{
  "success": true,
  "vote": {
    "id": 10004,
    "item_number": "CA-23",
    "title": "To authorize the Director of the Department of Public Service to execute those documents necessary for the transfer of 11,282 square foot (0.259 acre) portion of right-of-way adjacent to Starr Avenue to 5CL Properties LLC. ($0.00)",
    "description": "Explanation\n \nBackground:  The City of Columbus, Department of Public Service, received a request from 5CL Properties LLC, an Ohio Limited Liability Company, asking that the City transfer them an 11,282 square foot (0.259 acre) portion of right-of-way.   The right-of-way area runs east/west directionally for 240+/- feet and the width of the requested portion is 50+/- feet from north to south.  It is adjacent to the parcel at 440 - 470 E STARR AV (PID 010-001529) at the southern side of the parcel; and 471 - 479 E STARR AV (010-012062), at the northern side of the parcel.\n \nTransfer of this right-of-way will allow the applicant to accomplish an expansion of the existing facility/operations at 5th and Cleveland Avenue. The purpose of the transfer is to incorporate it with the adjacent parcel for a new build duplex on the lot.  The additional property would be used to increase the building mass of the project, as well as provide more space for parking at the rear of the property. The Department of Public Service has agreed to transfer the right-of-way via a quitclaim deed as described and shown within attached legal description and exhibit, and extinguishes its need for this public right-of-way.\n \nPer current practice, comments were solicited from interested parties, including City agencies, private utilities and the applicable area commission, before it was determined that, subject to the retention of a general utility easement for those utilities currently located within this right-of-way, the City will not be adversely affected by the transfer of this right-of-way.  \n \nThe Department of Public Service submitted a request to the City Attorney’s Office, asking that they establish a value for this right-of-way, and a value of $33,846.00 was established.  \n \nThis request went before the Land Review Commission on March 21, 2024.  After review of the request, the Land Review Commission voted to recommend the above referenced right-of-way be transferred to 5CL Properties LLC, an Ohio limited liability company at the cost of $33,846.00 to them.\n                     \nFISCAL IMPACT:  The City will receive a total of $33,846.00 and the funds are to be deposited in Fund 7748, Project P537650, as consideration for the transfer of the requested right-of-way.\n \nTitle\n \nTo authorize the Director of the Department of Public Service to execute those documents necessary for the transfer of 11,282 square foot (0.259 acre) portion of right-of-way adjacent to Starr Avenue to 5CL Properties LLC. ($0.00)\n \nBody\n \nWHEREAS, the City of Columbus, Department of Public Service, received a request from 5CL Properties LLC, an Ohio Limited Liability Company, asking that the City transfer them an 11,282 square foot (0.259 acre) portion of right-of-way.  The right-of-way area runs east/west directionally for 240+/- feet and the width of the requested portion is 50+/- feet from north to south.  It is adjacent to the parcel at 440 - 470 E STARR AV (PID 010-001529) at the southern side of the parcel; and 471 - 479 E STARR AV (010-012062), at the northern side of the parcel; and \n \nWHEREAS, the transfer of this right-of-way will allow the applicant to accomplish an expansion of the existing facility/operations at 5th and Cleveland Avenue. The purpose of the transfer is to incorporate it with the adjacent parcel for a new build duplex on the lot.  The additional property would be used to increase the building mass of the project, as well as provide more space for parking at the rear of the property; and\n \nWHEREAS, the Department of Public Service has agreed to transfer via quitclaim deed the right-of-way as described and shown within attached legal description and exhibit, and extinguishes its need for this public right-of-way; and\n \nWHEREAS, per current practice, comments were solicited from interested parties, including City agencies, private utilities and the applicable area commission, before it was determined that, subject to the retention of a general utility easement for those utilities currently located within this right-of-way, the City will not be adversely affected by the transfer of this right-of-way; and\n \nWHEREAS, the Department of Public Service submitted a request to the City Attorney’s Office, asking that they establish a value for this right-of-way; and\n \nWHEREAS, a value of $33,846.00 was established; and\n \nWHEREAS, this request went before the Land Review Commission on March 21, 2024; and\n \nWHEREAS, after review of the request, the Land Review Commission voted to recommend the above referenced right-of-way be transferred to 5CL Properties LLC, an Ohio limited liability company at the cost of $33,846.00; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.    That the Director of the Department of Public Service be, and hereby is, authorized to execute a quitclaim deed and other incidental instruments prepared by the City Attorney’s Office, necessary to transfer the right-of-way described below and depicted in the attached exhibit which is incorporated into this ordinance for reference, to 5CL Properties LLC, an Ohio limited liability company; to-wit:\n \nParcel Description \n~ 0.259 Acres ~\nNorth of Second Avenue\nWest of Cleveland Avenue\n-1-\n \nSituated in the State of Ohio, County of Franklin, City of Columbus, being in Half-Section 4, Township 5, Range 22, Refugee Lands and containing 0.259 acres, said 0.259 acres being part of Third Avenue (originally dedicated at 25’) as dedicated upon the record plat of Terrace View Addition of record in Plat Book 4, Page 250 (now known as E. Starr Avenue) and part of that tract of land as conveyed for highway purposes to The City of Columbus, Ohio of record in Deed Book 506, Page 398, said 0.259 acres more particularly described as follows:\n \nBeginning, at a P.K. Nail set at the northwesterly corner of Lot 119 of said Terrace View Addition, the southwesterly terminus of said Third Avenue (original 25’)(n.k.a E. Starr Avenue) and in the easterly line of Tract 3 as described in the deed to 5CL Properties LLC of record in Instrument No. 201711020154296; \n \nThence N 03° 51’ 34” E, with the easterly line of said Tract 3, westerly terminus of said Third Avenue (original 25’)(n.k.a E. Starr Avenue) and the westerly line of said City of Columbus tract, 50.00 feet to a P.K. nail set;\n \nThence S 85° 57’ 02” E, with the southerly line of said Tract 3 and the northerly line of said City of Columbus tract, 225.85 feet to a P.K. Nail set;\n \nThence S 03° 41’ 25” W, across said City of Columbus tract and said Third Avenue (original 25’)(n.k.a E. Starr Avenue), 50.00 feet to an iron pin set in the southerly right-of-way line of said Third Avenue (original 25’), also being in the northerly line of Lot 112 of said Terrace View Addition;\n \nThence N 85° 57’ 02” W, with the northerly line of Lots 112 through 199, inclusive, of said Terrace View Addition, said line also being the southerly line of said Third Avenue (original 25’)(n.k.a E. Starr Avenue), 226.00 feet to the True Point of Beginning, and containing 0.259 acres, more or less.\n \nSubject, however, to all legal highways, easements, and restrictions. The above description was prepared by Advanced Civil Design, Inc. on April 1, 2024 and is based on existing records and an actual field survey performed in June of 2020. A drawing of the above description has been prepared and is a part hereof.\n \nAll iron pins set are 5/8” diameter rebar, 30” long with a plastic inscribed “Advanced 7661”.\n \nBearings are based on the bearing of S 03º 45' 45” W for a portion of the Centerline of Cleveland Avenue between Gibbard Avenue and E. Starr Avenue, and as established by using a G.P.S. Survey (Ohio State Plane Coordinate System, South Zone, NAD83, NSRS 2011).\n \nAll references used in this description can be found at the Recorder’s Office, Franklin County, Ohio.  \n \nADVANCED CIVIL DESIGN, INC.  Douglas R. Hock, P.S. 7661       \n \nSECTION 2.    That the attached referenced real property shall be, and hereby is, considered excess road right-of-way and the public rights therein shall terminate upon the Director's execution and delivery of said quitclaim deed to the grantee thereof.\n \nSECTION 3.    That a general utility easement in, on, over, across and through the legal description and attached exhibit describing the right-of-way shall be retained unto the City of Columbus for those utilities located within said right-of-way.\n \nSECTION 4.    That upon notification and verification of the relocation of all utilities located within the retained general utility easement area the Director of the Department of Public Service is hereby authorized to execute those documents necessary to release the retained general utility easement with no additional compensation due to the City and with no further legislative action required by the City.\n \nSECTION 5.  That the $33,846.00 to be received by the City as consideration for the sale of these rights-of-way shall be deposited in Fund 7748, Project P537650.\n \nSECTION 6.    That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 119,
    "meeting_date": "2024-07-22",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Property & Real Estate",
      "Public Works"
    ]
  }
}