{
  "success": true,
  "vote": {
    "id": 10025,
    "item_number": "CA-44",
    "title": "To authorize the Director of the Department of Development to enter into a planned modification of a Subrecipient Not-for Profit Service Contract with Equitas Health Inc., to modify the contract to increase the funding in an amount up to $14,744.33; to authorize the appropriation of $14,744.33 within the 2023 HOPWA grant; and to authorize the expenditure of  $14,744.33 utilizing the 2023 Housing Opportunities for People with Aids (HOPWA) entitlement. ($14,744.33).",
    "description": "Explanation\n \nBACKGROUND:  This ordinance authorizes the Director of the Department of Development to enter into a planned modification of a Subrecipient Not-for Profit Service Contract with Equitas Health Inc., to provide community services related to the Housing Opportunities for People with AIDS (HOPWA) to modify the contract to increase the funding in an amount up to $14,744.33; to authorize the appropriation and expenditure of up to $14,744.33 utilizing the 2023 HOPWA entitlement grant from the U.S. Department of Housing and Urban Development.  \n \nOriginal Agreement                     $  300,000.00                     Ord. 3254-2022                                          PO363460\nModification No. 1                     $  583,633.20    Ord. 0947-2023                                          PO385992                     \nModification No. 2                     $  355,723.99                     Ord. 3357-2023                                          PO423132\nModification No. 3                     $  655,960.00                     Ord. 0906-2024                                          PO451643\nModification No. 4                     $    14,744.33                     Ord. 1945-2024\nTotal                                                               $1,595,226.32\n \nThe HOPWA program provides for the implementation of long term comprehensive strategies for meeting the housing needs of low income persons with HIV/AIDS and their families.  Eligible services/activities include providing housing information services; resource identification; acquisition, rehabilitation, conversion, lease, and repair of facilities to provide housing and services; new construction of housing units; project or tenant based rental assistance; short term rent, mortgage and utility payments; supportive services; technical assistance and administrative support.  \n \nEquitas Health Inc., is a provider who specializes exclusively in assisting income eligible individuals/households living with HIV/AIDS in the eight county EMSA.  \n \nThis legislation represents a part of the 2023 Action Plans, per Ordinance 3353-2022 respectively.\n \nContract Compliance:  the vendor number is 004721 and expires 01/09/2026.\n \nFiscal Impact: $14,744.33 is available from the 2023 HOPWA Grant (G442203).\n \n \nTitle\n \nTo authorize the Director of the Department of Development to enter into a planned modification of a Subrecipient Not-for Profit Service Contract with Equitas Health Inc., to modify the contract to increase the funding in an amount up to $14,744.33; to authorize the appropriation of $14,744.33 within the 2023 HOPWA grant; and to authorize the expenditure of  $14,744.33 utilizing the 2023 Housing Opportunities for People with Aids (HOPWA) entitlement. ($14,744.33).\n \n \nBody\n \nWHEREAS, the City of Columbus is a participating jurisdiction of the U.S. Department of Housing and Urban Development; and\n \nWHEREAS, the City of Columbus is the recipient of the Housing Opportunities for People with AIDS (HOPWA) entitlement grant from the U.S. Department of Housing and Urban Development; and\n \nWHEREAS, the Columbus City Council has approved the 2023 Action Plans, per Ordinance 3353-2022 respectively; and\n \nWHEREAS, Equitas Health Inc. is a provider who specializes exclusively in assisting income eligible individuals/households living with HIV/AIDS in the eight county EMSA; and\n \nWHEREAS, the appropriation, transfer, and expenditure of additional funding is needed to continue services as they relate to the Housing Opportunities for People with AIDS (HOPWA) program; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \n \nSECTION 1.  That the Director of the Department of Development is hereby authorized to enter into a planned modification of a Subrecipient Not-for-Profit Service Contract with Equitas Health Inc. to add additional funds in an amount up to $14,744.33 that will be utilizing 2023 HOPWA grant funds.\n \nSECTION 2.  That the appropriation in an amount up to $14,744.33 or so much there of as may be needed is hereby authorized within Fund 2220 (General Government Grant Fund), from Dept-Div 44-4410, G442203 (2023 HOPWA), object class 03 (Services) per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That the expenditure of $17,444.33 or so much thereof as may be needed, is hereby authorized in Fund 2220 (General Government Grant Fund), from Dept-Div 44-10 (Housing), G442203 (2023 HOPWA), object class 03 (Services) per the account codes in the attachment to this ordinance.\n \nSECTION 4.  That funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n                                          \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.  That at the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements.\n \nSECTION 7.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 119,
    "meeting_date": "2024-07-22",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Grants"
    ]
  }
}