{
  "success": true,
  "vote": {
    "id": 10048,
    "item_number": "CA-67",
    "title": "To authorize the Director of the Department of Public Utilities to enter into a construction contract with Ironsite, Inc. for the Livingston Noe Bixby Culvert Removal project; to authorize the transfer of cash and appropriation between projects within the Storm Bond Fund; to authorize the expenditure of up to $361,139.98 from the Storm Bond Fund for the project.  ($361,139.98)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Utilities to enter into a construction contract via the City’s Invitation For Bid process with Ironsite, Inc. for the Livingston Noe Bixby Culvert Removal project, CIP #611724-100000, in an amount up to $359,139.98 and to encumber funds with the Department of Public Service for prevailing wage services in an amount up to $2,000.00, for a total expenditure of $361,139.98. \n \nThis project will improve the safety of an abandoned roadway in which the aging and failing culvert was not previously removed. The culvert is currently unstable and eroding the sub-surface soil adjacent to the culvert due to formation of a significant hole in the culvert’s sidewall. The project will stabilize the area and prevent further soil erosion from entering a tributary to Big Walnut Creek. The structural stability of daylighting this channel will prevent collapse of the culvert in the event any persons should attempt to walk over or through the failing structure.\n \nWork to be performed includes clearing and grubbing while taking considerations to protect specified trees; excavation and demolition of an existing 72-inch by 110-inch stone box culvert which has been observed to have an approximately 5-foot deep hole through its side where soil has eroded; regarding of a dirt channel and side slopes without disturbing the sanitary sewer line below the existing culvert; placing topsoil and re-establishing cover with seeding and mulching; planting 31 trees; and adding erosion control matting.\n \nThe Community Area is \"58 - Far East\".\n \nTIMELINE:  Contract work is required to be completed in a manner acceptable to the City within 180 days from the date that a Notice to Proceed (NTP) is given by the City.\n \nESTIMATED COST OF PROJECT:  The bid amount and proposed award amount is $359,139.98, including a 15% construction contingency amount that will be utilized to fund needed and approved changes in the work.  No contract modifications are anticipated at this time; however, construction exigency might later compel modification of this contract if unforeseen difficulties are encountered.\n \nCost summary: \n \nOriginal Contract                                                               $359,139.98\nFuture Anticipated Needs                                                     $0.00\nPrevailing Wages                                                                   $2,000.00\nCONTRACT TOTAL                                                   $361,139.98\n \n2.  ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT\nThis project will improve the safety of an abandoned roadway. The project will stabilize the area and prevent further soil erosion from entering a tributary to Big Walnut Creek. Additional trees will be planted in the project area.\n \n3.  BID INFORMATION\nThis project was formally advertised on the Vendor Services and Bid Express websites from 5/7/2024 through 6/5/2024.   Two bids were received:\n \n     Name                                          Bid Amount________City/State                      Status                     \nIronsite, Inc.                                                           $359,139.98                              Sunbury/OH                   MAJ\nTravco Construction, Inc.                            $510,432.10                            Columbus/OH                    MAJ                     \n \nIronsite, Inc.’s bid was deemed the lowest, best, most responsive bid.  Ironsite, Inc.’s certification was in good standing at the time of the contract award.\n \n4.  CONTRACT COMPLIANCE INFORMATION\nIronsite, Inc.’s contract compliance number is CC005926 and expires 7/16/2025.  \n \n5.  MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract was bid with an anticipated City of Columbus MBE/WBE Program goal of 12% as assigned by the City’s Office of Diversity and Inclusion (ODI).  \n \nIronsite, Inc., submitted a Utilization Plan meeting the 12% goal.  After review of their Utilization Plan and other related information the contractor submitted with their bid response, ODI has approved an MBE/WBE Program goal of 12% for this contract.  Failure by the contractor to meet this goal subjects the contractor to the Penalties for Non-Compliance as described in the bid documents for this contract.\n \nAs part of their proposal, Ironsite, Inc., has proposed the following three subcontractors to perform contract work:\n \nCompany Name                                            City/State                                     ODI Certification Status \nHardwick Tree Care                                                                   Centerburg, OH                                                                       MAJ\nGarcia Surveyors                                                                           Columbus, OH                                                                        MBE\nM.S. Trucking                                                                                  Lockbourne, OH                                                                     WBE\n \nThe certification of the above companies was in good standing at the time the bid was awarded.\n \n6. PRE-QUALIFICATION STATUS\nIronsite, Inc. and all subcontractors have met code requirements with respect to pre-qualification, pursuant to relevant sections of Columbus City Code Chapter 329. \n \n7.  FISCAL IMPACT\nFunding in the amount of $359,139.98 is available and appropriated within the Storm Bond Fund, Fund 6204.  A transfer of cash and appropriation between projects within the Storm Bond Fund is needed to align cash and appropriation with the proper project.\n \nTitle\nTo authorize the Director of the Department of Public Utilities to enter into a construction contract with Ironsite, Inc. for the Livingston Noe Bixby Culvert Removal project; to authorize the transfer of cash and appropriation between projects within the Storm Bond Fund; to authorize the expenditure of up to $361,139.98 from the Storm Bond Fund for the project.  ($361,139.98)\n \nBody\nWHEREAS, the Department of Public Utilities is engaged in the Livingston Noe Bixby Culvert Removal project; and\n \nWHEREAS, two bids for the Livingston Noe Bixby Culvert Removal project were received and opened on 6/5/24; and\n \nWHEREAS, it is necessary to authorize the Director of the Department of Public Utilities to enter into a construction services contract with Ironsite, Inc. for the Livingston Noe Bixby Culvert Removal project; and \n \nWHEREAS, it is necessary to transfer cash and appropriation between projects within the Storm Bond Fund, Fund 6204, to align cash and appropriation with the proper project; and\n \nWHEREAS, it is necessary to expend funds to pay for this project; and now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the transfer of $145,450.32, or so much thereof as may be needed, is hereby authorized between projects within the Storm Bond Fund, Fund 6204, per the account codes in the attachment to this ordinance.\n \nSECTION 2.  That the Director of Public Utilities is hereby authorized to enter into a construction services contract for the Livingston Noe Bixby Culvert Removal project with Ironsite, Inc., PO Box 304, Sunbury, OH 43074, in an amount up to $359,139.98, in accordance with the terms and conditions of the contract on file in the Department of Public Utilities; and to pay the Department of Public Services an amount up to $2,000.00 to provide prevailing wage services for the project.\n \nSECTION 3.  That an expenditure of up to $361,139.98, or so much thereof as may be needed, is hereby authorized from the Storm Bond Fund, Fund 6204, per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 7.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 119,
    "meeting_date": "2024-07-22",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}