{
  "success": true,
  "vote": {
    "id": 10068,
    "item_number": "SR-11",
    "title": "To authorize the Director of the Department of Public Utilities to modify and increase a professional engineering services contract with MS Consultants, Inc. for the Southerly Stormwater and Floodplain Improvements project; to appropriate funds in the Sanitary - Fresh Water Market Rate Fund; to make this ordinance contingent upon the Ohio Water Development Authority approving a loan for this project; and to authorize an expenditure of $3,974,725.81 from the Sanitary Fresh Water Market Rate Fund to pay for the contract modification.  ($3,974,725.81)",
    "description": "Explanation\n1.  BACKGROUND\nThis Ordinance authorizes the Director of Public Utilities to modify and increase the professional engineering services contract with MS Consultants, Inc., for the Southerly Stormwater and Floodplain Improvements project, CIP #650377-100000, in an amount up to $3,974,725.81, to pay for the first phase of detailed design services. \n \nThe City’s Wastewater Treatment Plants require continual development and upgrades in order to keep processes and equipment up to date, in compliance, and running well.  All re-development requires compliance with the City of Columbus Stormwater and Drainage Manual as well as Ohio Environmental Protection Agency (OEPA) Stormwater general permit and Federal Emergency Management Agency (FEMA) requirements.  This project will provide a phased development stormwater and floodplain masterplan for the Southerly Wastewater Treatment Plant.  \n \nThe first phase of the contract performed preliminary engineering and analyzed several alternatives for meeting these regulations while accounting for any unmitigated historical impacts and anticipated future development. Findings of the initial phase are that a levee is required to accommodate future expansion necessary to accommodate the expected increase in flows from Intel and other large developments in our service area.\n \nDue to the size and complexity of the project the detailed design will be split into two phases, which are being called Step 2a and Step 2b.  Step 2a is the current phase of work and is performing field investigations and developing technical memoranda (TM) required to fully define the environmental permitting, developing proposed environmental mitigation plans, and will progress the design through 30% design package. \n \nDue to uncertainty about which footprint would be selected, there were several if authorized tasks that were included in phase 2A. Due to fiscal constraints, the negotiated fee for step 2A was not fully legislated.  Since the initial partial legislation, DOSD has chosen to move forward with the full levee footprint, which in turn requires the remaining negotiated fee to be encumbered in order to authorize these tasks.\n \nProject coordination and engineering to support permitting will occur with the following entities: Ohio Environmental Protection Agency (OEPA); US Army Corps of Engineers; (Ohio Department of Natural Resources (ODNR); US Fish and Wildlife; Ohio State Historic Preservation Office (OSHPO); Federal Emergency Management Agency (FEMA); local floodplain administrators; and the City of Columbus Stormwater Regulatory, Recreation and Parks, and One Stop Shop.\n \nThe Community Planning Area for this project is 99-Citywide\n \n1.1 Future Renewals/Modifications:  There will be a total of three modifications for detailed design followed by a modification for services during construction.\n   \n1.2 Amount of additional funds to be expended:  $3,974,725.81.\n      Original Contract, Preliminary Design (PO242747)                                                $820,064.27\n      Modification 1 (PO394480)                                                                                                       $4,000,000.00\n      Modification 2 (current request)                                                                                      $3,974,725.81\n      Modification 3 (estimated future request)                                         $8,000,000.00\n      Modification 4 (estimated future request)                                                                        $10,000,000.00\n      Contract Total:                                                                              $26,794,790.08\n \n1.3. Reason other procurement processes are not used:  This is a planned modification to add funding needed to continue work on the project scope on a contract that was awarded through the City’s Request for Proposal process.  This modification provides the remainder of the negotiated fee that was not previously available at the time of the first contract modification due to fiscal constraints.  Another procurement process is not required.\n \n1.4. How the cost of renewal was determined:  The cost proposal was provided by MS Consultants, Inc., reviewed by the Division of Sewerage, and Drainage and was deemed acceptable.  The fees in the proposal are based upon contract pricing already established for job titles, tasks, and allowable expenses for the contract.\n \n2.  ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT\nThis project will take a holistic approach to site development at the wastewater treatment plant site.  It will be more efficient to perform all of the stormwater and floodplain design under one contract, providing compliance to the stormwater and drainage manual, and reducing coordination efforts and delays on other capital projects within the department. \n \n3.  CONTRACT COMPLIANCE INFORMATION\nMS Consultants, Inc.’s contract compliance number is CC-006998 and expires 12/1/25.\n \n4.  MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract was put in place prior to the implementation of the City of Columbus MBE/WBE Program and is not subject to the requirements of that program. MS Consultants, Inc. is classified as a majority company by the City’s Office of Diversity and Inclusion. Per the Utilization Plan submitted with this ordinance, MS Consultants, Inc. plans to use five City-certified MBE/WBE sub-consultants on this project for a total spend of $743,657.01, or about 18.7% of the work.\nAs part of their proposal, MS Consultants, Inc. has proposed using the following sub-consultants to perform contract work:\nCompany Name                                       City/State                                     ODI Certification Status\nBlack & Veatch                                       Columbus, Ohio                                          MAJ\nASC Group, Inc.                                       Columbus, Ohio                                         WBE \nResource International                              Columbus, Ohio                                          WBE\nStone Environmental                                 Westerville, Ohio                                        WBE\nDHDC, Inc.                                             Columbus, Ohio                                          MBE\nCDM Smith                                              Columbus, Ohio                                          MAJ \nEagon & Associates                                 Worthington, Ohio                                       MAJ\nSmoot Construction                                   Columbus, Ohio                                          MBE\nS&ME                                                     Dublin, Ohio                                               MAJ\nThe certification of MS Consultants, Inc. and the above companies was in good standing at the time of the contract modification.\n5.  FISCAL IMPACT\nFunding for this contract will be obtained through the Ohio Water Development Authority Direct Loan Program.  City Council authorized this loan application and acceptance of loan funding via Ordinance 0652-2024, passed by Council on 3/25/24.  This loan is expected to be approved at the July Board meeting.  This ordinance is contingent upon the OWDA Board approving the loan application.  Funds will need to be appropriated in the Sanitary - Fresh Water Market Rate Fund, Fund 6124.\n \nThe Ohio Water Development Authority (OWDA) Direct Loan Program is a reimbursement program.  Purchase orders will need to be established to MS Consultants, Inc. for these contracts.  Public Utilities will need to pay invoices directly to MS Consultants, Inc. and then submit reimbursement requests based upon these paid invoices to OWDA for OWDA to reimburse Public Utilities.\n \nTitle\nTo authorize the Director of the Department of Public Utilities to modify and increase a professional engineering services contract with MS Consultants, Inc. for the Southerly Stormwater and Floodplain Improvements project; to appropriate funds in the Sanitary - Fresh Water Market Rate Fund; to make this ordinance contingent upon the Ohio Water Development Authority approving a loan for this project; and to authorize an expenditure of $3,974,725.81 from the Sanitary Fresh Water Market Rate Fund to pay for the contract modification.  ($3,974,725.81)\n \nBody\nWHEREAS, there is an existing professional engineering services contract with MS Consultants, Inc. for the Southerly Stormwater and Floodplain Improvements project; and\n \nWHEREAS, it is necessary to authorize a modification to the contract to increase the dollar amount of the contract to fund detailed design of the project; and \n \nWHEREAS, Ordinance 0652-2024 authorized this modification to be funded by a loan to be obtained through the Ohio Water Development Authority (OWDA) Direct Loan Program; and\n \nWHEREAS, this ordinance is contingent upon the loan being approved; and\n \nWHEREAS, it is necessary to appropriate funds in the Sanitary Fresh Water Market Rate Fund; and\n  \nWHEREAS, funds must be expended to pay for services provided under this contract modification; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2024, the sum of $3,974,725.81 is appropriated in the Sanitary - Fresh Water Market Rate Fund, Fund 6124, per the account codes in the attachment to this ordinance.\n \nSECTION 2.  That the Director of the Department of Public Utilities is hereby authorized to modify and increase the professional engineering services contract with MS Consultants, Inc., 2221 Schrock Rd. Columbus, Ohio, 43229, for the Southerly Stormwater and Floodplain Improvements project, in an amount up to $3,974,725.81.\n \nSECTION 3.  That the expenditure of $3,974,725.81, or so much thereof as may be needed, is hereby authorized to pay for this contract modification per the accounting codes in the attachment to this ordinance. \nSECTION 4.  That this ordinance is contingent upon the Ohio Water Development Authority's Board approving the loan for this project. \nSECTION 5.  That funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\nSECTION 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\nSECTION 7.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\nSECTION 8.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 119,
    "meeting_date": "2024-07-22",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}