{
  "success": true,
  "vote": {
    "id": 10063,
    "item_number": "SR-6",
    "title": "To authorize the Executive Director of the Mayor’s Office of Education to enter into contracts with high-quality pre-kindergarten organizations, selected via a competitive application process, to provide educational services as part of the 2024-2025 Early Start Columbus Program; and to authorize the expenditure not to exceed $6,000,000.00 from the General Fund. ($6,000,000.00)",
    "description": "Explanation\nMayor Ginther’s vision for Columbus, America’s Opportunity City, is to create access to a high-quality pre-kindergarten education for every 4-year-old. Addressing early childhood learning means bringing awareness and resources to a critical learning stage in childhood development. Children who come to school ready to learn are more likely to succeed academically and in life.  \n \nChildren who participate in high-quality pre-kindergarten experiences significantly improve their early literacy, language, and math skills. Ample evidence shows that children who enter school unprepared fall farther and farther behind. Students who get a poor start in their earliest years are likely to struggle in high school and subsequently, fail to graduate. \n \nThe purpose of Early Start Columbus is to expand high-quality pre-kindergarten services through partnerships with Columbus City Schools and community-based providers. The providers partnering in the Early Start Columbus Program have all demonstrated their ability to provide a high-quality pre-kindergarten education. All partnering providers are rated at least three stars in the State’s Step Up To Quality rating and improvement system.  Providers were chosen from a competitive application process. \n \nState law makes allowable the braiding of Ohio Department of Education Early Childhood Expansion funds with those of the Ohio Department of Jobs and Family Service Publicly Funded Childcare program. The 2024-2025 Early Start Columbus Program combines the Mayor’s Office of Education funds with these funding streams to further extend the number of children served while using City funds more efficiently. This approach uses City funds as “last dollar” funding.  \nFISCAL IMPACT: This ordinance authorizes an expenditure of $6,000,000.00 from the 2024 Mayor’s Office of Education’s General Operating fund.\n \nTitle\nTo authorize the Executive Director of the Mayor’s Office of Education to enter into contracts with high-quality pre-kindergarten organizations, selected via a competitive application process, to provide educational services as part of the 2024-2025 Early Start Columbus Program; and to authorize the expenditure not to exceed $6,000,000.00 from the General Fund. ($6,000,000.00)\n \nBody\nWHEREAS, the Executive Director of the Mayor’s Office of Education desires to enter into contracts with various high-quality pre-kindergarten organizations to provide educational services and quality pre-kindergarten services to Columbus 4-year-olds to prepare them for kindergarten; and \n \nWHEREAS, research shows that quality pre-kindergarten instruction provides meaningful value to children’s educational performance and preparation for school; and\n \nWHEREAS, the goal is that all children in City of Columbus will be kindergarten ready; and \n \nWHEREAS, providers were chosen via a competitive application process available to all providers in Franklin County; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Mayor’s Office of Education to authorize the Director to enter into contracts to meet the operational needs of the Early Start Columbus providers, thereby preserving the public health, peace, property, safety and welfare; NOW, THEREFORE:\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. City Council finds that funding pre-kindergarten organizations is a proper public purpose and furthers the City's goal to provide high-quality education to qualified organizations throughout the City. The Executive Director of the Mayor’s Office of Education is authorized to enter into contracts with the attached quality pre-kindergarten organizations, under the terms and conditions and in the amounts deemed necessary to advance the Early Start Columbus initiative. Contracts are being awarded to the attached providers. These providers were selected through a competitive application process due to their prior experience and success in providing the same services in the 2023-2024 school year and via a competitive application process.\n \nSECTION 2.  That the expenditure of $6,000,000.00 is authorized as follows (see attachment):\n \nDept/Div: 40-06 | Obj Class: 03 | Main Account: 63050 | Fund: 1000 | Sub-fund: 100010 | Program: ED001 | Amount: $6,000,000.00\n \nSECTION 3.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5. That this ordinance shall take effect and be in force from and after the earliest period permitted by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 119,
    "meeting_date": "2024-07-22",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements"
    ]
  }
}