{
  "success": true,
  "vote": {
    "id": 10079,
    "item_number": "SR-22",
    "title": "To amend various sections, and enact new sections, of Title 41, the Columbus Building Code, to establish termination and abandonment provisions for existing plumbing fixtures or appurtenances and provide definitions of new terms.",
    "description": "Explanation\n \nThe Columbus Department of Building and Zoning Services is the agency that is certified by the Ohio Board of Building Standards to enforce all provisions of Chapters 3781 and 3791 of the Ohio Revised Code and the rules of the Board.  The Ohio Building Code (OBC), and the Residential Code of Ohio (RCO) are incorporated into the Columbus Building Code through City Code Chapter 4103.\n \nFollowing the provisions of Section 102.2 of the OBC and RCO, the Chief Building Official of a certified agency may make further and additional regulations, not in conflict with Chapters 3781 and 3791 of the Ohio Revised Code, or with the rules of the Board of Building Standards. The current code does not provide safe and sanitary termination or abandonment of existing plumbing fixtures or appurtenances. This proposed code change will establish termination and abandonment provisions, while also providing definitions for new terms, including adding the definition of point of service.\n \nA Public Hearing was held before the Skilled Trades Review Board on January 17, 2024, and the Columbus Building Commission on February 20, 2024, whereupon the Skilled Trade Review Board and the Building Commission voted to approve the code changes and recommend that it be forwarded to the Columbus City Council for adoption.\n \nFISCAL IMPACT: No funding is required for this legislation.\n \nTitle\n \nTo amend various sections, and enact new sections, of Title 41, the Columbus Building Code, to establish termination and abandonment provisions for existing plumbing fixtures or appurtenances and provide definitions of new terms.\n \nBody\n \nWHEREAS, the Department of Building and Zoning Services is the agency that is certified by the Ohio Board of Building Standards to enforce provisions of the rules of the Board, Chapters 3781 and 3791 of the Ohio Revised Code and of Chapter 4101:1-1-01 and section 102.2 of the Ohio Administrative Code relating to other laws; and\n                     \nWHEREAS, the OBC and RCO permit municipal corporations to make further and additional regulations, not in conflict with Chapters 3781 and 3791 of the Ohio Revised Code or with the rules of the Board of Building Standards; and\n \nWHEREAS, the OBC and RCO do not have provisions for safe and sanitary termination or abandonment of existing plumbing fixtures or appurtenances; and\n \nWHEREAS, this code change adopts acceptable safe and sanitary methods for termination or abandonment of existing plumbing fixtures or appurtenances; and\n \nWHEREAS, a Public Hearing was held before the Skilled Trades Review Board on January 17, 2024, and the Columbus Building Commission on February 20, 2024, whereupon the Skilled Trades Review Board and Building Commission voted to recommend this proposed Ordinance be forwarded to the Columbus City Council for adoption; \n \nWHEREAS, it has become necessary to amend various sections, and enact new sections, of Title 41, the Columbus Building Code, to establish termination and abandonment provisions for existing plumbing fixtures or appurtenances and provide definitions of new terms; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS\n \nSECTION 1. That the existing Section 4101.16 of the Columbus City Codes is hereby amended to read as follows:\n \n4101.16 - Letter P.\n \n\"Partition\" means a minor interior wall used to subdivide a floor area.\n \n\"Partition, bearing\" means a partition which supports a load in addition to its own weight.\n \n\"Partition, nonbearing\" means a partition which supports only its own weight.\n \n\"Passageway\" means an enclosed hallway or corridor connecting a required exit to a street, or other open space communicating with a street when such required exit does not lead directly to a street.\n \n\"Permanent open space\" means a street, alley, permanent surface and air easement, waterway, public park, or railroad right-of-way, other than a siding for the loading, unloading, or storage of cars or motive power equipment.\n \n\"Person\" means a natural person, beneficiaries, executors, administrators or assigns, and also includes an organization, firm, partnership, corporation, contractor, or subcontractor, its or their successors or assigns, or the agent of any of the aforesaid.\n \n\"Platform\" means a raised section of floor not enclosed by walls above the platform floor level. This definition shall not include a stage as defined in the Ohio Building Code.\n \n\"Plumbing\" means the business, trade, or work having to do with the installation, removal, alteration, or repair of plumbing and drainage systems or parts thereof.\n \n\"Plumbing appliance\" means any one of a special class of plumbing fixture which is intended to perform a special function. Its operation and/or control may be dependent upon one or more energized components, such as motors, controls, heating elements, or pressure or temperature-sensing elements. Such fixtures may operate automatically through one or more of the following actions: a time cycle, a temperature range, a pressure range, a measured volume or weight, or the fixture may be manually adjusted or controlled by the user or operator.\n \n\"Plumbing appurtenance\" means a manufactured device, or a prefabricated assembly, or an on-the-job assembly of component parts, and which is an adjunct to the basic piping system and plumbing fixtures. An appurtenance demands no additional water supply, nor does it add any discharge load to a fixture or the drainage system. It is presumed that it performs some useful function in the operation, maintenance, servicing, economy, or safety of the plumbing system.\n \n\"Plumbing fixture\" means a receptacle or device which is either permanently or temporarily connected to the water distribution system, and demands a supply of water therefrom, or it discharges used water, liquid-borne waste materials, or sewage either directly or indirectly to the drainage system, or which requires both a water supply connection and a discharge to the drainage system. Plumbing appliances as a special class of fixture are further defined.\n \n\"Plumbing system\" means and includes all potable water supplies and distribution pipes, all plumbing fixtures and traps, all drainage and vent pipes and all building drains, including their respective joints and connections, devices and appurtenances within the property lines of the premises and shall include potable water treatment or using equipment.\n \n“Point of service” means that portion of the domestic or fire water service pipe and appurtenances from the meter to the water distribution system of the building(s) served.  It does not include the service line, as defined in City Code Chapter 1105.\n \n\"Porch\" means a roofed structure with one or more open sides, erected against and projecting from, an exterior wall of a building.\n \n\"Premises\" means lands and everything of a permanent nature attached thereto as a part of realty.\n \n\"Property line\" means the line of demarcation between properties either public or private.\n \n\"Public nuisance\" means any structure which is permitted to be or remain in any of the following conditions:\n(1) In a dilapidated, decayed, unsafe or unsanitary condition detrimental to the public health, safety, and welfare, or well being of the surrounding area; or\n(2) A fire hazard; or\n(3) Any vacant building that is not secured and maintained in compliance with Chapter 4513; or\n(4) Land, real estate, houses, buildings, residences, apartments, or premises of any kind which are used in violation of any division of Section 2925.13, Ohio Revised Code.\n \n\"Public nuisance\" also means any structure or real property which is not in compliance with any building, housing, zoning, fire, safety, air pollution, health or sanitation ordinance of the Columbus City Code or Columbus City Health Code, or any real property upon which its real property taxes have remained unpaid in excess of one year from date of assessment.\n \nSECTION 2. That the existing Section 4101.18 of the Columbus City Codes is hereby amended to read as follows:\n \n4101.18 - Letter R.\n \n“Ready Access” means that which enables a fixture, appliance or equipment to be directly reached without requiring the removal or movement of any panel, door, or similar obstruction, and without the use of a portable ladder, step stool, or similar device.\n \n\"Row\" means a group of connected dwellings separated by vertical fire walls, each dwelling having its own front and rear yards and having appropriated to it the entire building between the fire walls.\nWhere the firewalls are party walls, each dwelling shall be considered a single-family dwelling provided that each dwelling has completely separate connections to all utilities and public sewers.\n \nSECTION 3. That the existing Section 4101.20 of the Columbus City Codes is hereby amended to read as follows:\n4101.20 - Letter T.\n\"Tent\" means a shelter or structure which is not an appendage to a building, nor a roof structure the covering of which is wholly or partly of canvas or other pliable material which is supported and made stable by standards, stakes, and ropes.\n“Trap” means a fitting or device that provides a liquid seal to prevent the emission of sewer gases without materially affecting the flow of sewage or waste water through the trap.\n\"Truss\" means a complete or redundant framed structural unit composed of structural members connected at their intersections, in which, if loads are applied at their intersections, the stress in each member is in the direction of the length of the member.\n \nSECTION 4. That the existing Section 4101.23 of the Columbus City Codes is hereby amended to read as follows:\n \n4101.23 - Letter W.\n \n“Water supply system” means the water service pipe, water distribution pipes, and the necessary connecting pipes, fittings, control valves, and all appurtenances in or adjacent to the structure or premises.\n \n\"Window bay\" means a window projecting beyond the wall of a building and extending down to or below the ground.\n \nWindow, Dormer. \"Dormer window\" means a substantially vertical window and its enclosing structure erected as an appendage to a sloping roof.\n \nWindow, Oriel. \"Oriel window\" means a window projecting beyond and suspended from the wall of a building or cantilevered therefrom.\n \nWindow, Show. \"Show window\" means a window in which goods or wares are displayed for sale or advertising purposes.\n \n\"Written notice\" shall be considered to have been served if delivered in person to the individual or to the parties intended, or if delivered at or sent by registered or certified mail to the last business address known to the party giving notice.\n \nSECTION 5. That Columbus City Codes are supplemented with the creation of a new section numbered 4125.43, reading as follows: \n \n4125.43   OPC Plumbing Code -Appurtenance/Fixture Termination and/or Abandonment.\n \n(a)                     When any proposed work includes termination/abandonment of existing plumbing appurtenances, such as, storm water catch basins, separators, interceptors, or similar appurtenances, the contents of the plumbing appurtenance shall be removed and disposed of, then the drain serving the appurtenance shall be removed back to the closest main line and capped in a manner compliant with the Ohio Plumbing Code, or the drain shall be extended vertically and terminate at a floor cleanout with Ready Access. The plumbing appurtenance shall be removed entirely, or, if approved by the Chief Building Official, the plumbing appurtenance may be crushed/destroyed in place, provided that it is crushed/destroyed in a manner that prevents the plumbing appurtenance from retaining any waste or water. The method of termination/abandonment must be included in the documents submitted for approval along with specifications, as applicable, for final completion of the termination/abandonment. \n \n(b)                     When any proposed work includes termination/abandonment of existing plumbing fixtures, the drain serving the fixture shall be removed back to the closest main line and capped in a manner compliant with the Ohio Plumbing Code, or the drain shall be extended vertically and terminate at a floor cleanout with Ready Access. If the plumbing fixture had a concealed Trap, such as a floor drain, the Trap shall be removed before extending the drain upward as a floor cleanout. The plumbing fixture shall be removed entirely. If the building water supply system serves the terminated/abandoned plumbing fixture, the portion of the building water supply system that serves the plumbing fixture shall be terminated in accordance with one of the following methods:\n1.                     The portion of the building water supply system that serves the plumbing fixture shall be removed back to the closest main line and capped at or above the horizontal plane in a manner compliant with the Ohio Plumbing Code, or, \n2.                     In the event that portions of the water lines are installed below grade, the water lines shall be either capped as close as possible to the floor or capped below grade in a manner compliant with the Ohio Plumbing Code, provided that the water line(s) are terminated in a manner that does not leave a possibility of stagnate water in the terminated line remaining in contact with the potable water distribution system. \n(c)                     The method of termination/abandonment must be included in the documents submitted for approval along with specifications, as applicable, for final completion of the termination/abandonment. \n \nSECTION 6. That Columbus City Codes are supplemented with the creation of a new section numbered 4127.11, reading as follows: \n \n4127.11 - Columbus revision to the Residential Code of Ohio (RCO) - “Part IX-Plumbing.”\n \nThe following subsection is a supplement to the Residential Code of Ohio (RCO)-\"Part IX- Plumbing,\" and shall apply to all one-, two-, and three-family dwellings and all structures not covered or governed under the OBC:\n \n(A) Fixture Termination and/or Abandonment.\nWhen any proposed work includes termination/abandonment of existing plumbing fixtures, the drain serving the fixture shall be removed back to the closest main line and capped in a manner compliant with the Ohio Plumbing Code, or the drain shall be extended vertically and terminate at a floor cleanout with Ready Access. If the plumbing fixture had a concealed Trap, such as a floor drain, the Trap shall be removed before extending the drain upward as a floor cleanout. The plumbing fixture shall be removed entirely. If the building water supply system serves the terminated/abandoned plumbing fixture, the portion of the building water supply system that serves the plumbing fixture shall be terminated in accordance with one of the following methods:\n1.                     The portion of the building water supply system that serves the plumbing fixture shall be removed back to the closest main line and capped at or above the horizontal plane in a manner compliant with the Ohio Plumbing Code, or, \n2.                     In the event that portions of the water lines are installed below grade, the water lines shall be either capped as close as possible to the floor or capped below grade in a manner compliant with the Ohio Plumbing Code, provided that the water line(s) are terminated in a manner that does not leave a possibility of stagnate water in the terminated line remaining in contact with the potable water distribution system. \n3.                     The method of termination/abandonment must be included in the documents submitted for approval along with specifications, as applicable, for final completion of the termination/abandonment. \n \nSECTION 7. That prior existing Sections 4101.16, 4101.18, 4101.20 and 4101.23 of the Columbus City Codes are hereby repealed.\n \nSECTION 8. That this ordinance shall take effect and be in force from and after the earliest period provided by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 119,
    "meeting_date": "2024-07-22",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "General"
    ]
  }
}