{
  "success": true,
  "vote": {
    "id": 10106,
    "item_number": "0",
    "title": "To adopt a Capital Improvements Budget for the twelve months ending December 31, 2024 or until such a time as a new Capital Improvements Budget is adopted, establishing a project budget for capital improvements requiring legislative authorization in 2024; to repeal Ordinance No. 1711-2023, as amended; and to declare an emergency.",
    "description": "Explanation\n \nBACKGROUND:  This ordinance establishes the 2024 Capital Improvement Budget (CIB) in the amount of $1.99 billion.  The budget presented herein represents a plan for the expenditure of monies in 2024 for a variety of capital improvement projects.\n \nThe new funding amount of the total CIB is $1.37 billion, but $953.0 million of this amount, or 69.4%, is supported by enterprise revenues and miscellaneous smaller revenues such as internal service fees, not the set-aside of income taxes.  Of the total CIB, $618.1 million represents carryover funding.\n \nFISCAL IMPACT:  Appropriation authority for new money is granted at the time debt is issued, not with this ordinance.  \n \nTitle\n \nTo adopt a Capital Improvements Budget for the twelve months ending December 31, 2024 or until such a time as a new Capital Improvements Budget is adopted, establishing a project budget for capital improvements requiring legislative authorization in 2024; to repeal Ordinance No. 1711-2023, as amended; and to declare an emergency. \n \nBody\n \nWHEREAS, Chapter 333.01 of the Columbus City Codes requires the annual submission of a Capital Improvements Budget to City Council for consideration and adoption; and\n \nWHEREAS, the following sets forth capital projects proposed for the City of Columbus in 2024, the proposed source of funds for each project, and a maximum budget for the 12 months beginning January 1, 2024 and ending December 31, 2024, or until such time as a new capital improvements budget is adopted; and\n \nWHEREAS, an emergency exists in the usual daily operations of the various city departments in that it is immediately necessary to budget capital projects and proposed funding by the adoption of a Capital Improvements Budget all for the immediate preservation of the public health, peace, property, safety and welfare; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That from the monies in each of the funds and subfunds, the source of which is identified for each project, there be and hereby are budgeted for the following capital projects (see attached files), the following sums of money for the 12 months from January 1, 2024 to December 31, 2024 or until such time as a new capital improvements budget is adopted.\n \nSECTION 2.  That for the purposes of amendment and review of legislation for conformance to the Capital Improvements Budget each project budget identified by the \"Project Number\" listed on this Ordinance shall be regarded as a separate and distinct section of the Capital Improvements Budget.\n \nSECTION 3.  That, pursuant to Section 333.03 of the Columbus City Codes, all ordinances relative to the issuance of notes or bonds, appropriating money from general bond funds or any other funds listed therein in any way relating to the Capital Improvements of the City of Columbus shall be forwarded to the Department of Finance and Management for review and approval prior to submission to the City Council.  Each ordinance concerning Capital Improvements shall be designated as in \"conformance\" or \"non-conformance\" with the approved Capital Improvements Budget for the ensuing year.  If designated in \"non-conformance\" an explanation including the reasons for, and the specific effects of the \"non-conformance\" shall be affixed to the ordinance.\n \nSECTION 4.  That, pursuant to Section 333.04 of the Columbus City Codes, ordinances not conforming to the Capital Improvements Budget shall not be passed until said budget is amended.  No amendments to the Capital Improvements Budget shall be made except as follows:\n \n                     All requests for modification pertaining to the Capital Improvements Budget shall be submitted to the Director of Finance and Management for recommendations before such changes shall be submitted to City Council for adoption.\n \nSECTION 5.  That, among the responsibilities of the Department of Finance and Management shall be the integration of the Capital Improvements Budget into the City's annual operating budget, the preparation of quarterly reports on Capital Improvement expenditures, the preparation of long-range Capital Improvement fiscal requirements, the establishment of a city-wide uniform budgeting and record-keeping system for Capital Improvement projects, and the monitoring of capital improvement ordinances for their conformance with the Capital Improvements Budget.\n \nSECTION 6.  That the Director of Finance and Management or designee is authorized to make any amendments to the Capital Improvement Budget, including the transfer of cash and appropriation, within each project category and subproject as deemed necessary. \n \nSECTION 7.  That the City Auditor is hereby authorized to establish and implement proper project and fund accounting systems and procedures for Capital Improvements as well as the identification and monitoring of the objects of expenditure of all transactions.  The City Auditor shall report monthly a summary of all Capital Improvement transactions.\n \nSECTION 8.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department of Finance and Management and the Director of the Department administering said project stipulating that the project has been completed and the monies are no longer required for said project, except that no transfer shall be made from a project account funded by monies from more than one source.\n \nSECTION 9. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 10.  That it is understood that this Council is not making specific allocations for each minor object of a project account herein before contained but only for the project accounts within the stated funds.  The allocations herein made shall constitute limitations on each project account and no official or employee of the City shall make or authorize expenditures beyond such limitation nor shall be authorized to make expenditures from an improper project account.  It is provided, however, that transfers may be made from one project account to another within the same fund.  \n \nSECTION 11.  That subsequent legislation affecting the various projects contained herein will be submitted to this Council transferring and/or originating necessary funds.\n \nSECTION 12.  That Ordinance No. 1711-2023, as amended, be and the same is hereby repealed.\n \nSECTION 13.  That, in accordance with Section 27 of the Columbus City Charter, detailed schedules of all changes from the Mayor's Estimate shall be placed on file in the Office of the City Clerk.\n \nSECTION 14.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 120,
    "meeting_date": "2024-07-29",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services"
    ]
  }
}