{
  "success": true,
  "vote": {
    "id": 1013,
    "item_number": "SR-1",
    "title": "To amend the 2020 Capital Improvement Budget; to authorize the Director of Finance and Management to enter into a contract on behalf of the Office of Construction Management with Columbus Asphalt Paving, Inc. for a parking lot expansion at 1410 Cleveland Avenue; to authorize the transfer and expenditure of $212,030.00 between projects within the Construction Management Capital Improvement Fund; to waive the competitive bidding provisions of Columbus City Code; and to declare an emergency. ($212,030.00)",
    "description": "Explanation\nBACKGROUND:  This legislation authorizes the Finance and Management Director to enter into a contract on behalf of the Office of Construction Management with Columbus Asphalt Paving, Inc. for parking lot expansion located at 1410 Cleveland Avenue. \nThis project will expand the existing parking lot at 1410 Cleveland Avenue and will result in the creation of needed additional parking spaces. These additional spaces will help alleviate the shortage of parking at the facility. This project will also include subgrade preparation, asphalt pavement, concrete curbing, parking lot light relocation and other such work as may be necessary to complete the contract.\nFormal bids were solicited and the City received one bid on June 26, 2020 as follows (0 FBE, 0 MBE):\n\n\n\nBidder/Consultant\n\nCity\n\nFBE/MBE\n\nAmount of Bid\n\n\n\nColumbus Asphalt Paving, Inc.\n\nGahanna\n\nEBOCC\n\n$168,600.00\n\n\n \nBid Waiver Request: The Office of Construction Management opened bids for this project on June 26, 2020, however, due to the COVID-19 pandemic this project was placed on hold. Columbus Asphalt Paving, Inc. was the sole bidder and submitted a cost proposal totaling $168,600.00. Bidding specifications require bidders to hold their pricing for 180 days which has passed. The Office of Construction Management is now in a position to begin this project and asked Columbus Asphalt to update their cost proposal and they submitted a revised cost of $177,030.00, which represents a 5% increase due to cost increases in the construction industry. Additionally, the Office of Construction Management would like to add a $35,000.00 contingency to this amount . \nTherefore, the final cost totals $212,030.00. Due to the fact that this project is needed and to avoid further delay, this ordinance seeks authority to waive the competitive bidding provisions of Columbus City Code, Section 329. and that the award be made to the sole responsive and responsible bidder, Columbus Asphalt Paving, Inc. and accept the revised pricing.\nColumbus Asphalt Paving, Inc. Contract Compliance No. 31-0857095, expiration date November 4, 2021.\nEmergency action is requested in order to allow time for construction of the project within the 2021 season prior to the asphalt plants slowing their operations in late fall and winter.\nFiscal Impact:  This ordinance authorizes an expenditure of $212,030.00 from the Construction Management Capital Improvement Fund with Columbus Asphalt Paving, Inc. for a parking lot expansion at 1410 Cleveland Ave. These funds are budgeted within the Construction Management Capital Improvement Fund. \n \nTitle\nTo amend the 2020 Capital Improvement Budget; to authorize the Director of Finance and Management to enter into a contract on behalf of the Office of Construction Management with Columbus Asphalt Paving, Inc. for a parking lot expansion at 1410 Cleveland Avenue; to authorize the transfer and expenditure of $212,030.00 between projects within the Construction Management Capital Improvement Fund; to waive the competitive bidding provisions of Columbus City Code; and to declare an emergency. ($212,030.00)\n \nBody\nWHEREAS, it is necessary to amend the 2020 Capital Improvement Budget and to authorize the transfer of funds between projects within the Construction Management Capital Improvement Fund; and\n \nWHEREAS, the Finance and Management Department, Office of Construction Management desires to enter into a contract for parking lot expansion at 1410 Cleveland Avenue to meet the operational needs; and\n \nWHEREAS, the Office of Construction Management solicited formal bids for the expansion of the parking lot at 1410 Cleveland Avenue; and \n \nWHEREAS, Columbus Asphalt Paving, Inc. was deemed the sole responsive, and best bidder; and \nWHEREAS, it is necessary to authorize the expenditure of $212,030.00 from the Construction Management Capital Improvement Fund; and\nWHEREAS, it is necessary to waive the competitive bidding provisions of Columbus City Code, Section 329; and\nWHEREAS, an emergency exists in the usual daily operation of the Finance and Management Department, Office of Construction Management, in that it is immediately necessary to authorize the Director of Finance and Management to enter into a contract with Columbus Asphalt Paving, Inc. for the parking lot expansion at 1410 Cleveland Avenue so that parking lot improvements can be completed before fall and potential cold weather; thereby preserving the public health, peace, property, safety, and welfare; now, therefore\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1.  That the 2020 Capital Improvement Budget be amended as follows:\nProject ID | Project Name | Current Authority | Revised Authority | Change\nP570030-100120 |Facility Renovations - Various | $2,257,818 | $2,045,788 | ($212,030)\nP570087-100002 | Neighborhood Building Parking Lot Expansion 1410 Cleveland Avenue| $0 | $212,030 | $212,030\n \nSECTION 2.  That the Finance and Management Director is hereby authorized to enter into a contract on behalf of the Office of Construction Management with Columbus Asphalt Paving, Inc. for the parking lot expansion at 1410 Cleveland Avenue.\n \nSECTION 3. That the transfer of $212,030.00, or so much thereof as may be needed is hereby authorized within Fund 7733, in Object Class 06 - Capital Outlay, per the accounting codes in the attachment to this ordinance.\nSECTION 4.  That the expenditure of $212,030.00, or so much thereof that may be necessary in regards to the action authorized in SECTION 1, is hereby authorized in the Construction Management Capital Improvement Fund, Fund 7733 in Object Class 06 - Capital Outlay, per the accounting codes in the attachment to this ordinance.  \n \nSECTION 5. That the monies in the foregoing Sections shall be paid upon order of the Director of Finance and Management, and that no order shall be drawn or money paid except by voucher, the form of which shall be approved by the City Auditor.\nSECTION 6.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 7.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 8. That the competitive bidding provisions of Columbus City Code, Section 329 are hereby waived; and\n \nSECTION 9.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 10.  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared an emergency measure and shall take effect and be enforced from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 16,
    "meeting_date": "2021-06-07",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}