{
  "success": true,
  "vote": {
    "id": 10140,
    "item_number": "CA-27",
    "title": "To authorize the Director of Recreation and Parks to enter into contract with E.L. Robinson Engineering of Ohio Co. to provide professional services for the Big Walnut Trail - Refugee Road to East Main Street - Stage 1 Project; to authorize the transfer of $692,000.00 within the Recreation and Parks Voted Bond Fund, to authorize the expenditure of $692,000.00 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($692,000.00)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Director of the Recreation and Parks Department to enter into contract with E.L. Robinson Engineering of Ohio Co. to provide professional services for the Big Walnut Trail - Refugee Road to East Main Street - Stage 1 Project. The contract amount is $657,021.87, with a contingency of $34,978.13, for a total of $692,000.00 being authorized by this ordinance.\n \nThe central reach of the Big Walnut Trail is developing into one of the Central Ohio Region’s most scenic and accessible greenways and will put thousands of residents of the Mid East, South East, and Far East Communities within a few minutes access to the regional trail network. This project has been awarded $7,483,914 from MORPC Attributable Funds towards construction in Fiscal Year 2028. The extension begins in Nafzger Park, along Big Walnut Creek at Refugee Road. From there, the trail will head north along Big Walnut Creek and the Noe Bixby Road Corridor, passing beneath Interstate 270, Norfolk Southern Railroad, and Interstate-70 to a proposed stream crossing into Big Walnut Park. The trail then uses the existing one mile trail ending north of Livingston Avenue. The final segment will head north through Big Walnut Parkland to the northern terminus on the south side of East Main Street, at the Fairway Boulevard signalized crossing. During preliminary design, neighborhood connections will be evaluated and designed to serve the Walnut Heights, Pine Hills, and Shady Lane Neighborhoods.  \n \nThis Stage 1 contract includes preliminary engineering, environmental studies, and community outreach. Upon successful completion of Stage 1, the City intends to negotiate a scope and fee for a Stage 2 contract modification to complete the detailed design and construction plans for the successful bidding of this trail project.\n \nVendor Bid/Proposal Submissions (ODI designation status): Bids were advertised through Vendor Services, in accordance with City Code Section 329, on April 16, 2024 and received by the Recreation and Parks Department on May 8, 2024. Bids were received from the following companies:\n \nE.L. Robinson Engineering of Ohio Co. (MAJ)\nMichael Baker International (MAJ)\nEMH&T (MAJ)\nThe Kleingers Group (MAJ)\nWoolpert, Inc. (MAJ)\n \nOf note, professional services contracts are quality based selections and not based on price. Costs were not requested nor were they part of this evaluation.\n \nIn accordance with City Code, a selection team evaluated the proposals and recommended E.L. Robinson Engineering of Ohio Co. be selected to perform the work. The firm was chosen based on their referenced projects, experience, qualifications, availability, timeline, and project approach.\n \nAs part of their bid, E.L. Robinson Engineering of Ohio Co. has proposed the following vendors to fulfill the Office of Diversity and Inclusion project goal:\n \nCap-Stone & Associates, Inc. (WBE)\nMurphy Epson (WBE)\nDLZ (MBE)\n \nCertification of the MBE’s and WBE’s being proposed are in good standing at the time the bid is being awarded.\n \nPrincipal Parties: \nE.L. Robinson Engineering of Ohio Co. \n950 Goodale Boulevard, Suite 180\nColumbus, Ohio 43212 \nAngela Fedak, (614) 586-0642, afedak@elrobinson.com\nContract Compliance Number: 005858\nContract Compliance Expiration Date: January 19, 2026\n \nEmergency Justification: Emergency action is requested in order to meet the commitment of design commencement required by the grant funding that is funding the future construction of the project.\n \nBenefits to the Public: This project will improve access to trails and is one of the top rated priorities noted by Columbus residents. This project will provide significant connectivity for residents in Mid East, South East and Far East Communities by extending existing regional trail access to and through several parks and neighborhoods.\n \nCommunity Input/Issues: As part of the MORPC grant application process, the Recreation and Parks Department received dozens of letters of support for this project from the members of the community, including many students from Independence High School and the neighboring communities of Gahanna and Whitehall.\n \nArea(s) Affected: Citywide (99)\n \nMaster Plan Relation: This project supports the Recreation and Parks Master Plan by improving access to trails and greenways corridors. It provides equitable and safe access to the trail system for under-served communities.\n \nFiscal Impact: $692,000.00 is budgeted and available from within the Recreation and Parks Voted Bond Fund 7702 to meet the financial obligations of this contract.\nTitle\n \nTo authorize the Director of Recreation and Parks to enter into contract with E.L. Robinson Engineering of Ohio Co. to provide professional services for the Big Walnut Trail - Refugee Road to East Main Street - Stage 1 Project; to authorize the transfer of $692,000.00 within the Recreation and Parks Voted Bond Fund, to authorize the expenditure of $692,000.00 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($692,000.00)\n \nBody\n \nWHEREAS, it is necessary to authorize the Director of the Recreation and Parks to enter into contract with E.L. Robinson Engineering of Ohio Co. to provide professional services for the Big Walnut Trail - Refugee Road to East Main Street - Stage 1 Project; and\n \nWHEREAS, it is necessary to authorize the transfer of $692,000.00 within the Recreation and Parks Voted Bond Fund; and, \n \nWHEREAS, it is necessary to authorize the expenditure of $692,000.00 from the Recreation and Parks Voted Bond Fund 7702; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Recreation and Parks Department in that it is immediately necessary to authorize the Director to enter into contract with E.L. Robinson Engineering of Ohio Co. in order to meet the commitment of design commencement required by the grant funding that is funding the future construction of the project, all for the preservation of the public health, peace, property, safety, and welfare and, NOW, THEREFORE  \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Recreation and Parks be and is hereby authorized to enter into contract E.L. Robinson Engineering of Ohio Co. to provide professional services for the Big Walnut Trail - Refugee Road to East Main Street - Stage 1 Project.\n \nSECTION 2. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 4. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 5. That the transfer of $692,000.00 or so much thereof as may be needed, is hereby authorized between projects within the Recreation and Parks Bond Fund 7702 per the account codes in the attachment to this ordinance.\n \nSECTION 6. For the purpose stated in Section 1, the expenditure of $692,000.00 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Recreation and Parks Voted Bond Fund 7702 in object class 06 Capital Outlay per the accounting codes in the attachments to this ordinance.\n \nSECTION 7. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 120,
    "meeting_date": "2024-07-29",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}