{
  "success": true,
  "vote": {
    "id": 10172,
    "item_number": "CA-59",
    "title": "To authorize the Director of Public Utilities to enter into a contract with AM Conservation Group, Inc. for the Smart Thermostat Program. ($0.00)",
    "description": "Explanation\n \nThis legislation authorizes the Director of Public Utilities to enter into a contract with AM Conservation Group, Inc. for the Smart Thermostat Program.\n \nThe program will promote energy efficiency and conservation to customers by offering them smart thermostats. The program will operate in conjunction with the Department of Public Utilities’ (DPU) Enhanced Meter Project in the hopes of unlocking further customer engagement concerning demand response and encouraging off-peak energy use.\n \nAM Conservation Group, Inc. (AMC) will design, develop, and implement an online ecommerce solution branded as the “FlashMarket” to support the City’s Smart Thermostat Program. FlashMarket will enable Division of Power (DOP) customers to redeem instant rebates funded by its Smart Thermostat Program. Eligible customers will be able to choose from three smart thermostats approved by the City and AMC will handle procurement, warehousing, and shipment of smart thermostat orders, and report and invoice for all rebates redeemed for the prior month. Eligible customers are any customer in good standing who can validate with an active DOP account number.\n \nPROCUREMENT:  \n \nThe Department of Public Utilities solicited competitive bids through the Vendor Services and Bonfire websites from February 27, 2024 to March 22, 2024 for the Smart Thermostat Program in accordance with the relevant provisions of Chapter 329 of City Code (RFQ026973). Two (2) bids, both by majority vendors, were received. Both bids were deemed responsive and were evaluated on April 2, 2024. The evaluation committee determined that AMC submitted the strongest proposal because it displayed a strong understanding of the project scope, how the company plans to implement it, and the company’s past performance that shows a strong working relationship within local government.\n \nMINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM:\n \nThis contract opportunity was submitted to the City’s Office of Diversity and Inclusion (ODI) for review and assignment of an MBE/WBE goal prior to bidding. ODI determined there was not an opportunity for MBE/WBE participation in this contract and did not assign a goal. This contract was not bid with a City of Columbus MBE/WBE Program goal and the requirements of the City’s MBE/WBE Program are not applicable to this contract.\n \nSUPPLIER:  \n \nAM Conservation Group, Inc. | EIN on file | D365 Vendor #011338 | Expired 8/20/2021 | \nThe company does not hold MBE or WBE status.\n \nFISCAL IMPACT  \n \n$0.00\n \n$0.00 was spent in 2023\n$0.00 was spent in 2022\n \nORD 0963-2023 authorized acceptance and expenditure of the award for the 2022 EcoSmart Choice Sustainability Grant, G602100, in the amount of $101,536.31 from American Municipal Power, Inc. (AMP). AMP approved the Division of Power’s (DOP) plan to use the 2022 grant award funds to offer smart thermostats at no or low cost to customers in connection with the ongoing Enhanced Meter Project (670500-100000). ORD 2704-2023 authorized the transfer of $2,485.24 of those funds to honor applications from a separate Division of Power grant for economically disadvantaged customers that were approved in excess of the remaining grant balance, leaving $99.051.07 available for the Smart Thermostat Program.\n \nThere is a $10,000.00 start-up fee associated with this project. The expected rebate range will be $80.00 to $115.00 per device. Smart thermostat manufacturer’s suggested retail prices (MSRP) can vary, so the final rebate amount per smart thermostat will be confirmed during start-up based upon City selection of devices it wishes to offer. Additional per device fees are below:\n \n•                     $15.00 for marketing\n•                     $10.00 for customer care services\n•                     $10.00 for project management services\n \nWith these rates and fees, the range of total cost for each smart thermostat is $115.00 to $150.00, meaning the program may disburse 593 to 774 smart thermostats.\n \n \nTitle\n \nTo authorize the Director of Public Utilities to enter into a contract with AM Conservation Group, Inc. for the Smart Thermostat Program. ($0.00)\n \n \nBody\n \nWHEREAS, the Department of Public Utilities (DPU) was awarded an EcoSmart Choice Sustainability Grant, G602100, in the amount of $101,536.31 from American Municipal Power, Inc. (AMP) to offer smart thermostats at no or low cost to customers in connection with the ongoing Enhanced Meter Project; and\n \nWHEREAS, AMP approved the transfer of $2,485.24 of those funds to honor applications from a separate Division of Power EcoSmart Choice Sustainability Grant for economically disadvantaged customers that were approved in excess of the remaining grant balance, leaving $99.051.07 available for the Smart Thermostat Program; and\n \nWHEREAS, the DPU solicited competitive bids through the Vendor Services and Bonfire websites from February 27, 2024 to March 22, 2024 for the Smart Thermostat Program (RFQ026973); and\n \nWHEREAS, two (2) bids, both by majority vendors, were received, deemed responsive, evaluated on April 2, 2024, and the evaluation committee determined that AM Conservation (AMC) submitted the strongest proposal; and  \n \nWHEREAS, AMC will design, develop, and implement an online ecommerce solution branded as the “FlashMarket” to support the program, which will enable eligible Division of Power customers to choose from three smart thermostats approved by the City; and  \n \nWHEREAS, AMC will handle procurement, warehousing, and shipment of smart thermostat orders, and report and invoice for all rebates redeemed for the month prior; and\nWHEREAS, eligible customers are any customer in good standing who can validate with an active DOP account number; and\n \nWHEREAS, there is a $10,000.00 start-up fee associated with this project.\n \nWHEREAS, there are per device fees of $15.00 for marketing, $10.00 for customer care services, and $10.00 for project management services; and\n \nWHEREAS, with these fees and estimated rebates of $80.00 to $115.00 per device, the range of total cost for each smart thermostat is $115.00 to $150.00, meaning the program may disburse 593 to 774 smart thermostats; and \n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities to authorize the Director of Public Utilities to enter into a contract for the Smart Thermostat Program with AM Conservation Group, Inc.; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Public Utilities is hereby authorized to enter into a contract with AM Conservation Group, Inc. for the Smart Thermostat Program.\nSECTION 2.  That this contract is in accordance with the relevant provisions of Chapter 329 of City Code.\nSECTION 3. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 120,
    "meeting_date": "2024-07-29",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}