{
  "success": true,
  "vote": {
    "id": 10197,
    "item_number": "SR-13",
    "title": "To authorize the Director of the Department of Neighborhoods to enter into a non-profit service contract with the Center for Employment Opportunities for litter abatement work; to authorize the appropriation and expenditure of $50,000.00 from the Neighborhood Initiatives Fund; to authorize the expenditure of $200,000 from the Department of Neighborhoods' General Fund; to waive the competitive bidding provisions of the City Codes; and to declare an emergency. ($250,000.00)",
    "description": "Explanation\n \nBackground: \n \nThe Department of Neighborhoods and the Department of Public Service work collaboratively to support community needs.\n \nThis ordinance authorizes the waiving of competitive bidding to award a non-profit professional service agreement in an amount not to exceed $250,000.00 to the Center for Employment Opportunities (CEO). This contract will allow the City of Columbus to work with CEO to engage participants in their job training program to provide services including:\n•                     Litter abatement and disposal\n•                     Illegal dumping removal and disposal\n•                     Clearing weeds and brush\n•                     Alley clean-up\n \nCEO is dedicated to providing, immediate, effective and comprehensive employment services to men and women recently released from incarceration. It is a highly structured and tightly supervised program that helps participants regain the skill and confidence needed for a successful transition to stable, productive lives.\n \nThe Department of Neighborhoods and the Department of Public Service will work collaboratively to identify areas across Columbus where the CEO work crew will focus.     \n \nVendor Contract Compliance:\n023706 Center for Employment Opportunities, Inc. and is pending\n \nFiscal Impact: Funding is available within the Department of Neighborhoods Fund 1000, Subfund 100010 and Neighborhood Initiatives Subfund, and Fund 1000, Subfund 100018. \n \nEmergency Justification:  Emergency action is requested to allow for the immediate execution of this contract in order to begin community clean-up work as soon as possible.  \n \nTitle\n \nTo authorize the Director of the Department of Neighborhoods to enter into a non-profit service contract with the Center for Employment Opportunities for litter abatement work; to authorize the appropriation and expenditure of $50,000.00 from the Neighborhood Initiatives Fund; to authorize the expenditure of $200,000 from the Department of Neighborhoods' General Fund; to waive the competitive bidding provisions of the City Codes; and to declare an emergency. ($250,000.00)\n \nBody\n \nWHEREAS, the City is focused on supporting community needs to strengthen neighborhoods; and  \n \nWHEREAS, contracting with the Center for Employment Opportunities will provide additional capacity to conduct litter abatement, illegal dumping removal, alley clean-up and disposal and the clearing of weeds and brush; and \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Neighborhoods in that it is immediately necessary to authorize the Director of the Department of Neighborhoods to enter into contract with the Center for Employment Opportunities to begin clean-up services thereby advancing the public health, and welfare; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Neighborhoods be, and hereby is, authorized to enter into a non-profit service contract with the Center for Employment Opportunities for community clean-up work up to $250,000.00, or so much thereof as may be needed, in accordance with the provisions of Columbus City Code, and that the competitive bidding provisions of Chapter 329 of the Columbus City Codes are hereby waived.\n \nSECTION 2. That the Auditor is hereby authorized and directed to appropriate and expend $50,000.00 within the Neighborhood Initiatives, Fund 1000, Subfund 100018, per the accounting codes in the attachment to this ordinance.\nSECTION 3. That the expenditure of $200,000.00 is authorized in the Department of Neighborhoods general fund, Fund 1000, per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modification associated with this ordinance. \nSECTION 6.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 120,
    "meeting_date": "2024-07-29",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Community Services",
      "Contracts & Agreements"
    ]
  }
}