{
  "success": true,
  "vote": {
    "id": 10201,
    "item_number": "SR-17",
    "title": "To authorize the Municipal Court Clerk, to establish a purchase order with TAB Products Company LLC for the purchase of case file folders for the Municipal Court Clerk's Office; to waive the competitive bidding provisions of Columbus City Code; to authorize the expenditure of $78,157.80 from the Municipal Court Clerk General Fund; and to declare an emergency. ($78,157.80 )",
    "description": "Explanation\n \nBackground: This legislation authorizes Franklin County Municipal Court, Clerk of Court (\"Municipal Court Clerk\") to establish a purchase order with TAB Products Company LLC for the purchase of case file folders in the amount of $78,157.80. \n \nThe Municipal Court Clerk utilizes case file folders to store civil, criminal, traffic, expungement, and environmental court documents for Municipal Court Clerk's Office. \n \nIn past years, it was deemed to be in the best interest of the Clerk's Office to purchase from the previously established State of Ohio, State Term Schedule with TAB Products Company LLC, that recently expired, schedule number 800809; effective dates 09/01/2021 to 08/31/2023. Therefore, to continue to have an exact match to the file folders (color coding) and to continue to receive competitive pricing consistent with the State Term Schedule previously used, this legislation is being submitted in accordance with the City of Columbus bid waiver procurement. \n \nContract Compliance: 52-2390162\nExpiration Date: 2/28/2026\nDAX Vendor Number: 009129\n \nThis company is not debarred according to the excluded party listing system of the Federal Government or prohibited from being awarded a contract according to the Auditor of State unresolved finding for recovery certified search.\n \nContracts:\nOrdinance: 1310-2009; $94,303.63; FL004454\nOrdinance: 0933-2010; $101,414.83; FL004665\nOrdinance: 1517-2011; $76,215.65; FL005010\nOrdinance: 1081-2012; $84,928.60; FL005293\n2013 Purchase Order: ED048428; $810.60\nOrdinance: 1431-2013; $70,799.30; FL005652\nOrdinance: 1297-2014; $71,499.43; FL005934\nOrdinance: 1676-2015; $75,018.67; FL006297\nOrdinance: 1545-2016; $80,592.17; PO032569\nOrdinance: 0739-2017; $76,436.80; PO068202\n2018 Purchase Order:  PO109856; $489.00\nOrdinance: 0466-2018; $81,350.15; PO124521\n2019 Purchase Order: 160689; $240.45\nOrdinance: 1192-2019; $81,458.75; PO180693\nOrdinance: 1136-2020; PO233216; $78,318.35\n2021 Purchase Order: PO276285; $45,247.31 \nOrdinance: 1244-2022; PO337083; $61,581.41\n2022 Purchase Order; PO347862; $2,100.00\n2023 Purchase Order; PO372969 $150.60\nOrdinance: 1008-2023; PO395690 $78,048.90\nOrdinance: 2072-2024; $78,157.80\n \nEmergency:  There is an immediate need to establish a purchase order with TAB Products Company LLC to continue the daily operations and to account for the increased amount of cases filed in the Municipal Court. \n \nFiscal Impact:  Funds totaling $78,157.80 are available within the Franklin County Municipal Court 2024 General Fund budget. \n \nTitle\n \nTo authorize the Municipal Court Clerk, to establish a purchase order with TAB Products Company LLC for the purchase of case file folders for the Municipal Court Clerk's Office; to waive the competitive bidding provisions of Columbus City Code; to authorize the expenditure of $78,157.80 from the Municipal Court Clerk General Fund; and to declare an emergency. ($78,157.80 )\n \nBody\n \nWHEREAS, the Municipal Court Clerk has a need to purchase case file folders to store civil, criminal, traffic, and environmental court documents; and\n \nWHEREAS, it is in the City's best interest to waive the competitive bidding provisions of Columbus City Code for case file folders; and\n \nWHEREAS,an emergency exists in the usual daily operation of the Franklin County Municipal Court in that it is immediately necessary to authorize the Municipal Court Clerk to establish a purchase order with TAB Products Company LLC in order to maintain the supply of case file folders to account for the increased amount of cases filed, for the immediate preservation of the public health, peace, property, safety and welfare; and NOW THEREFORE,\n  \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Municipal Court Clerk be and hereby is authorized to establish a purchase order with TAB Products Company LLC in the amount of $78,157.80 for the purchase of case file folders. \n \nSECTION 2.  That this Council finds that it is in the City's best interest to waive the competitive bidding provisions of City Code in order to enter into this contract.\n \nSECTION 3.  That the expenditure sum of $29,226.15 or so much as may be needed, be and hereby is authorized within Department 26, the Municipal Court Clerk, Object Class 02 Materials and Supplies, Program MC001, per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the expenditure sum of $48,931.65 or so much as may be needed, be and hereby is authorized within Department 26, the Municipal Court Clerk, Object Class 02 Materials and Supplies, Program MC002 per the accounting codes in the attachment to this ordinance.\n \nSECTION 5.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 120,
    "meeting_date": "2024-07-29",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}