{
  "success": true,
  "vote": {
    "id": 10258,
    "item_number": "CA-29",
    "title": "To authorize and direct the Board of Health to modify an existing contract with Crosby’s Drugs, Inc., for increased pharmaceutical distribution services for the Ben Franklin TB grant program for the period of January 1, 2024 through December 31, 2024; to authorize the expenditure not to exceed $40,000.00 from the Health Department Grant fund; and to declare an emergency.  ($40,000.00).",
    "description": "Explanation \n \nBACKGROUND:   This ordinance authorizes the Board of Health to modify an existing contract with Crosby’s Drugs, Inc., for tuberculosis (TB) pharmaceutical distribution services for the Ben Franklin TB grant program. The contract period for this contract modification is January 1, 2024 to December 31, 2024 with an amount not to exceed $40,000.00, for a new total contract amount of $110,000.00.\n \nCrosby’s Drugs, Inc. contract compliance number is CC-004573. \n \nColumbus Public Health has a need to increase 340B pharmaceutical distribution services for the Ben Franklin Tuberculosis (TB) grant program with Crosby’s Drugs, Inc., due to a national shortage of a specific drug (pyrazinamide) required to treat virtually all patients with TB disease. This shortage reduced availability, disrupted supply chains, and increase the cost from all suppliers. Additionally, an increase in TB patients without insurance who are also Medicaid ineligible also contributed to increased costs, due to the need for TB drugs not included in the 340B formulary.\n \nThe contract increase amount is based on the previous six months of pharmaceuticals purchased which represent the current patient cases being treated. Unit prices of medication are based on a pre-determined 340B rate.  \n \nThere is an immediate need to continue pharmacy services with Crosby’s Drugs, Inc., an authorized 340B distributor of this region per the attached bid waiver which was previously authorized on original Ordinance 0163-2024. A disruption to those services could be harmful to patients being treated at the Ben Franklin TB Clinic. \n \nFISCAL IMPACT:  $40,000.00 is budgeted in the Health Department Grant Fund for pharmaceutical distributions services for the TB grant program.  \n \nTitle\n \nTo authorize and direct the Board of Health to modify an existing contract with Crosby’s Drugs, Inc., for increased pharmaceutical distribution services for the Ben Franklin TB grant program for the period of January 1, 2024 through December 31, 2024; to authorize the expenditure not to exceed $40,000.00 from the Health Department Grant fund; and to declare an emergency.  ($40,000.00).\n \nBody\n \nWHEREAS, Columbus Public Health has a need to modify an existing contract for pharmaceutical distribution services for the contract period of January 1, 2024 through December 31, 2024; and \n \nWHEREAS, Crosby’s Drugs, Inc. has the expertise required to provide these services; and\n \nWHEREAS, an emergency exists in the usual daily operation of Columbus Public Health in that it is immediately necessary to authorize the Board to modify a contract with Crosby’s Drugs, Inc., to ensure the continued operation of pharmaceutical distribution of TB medications to prevent the spread of infectious diseases in Franklin County, all for the immediate preservation of the public health, peace, property, safety and welfare; and NOW, THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Board of Health is hereby authorized to modify the existing contract with Crosby’s Drugs, Inc., in the amount not to exceed $40,000.00, for a new total contract amount of $110,000, for the TB grant program, for the period of January 1, 2024 through December 31, 2024\n \nSECTION 2.  That to pay the costs of said contract, an expenditure not to exceed $40,000.00 is authorized from the Health Department Grant fund, Fund No. 2251, per the attached accounting document. \n \nSECTION 3.  That the funds necessary to carry out the purpose of this Ordinance are deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5.  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 121,
    "meeting_date": "2024-09-09",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}