{
  "success": true,
  "vote": {
    "id": 10263,
    "item_number": "CA-34",
    "title": "To authorize the Director of the Department of Public Utilities to modify Indefinite Quantity Contracts with Facemyer Landscaping LLC/Ironsite, Inc. and Russell Tree Experts Ltd. for Invasive Plant Management Services to increase funding; to authorize the expenditure of $70,000.00 from the Water Operating Fund; and to declare an emergency.  ($70,000.00)",
    "description": "Explanation                     \n \nBACKGROUND: This legislation authorizes the Director of Public Utilities to modify to increase an existing Indefinite Quantity Contract for Invasive Plant Management Services with Ironsite, Inc., and Russell Tree Experts Ltd. in the amount of $70,000.00. The Department of Public Utilities uses this service for management of trees and brush that grow around power distribution lines, street light circuits, water treatment facilities, sewer treatment facilities and other areas serviced by the City of Columbus.\n \nThe Department of Public Utilities solicited competitive bids for Invasive Plant Management Services in accordance with the relevant provisions of Section 329 (RFQ021643). Four hundred and twenty-two (422) vendors were solicited.  Two (2) bids were received and opened on May 18, 2022. The bids from Ironsite, Inc. and Russell Tree Experts Ltd. were deemed as responsive, responsible and best bidders. \n \nPurchase Agreement, PA005917 and PA005919, were established in accordance with Request for Quotation RFQ021643 and authorized under Ordinance Number 1598-2022 and will expire December 31, 2025.\n \nThis legislation seeks to add funding to the contract. This Ordinance is being submitted in accordance with the relevant provisions of Chapter 329 of City Code pertaining to contract modifications and renewals. \n \nSUPPLIERS:                      Ironsite, Inc., WBE/EBE (005926), expires July 16, 2025.\n                                                    Russell Tree Experts Ltd., MAJ (011950), expires May 19, 2025.\n \nThe companies are not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.  \n \n1.                       Amount of additional funds:  Total amount of additional funds needed for the modification is to ADD $70,000.00.  Total contract amount including this modification is $250,000.00.\n \n2.                     Reasons additional funds were not foreseen:  The need for additional funds was known at the time of the initial contract.  This modification to increase funding is necessary for the payment of services to be provided through December 31, 2025.\n \n3.                     Reason other procurement processes were not used:  Work under this modification is a continuation of services included in the scope of the original bid contract.  No lower pricing/more attractive terms and conditions are anticipated at this time.\n \n4.                     How cost was determined:  The cost, terms and conditions are in accordance with the original agreement.\n \nEMERGENCY DESIGNATION:   This ordinance is being submitted as an emergency in order to remove invasive plants at the reservoir to facilitate proper management of shoreline property and in advance of a fall tree planting.\n \nFISCAL IMPACT:  The money for this contract is budgeted and available within the Water Operating Fund ($70,000).  \n \n$90,000.00 was spent for services in 2023\n$90,000.00 was spent for services in 2022\n \nTitle\n \nTo authorize the Director of the Department of Public Utilities to modify Indefinite Quantity Contracts with Facemyer Landscaping LLC/Ironsite, Inc. and Russell Tree Experts Ltd. for Invasive Plant Management Services to increase funding; to authorize the expenditure of $70,000.00 from the Water Operating Fund; and to declare an emergency.  ($70,000.00)\n \nBody\n \nWHEREAS, the Department of Public Utilities entered into an Indefinite Quantity Contract for the purchase of Invasive Plant Management Services in accordance with Chapter 329 of the Columbus City Code, pursuant to solicitation, RFQ021643, Ironsite, Inc. and Russell Tree Experts Ltd.; and \n \nWHEREAS,  the Department of Public Utilities wishes to modify to increase funding for the contract with Ironsite, Inc. and Russell Tree Experts Ltd.; and for the purchase of Invasive Plant Management Services to provide additional funding without extending the term of the contract; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Utilities, Division of Water, in that it is immediately necessary to authorize the Director of Finance and Management to associate all General Budget Reservations resulting from this ordinance for the purchase of Invasive Plant Management Services with Ironsite, Inc., and Russell Tree Experts Ltd. to control invasive plants at the reservoir to facilitate proper management of shoreline property and in advance of fall tree planting, all for the immediate preservation of the public health, peace, property, and safety; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Public Utilities be and is hereby authorized to modify and modify to add funding to Indefinite Quantity Agreements PA005919 and PA005917 with Ironsite, Inc., and Russell Tree Experts Ltd. for Invasive Plant Management Services in accordance with the terms and conditions as shown in the agreement on file in the Department of Public Utilities. Total amount of this modification is to ADD $70,000.00.  Total contract amount including this modification is $250,000.00.\n \nSECTION 2.  That the expenditure of $70,000.00 or so much thereof as may be needed, be and is hereby $70,000.000 authorized in Fund 6000 (Water Operating) in object class 03 per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this Ordinance.\n \nSECTION 5.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure, which shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 121,
    "meeting_date": "2024-09-09",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}