{
  "success": true,
  "vote": {
    "id": 10272,
    "item_number": "SR-1",
    "title": "To accept the amounts and rates by the Franklin County Budget Commission for the City's Tax Budget for 2025 and to declare an emergency.",
    "description": "Explanation\nThis action is required as part of the County tax budget process. This resolution accepts the amounts and rates determined by the Franklin County Budget Commission.\n \nFiscal Impact:  No direct fiscal impact at this time - this resolution accepts rate information from Franklin County\n \nTitle\nTo accept the amounts and rates by the Franklin County Budget Commission for the City's Tax Budget for 2025 and to declare an emergency.\n \nBody\nWHEREAS, this Council, in accordance with the provisions of law, has previously adopted a tax budget for the fiscal year commencing January 1, 2025; and\n \nWHEREAS, the Budget Commission of Franklin County, Ohio, has certified its action to this Council together with an estimate by the County Auditor of the rate of each tax necessary to be levied by the Council, and what part thereof is without and what part is within the ten mill limitation; and\n \nWHEREAS, an emergency exists in the usual daily operation of the City Government in that it is immediately necessary for Council to accept the amounts and rates fixed by the County Budget Commission for the City's tax budget for the tax year 2024 (collection year 2025) in order to meet the required Oct 1, 2024 deadline. The mandated timing and availability of the data necessary to prepare this resolution require that it be submitted as an emergency; now therefore, \n  \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the amounts and rates as determined by the Franklin County Budget Commission in its certification, be and the same are hereby accepted.\n \nSECTION 2. Be it further resolved that there be and is hereby levied on the tax duplicate of said City the rates of each tax necessary to be levied within and without the ten mill limitation for tax year 2024 (collection year 2025), as set forth in SCHEDULE A, as follows:\n \nSCHEDULE A\nSUMMARY OF AMOUNTS REQUIRED FROM GENERAL PROPERTY TAX\nAPPROVED BY THE BUDGET COMMISSION, AND COUNTY AUDITOR'S\nESTIMATED TAX RATES\n                                                                                                     County Auditor's\n                                   Amount to be      Amount Approved           Estimate of Full Tax\n                                    Derived from           by Budget                   Rate to be Levied\n                                    Levies Outside        Commission                Inside            Outside\n                                      10 Mill                  Inside 10 mill              10 Mill           10 Mill\n                                     Limitation                __Limit                    _Limit          __Limit  \n \nGeneral Fund                                                    $71,068,978                    2.54\nPolice Pension                                                      8,523,064                     .30\nFire Pension              _____                             __8,523,064____       __  .30\n                                Total                             $88,115,106                  3.14       \n \n \nSECTION 3. Be it further resolved that the Clerk of this Council, be and she is hereby directed to certify a copy of this Resolution to the County Auditor of said County.\n \nSECTION 4. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this resolution is hereby declared to be an emergency measure and shall take effect and be in force from and after its adoption and approval by the Mayor, or ten days after adoption if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 121,
    "meeting_date": "2024-09-09",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services"
    ]
  }
}