{
  "success": true,
  "vote": {
    "id": 10273,
    "item_number": "SR-2",
    "title": "To amend the 2024 Capital Improvement Budget; to authorize the transfer of cash and appropriation within the Affordable Housing Bond Fund; to authorize a funding agreement in an amount up to $4,000,000 with the Central Ohio Community Land Trust to develop affordable housing; to authorize the expenditure of up to $4,000,000.00 from the Affordable Housing Bond Fund; and to declare an emergency. ($4,000,000.00)",
    "description": "Explanation\n \nBACKGROUND\n \nThis legislation authorizes the expenditure of $4,000,000.00 from the Affordable Housing Fund per the Housing Development Agreement with the Central Ohio Community Land Trust (COCLT).\n \nColumbus City Council Ordinance 2522-2022, passed October 3, 2022, authorized the Director of the Department of Development to enter into a $12 million Housing Development Agreement (HDA) with the COCLT and appropriated $4 million for first allocation under the HDA. Council Ordinance 3377-2023, passed January 8th, 2024, authorized the expenditure of the second allocation of $4 million under the agreement. The Department of Development now request the final $4 million allocation under this HDA.  \n \nThe COCLT is a successful tool to bring more affordable homeownership opportunities and reutilize Land Bank lots. This agreement will allow the continued expansion of the COCLT and continue ongoing projects.   As of August, 2024 the COCLT has developed and sold 126 affordable homeownership housing units throughout Franklin County, including 100 within the City of Columbus.  An additional 47 units are finished and under contract or in substantially in construction.  \n \nEmergency action is requested to ensure completion of the units according to schedule and made available for occupancy.\n \n \nFISCAL IMPACTS\nThis ordinance authorizes an expenditure of $4,000,000.00 in the Affordable Housing Bond Fund. An amendment to the 2024 Capital Improvement Budget is required to establish sufficient budget authority within the proper project.\nCONTRACT COMPLIANCE:  the vendor number is 039810 and expires 2/9/26.\n \n \nTitle\n \nTo amend the 2024 Capital Improvement Budget; to authorize the transfer of cash and appropriation within the Affordable Housing Bond Fund; to authorize a funding agreement in an amount up to $4,000,000.00 with the Central Ohio Community Land Trust to develop affordable housing; to authorize the expenditure of up to $4,000,000.00 from the Affordable Housing Bond Fund; and to declare an emergency. ($4,000,000.00)\n \n \nBody\n \nWHEREAS, by Ordinances 0227-2019 and 0872-2020, Columbus City Council authorized the Director of the Department of Development to enter into an agreement with the Central Ohio Community Improvement Corporation to establish a Community Land Trust and authorized the expenditure of $4,000,000.00; and\n \nWHEREAS, by Ordinance 1059-2021, Columbus City Council authorized the expenditure of an additional $3,060,000.00 to fund additional trust projects; and\n \nWHEREAS, by Ordinance 2522-2022, Columbus City Council authorized the Director of Development to execute a Housing Development Agreement for $12,000,000.00 and authorized the expenditure of  $4,000,000.00 under the agreement; and\n \nWHEREAS, by Ordinance 3377-2023, Columbus City Council authorized the Director of Development authorized the expenditure of $4,000,000.00 under the agreement; and\n \nWHEREAS, The City and COCLT seek a final $4,000,000.00 allocation under the Housing Development Agreement, to bring the total expenditure to $12,000,000.00; and \n \nWHEREAS, COCLT is proposing to develop affordable housing under the land trust model that will include retaining ownership of the underlying land to ensure the sites remain permanently affordable; and\n \nWHEREAS, the COCLT has been undertaken successful projects in the South Side, Near East, Franklinton, Weiland Park, Milo-Grogan, Hilltop, Far Southside, and Linden in partnership with various co-developers and will expand into additional Columbus neighborhoods and with additional partners; and\n \nWHEREAS, the Parties desire to memorialize their understanding and agreements with respect to such cooperation; and\n \nWHEREAS, the City’s obligation to provide financial assistance as set forth herein is contingent upon the subsequent adoption of appropriate legislation by Columbus City Council authorizing such assistance; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development, Land Redevelopment Division to provide financial assistance for the construction of affordable housing without interruption, for the immediate preservation of the public health, peace, property, safety, and welfare; and NOW, THEREFORE,\n \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \n \nSECTION 1.                     That the 2024 Capital Improvements Budget authorized by ordinance 1907-2024 be amended as follows to establish sufficient authority for this project:\n \nFund / Project / Project Name / Current / Change /C.I.B. as Amended\n \nFund / Project / Project Name / C.I.B. / Change / C.I.B. as Amended\n7779 / P782012-100000 / Affordable Housing Funds (Voted Carryover) / $24,738,598.00 / ($4,000,000.00) / $20,738,598.00\n7779 / P782025-100000 / Community Land Trust (Voted Carryover) / $4,000,000.00 / $4,000,000.00 / $8,000,000.00 \nSECTION 2.                      That the Director of the Department of Development be and is hereby authorized to enter into a funding agreement, in an amount up to $4,000,000.00 on behalf of the City with the Central Ohio Community Land Trust, an Ohio Non-profit Corporation to construct affordable housing under a community land trust.  \n \nSECTION 3.  That the transfer of $4,000,000.00 or so much thereof as may be needed, is hereby authorized within Fund 7779 (Affordable Housing Bond Fund), per the account codes in the attachment to this ordinance.\n \nSECTION 4.  That for the purpose as stated in Section 1, the expenditure of $4,000,000.00, or so much thereof as may be necessary, is hereby authorized in fund 7779 (Affordable Housing Bond Fund), Project P782025-100000, Dept. 44-11 (Land Redevelopment), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance. \n \nSECTION 5.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance\n \nSECTION 7. For the reasons stated in the Preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 121,
    "meeting_date": "2024-09-09",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}