{
  "success": true,
  "vote": {
    "id": 1033,
    "item_number": "SR-21",
    "title": "To repeal Ordinances 1643-2020 and 1807-2020 pertaining to the wearing of face coverings in response to the spread of COVID-19; and to declare an emergency.",
    "description": "Explanation\nThe purpose of this ordinance is to repeal ordinances 1643-2020 and 1807-2020 requiring the wearing of face coverings in the City of Columbus in response to the spread of COVID-19 in light of new guidance issued by the Centers for Disease Control and Prevention for Fully Vaccinated People, and subsequent incorporation of federal guidance into the Ohio Department of Health Director’s Second Amended Order for Social Distancing, Facial Coverings and Non-Congregating, issued on May, 17, 2021. \nTitle\nTo repeal Ordinances 1643-2020 and 1807-2020 pertaining to the wearing of face coverings in response to the spread of COVID-19; and to declare an emergency.\nBody\nWHEREAS, beginning in March 2020, the City of Columbus experienced an ongoing threat of an acutely hazardous disease, illness, or health condition; specifically, COVID-19, that was caused by the appearance of a novel infectious agent resulting in international, federal, state and local declarations of states of public health emergencies; and\nWHEREAS, on July 6, 2020, after weighing the available information about the COVID-19 virus, consulting with Columbus Public Health, considering the guidance from Orders issued by the Ohio Department of Health and Governor DeWine, City Council concluded that the safety of the citizens of Columbus was best protected by implementing a face covering requirement and so passed Ordinance 1643-2020 mandating same; and \nWHEREAS, on July 8, 2020, the Ohio Department of Health subsequently issued face covering mandates for Franklin County which were, in some respects, more expansive than the requirements of 1643-2020 which led City Council to enact Ordinance 1807-2020 in order to harmonize the City and state law provisions; and\nWHEREAS, Ohio Department of Health Director Stephanie McCloud, under direction from Governor DeWine, issued the Director’s Second Amended Order for Social Distancing, Facial Coverings and Non-Congregating on May 17, 2021 which states that individuals fully vaccinated against COVID-19 may safely do most activities without a facial covering and without socially distancing; and\nWHEREAS, the Centers for Disease Control and Prevention issued guidance on May 16, 2021 that individuals fully vaccinated against COVID-19 may resume activities done prior to the pandemic without a mask or physically distanced, except where required by federal, state, local, tribal or territorial laws, rules, and regulations; and\nWHEREAS, the Columbus Public Health Department has the duty to enforce public health orders issued at both the state and local level; and\nWHEREAS there exists a current conflict between the face coverings ordinances of City Council and the guidance of the CDC, the repealing of the face covering orders of the Ohio Department of Health, the evolving medical knowledge regarding the manner by which COVID-19 is spread, and the current and prevalent availability of COVID-19 vaccinations; and\nWHEREAS, this conflict has created an emergency in the usual daily operations of the Columbus Public Health Department; NOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1.  That Ordinances 1643-2020 and 1807-2020 are hereby repealed.\nSECTION 2. That for the reasons stated in the preamble hereto, which is made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 16,
    "meeting_date": "2021-06-07",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services"
    ]
  }
}