{
  "success": true,
  "vote": {
    "id": 10359,
    "item_number": "CA-1",
    "title": "To Recognize October as Ostomy Awareness Month in the City of Columbus",
    "description": "Title\nTo Recognize October as Ostomy Awareness Month in the City of Columbus\n \n \nBody\nWHEREAS, Ostomy surgery is a life-saving procedure that allows bodily waste to pass through a surgically created stoma on the abdomen into a prosthetic known as an “ostomy bag” on the outside of the body or an internal surgically created pouch for continent diversion surgeries. Ostomy can occur at any age and does not lower life expectancy but is the start of a “new normal” life; and \n \nWHEREAS, there are currently more than 725,000 Americans living with an ostomy with that number growing each year, 1 in 500 people will require ostomy surgery at some point in their lives, and despite the life-saving nature of the surgery, 70% of ostomates report feeling stigmatized or socially isolated because of their condition; and \n \nWHEREAS, information about ostomy and ostomates will advocate for those who suffer silently, afraid to share their stories and address health issues and insurance policies that hindered ostomates from obtaining health care, insurance and ostomy supplies; and\n \nWHEREAS, this year’s theme is “ostomies are lifesavers”, a call to action to raise awareness, advocacy, and break the stigma associated with ostomy bags, which for many people are fear discussing due to the misconceptions and judgment that often surround them; and\n \nWHEREAS this year’s resolution recipient, Tonya Kelly, is the Founder of Ostomy Warriors, which provides people who have or will have surgery, caregivers, family, and friends lifelong learning and emotional support in addition to being an ostomy donation hub; now, therefore\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: That this Council proclaims, recognizes, and celebrates October as Ostomy Awareness Month in the City of Columbus.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 123,
    "meeting_date": "2024-10-07",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}