{
  "success": true,
  "vote": {
    "id": 10363,
    "item_number": "CA-5",
    "title": "To Recognize and Celebrate the 44th Nationwide Children’s Hospital Columbus Marathon for Celebrating Racing in the Community, Exceptional Fundraising, and Groundbreaking Research.",
    "description": "Title\n \nTo Recognize and Celebrate the 44th Nationwide Children’s Hospital Columbus Marathon for Celebrating Racing in the Community, Exceptional Fundraising, and Groundbreaking Research.\n \nBody\n \nWHEREAS, Nationwide Children’s Hospital is honored to be the title beneficiary for the Columbus Marathon & ½ Marathon and 2024 marks the 13th year of this strong partnership; and \n \nWHEREAS, thus far, more than $13 million has been raised for the Hospital. This includes more than $1.4 million contributed since 2012 by the Columbus Marathon Board of Directors; and\n \nWHEREAS, the 44th Nationwide Children’s Hospital Columbus Marathon and 18th annual ½ Marathon will take place on Sunday, October 20, 2024 in the heart of the Capital City; and\n \nWHEREAS, we encourage everyone to register and fundraise for the Nationwide Children’s Hospital Columbus Marathon & ½ Marathon, so that one day we can celebrate finding cures for all of the patients. Dedicate your race to the kids helped by this incredible institution, by running or walking 13.1 or 26.2 miles; and\n \nWHEREAS, there will be two additional events on Saturday, Oct. 19 as part of Marathon weekend - the Jesse Owens 5K and 1 Mile Fun Run & Walk presented by Park National Bank. The 5K will be a timed race for runners and walkers and the 1 Mile Fun Run & Walk will be an untimed family friendly event; and \n \nWHEREAS, the Columbus Marathon also partners with Columbus Recreation and Parks Department to host the Kids Run presented by White Castle on Saturday, Oct. 19 for free for children ages 3 to 11; now, therefore\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: \nThat this Council recognizes the runners, walkers, volunteers and supporters of the Nationwide Children’s Hospital Columbus Marathon & ½ Marathon; further, we celebrate our community's youngest patients, honor those who have succumbed to their illnesses, and support the family and friends who stood by them, for their determination and courage.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 123,
    "meeting_date": "2024-10-07",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Ordinances & Resolutions"
    ]
  }
}