{
  "success": true,
  "vote": {
    "id": 10378,
    "item_number": "CA-20",
    "title": "To authorize the Director of the Department of Finance and Management, on behalf of Fleet Management, to allow the expenditure of more than $100,000 per vendor for automotive repair services and establish purchase orders in accordance with the terms and conditions of the citywide Universal Term Contract; to increase the UTC expenditure with each Dick Masheter Ford Inc, Atlantic Emergency Solutions Inc., Heritage Fire Equipment, LLC, The W.W. Williams Company, LLC, and Rush Truck Centers of Ohio, Inc. to $250,000 for the division of Fleet Management; and to declare an emergency. ($250,000.00)",
    "description": "Explanation\n \nBackground: The Department of Finance and Management Fleet Division has a need for services to aide in the repair and upkeep of City-owned. The Department of Finance and Management has established a Universal Term Contracts (UTC) with Heritage Fire (PA006291 - Exp. 1/31/2025) for Sutphen parts & services, Dick Masheter (PA007347 - Exp. 6/30/2026) for automotive body repair, WW Williams Company LLC(PA006585 - Exp. 5/31/2025) for Detroit Diesel OEM Parts, Rush Truck Centers of Ohio (PA006827- Exp. 10/31/2025, PA006787 Exp. 9/30/2025, PA005520, Exp. 10/31/2024, PA006093, Exp. 9/30/2024) for Atermarket Truck Parts, HD Specialty Services, International Navistar & OEM Truck Parts, Atlantic Emergency Solutions Inc. (PA005703 Exp. -9/30/2024,PA005497 Exp. 10/31/2024, PA007286 Exp. 5/31/2027) for Fire Boots, Pierce (SS) & Self Contained Breathing App.   The Department of Finance and Management Fleet Division has been steadily dealing with an increased number of city vehicles to service as well as the rising cost of services and materials. With this increased load, Fleet Management has already incurred near the single-year expenditures limit of $100,000 from purchase orders established in accordance with the UTCs with each vendor.  \n \nThis ordinance authorizes the purchase of more than $100,000 from each of these individual UTCs by a single agency and authorizes the Finance and Management Director to more of the allotted yearly funds on these UTC purchase agreements.  For each of the following vendors - Dicks Masheter, Heritage Fire Equipment, Rush Truck Centers of Ohio, WW Williams Company LLC. and Atlantic Emergency Solutions Inc, the allotted max expenditure will be $250,000 for the division of Fleet Management. \n \nPrincipal Parties: \nDick Masheter Ford Inc - Vendor# 004265, EBO Certification#CC-004265, Exp. 09/15/2024\nHeritage Fire Equipment - Vendor #024589 , EBO Certification #CC-024589 Exp. 10/12/2025\nWW Williams Company LLC- Vendor#020988, EBO Certification# CC-020988, Exp. 1/17/2025\nRush Truck Centers of Ohio, Vendor #008512, EBO Certification #CC-008512, Exp. 07/06/2025\nAtlantic Emergency Solutions Inc, Vendor #034448, EBO Certification #CC-034448, Exp. 12/21/2025\n \nEmergency Justification: Emergency legislation is required to ensure uninterrupted supply of automotive repair services, thereby keeping City owned vehicles in operation, including Police, Fire and Refuse Collection vehicles. \n \nFiscal Impact:  The money for these repairs is already budgeted in the Fleet Management budget, this ordinance permits Fleet Management to increase the amount they are expending from the Fleet Operating Budget on the citywide UTCs. \n \nTitle\n \nTo authorize the Director of the Department of Finance and Management, on behalf of Fleet Management, to allow the expenditure of more than $100,000 per vendor for automotive repair services and establish purchase orders in accordance with the terms and conditions of the citywide Universal Term Contract; to increase the UTC expenditure with each Dick Masheter Ford Inc, Atlantic Emergency Solutions Inc., Heritage Fire Equipment, LLC, The W.W. Williams Company, LLC, and Rush Truck Centers of Ohio, Inc. to $250,000 for the division of Fleet Management; and to declare an emergency. ($250,000.00)\n \nBody\n \nWHEREAS, it is necessary to allow the Division of Fleet Management to continue to make purchase orders utilizing the 2024 Fleet Management Operating Budget for automotive repair services with Dick Masheter Ford Inc, Heritage Fire Equipment, WW Williams, Atlantic Emergency Solutions Inc. and Rush Truck Centers of Ohio beyond the allotted $100,000.00 per agency; and\n \nWHEREAS, the automotive repair services will be purchased in accordance with the UTCs that have been established with Dick Masheter (PA007347 - Exp. 6/30/2026) for automotive body repair, WW Williams Company LLC (PA006585 - Exp. 5/31/2025) for Detroit Diesel OEM Parts, Rush Truck Centers of Ohio (PA006827- Exp. 10/31/2025, PA006787 Exp. 9/30/2025, PA005520, Exp. 10/31/2024, PA006093, Exp. 9/30/2024) for Aftermarket Truck Parts, HD Specialty Services, International Navistar & OEM Truck Parts, Atlantic Emergency Solutions Inc. (PA005703 Exp. -9/30/2024,PA005497 Exp. 10/31/2024, PA007286 Exp. 5/31/2027) for Fire Boots, Pierce (SS) & Self Contained Breathing App, Heritage Fire (PA006291 - Exp. 1/31/2025) for Sutphen parts & services; and\n \nWHEREAS, City Code 329.19 (g) requires City Council approval for purchases in excess of $100,000 from an individual universal term contract by a single agency; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Finance & Management, Fleet Management Division, in that it is immediately necessary to increase the allotted amount for Fleet Management to expend with Dick Masheter, WW Williams Company, LLC, Rush Truck Centers of Ohio, Atlantic Emergency Solutions and Heritage, Rush & Cummins off of the citywide UTCs to ensure uninterrupted automotive repair services in order to ensure uninterrupted supply of automotive repair services, thereby keeping City owned vehicles in operation, including Police, Fire and Refuse Collection vehicles. NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Department of Finance and Management, on behalf of  the Department of Finance and Management, is hereby authorized to make purchase orders for automotive repair services with Dick Masheter Ford Inc, Atlantic Emergency Solutions, Heritage Fire Equipment, LLC, The W.W. Williams Company, LLC, and Rush Truck Centers of Ohio, Inc. beyond the allotted $100,000.00 per agency in accordance with the terms and conditions of the citywide Universal Term Contract on file in the Purchasing Office.\n \nSECTION 2.  That the expenditure maximum from the Fleet Management Operating Fund for 2024 off of the UTCs for Dick Masheter Ford Inc, Heritage Fire Equipment, WW Williams, Atlantic Emergency Solutions and Rush Truck Centers of Ohio will be $250,000 per vendor for the division of Fleet Management. .\n \nSECTION 3.  That City Council approves the purchases of more than $100,000.00 from the listed individual universal term contracts by a single agency.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this legislation.\n \nSECTION 5.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten (10) days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 123,
    "meeting_date": "2024-10-07",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}