{
  "success": true,
  "vote": {
    "id": 10385,
    "item_number": "CA-27",
    "title": "To authorize the Director of Public Service and Director of Recreation and Parks to submit applications for the Local Transportation Improvement Program and State Capital Improvement Program and to execute project agreements for approved projects; to authorize the Director of Public Service, Director of Recreation and Parks and the Director of Finance and Management to submit loan documents and borrow money from the Ohio Public Works Commission for projects as awarded under the State Capital Improvement Program; to authorize the Director of Finance and Management and City Auditor, as appropriate, to sign for funding use certification, local match availability, and to certify loan portion repayment.  ($0.00)",
    "description": "Explanation\n1.  BACKGROUND\nThe Mid-Ohio Regional Planning Commission (MORPC) is accepting Ohio Public Works Commission (OPWC) Round 39 applications for the Local Transportation Improvement Program (LTIP) and State Capital Improvement Program (SCIP).  MORPC serves in a staff support capacity to the District Three (Franklin County) Public Works Integrating Committee (PWIC).\n \nOPWC requires that a designated official be authorized to submit said applications and execute project agreements for approved projects.  Additionally, OPWC is required to award a minimum of 10% of the SCIP funding as a no interest loan; in order to make City applications more favorable, some of the applications may include a request for a no interest loan.  Therefore, the applications and ensuing agreements may also require a signature from the Director of Finance and Management and City Auditor, as appropriate, to sign for funding use certification, local match availability, and to certify loan portion repayment.\n \nThis legislation will authorize the Director of Public Service and the Director of Recreation and Parks to submit applications and to execute project agreements for approved projects.  The legislation will also authorize the Director of Finance and Management and City Auditor, as appropriate, to sign for funding use certification, local match availability, and to certify loan portion repayment.\n \n2.  EXPECTED PROJECTS\nThe Department of Public Service and Recreation and Parks Department plan to submit applications for the following projects:\n \n512004-202201 - Kilbourne Run Sports Park - This is a Recreation and Parks Department project.  The purpose of this portion of the Kilbourne Run Sports Park project is to enhance pedestrian safety and address roadway deficiencies to maintain seamless access and connectivity to Kilbourne Run Sports Park and the Westerville Road corridor.  The project will relocate the entrance drive of Kilbourne Run Sports Park to align with Westerville Woods Drive and convert the intersection into a roundabout.  It will also upgrade pedestrian facilities and resolve sight distance issues at the intersection to ensure a safer environment for pedestrians and cyclists.  Total project cost is approximately $4,087,395.00.\n \n531025-910002 - Roadway - Multimodal - Mt Vernon Ave Phase 1 - The project will add an on-street two-way separated bike facility (cycle track) on Martin Luther King Jr. Boulevard and Mount Vernon Avenue from Hamilton Avenue to Champion Avenue with all bike facility construction occurring within the existing curb lines. The proposed cycle track will be separated from vehicular traffic by a concrete median, which will vary in width depending on the existing width of the road. Five floating bus islands will be created throughout the project limits by constructing the cycle track and concrete median to the same height to meet width standards for COTA bus stops.  Twelve curb extensions will be added on the north side of Martin Luther King Jr. Boulevard and Mount Vernon Avenue throughout the project limits to slow traffic, define on-street parking, and shorten crosswalk distances.  The project will also remove the traffic signal at the intersection of Mount Vernon Avenue and N 17th St; and it will replace the existing traffic signal infrastructure at the intersection of Mount Vernon Avenue and N 20th Street.  Existing roadway, curb ramps, curb and gutter, and sidewalk infrastructure will be reconstructed as needed throughout the project limits; and storm sewer will be added as needed to accommodate drainage. Total project cost is approximately $5,319,259.00.\n \n545027-100000 - Signals - N. 4th St Ph 1 - This project will replace and upgrade existing signals at the intersections of N. 4th Street with 1st Avenue, 2nd Avenue, 5th Avenue, 7th Avenue, and 17th Avenue. New fiber optic cable will be installed within the limits of each intersection to connect the signals to the existing Columbus Traffic Signal System (CTSS) network; and pedestrian push buttons will be also be installed at all five intersections.  Total project cost is approximately $4,000,000.00.\n \n533003-100000 - Arterial Street Rehabilitation - SR-161 - I-71 to Cleveland Avenue Phase 2 - This project will provide improvements along SR161 from Maple Canyon Avenue to Ambleside Drive. Side streets including Beechcroft Road and Tamarack/Sharon Woods Boulevard will be improved north and south of SR161. These improvements will include the addition of pedestrian and bike facilities, new traffic signals, pavement widening and resurfacing, raised medians on the side streets and the installation of mini-roundabouts.  The shared used path limits on the north and south side of SR-161 will be from Maple Canyon Avenue to Ambleside Drive.  Total project cost is approximately $20,810,585.00.\n \n(This listing is meant to be illustrative and is believed to be accurate and complete; however, last minute project additions and substitutions are permitted at the discretion of the Director of Public Service.)\n \n 3.  FISCAL IMPACT\nApproval of this legislation will provide an opportunity to secure funds for various projects.  The preliminary allocation for the District Three Public Works Integrating Committee is approximately $32,000,000, and it is to be awarded in the form of grants and loans.  As a part of the application for grant funds, the City may apply for a maximum of $3,000,000 in loans as necessary to make the applications more favorable to OPWC and the City.\n \nNo financial participation is required at this time.  City funds will be approved in the form of design contracts and/or construction contracts that will be or have been submitted for Council's approval.\n \nTitle\nTo authorize the Director of Public Service and Director of Recreation and Parks to submit applications for the Local Transportation Improvement Program and State Capital Improvement Program and to execute project agreements for approved projects; to authorize the Director of Public Service, Director of Recreation and Parks and the Director of Finance and Management to submit loan documents and borrow money from the Ohio Public Works Commission for projects as awarded under the State Capital Improvement Program; to authorize the Director of Finance and Management and City Auditor, as appropriate, to sign for funding use certification, local match availability, and to certify loan portion repayment.  ($0.00)\n \nBody\n \nWHEREAS, the Ohio Public Works Commission requires that the City of Columbus designate and authorize officials to submit Round 39 applications, execute project agreements, sign for funding use certification and local match availability, and to certify loan portion repayment for Local Transportation Improvement and State Capital Improvement Programs; and\n \nWHEREAS, application amounts are approximate depending upon OPWC scoring criteria; and\n \nWHEREAS, approved applications will require execution within 45 days of notification by the Ohio Public Works Commission; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Service and the Director of Recreation and Parks be and is hereby authorized to submit applications and execute project agreements with the Ohio Public Works Commission on behalf of the City of Columbus for the Local Transportation Improvement Program and State Capital Improvement Program projects.\n \nSECTION 2.  That the Director of Public Service, Director of Recreation and Parks and Director of Finance and Management be and are hereby authorized to submit loan documents and borrow money from the Ohio Public Works Commission on behalf of the City of Columbus for projects as awarded under the State Capital Improvement Program.\n \nSECTION 3.  The Director of Finance and Management and City Auditor, as appropriate, are authorized to sign any consequential promissory notes for a grand total of no more than $3,000,000 to certify Round 39 OPWC funding for the City's SCIP loan portion of any project that is awarded a no interest loan. \n \nSECTION 4.  At the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements.\n \nSECTION 5.  That this ordinance shall take effect and be in force from and after the earliest period by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 123,
    "meeting_date": "2024-10-07",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Economic Development"
    ]
  }
}