{
  "success": true,
  "vote": {
    "id": 10398,
    "item_number": "CA-40",
    "title": "To agree to an adjustment to the City’s boundaries by consenting to transfer approximately 26.5+/- acres from the City of Columbus to the City of New Albany. ($0.00)",
    "description": "Explanation\n \nBackground:\n \nA boundary adjustment between the City of Columbus and the City of New Albany has been proposed. The site is along the Morse Rd corridor from roughly the Johnstown Rd roundabout to the west, to the Reynoldsburg-New Albany Rd roundabout to the east, and includes parcels are owned by Village of New Albany adjacent to the north. The proposed adjustment moves the City of Columbus corporate boundary westward, to exclude the right-of-way and privately held parcels. The transfer will place the entirety of the parcels within the City of New Albany. \n \nThis legislation is being filed in response to the provisions of the Ohio Revised Code - section 709.37 regarding municipal boundary adjustments.  Parallel legislation is anticipated by the City of New Albany City Council. Columbus approval will allow the adjustment proposal to be submitted to Franklin County for finalization. \n \nFiscal Impact: \n \nNone                     \n \nTitle\n \nTo agree to an adjustment to the City’s boundaries by consenting to transfer approximately 26.5+/- acres from the City of Columbus to the City of New Albany. ($0.00)\n \nBody\n \nWHEREAS, 26.5+/- acres of territory from roughly the Johnstown Rd roundabout to the west, to the Reynoldsburg-New Albany Rd roundabout to the east, and includes publicly held parcels adjacent to the north; and\n \nWHEREAS, it is in the best interest of all parties if the boundaries of the two communities reflect the proposed adjustment; and\n \nWHEREAS, it is the desire of the City of Columbus to transfer the subject area to the City of New Albany which desires to accept said transfer; and \n \nWHEREAS, the proposed transfer does not involve the transfer of territory inhabited by more than five voters; now, therefore, \n \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS\n \nSection 1. That in accordance with Section 709.37 of the Ohio Revised Code, the City of Columbus hereby agrees to transfer to the City of Whitehall the land described as follows:\n \nSituate in the State of Ohio, County of Franklin, City of Columbus, being part of Quarter Township 4, Lot 33, and Quarter Township 3, Township 2, Range 16, United States Military Lands, being a part of a 0.271 acre tract of land in the name of the Franklin County Commissioners by a deed of record in Official Record 4416 J14, a part of a 0.888 acre tract of land in the name of the Franklin County Commissioners by a deed of record in Instrument Number 201004070041807, a part of a 0.284 acre tract of land in the name of the Franklin County Commissioners by a deed of record in Instrument Number 201004070041805, a part of a 2 acre tract of land in the name of The New Albany Company, LLC by a deed of record in Instrument Number 201306170100733, a part of a 2.0 acre tract of land in the name of The New Albany Company, LLC. By a deed of record in Instrument Number 202201070005905 (re-recorded in Instrument Number 202201250015603), a part of a 2.0 acre and a 0.563 acre tracts of land in the name of The New Albany Company, LLC. by a deed of record in Instrument Number 201404300052684, a part of a 3.477 acre tract of land, all of a 0.098 acre tract of land, and all of a 0.002 acre tract of land in the name of The City of Columbus, Ohio by a deed of record in Official Record 30536 B03, a part of a 9.309 acre tract of land, a part of a 4.391 acre tract of land, a part of Reserve A and portions of the right of way of Harlem Road (Right of way Varies) (Township Road 111) and Morse Road (Right of Way Varies) (County Road 17) as established and dedicated in Oakfield Subdivision of record in Plat Book 53, Page 15, a part of a 15.584 acre tract of land in the name of The Village of New Albany by a deed of record in Instrument Number 200803240044249, subject to a 0.378 acre highway easement in the name of the County of Franklin by a deed of record in Deed Book 3321, Page 326, a part of a 0.528 acre tract of land in the name of Kenneth E. Netting and Mary M. Netting by a deed of record in Deed Book 2756, Page 369, a part of a 26.04 acre tract of land in the name of The New Albany Company by a deed of record in Official Record 12773 A05, a part of a 21.611 acre tract of land in the name of The New Albany Company by a deed of record in Official Record 17378 F17, a 0.241 acre tract of land in the name of The New Albany Company by a deed of record in Official Record 14548 HOS, and a part of a 2. 609 acre tract of land in the name of the City of Gahanna by a deed of record in Instrument Number 200407210169353, as annexed into the City of Columbus as established by Ordinance Number 639-89 and of record in Official Record 13294 D07, Recorder's Office, Franklin County, Ohio, and being more particularly bounded and described as follows:\n \nCOMMENCING at a found bronze disk in a concrete monument (FCGS 991 IA RESET) at the centerline of right of way intersection of Morse Road (Right of Way Varies) (County Road 17) and Reynoldsburg-New Albany Road (Right of Way Varies) (County Road 6), said monument being a P.O.T. on the original centerline of said Morse Road and an angle point on the original centerline of said Reynoldsburg-New Albany Road, on the southerly line of Quarter Township 4, and the southerly line of Lot 33; \nThence Westerly a distance of 40.00 feet± along the centerline of right of way of said Morse Road, the southerly line of said Quarter Township, and the southerly line of said Lot 33 to the southeast comer of the said existing City of Columbus Corporation line and being THE PLACE OF BEGINNING; \nThence Westerly a distance of 1493 feet± along the centerline of right of way of said Morse Road, the southerly line of said Quarter Township, the southerly line of said Lot, and the southerly line of said existing City of Columbus Corporation line to an aluminum disk in PVC encased in concrete monument (FCGS 3319), said monument marking the southwest comer of said Quarter Township 3, the southeast comer of Quarter Township 4, the southwest comer of Lot 33, and the southerly line of said existing City of Columbus Corporation line; \n \nThence Westerly a distance of 1224 feet± along the centerline of right of way of said Morse Road, the southerly line of said Quarter Township, the southerly line of said existing City of Columbus Corporation line, and the northerly line of the existing City of Gahanna Corporation line as established by Ordinance 99-30 of record in Instrument Number 199903220070334 to an aluminum disk in a concrete monument (FCGS 7717), said monument marking an angle point on the centerline of right of way of said Morse Road, the southerly line of said Quarter Township, the southerly line of said existing City of Columbus Corporation line, the northwest comer of said existing City of Gahanna Corporation line, and the northeast comer of the existing City of Gahanna Corporation line as established by Ordinance Number 98-436 of record in Instrument Number 199903020052828;\n \nThence Westerly a distance of 2115 feet± along the said centerline of right of way of said Morse Road, the southerly line of said Quarter Township, the southerly line of said existing City of Columbus Corporation line, the northerly line of said existing City of Gahanna Corporation line, the northerly line of the existing City of Gahanna Corporation line as established by Ordinance Number 18-89 of record in Official Record 13873 A08, the northerly line of the existing City of Gahanna Corporation line as established by Ordinance Number 224-92 of record in Official Record 23449 Al 7, the northerly line of the existing City of Gahanna Corporation line as established by Ordinance Number 78-89 of record in Official Record 13871 C03, the northerly line of the existing City of Gahanna Corporation line as established by Ordinance Number 19-89 of record in Official Record 13872109 to an aluminum disk in a concrete monument (FCGS 6608), said monument marking the centerline intersection of said Morse Road and Harlem Road (Right of way Varies) (Township Road 111), the southerly line of said Quarter Township, the southerly line of said existing City of Columbus Corporation line, and the northerly line of said existing City of Gahanna Corporation line; \n \nThence Westerly a distance of 1734 feet± along the said centerline of right of way of said Morse Road, the southerly line of said Quarter Township, the southerly line of said existing City of Columbus Corporation line, and the northerly line of said existing City of Gahanna Corporation line to an aluminum disk in a concrete monument (FCGS 7716), said monument marking an angle point on the centerline of right of way of said Morse Road. The southerly line of said Quarter Township, the southerly line of said existing City of Columbus Corporation line, and the northerly line of said existing City of Gahanna Corporation line; \n \nThence Westerly a distance of 683 feet± along the said centerline of right of way of said Morse Road, the southerly line of said Quarter Township, the southerly line of said existing City of Columbus Corporation, and the northerly line of said existing City of Gahanna Corporation line to an aluminum disk in a concrete monument (FCGS 8860), said monument marking a P.O.T. on the centerline of right of way of Morse Road, the southerly line of said Quarter Township, the southerly line of said existing City of Columbus Corporation line, and the northerly line of said existing City of Gahanna Corporation line; \nThence Westerly a distance of 907 feet± along the said centerline of right of way of said Morse Road, the southerly line of said Quarter Township line. the southerly line of said existing City of Columbus Corporation line and the northerly line of said existing City of Gahanna Corporation line to an aluminum disk in a concrete monument (FCGS 8859 RESET), said monument marking the centerline intersection of Morse Road and Shull Road (Right of Way varies) (Township Road 198), the southerly line of said Quarter Township, the southerly line of said existing City of Columbus Corporation line, and the northerly line of said existing City of Gahanna Corporation line; \n \nThence Westerly a distance of 642 feet± along the said centerline of right of way of said Morse Road, the southerly line of said Quarter Township line, the southerly line of said existing City of Columbus Corporation line, the northerly line of said City of Gahanna Corporation line, and the northerly line of the existing City of Gahanna Corporation line as established by Ordinance Number 150-90 of record in Official Record 16700 B11 to an aluminum disk in a concrete monument (FCGS 6672 RESET), said monument marking the centerline intersection of Morse Road and Johnstown Road (Right of Way Varies) (United States Route 62), the southerly line of said Quarter Township, the southerly line of said existing City of Columbus Corporation line, and the northerly line of said existing City of Gahanna Corporation line;\n \nThence Westerly a distance of 445 feet± along the said centerline of right of way of said Morse Road, the southerly line of said Quarter Township line, the southerly line of said existing City of Columbus Corporation line, and the northerly line of said existing City of Gahanna Corporation line to the southeast comer of Collingwood Pointe at the Preserve 8th Amendment of record in Condo Plat Book 112, Page 49 and as declared in Instrument Number 200302250054932, also being the southeast comer of a highway easement in the name of the Franklin County Commissioner by a deed of record in Instrument Number 200609260191804, said comer being on the centerline of right of way of Morse Road, the southerly line of said Quarter Section, the southerly line of said City of Columbus Corporation line, and the northerly line of said existing City of Gahanna Corporation line; \n \nThence Northerly a distance of 30 feet± along the easterly line of said Condo and the easterly line of said highway easement to the northerly line of said existing City of Columbus Corporation line; \nThence Easterly a distance of 641 feet± along the northerly line of said City of Columbus Corporation line to the southwest comer of the existing City of New Albany Corporation line as established by Ordinance Number 19-89 and of record in Official Record 13965 D03, said comer also marking the southwesterly comer of The New Albany Country Club Section 13 of record in Plat Book 83, Page 28;\nThence Easterly a distance of 2239 feet± along the southerly line of the said New Albany Country Club Section 13, the southerly line of The New Albany Country Club Section 4 of record in Plat Book 74, Page 58. a portion of the northerly right of way of Morse Road, the northerly line of said City of Columbus Corporation line, and the southerly line of the existing City of New Albany Corporation line to the easterly line of said 0.528 acre tract of land in the name of Kenneth E. Netting and Mary M. Netting by deed of record in Deed Book 2756, Page 369, the westerly line of said existing City of Columbus Corporation line, and the easterly line of said existing City of New Albany Corporation line; \nThence Northerly a distance of 200 feet± along the easterly line of said 0.528 tract, the westerly line of said City of Columbus Corporation line, and the easterly line of said New Albany Corporation line to the northeasterly comer of said 0.528 acres tract, the southwesterly comer of said 15.584 acre tract, the southerly line of said existing City of Columbus Corporation line, and the northerly line of said existing New Albany Corporation line; \n \nThence Easterly a distance of 2063 feet± along the northerly line of said City of Columbus Corporation line, the southerly line of said existing New Albany Corporation line, the southerly line of said New Albany Country Club Section 4 of record in Plat Book 74, Page 58, the southerly line of The New Albany Country Club Section 11 of record in Plat Book 82, Page 72, and the southerly right of way of James River Road (60' Right of Way), to the easterly line of said existing City of Columbus Corporation line, and the westerly line of said existing New Albany Corporation line; \nThence Southerly a distance of 200 feet± along the easterly line of said existing City of Columbus Corporation line and the westerly line of said existing New Albany Corporation line to the northeasterly comer of said existing City of Columbus Corporation line and the southwesterly comer of said existing City of New Albany Corporation line; \n \nThence Easterly a distance of 472 feet± along the northerly line of said existing City of Columbus Corporation line and the southerly line of said existing New Albany Corporation line to the northwesterly comer of said existing City of Columbus and the southeasterly comer of said existing City of New Albany Corporation line; \n \nThence Northerly a distance of200 feet± along the westerly line of said existing City of Columbus Corporation line and the easterly line of said existing New Albany Corporation line to the southerly right of way of said James River Road, the southerly line of said The New Albany Country Club Section 11, the northwesterly comer of said existing City of Columbus Corporation line, and the southeasterly comer of said existing City of new Albany Corporation line; \n \nThence Easterly a distance of 2336 feet along the southerly right of way of said James River Road, the southerly line of The New Albany Country Club Section 11, the southerly line of Reserve D of said The New Albany Country Club Section 11, the northerly line of said existing City of Columbus Corporation line, the southerly line of said existing City of New Albany Corporation line to the easterly line of said Quarter Township 3, the westerly line of said Quarter Township 4, the westerly line of said Lot 33. the westerly line of a said 0.563 acre tract of land, the northeast comer of said existing City of Columbus Corporation line, and the southwesterly comer of said existing City of New Albany Corporation line; \nThence Southerly a distance of 200 feet±, along the easterly line of said Quarter Township 3, the westerly line of said Quarter Township 4, the westerly line of said Lot 33, the westerly line of the said 2.563 acre tract, the easterly line of said existing City of Columbus Corporation line, and the westerly line of said existing City of New Albany Corporation line to the northerly right of way of said Morse Road, northeasterly comer of said existing City of Columbus Corporation line, and the southwesterly comer of said existing City of New Albany Corporation line; \n \nThence Easterly a distance of 1450 feet±, along a portion of the northerly right of way of said Morse Road, the northerly line said existing City of Columbus Corporation line, the southerly line of the existing City of New Albany Corporation line as established by Ordinance Number 0-57-2023 of record in Instrument Number 202306210061200, and the southerly line of said existing City of New Albany Corporation line to the northeast comer of said existing City of Columbus Corporation line and the southeast comer of said existing City of New Albany Corporation line;\n \nThence Southeasterly a distance of 30 feet± along the easterly line of said existing City of Columbus Corporation to the PLACE OF BEGINNING, containing 26.5 acres, more or less, subject to all easements, restrictions and rights-of-way of record.\n \nThe total length of the annexation perimeter for this area is 19304 feet±, of which 9346 feet± is contiguous being 48% contiguous. \n \nThis description was prepared by the Franklin County Engineer's Office, Ryan J. Nichols, Ohio Registered Surveyor No. 8859, from available records on file within the Franklin County Offices and does not constitute information of an actual field survey. This is not intended for the transfer of Real Property.\n \nSection 2. That the City Clerk certify this ordinance to the County Commissioners of Franklin County, Ohio, for further proceedings in accordance with the law.\n \nSection 3.  That the City of Columbus agrees to the transfer of the territory described in Section 1 to the City of New Albany upon approval of the petition by the Board of Franklin County Commissioners and take any necessary steps to record such acceptance. \n \nSection 4. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 123,
    "meeting_date": "2024-10-07",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "General"
    ]
  }
}