{
  "success": true,
  "vote": {
    "id": 10438,
    "item_number": "SR-9",
    "title": "To amend the 2024 Capital Improvement Budget; to authorize the City Auditor to transfer funds within the Affordable Housing Bond Fund; to authorize the Director of Development to enter into a grant agreement with Community Development for All People in an amount up to $2,000,000.00 in support of the development of 245 units of new construction apartments owned by Dering Family Homes Owner LLC; to authorize the expenditure of up to $2,000,000.00 from the Affordable Housing Bond Fund; to authorize the reimbursement of expenditures incurred prior to the establishment of a purchase order; and to declare an emergency. ($2,000,000.00)",
    "description": "Explanation\n \nBACKGROUND\n \nThis ordinance authorizes the Director of the Department of Development to enter into a grant agreement with Community Development for All People (CD4AP) for development of 245 apartments in an amount up to $2,000,000.00.  Community Development for All People will enter into a grant agreement with the city for the bond funds as a pass-through entity.  Dering Family Homes Owner LLC is the ownership entity of the project with CD4AP being one of the managing members. Approval is also requested for reimbursement of construction expenses incurred prior to execution of the purchase order, starting January 1, 2023.\n \nDering Family Apartments will sit on two parcels - one is a vacant field at 98 Dering, and one is the former site of The Rice Bowl Restaurant, which has been demolished for the purpose of this development. The development will consist of 245 one-, two-, three-, and four-bedroom apartment units in three 4-story buildings. These apartments will be affordable to individuals and families making between 30% and 80% of the Area Median Income. The development will also have amenities including a fitness center, business center, playground, leasing office, and mail room for all residents, as well as 380 parking spots. \n \nAdditionally, because this development is on the South High Corridor, residents will have easy access to public transit that can take them to a number of important nearby amenities including groceries, health care facilities, shopping centers, schools, and parks. New commercial, single-family, and multi-family market rate development has been moving down South High Street for several years. As new development moves South, it is vital that new affordable housing units be produced to ensure long-term affordability in the neighborhood.\n \nDering Family Apartments will be more than just an affordable housing community and will create tremendous value to the larger Far South community. The NRP Group and CD4AP are both co-developers and co-owners of Dering Family Apartments.  NRP and CD4AP are working to partner with a child care provider on site.  Proximate child care and an affordable apartment community designed for families will have a tremendous positive impact for both residents of Dering Family Apartments, and of the Far South neighborhood.\n \nThe City executed a Housing Development Agreement for $2,000,000.00 pursuant to Ord 2883-2023 passed on October 30, 2023.  This legislation will confirm the funding for the project.\n \nDering Family Homes Owner LLC is the ownership entity of the project with Community Development for All People being one of the managing members.  The Director of the Department of Development is hereby authorized to enter into a grant agreement with Community Development for All People.  City Council hereby authorizes Community Development for All People to assign its rights, duties, and obligations under the grant agreement to Dering Family Homes Owner LLC, except that Community Development for All People shall remain responsible for the indemnification, reporting, and compliance obligations of the grant agreement as set forth in the copy of the agreement on file with the Department of Development.\n \nEmergency action is requested in order to maintain the project schedule and to fulfill financial needs to mitigate additional fees from lenders.  Without emergency action, new affordable housing would be further delayed from a low-income community in urgent need of it.\n \nFISCAL IMPACT:  Funding in the amount of $2,000,000.00 is available in 2024 Capital Improvement Budget, Affordable Housing Bond Fund. A transfer of cash is necessary, and an amendment to the 2024 Capital Budget is required to establish sufficient budget authority for the project.\n \n \nCONTRACT COMPLIANCE:  the vendor number is 008972 and expires 05/17/2026.\n \n \nTitle\n \nTo amend the 2024 Capital Improvement Budget; to authorize the City Auditor to transfer funds within the Affordable Housing Bond Fund; to authorize the Director of Development to enter into a grant agreement with Community Development for All People in an amount up to $2,000,000.00 in support of the development of 245 units of new construction apartments owned by Dering Family Homes Owner LLC; to authorize the expenditure of up to $2,000,000.00 from the Affordable Housing Bond Fund; to authorize the reimbursement of expenditures incurred prior to the establishment of a purchase order; and to declare an emergency. ($2,000,000.00)\n \n \nBody\n \nWHEREAS, the Director of Development seeks to enter into a grant agreement with Community Development for All People for development of 245 units of new construction apartments; and\n \nWHEREAS, these apartments will be affordable to individuals and families making between 30% and 80% of the Area Median Income; and\n \nWHEREAS, the development will consist of 245 one-, two-, three-, and four-bedroom apartment units in three 4-story buildings; and\n \nWHEREAS, because this development is on the South High Corridor, residents will have easy access to public transit that can take them to a number of important nearby amenities including groceries, healthcare facilities, shopping centers, schools, and parks; and\n \nWHEREAS, it is necessary to authorize the transfer of $2,000,000.00 within the Affordable Housing Bond Fund, Fund 7779; and\n \nWHEREAS, it is necessary to authorize the amendment of the 2024 Capital Improvements Budget Ordinance 1907-2024 in order to provide sufficient budget authority for this project; and\n \nWHEREAS, it is necessary to authorize the expenditure of $2,000,000.00 from the Affordable Housing Bond Fund, Fund 7779; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development to pass this ordinance as emergency in order to maintain the project schedule and to mitigate additional fees from project lenders, for the immediate preservation of the public health, peace, property, safety and welfare; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Development be and is hereby authorized to enter into a grant agreement with Community Development for All People for development of 245 units of new construction apartments in an amount up to $2,000,000.00 and to authorize the reimbursement of construction expenditures incurred prior to the establishment of a purchase order, beginning January 1, 2023.\n \nSECTION 2.  That the Director of the Department of Development is hereby authorized to enter into a grant agreement with Community Development for All People.  City Council hereby authorizes Community Development for All People to assign its rights, duties, and obligations under the grant agreement to Dering Family Homes Owner LLC, except that Community Development for All People shall remain responsible for the indemnification, reporting, and compliance obligations of the grant agreement as set forth in the copy of the agreement on file with the Department of Development.\n \nSECTION 3.  That the 2024 Capital Improvements Budget be amended as follows to establish sufficient authority for this project:\n                                       \nFund / Project / Project Name / C.I.B. / Change / C.I.B. as Amended\n7779 / P782012-100000 / Affordable Housing Funds (Voted Carryover) / $20,738,598.00/ ($2,000,000.00) / $18,738,598.00\n7779 / P782050-100008 / Dering Family Apartments (Voted Carryover) / $0 / $2,000,000.00/ $2,000,000.00\n \nSECTION 4.  That the transfer of $2,000,000.00 or so much thereof as may be needed, is hereby authorized within Fund 7779 (Affordable Housing Bond Fund), Dept-Div 44-10 (Housing) per the account codes in the attachment to this ordinance.\n \nSECTION 5.  That for the purpose as stated in Section 1, the expenditure of $2,000,000.00, or so much thereof as may be necessary, is hereby authorized in Fund 7779 (Affordable Housing Bond Fund), Project P782050-100008, Dept. 44-10 (Housing), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance. \n \nSECTION 6.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 7.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance\n \nSECTION 8. That for the reasons stated in the Preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 123,
    "meeting_date": "2024-10-07",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}