{
  "success": true,
  "vote": {
    "id": 10440,
    "item_number": "SR-11",
    "title": "To authorize the Board of Health to enter into contracts with Nationwide Children's Hospital for the provision of WIC Clinics at their facilities and Access 2 Interpreters, LLC for language interpretation services; to authorize the expenditure of $1,010,377.00 from the Health Department Grants Fund; and to declare an emergency. ($1,010,377.00)",
    "description": "Explanation\n \nBACKGROUND:  The Board of Health has been awarded a grant from the Ohio Department of Health to fund the Women, Infants and Children (WIC) Program for the period October 1, 2024, through September 30, 2025.  Columbus Public Health has been designated as the primary grantee agency and administrator for all WIC programs in Franklin County.  This ordinance authorizes the Board of Health to enter into a not-for-profit subrecipient agreement with Nationwide Children's Hospital for $825,977.00, for the staffing and operation of five WIC clinics at their facilities and a contract with Access 2 Interpreters LLC for $184,400.00 for language interpretation services for the WIC program.\n \nThe contract compliance number for Nationwide Children’s Hospital is 31-4379441.  Nationwide Children’s Hospital is listed as a non-profit organization.  \n \nThe contract compliance number for Access 2 Interpreters is 76-0803722. These services were advertised through Bonfire (RFQ022758) according to bidding requirements of the City Code. This RFQ initial twelve-month period began on October 1, 2022 through September 30, 2023 with an option to renew for four additional one-year periods ending September 30, 2027. This is year 3 of 5. \n \nEmergency action is requested in order to provide continued staffing and operations of the NCH WIC clinics and essential services to WIC clients.\n \nFISCAL IMPACT: The Women, Infants and Children Program is entirely funded by the Ohio Department of Health.  This program does not generate any revenue or require a City Match.\n \nTitle\n \nTo authorize the Board of Health to enter into contracts with Nationwide Children's Hospital for the provision of WIC Clinics at their facilities and Access 2 Interpreters, LLC for language interpretation services; to authorize the expenditure of $1,010,377.00 from the Health Department Grants Fund; and to declare an emergency. ($1,010,377.00)\n \nBody\n \nWHEREAS, The Ohio Department of Health has designated the Columbus Health Department as primary grantee agency and fund administrator for the Women, Infants and Children Grant Program in Franklin County; and, \n \nWHEREAS, The Research Institute at Nationwide Children’s Hospital will provide various services to meet all grant deliverables required by the Women, Infants and Children Grant and Access 2 Interpreters, LLC will provide language interpretation services to clients; and,\n \nWHEREAS, an emergency exists in the usual daily operation of the Health Department in that it is immediately necessary to enter into these contracts for the immediate preservation of the public health, peace, property, and safety, and to avoid any delays in providing program services to meet grant deliverables, effectively serve WIC clients and avoid forfeiture of grant funds; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Board of Health is hereby authorized to enter into contract with Nationwide Children's Hospital for the provision of five WIC clinics for the period of October 1, 2024 through September 30, 2025, in an amount not to exceed $825,977.00 and a contract with Access 2 Interpreters LLC. in an amount not to exceed $184,400.00 \n \nSECTION 2. That for the contracts stated above, the sum of $1,010,377.00 is hereby authorized to be expended from the Health Department Grants Fund, Fund No. 2251, according to the attached accounting document.\n \nSECTION 3. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance and to make any accounting changes necessary to ensure that this contract is properly accounted for and recorded accurately on the City’s financial records.\n \nSECTION 5.  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 123,
    "meeting_date": "2024-10-07",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}