{
  "success": true,
  "vote": {
    "id": 10471,
    "item_number": "CA-19",
    "title": "To authorize the Director of Finance and Management, on behalf of the Department of the Inspector General, to execute those documents necessary to enter into a First Amendment to Office Lease by and between the City of Columbus and the Columbus Downtown Development Corporation; to authorize the transfer between projects within the General Permanent Improvement Fund 7748; to authorize the appropriation of funds within the General Permanent Improvement Fund 7748; to authorize the expenditure of $130,000.00, or so much as may be necessary, from the General Permanent Improvement Fund 7748; to amend the 2024 Capital Improvement Budget; and to declare an emergency.  ($130,000.00)",
    "description": "Explanation\nBackground: The Department of Finance and Management, through its Real Estate Management Office, leases office space located at 50 West Town Street on behalf of the Department of the Inspector General as authorized by Ordinance #1269-2022.  The department has experienced growth and needs to expand the leased office space to accommodate additional staff.  This legislation authorizes the Director of Finance and Management, on behalf of the Department of the Inspector General, to execute those documents necessary to enter into a First Amendment to Office Lease with Columbus Downtown Development Corporation (“CDDC”) dba Columbus Downtown, Inc., an Ohio non-profit corporation, for additional leased office space located at 50 West Town Street, Columbus, Ohio. The expansion will add 1,320 rentable square feet to the 6,188 square feet of existing leased office space for total of 7,508 square feet of leased space. Funds to pay for the cost of construction of tenant improvements and associated IT costs, and furnishings is estimated at $130,000.00 and is available in the General Permanent Improvement Fund 7748. Construction costs include reorienting office spaces, relocating lighting controls and doorways, installing new carpet, new paint and adding data and electrical outlets.  Ordinance #0432-2024 authorized the expenditure of funds for payment of office rent from the Income Tax Set-Aside Fund for the 2024 lease term. This previously authorized appropriation and expenditure of funds will be sufficient to pay the additional $6,283.20 rent for the expanded lease space until funds are authorized for the payment of rent for 2025 term. This ordinance will also authorize the expenditure of $130,000.00, or so much as may be necessary, for cost associated with the tenant improvements necessary to make the additional leased space ready for occupancy. \n \nEmergency action is requested so that the City of Columbus Department of the Inspector General may commence construction and obtain occupancy of the expansion space at the earliest possible date.\n \nFiscal Impact: Funds are available in the General Permanent Improvement Fund 7748 for the $130,000.00 tenant improvement costs necessary to make the additional office space ready for occupancy. A transfer of cash between projects and an amendment to the 2024 Capital budget will be necessary.\n \nTitle\nTo authorize the Director of Finance and Management, on behalf of the Department of the Inspector General, to execute those documents necessary to enter into a First Amendment to Office Lease by and between the City of Columbus and the Columbus Downtown Development Corporation; to authorize the transfer between projects within the General Permanent Improvement Fund 7748; to authorize the appropriation of funds within the General Permanent Improvement Fund 7748; to authorize the expenditure of $130,000.00, or so much as may be necessary, from the General Permanent Improvement Fund 7748; to amend the 2024 Capital Improvement Budget; and to declare an emergency.  ($130,000.00)\n \n \nBody\nWHEREAS, the Department of Finance and Management, through its Real Estate Management Office, currently leases 6,188 rentable square feet of office space located at 50 West Town Street on behalf of the Department of the Inspector General; and\n \nWHEREAS, due to staffing growth by the Department it is now necessary to expand the existing leased office space to provide offices to accommodate additional staff; and\n \nWHEREAS, the City desires to enter into a First Amendment to Office Lease with the Columbus Downtown Development Corporation to lease an additional 1,320 rentable square feet of office space at 50 West Town Street, Columbus, Ohio; and \n \nWHEREAS, funding for the payment of rent for the 2024 term of the Lease Agreement was previously authorized by Ordinance #0432-2024 and is sufficient to cover the cost of the additional rent associated with the expanded rental space for the remainder of the 2024 term; and \n \nWHEREAS, it is necessary to amend the 2024 Capital Improvement Budget; and\nWHEREAS, it is necessary for the appropriation, transfer and expenditure of funds within the General Permanent Improvement Fund; and\n \nWHEREAS, an emergency exists in the usual daily operation of the City of Columbus in that it is immediately necessary to authorize the Director of Finance and Management to execute those documents necessary to enter into a First Amendment to Office Lease with the Columbus Downtown Development Corporation to allow for the expansion of leased office space for the City of Columbus, Department of the Inspector General, to authorize the expenditure of funds for the payment of tenant improvement costs necessary to ready the additional office space for occupancy at the earliest possible date, all for the immediate preservation of the public health, peace, property, safety, and welfare; and now, therefore:\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSection 1. That the Director of Finance and Management be, and hereby is, authorized to execute those documents, as approved by the Department of Law, Division of Real Estate, necessary to enter into a First Amendment to Office Lease, by and between the City of Columbus and Columbus Downtown Development Corporation, dba Columbus Downtown Inc., for the lease of an additional of 1,320 rentable square foot of office space, located at 50 West Town Street, for the Department of the Inspector General.\n \nSECTION 2. That the 2024 Capital Improvement Budget be amended in Fund 7748 as follows:\n \nFund/Project ID/Project Name (Funding Source)/Current Authority/Revised Authority/Change\n7748/P748999-100000/Unallocated (GPIF Carryover)/$1,610,905/$1,480,905/($130,000)\n7748/P410001-100000/Inspector General Office Renovations (GPIF Carryover)/$0/$130,000/$130,000\n                                                                                                                                                                        \nSECTION 3.  That the appropriation of $130,000.00 or so much thereof as may be needed, is hereby authorized within the General Permanent Improvement Fund 7748 per the account codes in the funding attachment to this ordinance. \n \nSECTION 4. That the transfer of cash in the amount of $130,000.00 between projects in fund 7748 is hereby authorized and approved per the accounting codes in the funding attachment to this ordinance.\n \nSECTION 5. That the expenditure of $130,000.00 or so much thereof as may be necessary in regard to the action authorized in Section 1, be and is hereby authorized and approved per the accounting codes in the funding attachment to this ordinance.\n \nSECTION 6. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 7. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 8. That the City Auditor is hereby authorized to transfer the unencumbered balance remaining for this project account to the unallocated balance account within the same fund upon receipt of proper notification from the Department of Finance and Management that the project has been completed and the monies are no longer required for this project.\n \nSECTION 9. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten (10) days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 1,
    "absent": 0,
    "meeting_id": 124,
    "meeting_date": "2024-10-21",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "ABSTAIN"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services",
      "Property & Real Estate"
    ]
  }
}