{
  "success": true,
  "vote": {
    "id": 10474,
    "item_number": "CA-22",
    "title": "To amend the 2024 Capital Improvement Budget; to authorize a transfer within the Construction Management Capital Improvement Fund; to authorize the expenditure of $135,422.82 from the Construction Management Capital Improvement Fund; and to authorize the expenditure of $5,563.18 from the Neighborhood Health Center Capital Reserve Fund in order to reimburse the general fund for construction and building renovation expenses incurred by the Office of Construction Management; and to declare an emergency. ($140,986.00)",
    "description": "Explanation\n \nBACKGROUND: The Finance and Management Department, Office of Construction Management, employs personnel that are engaged in overseeing various construction and building renovation capital projects for the City.  The staffing costs for the Office of Construction Management are initially expensed to the general fund; however, the portion related to managing capital projects is eligible to be capitalized.  Doing so is consistent with earlier efforts by the Office of Construction Management to reimburse the general fund when the general fund has incurred expenses more appropriate to capital improvement funding.  The Office of Construction Management tracks the hours each employee works on individual projects and bills these hours to the associated capital project. This process reimburses the general fund for the portion of staff time attributable to capital projects. \n \nEmergency action is requested so that reimbursement to the general fund can occur as quickly as possible. Up-to-date financial posting promotes accurate accounting and financial management.\n \nFiscal Impact: This ordinance authorizes the City Auditor to encumber $135,422.82 within the Construction Management Capital Improvement Fund and $5,563.18 within the Neighborhood Health Center Capital Reserve Fund for the purpose of Office of Construction Management staffing costs. \n \nTitle\n \nTo amend the 2024 Capital Improvement Budget; to authorize a transfer within the Construction Management Capital Improvement Fund; to authorize the expenditure of $135,422.82 from the Construction Management Capital Improvement Fund; and to authorize the expenditure of $5,563.18 from the Neighborhood Health Center Capital Reserve Fund in order to reimburse the general fund for construction and building renovation expenses incurred by the Office of Construction Management; and to declare an emergency. ($140,986.00)\n \nBody\n \nWHEREAS, the Office of Construction Management employs personnel engaged in construction and building renovation activities and these costs can be capitalized; and \n \nWHEREAS, it is necessary to authorize this expenditure in order to provide adequate operating resources for the Office of Construction Management; and\n \nWHEREAS, it is necessary to amend the 2024 Capital Improvement Budget to provide sufficient authority for this transaction; and \n \nWHEREAS, it is necessary to authorize a transfer of $135,422.82 within the Construction Management Capital Improvement Fund; and\n \nWHEREAS, it is necessary to authorize the expenditure of $135,422.82 from the Construction Management Capital Improvement Fund and $5,563.18 from the Neighborhood Health Center Capital Reserve Fund to reimburse the general fund for construction and building renovation expenses, and  \n \nWHEREAS, an emergency exists in the usual daily operation of the Finance and Management Department, Office of Construction Management, in that it is immediately necessary to authorize the Finance and Management Director to reimburse the general fund, thereby preserving the public health, peace, property, safety, and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the 2024 Capital Improvement Budget be amended as follows:\n \nSee Attached File: Ord 2776-2024 Legislation Template.xls\n \nSECTION 2. That the transfer of $135,422.82 is hereby authorized within the Construction Management Capital Improvement Fund 7733 per the accounting codes in the attachment to this ordinance. \n \nSee Attached File: Ord 2776-2024 Legislation Template.xls\n \nSECTION 3. That the Finance and Management Director is hereby authorized to expend $135,422.82 from the Construction Management Capital Improvement Fund 7733 and $5,563.18 from the Neighborhood Health Center Capital Reserve Fund 7784, or so much thereof as may be necessary, to reimburse the general fund for construction and building renovation expenses incurred in connection with the capital improvements program.\n \nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding sources for all contracts or contract modifications associated with the ordinance. \n \nSECTION 6. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project. \n \nSECTION 7. That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 124,
    "meeting_date": "2024-10-21",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services",
      "Health & Safety"
    ]
  }
}