{
  "success": true,
  "vote": {
    "id": 10497,
    "item_number": "CA-45",
    "title": "To authorize and direct the City Auditor to establish an auditor’s certificate in the amount of $50,000.00 for various expenditures for labor, materials, and equipment in conjunction with greenways trail system improvements within the Recreation and Parks Department; and to authorize the expenditure of $50,000.00 from the Recreation and Parks Voted Bond Fund. ($50,000.00)",
    "description": "Explanation \n \nBackground: This ordinance will authorize the City Auditor to set up a certificate in the amount of $50,000.00 for various expenditures for labor, material, and equipment in conjunction with greenways trail system improvements managed by the Recreation and Parks Department. Improvements to the regional greenways trail system will include, but are not limited to, the Alum Creek Trail, Big Walnut Trail, Blacklick Creek Trail, Camp Chase Trail, Darby Creek Trail, Downtown Connector Trail, Olentangy Trail, and Scioto Trail. These funds will be used for unanticipated expenditures directly related to the following types of capital improvements: \n \n•                     The construction of new buildings and structures, including site preparation\n•                     Additions, alterations, conversions, expansions, reconstruction, renovations, rehabilitations, and major replacements of a building or structure\n•                     Major mechanical and electrical system installations and upgrades, including, but not limited to, plumbing, heating and central air conditioning, boilers, ventilation systems, fire suppression systems, pump systems, electrical work, elevators, escalators, and other similar building services that are built into the facility\n•                     New, fixed outside structures or facilities, including, but not limited to, sidewalks and trails, highways and streets, bridges, parking lots, utility connections, outdoor lighting, water supply lines, sewers, water and signal towers, electric light and power distribution and transmission lines, playgrounds and equipment, parks with features, retaining walls, and similar facilities that are built into or fixed to the land, including site preparation\n•                     Additions, alterations, expansions, reconstruction, renovations, rehabilitations, and major replacements of a fixed, outside structure \n•                     Major earthwork for land improvements for parks and recreation fields\n•                     Surveys in conjunction with land acquisitions or improvements \n•                     Equipment that itself rises to the level of a capital asset or which directly relates to a capital project\n \nContracts will be entered into in compliance with the procurement provisions of the Columbus City Codes Chapter 329. Expenditures will be in compliance with the City of Columbus Capital Eligibility Requirements.\n \nBenefits to the Public: Having this funding in place for unanticipated needs as they arise will benefit the community by helping to ensure that the regional greenways trail system remains accessible, safe, updated, and user friendly, keeping the impact on trail users to a minimum when unforeseen issues arise. \n \nCommunity Input Issues: Many issues that this funding helps to address come straight from the community, through 311 and direct contact with the department. The community has expressed the desire for a well-kept trails through public workshops, social media, and direct contact with City staff.  \n \nArea(s) Affected: Citywide (99) - The entire City of Columbus and beyond is affected by having the funding in place to act efficiently on issues that arise throughout the regional greenways trail system. \n \nMaster Plan Relation: This certificate and resulting projects will support the Recreation and Parks Master Plan by helping to ensure that multi-use trails remain accessible, safe, updated, and user friendly. \n \nFiscal Impact: $50,000.00 is budgeted and available from within the Recreation and Parks Voted Bond Fund 7702 to meet the financial obligations of these various expenditures.  \n \nTitle\n \nTo authorize and direct the City Auditor to establish an auditor’s certificate in the amount of $50,000.00 for various expenditures for labor, materials, and equipment in conjunction with greenways trail system improvements within the Recreation and Parks Department; and to authorize the expenditure of $50,000.00 from the Recreation and Parks Voted Bond Fund. ($50,000.00)\n \nBody\n \nWHEREAS, it is necessary that the City Auditor establish an auditor’s certificate in the amount of $50,000.00 for various expenditures in conjunction with greenways trail system improvements within the Recreation and Parks Department; and\n \nWHEREAS, funding is budgeted and available from within the Voted Recreation and Parks Bond Fund 7702 to meet the financial obligations of these various expenditures; and\n \nWHEREAS, it has become necessary in the usual daily operations of the Recreation and Parks Department in that it is necessary to authorize the expenditure of $50,000.00 from the Voted Recreation and Parks Bond Fund; NOW, THEREFORE \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the City Auditor is authorized and directed to establish an auditor’s certificate in the amount of $50,000.00 for various expenditures for labor, materials, and equipment in conjunction with greenways trail system improvements within the Recreation and Parks Department.   \n \nSECTION 2. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \nSECTION 4. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\nSECTION 5. That the expenditure of $50,000.00 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Voted Recreation and Parks Bond Fund 7702 in object class 06 Capital Outlay per the accounting codes in the attachment to this ordinance.\n \nSECTION 6.  That this Council hereby recognizes that this ordinance does not identify specific contractors or vendors for the expenditure purposes authorized herein and hereby delegates sole and final contracting decisions relative to the determination of lowest, best, most responsive and most responsible vendor(s) to the Director of the Recreation and Parks Department. All contracts will be entered into in compliance with the relevant procurement provisions of the Columbus City Codes Chapter 329.\n \nSECTION 7.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 124,
    "meeting_date": "2024-10-21",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Economic Development",
      "Parks & Recreation"
    ]
  }
}