{
  "success": true,
  "vote": {
    "id": 10502,
    "item_number": "CA-50",
    "title": "To authorize the Director of the Department of Building and Zoning Services to enter into a contract with 3SG Plus, LLC for Document Conversion Services; and to authorize an expenditure within the Development Services Fund. ($168,003.00)",
    "description": "Explanation\n \nThis legislation authorizes the Director of Building and Zoning Services (BZS) to enter into a services contract with 3SG Plus, LLC., in an amount of up to $168,003.00, for document conversion services for an initial 12-month period.  Because the project is expected to extend beyond one year, the contract will include one twelve-month renewal at $168,003.00, one twelve month renewal at $184,803.30, and two optional twelve-month renewals at $184,803.30 each, for a potential total of five years subject to Council reauthorization and additional funding allocation annually. \n                     \nBZS has a need for the conversion of physical documents into electronic images, which optimizes storage space, reduces future storage costs, and provides efficient access to department information. These services have been consistently utilized by BZS since 2014.\n \nBZS underestimated the technical complexity of these services in its 2023 procurement effort, which was ultimately unsuccessful. BZS partnered with the Department of Technology this time and solicited Requests for Statements of Qualifications for this Document Conversion Services contract.  The project was formally advertised on the Bonfire portal from June 7, 2024 to July 12, 2024.  The evaluation committee, including representatives from the Building and Zoning Services and Technology departments, evaluated the statements of qualifications and reviewed technical proposals for all offerors and determined that 3SG Plus, LLC was the highest qualified offeror.  The Building and Zoning Services Director subsequently authorized contract negotiations between the City and 3SG Plus, LLC, which were successful.    \n \nCONTRACT COMPLIANCE\nVendor: 3SG Plus, LLC. (D365 Vendor Acct. No:  019867)\n \nCertification #: CC-019867 - Exp: 10/31/2025. \n \nThe company is not disbarred according to the excluded party listing system of the Federal Government or prohibited from being awarded a contract according to the Auditor of State unresolved finding for recovery certified search.\n \nFISCAL IMPACT\nFunding for this contract is available within Fund 2240, the Development Services Fund.\n \nTitle\n \nTo authorize the Director of the Department of Building and Zoning Services to enter into a contract with 3SG Plus, LLC for Document Conversion Services; and to authorize an expenditure within the Development Services Fund. ($168,003.00)\n \nBody\n \nWHEREAS, the contract with 3SG Plus, LLC. authorized by this ordinance will ensure continuation of document conversion services, which optimize storage space, reduce future storage costs, and provide efficient access to department information; and\n  \nWHEREAS, the Department of Building and Zoning Services solicited Requests for Statements of Qualifications for this Document Conversion Services contract; and\n \nWHEREAS, 3SG Plus, LLC. was determined by the evaluation committee to have the highest qualified offer and the Building and Zoning Services Director subsequently authorized negotiations with the firm; and\n \nWHEREAS, it is necessary to enter into a contract with 3SG Plus, LLC. for the provision of document conversion services described above in the amount of up to $168,003.00; and\n \nWHEREAS, because the project is expected to extend beyond one year, this ordinance authorizes the contract to include two twelve-month extensions beyond the initial 12-month period and an additional two optional twelve-month extensions, subject to Council reauthorization and additional funding allocation annually; NOW, THEREFORE,\n  \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Department of Building and Zoning Services be, and hereby is, authorized to enter into a services contract with 3SG Plus, LLC. for Document Conversion services in an amount up to $168,003.00, for a period of twelve months with two twelve-month extensions and two optional twelve month extensions, subject to Council reauthorization and additional funding allocation annually.\n \nSECTION 2.  That the expenditure of $168,003.00 or so much thereof as may be necessary is hereby authorized from the Department of Building and Zoning Services, Division No. 43-01, Development Services Fund, Fund No, 2240, in object class 03 Purchased Services per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 4. That funds are hereby appropriated and expenditures authorized to carry out the purposes of this ordinance, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 124,
    "meeting_date": "2024-10-21",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Planning & Development"
    ]
  }
}