{
  "success": true,
  "vote": {
    "id": 10564,
    "item_number": "SR-23",
    "title": "To amend section 2133.07 of the Columbus City Codes, pertaining to stunt driving and street takeovers and penalties for violations, to correct a technical error by including a definition for the term “vehicle component;” to repeal existing section 2133.07; and to declare an emergency.",
    "description": "Explanation\n \nThe purpose of this ordinance is to amend Section 2133.07 of the Columbus City Codes, pertaining to the prohibition of stunt driving and street takeovers, to correct a technical omission.  \n \nFollowing the post-COVID surge of street racing, stunt driving, and street takeovers throughout the country, creating dangerous activity on public streets, Columbus City Council enacted Ord. 2210-2024, which added a specific prohibition of stunt driving and street takeovers to Section 2133.07 of the Columbus City Codes.  However, the version of this amendment that was passed omitted a definition for “Vehicle component,” a term that was added to the Codes, but remained undefined in the Codes.  This amendment will add the missing definition.  No other amendments will be made to the existing language of Section 2133.07.  \n \nEMERGENCY DESIGNATION:  This ordinance is presented as an emergency measure in order to allow for the timely enforcement and prosecution of any future charges brought for violations of Section 2133.07.  \n \n \nTitle\n \nTo amend section 2133.07 of the Columbus City Codes, pertaining to stunt driving and street takeovers and penalties for violations, to correct a technical error by including a definition for the term “vehicle component;” to repeal existing section 2133.07; and to declare an emergency.\n \n \nBody\n \nWHEREAS, Chapter 2133 of the Columbus City Codes pertains to provisions regarding the reckless operation of vehicles; and \n \nWHEREAS, Section 2133.07 deals specifically to street racing prohibitions; and \n \nWHEREAS, since the COVID pandemic, there has been a surge of street racing, stunt driving, and street takeovers throughout the country, creating dangerous activity on public streets; and \n \nWHEREAS, Council passed Ordinance 2210-2024 in July 2024 to specifically prohibit stunt driving and street takeovers in the Columbus City Codes and add penalties for violations; and\n \nWHEREAS, a definition for “vehicle component” was omitted in error from the original code amendment; and\n \nWHEREAS, Council is proposing this additional amendment to correct the drafting error; and\n \nWHEREAS, an emergency exists in the normal operations of the City, in it is necessary to immediately make a technical correction to the Codes, to address this danger to public safety; now, therefore\n \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \n \nSECTION 1.  That section 2133.07 of the Columbus City Codes is hereby amended, reading as follows:\n \n2133.07 - Street racing, stunt driving, and street takeover prohibited.\n(a) As used in this section:\n(1) \"Street racing\" means the operation of two (2) or more vehicles from a point side by side at accelerating speeds in a competitive attempt to out-distance each other or the operation of one or more vehicles over a common selected course, from the same point to the same point, wherein timing is made of the participating vehicles involving competitive accelerations or speeds. The operation of two (2) or more vehicles side by side either at speeds in excess of prima-facie lawful speeds established by Section 2133.03 or rapidly accelerating from a common starting point to a speed in excess of such prima-facie lawful speeds shall be prima-facie evidence of street racing.\n(2) \"Burnout\" means a maneuver performed while operating a vehicle whereby the vehicle is kept in a stationary position, but the wheels of the vehicle are spun, which may cause the tires of the vehicle to become heated and emit smoke from the friction.\n(3) \"Doughnut\" means a maneuver performed while operating a vehicle whereby the front or rear of the vehicle is rotated around the opposite set of wheels in a continuous motion, which may cause a circular skid-mark pattern of rubber on the driving surface, or the tires of the vehicle to become heated and emit smoke from the friction, or both.\n(4) \"Drifting\" means a maneuver performed while operating a vehicle whereby the vehicle is driven in a manner that causes a controlled, sideways skid during a turn, with the front wheels pointing in a direction that is the opposite of the direction of the turn.\n(5) \"Wheelie\" means a maneuver performed while operating a vehicle whereby the front wheel or wheels of the vehicle are raised off of the ground or whereby two wheels that are on the same side of the vehicle are raised off of the ground.\n(6) \"Stunt driving\" means performing or engaging in burnouts, doughnuts, drifting, or wheelies, causing vehicle tires to squeal, or allowing a passenger to ride either partially or fully outside of the vehicle while operating that vehicle.\n(7) \"Street takeover\" means blocking or impeding the regular flow of vehicle or pedestrian traffic on a public road, street, or highway or on private property that is open to the general public for the purpose of street racing or stunt driving.\n(8) \"Instrumentality\" has the same meaning as in section 2981.01 of the Revised Code.\n(9) “Vehicle Component” means any motor vehicle part or accessory specifically adapted for use in street racing, stunt driving, or street takeover.  “Vehicle Component” includes, but is not limited to, steering wheels, wheels and tires, and mufflers.\n(b) No person shall knowingly participate in a street racing, stunt driving, or street takeover upon any public road, street, or highway or on private property that is open to the general public.\n(c) Whoever violates this section is guilty of street racing, stunt driving, or street takeover, a misdemeanor of the first degree. In addition to any other sanctions, the court shall suspend the offender's driver's license, commercial driver's license, temporary instruction permit, probationary license, or nonresident operating privilege for not less than thirty (30) days or more than three (3) years. No judge shall suspend the first thirty (30) days of any suspension of an offender's license, permit, or privilege imposed under this division.\n(d) In addition to any other penalties imposed by law, a vehicle component used in a violation of division (b) of this section is an instrumentality, shall be subject to seizure as contraband, and is subject to forfeiture under Chapter 2981 of the Revised Code. \n(e) Persons rendering assistance in any manner to street racing, stunt driving, or street takeover shall be equally charged as the participants.\n \n(f) This section does not apply to the competitive operation of vehicles on public or private property in accordance with a Special Event permit issued pursuant to Chapter 923 or when otherwise authorized by ordinance of Council.\n \n \nSECTION 2.  That existing section 2133.07 of the Columbus City Codes is hereby repealed.\n \nSECTION 3.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or 10 days after its passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 124,
    "meeting_date": "2024-10-21",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services"
    ]
  }
}