{
  "success": true,
  "vote": {
    "id": 10588,
    "item_number": "CA-20",
    "title": "To authorize the Director of Recreation and Parks to modify an existing contract with Michael Baker International to provide professional services associated with the Alum Creek Trail Connections - Mock Road and Sunbury Drive Project; to authorize the transfer of $45,000.00 within the Recreation and Parks Voted Bond Fund; to authorize the amendment of the 2024 Capital Improvements Budget; and to authorize the expenditure of $45,000.00 from the Recreation and Parks Voted Bond Fund. ($45,000.00)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Director of the Recreation and Parks Department to modify an existing contract with Michael Baker International, Inc. to provide professional services associated with the Alum Creek Trail Connections - Mock Road and Sunbury Road Project. The modification amount being authorized by this ordinance is $45,000.00.\n \nThis project will create a vital 1.2-mile direct link for the Near Northeast Community to the City’s regional trail network. This shared use path will extend from the Alum Creek Trail at Sunbury Road and Mock Road, heading west to connect with the new Hudson Street Greenway.\n \nThis modification was anticipated, aligning the additional scope of services with final plans and engineer's construction cost estimates. The additional needed services include utility coordination, bidding support, and timely responses to contractors. The current consulting team is best positioned to efficiently complete the additional work. The contract modification will be priced according to established hourly rates. Construction is anticipated to start in the spring of 2025. An additional modification is planned for construction management and inspection services.\n \nPrincipal Parties: \nMichael Baker International, Inc.\n250 West Street, Suite 420\nColumbus, Ohio 43215\nKevin Dickens, (614) 538-7612\nContract Compliance Number: 001926\nContract Compliance Expiration Date: December 4, 2025\n \nBenefits to the Public: The proposed greenway along Mock Road will connect to the new Hudson Street Greenway and Alum Creek Trail, aligning with the City’s goal to enhance access to greenways for underserved neighborhoods.\n \nCommunity Input/Issues: Letters of support were received from non-profit organizations, residents, a school principal, and the Central Ohio Greenways Board. Further public engagement occurred during fall of 2022 through a public open house, online survey, area commission meetings, and social media blasts.  \n \nArea(s) Affected: Northeast (41), North Central (49)\n \nMaster Plan Relation: This project will support the Recreation and Parks Master Plan by improving access to trails and greenways corridors. It provides equitable and safe access to the trail system for underserved communities. \n \nFiscal Impact: The expenditure of $752,571.00 was legislated for the Alum Creek Trail Connections - Mock Road and Sunbury Drive Project by Ordinances 0166-2022 and 0434-2023. This ordinance will provide funding that will modify the previously authorized amount by $45,000.00. $45,000.00 is budgeted and available in the Recreation and Parks Voted Bond Fund 7702 to meet the financial obligations of this contract modification. The aggregate total amount authorized, including this modification, is $797,571.00.\n \nTitle\n \nTo authorize the Director of Recreation and Parks to modify an existing contract with Michael Baker International to provide professional services associated with the Alum Creek Trail Connections - Mock Road and Sunbury Drive Project; to authorize the transfer of $45,000.00 within the Recreation and Parks Voted Bond Fund; to authorize the amendment of the 2024 Capital Improvements Budget; and to authorize the expenditure of $45,000.00 from the Recreation and Parks Voted Bond Fund. ($45,000.00)\n \nBody\n \nWHEREAS, it is necessary to authorize the Director of the Recreation and Parks to modify an existing contract with Michael Baker International to provide professional services associated with the Alum Creek Trail Connections - Mock Road and Sunbury Drive Project; and\n \nWHEREAS, it is necessary to authorize the transfer of $45,000.00 within the Recreation and Parks Voted Bond Fund 7702; and\n \nWHEREAS, it is necessary to authorize the amendment of the 2024 Capital Improvements Budget Ordinance 1907-2024 in order to provide sufficient budget authority for this and future projects; and\n \nWHEREAS, it is necessary to authorize the expenditure of $45,000.00 from the Recreation and Parks Voted Bond Fund 7702; and\n \nWHEREAS, it has become necessary in the usual daily operations of the Recreation and Parks Department in that it is necessary to authorize the Director to modify an existing contract with Michael Baker International, Inc. to provide professional services associated with the Alum Creek Trail Connections - Mock Road and Sunbury Road Project, NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Recreation and Parks be and is hereby authorized to modify an existing contract with Michael Baker International to provide professional services associated with the Alum Creek Trail Connections - Mock Road and Sunbury Drive Project. The modification amount being authorized by this ordinance is $45,000.00.\n \nSECTION 2. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 4. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 5. That the transfer of $45,000.00 or so much thereof as may be needed, is hereby authorized between projects within the Recreation and Parks Voted Bond Fund 7702 per the account codes in the attachment to this ordinance.\n \nSECTION 6. That the 2024 Capital Improvements Budget Ordinance 1907-2024 is hereby amended as follows in order to provide sufficient budget authority for this ordinance and future projects.\n \nFund / Project / Project Name / Current Revised Authority / Current Remaining Authority / Change / Amended Revised Authority / Amended Remaining Authority\n \nFund 7702 / P512022-100000 / Greenways Development - Misc. (Voted Carryover) / $393,246 / $343,246 / ($45,000) / $348,246 / $298,246\n \nFund 7702 / P512027-100000; Alum Creek Trail Connections - Mock Road and Sunbury Drive (Voted Carryover) / $0 / $0 / $45,000 / $45,000 / $45,000\n \nSECTION 7. For the purpose stated in Section 1, the expenditure of $45,000.00 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Recreation and Parks Voted Bond Fund 7702 in object class 06 Capital Outlay per the accounting codes in the attachments to this ordinance.  \n \nSECTION 8. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 125,
    "meeting_date": "2024-10-28",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Parks & Recreation"
    ]
  }
}