{
  "success": true,
  "vote": {
    "id": 10581,
    "item_number": "CA-13",
    "title": "To authorize the Finance and Management Director to modify and extend the contract for the option to purchase Thermoplastic Glass Beads with Potters Industries, LLC, and to declare an emergency. ($0.00)",
    "description": "Explanation\nBACKGROUND:  This legislation authorizes the Finance and Management Director to modify and extend an existing Universal Term Contract (UTC) for the option to obtain Thermoplastic Glass Beads with Potters Industries, LLC, CC# 001619 and expires October 31, 2024.  This contract provides Ohio Type C Glass Beads that are used in road striping to provide thermoplastic reflection for the Division of Traffic Management.  This modification and extension is necessary to maintain an uninterrupted supply of these items. The contract, PO244415 was established in accordance with Request for Quotation RFQ016262 and will expire October 31, 2024. The term of the proposed option contract would be approximately one year, expiring October 31, 2025.\n \nNo additional funds are necessary to extend the option contract as requested.  The original contract was formally bid. It was presumed that there was a contract extension available, while there was not.  It is not in the City's best interest to go through the procurement process for these goods as that would result in a lapse of contract. It is imperative to have continuation of this contract as these goods are used daily throughout the roads of the City of Columbus. The original terms and conditions remain in effect.\n \nEMERGENCY DESIGNATION:  The Finance and Management Department respectfully requests this legislation be considered an emergency because this contract expires on October 31, 2024. For the continued safety and well-being of the residents of the City of Columbus, it is crucial that this contract does not lapse.\n \nFISCAL IMPACT: No funding is required to extend the contract. The Department of Public Service must set aside their own funding for their estimated expenditures.  \n \nTitle\n \nTo authorize the Finance and Management Director to modify and extend the contract for the option to purchase Thermoplastic Glass Beads with Potters Industries, LLC, and to declare an emergency. ($0.00)\n \nBody\n \nWHEREAS, the Purchasing Office entered into a Universal Term Contract for Thermoplastic Glass Beads for use by Division of Traffic Management; and,  \n \nWHEREAS, it is necessary to modify and extend the existing Universal Term Contract with Potters Industries, LLC; and,\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service as this UTC  expires on October 31, 2024, in that it is immediately necessary to authorize the Finance and Management Director to immediately modify and extend a Universal Term Contract with Potters Industries LLC for the option to obtain Thermoplastic Glass Beads as this UTC is set to expire on October 31, 2024, all for the immediate preservation of the public health, peace, property, safety, and welfare; and now, therefore: \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Finance and Management Director is hereby authorized to modify and extend a contract for option to obtain Thermoplastic Glass Beads with Potters Industries, LLC, for a term of approximately one (1) year, expiring October 31, 2025.\n \nSECTION 2. That this modification is in accordance with relevant provisions of Section 329 of the Columbus City Code.  \n \nSECTION 3.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 125,
    "meeting_date": "2024-10-28",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}