{
  "success": true,
  "vote": {
    "id": 10587,
    "item_number": "CA-19",
    "title": "To authorize the Director of Recreation and Parks to enter into contract with Korda/Nemeth Engineering, Inc. to provide design services for the HVAC Controls Upgrades - Phases 2-3 Project; to authorize the transfer of $99,166.60 within the Recreation and Parks Voted Bond Fund; to authorize the amendment of the 2024 Capital Improvements Budget; and to authorize the expenditure of $99,166.60 from the Recreation and Parks Voted Bond Fund. ($99,166.60)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Director of the Recreation and Parks Department to enter into contract with Korda/Nemeth Engineering, Inc. to provide design services for the HVAC Controls Upgrades - Phases 2-3 Project. The contract amount is $90,606.00, with a contingency of $8,560.60, for a total of $99,166.60 being authorized by this ordinance\n \nThis project is a continuation of departmental efforts to modernize end-of-life HVAC equipment throughout our facilities in order to improve energy efficiency and user comfort. This contract is for design services for the second and third of three phases to replace or upgrade antiquated HVAC control systems. These changes will improve operating efficiency of the facilities and allow them to be added to Recreation and Parks Department’s Niagara brand system for remote management.\n \nThe project scope includes replacement of defunct HVAC control systems at Whetstone Community Center, Dodge Community Center, Brentnell Community Center, and the Maintenance Headquarters Facility. Other locations included in this project will be Blackburn Community Center, Barack Community Center, Beatty Community Center and Holton Community Center. All of these locations will have their systems integrated into the centralized HVAC control system.\n \nThe Recreation and Parks Department was awarded $156,193.00 in grant funds through the State of Ohio, Department of Development, Office of Energy and Environment (OEE) Energy Efficiency Program for Ohio Communities (EEPOC) in conjunction with the U.S. Department of Energy (DOE) Infrastructure Investment and Jobs Act (IIJA). This grant was specifically intended to support the work on Blackburn Community Center and the Maintenance Headquarters Facility and will be used towards the future construction of the project at these locations.\n \nVendor Bid/Proposal Submissions (Office of Diversity and Inclusion designation status): \nEvery two years, the Recreation and Parks Department pre-qualifies professional service vendors to provide Engineering, Architectural, and Construction Management Services. During each prequalification period, the Department enters into contracts for various services to facilitate the execution of our Capital Improvements Plan. Ordinance 2467-2022 authorized the pre-qualified arrangement for the period of 2022 to 2024. The contracts being authorized by this ordinance are being awarded utilizing the pre-qualified list of vendors, as previously authorized by 2467-2022. \n \nPrincipal Parties: \nKorda/Nemeth Engineering, Inc.\n1650 Watermark Drive\nColumbus, Ohio 43215                                                      \nEd Keener, (614) 256-2231\nContract Compliance Number: 004467\nContract Compliance Expiration Date: February 22, 2025\n \nBenefits to the Public: The improved environmental quality, increased systems reliability, and reduction in building energy use enabled by this project will help the City of Columbus meet its Climate Action Plan goals that are meant to help combat climate change.\n \nCommunity Input/Issues: The community has expressed support for the environmental initiatives driven by the Mayor's Climate Action Plan.\n \nArea(s) Affected: Citywide (99)\n \nMaster Plan Relation: This project will support the Recreation and Parks Master Plan by helping to improve operations and services to the citizens of Columbus.\n \nFiscal Impact: $99,166.60 is budgeted and available from within the Recreation and Parks Voted Bond Fund 7702 to meet the financial obligations of this contract.\n \nTitle\n \nTo authorize the Director of Recreation and Parks to enter into contract with Korda/Nemeth Engineering, Inc. to provide design services for the HVAC Controls Upgrades - Phases 2-3 Project; to authorize the transfer of $99,166.60 within the Recreation and Parks Voted Bond Fund; to authorize the amendment of the 2024 Capital Improvements Budget; and to authorize the expenditure of $99,166.60 from the Recreation and Parks Voted Bond Fund. ($99,166.60)\n \nBody\n \nWHEREAS, it is necessary to authorize the Director of the Recreation and Parks to enter into contract with Korda/Nemeth Engineering, Inc. to provide design services for the HVAC Controls Upgrades - Phases 2-3 Project; and\n \nWHEREAS, it is necessary to authorize the transfer of $99,166.60 within the Recreation and Parks Voted Bond Fund 7702; and\n \nWHEREAS, it is necessary to authorize the amendment of the 2024 Capital Improvements Budget Ordinance 1907-2024 in order to provide sufficient budget authority for this and future projects; and\n \nWHEREAS, it is necessary to authorize the expenditure of $99,166.60 from the Recreation and Parks Voted Bond Fund 7702; and\n \nWHEREAS, it has become necessary in the usual daily operations of the Recreation and Parks Department in that it is necessary to authorize the Director to enter into contract with Korda/Nemeth Engineering, Inc. to provide design services for the HVAC Controls Upgrades - Phases 2-3 Project, NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Recreation and Parks be and is hereby authorized to enter into contract with Korda/Nemeth Engineering, Inc. for the HVAC Controls Upgrades - Phases 2-3 Project. \n \nSECTION 2. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 4. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\nSECTION 5. That the transfer of $99,166.60 or so much thereof as may be needed, is hereby authorized between projects within the Recreation and Parks Bond Fund 7702 per the account codes in the attachment to this ordinance.\nSECTION 6. That the 2024 Capital Improvements Budget Ordinance 1907-2024 is hereby amended as follows in order to provide sufficient budget authority for this ordinance and future projects.\nFund / Project / Project Name / Current Revised Authority / Current Remaining Authority / Change / Amended Revised Authority / Amended Remaining Authority\nFund 7702 / P511000-100000 / Renovation - Misc. (Voted Carryover) / $811,534 / $311,534 / ($99,167) / $712,367 / $212,367\n Fund 7702 / P511040-202425 / HVAC Upgrades 2024-2025 (Voted Carryover) / $0 / $0 / $99,167 / $99,167 / $99,167\nSECTION 7. For the purpose stated in Section 1, the expenditure of $99,166.60 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Recreation and Parks Voted Bond Fund 7702 in object class 06 Capital Outlay per the accounting codes in the attachments to this ordinance.  \nSECTION 8. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 125,
    "meeting_date": "2024-10-28",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Parks & Recreation"
    ]
  }
}