{
  "success": true,
  "vote": {
    "id": 10635,
    "item_number": "SR-1",
    "title": "To authorize and direct the City Auditor to establish an auditor’s certificate in the amount of $500,000.00 for various expenditures for professional architectural, engineering, and construction management services in conjunction with park, trail, and facility capital improvement projects; to waive the competitive bidding provisions of the Columbus City Code; to authorize the Director of the Recreation and Parks Department to enter into multiple future professional service contracts; to authorize the transfer of $500,000.00 within the Recreation and Parks Voted Bond Fund; to authorize the amendment of the 2024 Capital Improvements Budget; and to authorize the expenditure of $500,000.00 from the Recreation and Parks Voted Bond Fund. ($500,000.00) (Amended by ord. 0072-2026 passed on 2/9/2026 -LG)",
    "description": "Explanation\n \nBackground: This ordinance is to authorize the City Auditor to establish an auditor’s certificate in the amount of $500,000.00 for various expenditures for professional architectural, engineering, and construction management services in conjunction with park, trail, and facility capital improvement projects. This ordinance will also waive the competitive bidding provisions of Columbus City Code Chapter 329, authorizing the Department of Recreation and Parks to enter into contracts on behalf of the City for the professional services mentioned herein so long as total expenditures under any contract do not exceed one hundred thousand dollars ($100,000.00). \n \nThe Recreation and Parks Department’s 2018 to 2020 pilot arrangement of pre-qualified vendors was a success and, since then the Department has authorized a similar arrangement of pre-qualified vendors for the periods of 2020 to 2022, as authorized by Ordinance 2050-2020, and 2022 to 2024, as authorized by Ordinance 2467-2022. This arrangement has created efficiencies for many projects during this time. Therefore, this ordinance will renew this pre-qualified arrangement for the period of 2022 to 2024. \n \nThis legislation will authorize the establishment of an auditor certificate for the future award of contracts for Architectural, Engineering, and Construction Management Services. Contracts will be awarded to Consultants that have been pre-qualified in accordance with Columbus City Code Sections 329.26 and 329.27. Services that will be provided may include, but are not limited to, the following four categories:\n \n•                     Site planning, architectural design, landscape architecture, golf course design\n•                     Mechanical, electrical, plumbing, and HVAC engineering\n•                     Civil engineering, environmental engineering and services, and structural engineering\n•                     Construction management, inspection, and surveying\n \nVendor Bid/Proposal Submissions (ODI designation status):\n \nThe Recreation and Parks Department solicited Requests for Statements of Qualifications for professional architectural, engineering, and construction management services. Multiple contracts will be awarded to various companies that were deemed to be prequalified through the evaluation process. The RFSQ’s were advertised through the City’s Vendor Services website on May 3, 2024 and received on May 31, 2024. The City received 88 total responses across the four categories noted above. In accordance with City Code, a selection team evaluated the proposals and recommends that the firms identified below be selected to perform the work.  The firms were chosen based on their location, experience, qualifications, availability, understanding of departmental needs, and ability to control costs. Multiple contracts will be awarded to various companies that were deemed to be prequalified through the evaluation process. After a review by the Selection Committee, the following companies were deemed prequalified through 2026:\n2LMN, Inc. (MBE) - 015414\nAdvanced Engineering Consultants, LTD. (MBE, WBE) - 005665\nAscension Construction Solutions, LLC (MBE) - 023827\nCompass Infrastructure Group, LLC (WBE) - 032467\nCT Consultants, Inc. (MAJ) - 006450\nDLZ Ohio, Inc. (EBE, MBE) - 004939\nDesignLevel LLC (WBE) - 011513\nDesigning Local LTD (WBE) - 020995\nDynotec, Inc. (MBE) - 005053\nEnvironmental Design Group, LLC (MAJ) - 003292\nEvans Mechwart Hambleton & Tilton, Inc. DBA EMH&T (MAJ) - 004214\nThe Edge Group, Inc. (MAJ) - 001500\nGlaus, Pyle, Schomer, Burns and Dehaven, Inc. DBA GPD Group (MAJ) - 006560\nHurdzan Golf, LLC (MAJ) - 048885\nIMEG Consultants Corp. (MAJ) - 047820\nKorda/Nemeth Engineering, Inc. (MAJ) - 004467\nKramer Engineering, Inc. (MAJ) - 029993\nMad Scientist Associates, LLC (WBE) - 001014\nMS Consultants, Inc. (MAJ) - 006998\nMarker, Inc. DBA Marker Construction (WBE) - 006989\nMeyers + Associates Architecture, LLC (MAJ) - 005957\nOrchard, Hiltz & McCliment, Inc. DBA OHM (MAJ) - 007505\nThe Osborn Engineering Company (MAJ) - 006417\nPOD, LLC DBA POD Design (MAJ) - 001114\nREALM Collaborative, LLC (MAJ) - 021146\nResource International, Inc. (WBE) - 004197\nRogers Krajnak Architects, Inc. (MAJ) - 005923\nSchooley Caldwell Associates, Inc. (MBE) - 004535\nSmoot Construction Company of Ohio (MBE) - 004871\nStar Consultants, Inc. (MBE) - 005568\nCAP-STONE & Associates, Inc. DBA Stone Environmental Engineering and Science (WBE) - 004933\nToole Design Group LLC (EBE, WBE) - 000315\nTriad Architects LTD. (MAJ) - 005893\nVS Engineering, Inc. (MBE) - 031373\n \nAs was done per 2453-2018, 2050-2020, and 2467-2022, for the previous two year arrangements and per City Code Section 329.15, regarding non-emergency waiver of regulations, it is in the best interests of the City to waive the competitive bidding provisions of City Code for the purpose of this ordinance. Authorizing the Recreation and Parks Department to enter into contracts up to the amount of one hundred thousand dollars ($100,000.00), raising the threshold from twenty thousand dollars ($20,000.00) noted in Section 329.24, will continue to create significant efficiencies within the Recreation and Parks Department moving forward. The Department has many recurring, non-project specific needs for professional service contracts in excess of $20,000.00 that are essential to the ongoing operation of the Department’s strategic planning, design, and construction management functions. Instead of drafting new legislation to approve all contracts over twenty thousand dollars ($20,000.00), all contracts anticipated as a result of this ordinance will be able to move forward as soon as they are needed, as a result of this ordinance. \n \nFurthermore, the process used by the Recreation and Parks Department to prequalify the vendors noted herein provided a significant amount of competition among potential vendors. The process used to select the prequalified vendors was in accordance with City Code Sections 329.26 and 329.27. These sections are the standard process used to select and authorize professional services contracts over fifty thousand dollars ($50,000.00). This ordinance will allow the Recreation and Parks Department to use the results of this completed process to collect technical proposals from the prequalified vendors as each new need arises. In turn, there will be sufficient competition for all contracts authorized by this ordinance. All relevant city codes, in regards to selecting vendors for professional services have been met. All contracts will be entered into in accordance with the prequalification process described herein this ordinance and in\ncompliance with the procurement provisions of the Columbus City Codes Chapter 329 regarding professional services.\n \nBenefits to the Public: Having this funding in place for needs as they arise will benefit the community by helping to ensure that parks, trails, and facilities remain accessible, safe, updated, and user friendly.\n \nCommunity Input/Issues: Community input has not been obtained on this legislation because it is being used mainly for staff augmentation needs, as well as, emergency and unanticipated needs. However, community input will be sought as appropriate for work that results from contracts awarded through this process.\n \nArea(s) Affected: Citywide (99)\n \nMaster Plan Relation: This arrangement will support the Recreation and Parks Master Plan by helping to ensure that parks, trails, and facilities remain accessible, safe, updated, and user friendly.\n \nFiscal Impact: $500,000.00 is budgeted and available from within the Recreation and Parks Bond Fund 7702 and 7712 to meet the financial obligations of these various expenditures. \n \nTitle\n \nTo authorize and direct the City Auditor to establish an auditor’s certificate in the amount of $500,000.00 for various expenditures for professional architectural, engineering, and construction management services in conjunction with park, trail, and facility capital improvement projects; to waive the competitive bidding provisions of the Columbus City Code; to authorize the Director of the Recreation and Parks Department to enter into multiple future professional service contracts; to authorize the transfer of $500,000.00 within the Recreation and Parks Voted Bond Fund; to authorize the amendment of the 2024 Capital Improvements Budget; and to authorize the expenditure of $500,000.00 from the Recreation and Parks Voted Bond Fund. ($500,000.00) (Amended by ord. 0072-2026 passed on 2/9/2026 -LG)\n \nBody\n \nWHEREAS, it is necessary that the City Auditor establish an auditor’s certificate in the amount of $500,000.00 for various expenditures for professional architectural, engineering, and construction management services in conjunction with park, trail, and facility capital improvement projects; and\n \nWHEREAS, the Recreation and Parks Department conducted a process by which it pre-qualified multiple firms for the above mentioned services in compliance with the procurement provisions of the Columbus City Codes Chapter 329; and\n \nWHEREAS, it is necessary to authorize the amendment of the 2024 Capital Improvements Budget Ordinance 1907-2024 in order to provide sufficient budget authority for this and future projects; and\n \nWHEREAS, it is necessary to authorize the transfer of $500,000.00 within the Recreation and Parks Voted Bond Fund 7702 and 7712; and\n \nWHEREAS, it is necessary to authorize the expenditure of $500,000.00 from the Recreation and Parks Voted Bond Fund 7702 and 7712; and\n \nWHEREAS, it is in the best interests of the city to waive the competitive bidding provisions of City Code Chapter 329, allowing the Recreation and Parks Department to enter into multiple future contracts on behalf of the City for the professional services mentioned herein up to the amount of one hundred thousand dollars ($100,000.00); and\n \nWHEREAS, it has become necessary in the usual daily operations of the Recreation and Parks Department in that it is necessary to authorize the expenditure of $500,000.00 from the Recreation and Parks Voted Bond Fund for the various expenditures described herein, all for the preservation of the public health, peace, property, safety, and welfare; NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the City Auditor is authorized to set up a certificate in the amount of $500,000.00 for various expenditures for professional architectural, engineering, and construction management services in conjunction with park, trail, and facility capital improvement projects within the Recreation Parks Department.\n \nSECTION 2. That this Council finds it is in the best interests of the City to waive the competitive bidding provisions of City Code Chapter 329, allowing the Recreation and Parks Department to enter into multiple future contracts on behalf of the City for the professional services mentioned herein up to the amount of one hundred thousand dollars ($100,000.00).\n \nSECTION 3. That the Director of the Recreation and Parks Department is authorized to enter into contracts with the firms listed below for professional architectural, engineering, and construction management services in conjunction with park, trail, and facility capital improvement projects:\n \n2LMN, Inc. (MBE) - 015414\nAdvanced Engineering Consultants, LTD. (MBE, WBE) - 005665\nAscension Construction Solutions, LLC (MBE) - 023827\nCompass Infrastructure Group, LLC (WBE) - 032467\nCT Consultants, Inc. (MAJ) - 006450\nDLZ Ohio, Inc. (EBE, MBE) - 004939\nDesignLevel LLC (WBE) - 011513\nDesigning Local LTD (WBE) - 020995\nDynotec, Inc. (MBE) - 005053\nEnvironmental Design Group, LLC (MAJ) - 003292\nEvans Mechwart Hambleton & Tilton, Inc. DBA EMH&T (MAJ) - 004214\nThe Edge Group, Inc. (MAJ) - 001500\nGlaus, Pyle, Schomer, Burns and Dehaven, Inc. DBA GPD Group (MAJ) - 006560\nHurdzan Golf, LLC (MAJ) - 048885\nIMEG Consultants Corp. (MAJ) - 047820\nKorda/Nemeth Engineering, Inc. (MAJ) - 004467\nKramer Engineering, Inc. (MAJ) - 029993\nMad Scientist Associates, LLC (WBE) - 001014\nMS Consultants, Inc. (MAJ) - 006998\nMarker, Inc. DBA Marker Construction (WBE) - 006989\nMeyers + Associates Architecture, LLC (MAJ) - 005957\nOrchard, Hiltz & McCliment, Inc. DBA OHM (MAJ) - 007505\nThe Osborn Engineering Company (MAJ) - 006417\nPOD, LLC DBA POD Design (MAJ) - 001114\nREALM Collaborative, LLC (MAJ) - 021146\nResource International, Inc. (WBE) - 004197\nRogers Krajnak Architects, Inc. (MAJ) - 005923\nSchooley Caldwell Associates, Inc. (MBE) - 004535\nSmoot Construction Company of Ohio (MBE) - 004871\nStar Consultants, Inc. (MBE) - 005568\nCAP-STONE & Associates, Inc. DBA Stone Environmental Engineering and Science (WBE) - 004933\nToole Design Group LLC (EBE, WBE) - 000315\nTriad Architects LTD. (MAJ) - 005893\nVS Engineering, Inc. (MBE) - 031373\n \nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 6. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 7. That the transfer of $500,000.00 or so much thereof as may be needed, is hereby authorized between projects within the Recreation and Parks Bond Fund 7702 and 7712 per the account codes in the attachment to this ordinance.\n \nSECTION 8. That the 2024 Capital Improvements Budget Ordinance 1907-2024 is hereby amended as follows in order to provide sufficient budget authority for this ordinance and future projects.\nFund / Project / Project Name / Current Revised Authority / Current Remaining Authority / Change / Amended Revised Authority / Amended Remaining Authority\n \nFund 7702 / P511000-100000 / Renovation - Misc. (Voted Carryover) / $712,367 / $212,367 / ($92,367) / $620,000 / $120,000\nFund 7702 / P511007-100000 / Hard Surface Improvements (Voted Carryover) / $125,591 / $125,591 / ($125,591) / $0 / $0\nFund 7702 / P511057-100000 / Lincoln Park Improvements (Voted Carryover) / $35,133 / $35,133 / ($35,133) / $0 / $0\nFund 7702 / P511069-100000 / Shelter Improvements 2023-2024 (Voted Carryover) / $1,140,000 / $1,140,000 / ($121,909) / $1,018,091 / $1,018,091\nFund 7702 / P512000-100000 / New Development - Misc. (Voted Carryover) / $1,412,267 / $1,412,267 / ($10,000) / $1,402,267 / $1,402,267\nFund 7702 / P514024-100000 / Berliner Sports Park Improvements 2023-2024 (Voted Carryover) / $322,119 / $322,119 / ($20,000) / $302,119 / $302,119\nFund 7702 / P515009-100000 / Turnberry Golf Course Bridge (Voted Carryover) / $983,790 / $983,790 / ($25,000) / $958,790 / $958,790\nFund 7702 / P516001-100000 / Emergency Replacement - Cost Allocation (Voted Carryover) / $40,000 / $40,000 / ($40,000) / $0 / $0\nFund 7702 / P517001-100000 / Opportunity Projects - Cost Allocation (Voted Carryover) / $30,000 / $30,000 / ($10,000) / $20,000 / $20,000\nFund 7712 / P514024-100000 / Berliner Sports Park Improvements 2023-2024 (Voted Carryover) / $39,365 / $39,365 / ($20,000) / $19,365 / $19,365\n \nFund 7702 / P511020-100000 / Renovation - General Design & Construction Management Services (Voted Carryover) / $0 / $0 / $375,000 / $375,000 / $375,000\nFund 7702 / P512020-100000; New Development - General Design & Construction Management Services (Voted Carryover) / $0 / $0 / $10,000 / $10,000 / $10,000\nFund 7702 / P514020-100000; Program Projects (Small) - General Design & Construction Management Services (Voted Carryover) / $0 / $0 / $20,000 / $20,000 / $20,000\nFund 7702 / P515020-100000; Program Projects (Large) - General Design & Construction Management Services (Voted Carryover) / $0 / $0 / $25,000 / $25,000 / $25,000\nFund 7702 / P516020-100000; Emergency Replacement - General Design & Construction Management Services (Voted Carryover) / $0 / $0 / $40,000 / $40,000 / $40,000\nFund 7702 / P517020-100000; Opportunity Projects - General Design & Construction Management Services (Voted Carryover) / $0 / $0 / $10,000 / $10,000 / $10,000\nFund 7712 / P514020-100000; Program Projects (Small) - General Design & Construction Management Services (Voted Carryover) / $0 / $0 / $20,000 / $20,000 / $20,000\n \nSECTION 9. That the expenditure of $500,000.00 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Voted Recreation and Parks Bond Fund 7702 and 7712 in object class 06 Capital Outlay per the accounting codes in the attachment to this ordinance. \n \nSECTION 10. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 125,
    "meeting_date": "2024-10-28",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Economic Development"
    ]
  }
}