{
  "success": true,
  "vote": {
    "id": 10642,
    "item_number": "SR-8",
    "title": "To authorize the Director of the Department of Public Utilities to modify to add funding to contracts with Ohio Mulch Supply, Inc. and Quasar Energy Group LLC-North Tree Farm for the Deep Row Hybrid Poplar Tree Farm #2 Program; to authorize the expenditure of $1,000,000.00 from the Sanitary Sewerage Operating Fund; ($1,000,000.00)",
    "description": "Explanation\nBACKGROUND\nTo authorize the Director of Public Utilities to modify to add funding for contracts with Ohio Mulch Supply, Inc. and Quasar Energy Group LLC-North Tree Farm for the Deep Row Hybrid Poplar Tree Farm #2 Program to provide services for the Compost Facility. The Division of Sewerage and Drainage, produces Class B biosolids in accordance with ORC 3745-40 at both the Jackson Pike and the Southerly Wastewater Treatment Plants. The City has committed to 100% beneficial reuse of its biosolids.\n \nThis contract functions as a mechanism to facilitate Class B biosolids disposal via an Ohio Environmental Protection Agency (OEPA) approved Deep Row Hybrid Poplar (DRHP) or other approved rapid growth tree farm. The selected entity shall demonstrate compliance with all applicable rules and regulations related to biosolids handling and disposal, land development, land reclamation and environmental permitting.\n \nPROCUREMENT\nThe Department of Public Utilities solicited competitive bids for the Deep Row Hybrid Poplar Tree Farm #2 Program in accordance with the relevant provisions of Chapter 329 (RFQ022646). Three (3) majority bids were received and two (2) contracts were established and authorized under Ordinance #0095-2023. \n \nCONTRACT AMOUNTS / TIMELINE\nThe contract term was for one (1) year from the date of execution. The contract language allows for six (6) one (1) year renewal options on a year to year basis upon mutual agreement, availability of funds, and approval by Columbus City Council. If unforeseen issues or difficulties are encountered that would require additional funding, a modification would be requested. We are currently in the second year of a seven year contract.\n \nThis legislation seeks to modify the contracts to add funding to provide for services through the term of the contract. This Ordinance is being submitted in accordance with the relevant provisions of Chapter 329 of City Code pertaining to contract modifications. \n \nCost summary: \n \nOriginal Contract, Ordinance #0095-2023                                           $1,840,000.00\nModification #1, Ordinance #1875-2023                                                $1,060,000.00\nModification #2, Ordinance #2984-2023                                                $880,000.00\nModification/Renewal #3, Ordinance #0442-2024                     $3,600,000.00\nModification #4, Ordinance 2585-2024 (pending)                         $1,000,000.00\n \nEstimated Contract Total:                                                                                          $8,380,000.00\n \n1.                      Amount of additional funds:  Total amount of additional funds needed for the contract is $1,000,000.00.  Total contract amount including this modification is $8,380,000.00.\n \n2.                     Reason additional funds were not foreseen: This funding is to provide services through the term of the contract. Funding is added on an incremental basis. The need for additional funds were included in the initial contract.\n \n3.                     Reason other procurement processes are not used: The pricing was obtained through a formal bid (RFQ022646) and awarded to the two bidders that met the specifications. Planned contract modifications were anticipated to add funds for continuation of services. This is one of those planned contract modifications so a new procurement process is not required.\n \n4.                     How cost was determined: A cost proposal was provided by Ohio Mulch Supply, Inc. and Quasar Energy Group LLC-North Tree Farm in their bids and was reviewed by the Division of Sewerage and Drainage and was deemed acceptable.\n \nSUPPLIER(S) / CONTRACT COMPLIANCE INFORMATION  \nOhio Mulch Supply, Inc., vendor #004715, cc# expires 12/14/23 (update pending), majority status\nQuasar Energy Group LLC-North Tree Farm, vendor #018416, cc# expires 9/27/26, majority status\n \nThe certifications of Ohio Mulch Supply, Inc. and Quasar Energy Group LLC-North Tree Farm are in good standing at the time of the contract awards. The companies are not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.\n \nMINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract was put in place prior to the implementation of the City of Columbus MBE/WBE Program and is not subject to the requirements of that program. Ohio Mulch Supply, Inc. and Quasar Energy Group LLC-North Tree Farm are classified as majority companies by the City’s Office of Diversity and Inclusion.  \n \nFISCAL IMPACT\n$1,000,000.00 is budgeted and needed for this purchase. Funds are budgeted and available for this expenditure within the Sanitary Sewer Operating Fund\n$3,817,203.32 was spent in 2023\n$1,400,119.18 was spent in 2022\n \n \nTitle\nTo authorize the Director of the Department of Public Utilities to modify to add funding to contracts with Ohio Mulch Supply, Inc. and Quasar Energy Group LLC-North Tree Farm for the Deep Row Hybrid Poplar Tree Farm #2 Program; to authorize the expenditure of $1,000,000.00 from the Sanitary Sewerage Operating Fund; ($1,000,000.00)\n \n \nBody\nWHEREAS, the Department of Public Utilities entered into contracts for Deep Row Hybrid Poplar Tree Farm #2 Program in accordance with Chapter 329 of the Columbus City Code, pursuant to solicitation RFQ022646, with Ohio Mulch Supply, Inc. and Quasar Energy Group LLC-North Tree Farm; and\n \nWHEREAS, the Department of Public Utilities wishes to modify to add funding to the contracts with Ohio Mulch Supply, Inc. and Quasar Energy Group LLC-North Tree Farm for the Deep Row Hybrid Poplar Tree Farm #2; and\n \nWHEREAS, the vendors have agreed to modify the contracts under current prices and conditions; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities to authorize the Director to modify contracts with Ohio Mulch Supply, Inc. and Quasar Energy Group LLC-North Tree Farm for the Deep Row Hybrid Poplar Tree Program in accordance with the terms, conditions and specifications of solicitation RFQ022646 on file; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Public Utilities be and is hereby authorized to modify the contracts for the Deep Row Hybrid Poplar Program with Ohio Mulch Supply, Inc. and Quasar Energy LLC-North Tree Farm per the terms and conditions of RFQ022646 on file in the Department of Public Utilities.\n \nSECTION 2.  That said firm shall conduct the work to the satisfaction of the Director of Public Utilities.\n \nSECTION 3.  This legislation seeks to modify the contracts to add funding to provide for services through the term of the contract. This Ordinance is being submitted in accordance with the relevant provisions of Chapter 329 of City Code pertaining to contract modifications. \n \nSECTION 4.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That the expenditure of $1,000,000.00 is authorized in Fund 6100 (Sanitary Sewer-Operating) in object class 03 Services per the accounting codes in the attachment to this ordinance.\n \nSECTION 6.   That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 125,
    "meeting_date": "2024-10-28",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}