{
  "success": true,
  "vote": {
    "id": 10657,
    "item_number": "CA-8",
    "title": "To authorize the Director of the Department of Finance and Management, on behalf of the Facilities Management Division, to enter into contracts with Farber Corporation and 2K General Co. for the Municipal Court Renovations Project; to authorize an amendment to the 2024 Capital Improvement Budget; to authorize a transfer and expenditure of $111,669.00 within the Construction Management Capital Improvement Fund; and to declare an emergency. ($111,669.00)",
    "description": "Explanation\n \nBACKGROUND: This ordinance authorizes the Director of Finance and Management, on behalf of the Facilities Management Division, to enter into contracts with Farber Corporation and TwoK General Co. d/b/a 2K General Co (\"2K General Co) for the Municipal Court Renovations Project.\n \nThe scope of work includes the replacement of the domestic water booster pumps, replacement of the air compressor pump, boiler flue replacement, and the replacement of the sanitary vent at the Municipal Court Building located at 375 S. High Street.\n \nCONSTRUCTION CONTRACT AWARD:  The project was let by the Facilities Management Division via Vendor Services and Bid Express. Municipal Court Building Domestic Water Booster Pump Replacement: Two bids were opened on September 9, 2024 from the following Majority-designated vendors:\n \n1.   Farber Corporation                                                                                     $62,710.00\n2.   The Righter Co.                                                                         $113,200.00\n \n \nFarber Corporation’s bid was deemed the lowest, best, most responsive and responsible bid in the amount of $62,710.00.  Majority-owned firm.   Searches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against Farber Corporation.\n \nMunicipal Court Building Air Compressor Pump Replacement: One bid was opened on September 11, 2024 from the following Majority-designated vendor:\n \n1.   Farber Corporation                                                                                     $10,915.00\n \nFarber Corporation’s bid was deemed the lowest, best, most responsive and responsible bid in the amount of $10,915.00.  Majority-owned firm.   Searches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against Farber Corporation.\n \nMunicipal Court Building Boiler Flue Replacement: One bid was opened on September 30, 2024 from the following Majority-designated vendor:\n \n1.   Farber Corporation                                                                                     $23,555.00\n \nFarber Corporation’s bid was deemed the lowest, best, most responsive and responsible bid in the amount of $23,555.00.  Majority-owned firm.   Searches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against Farber Corporation.\n \nMunicipal Court Building Sanitary Vent Replacement: One bid was opened on September 16, 2024 from the following Majority-designated vendor:\n \n1.   2K General Co.                                                                                    $14,489.00\n \n2K General Co.’s bid was deemed the lowest, best, most responsive and responsible bid in the amount of $14,489.00.  Majority-owned firm.   Searches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against 2K General Co\n \n \n \nSUBCONTRACTOR PARTICIPATION:  An ODI goal was not assigned due to the low dollar threshold of the project.\n \nEMERGENCY DESIGNATION: Emergency legislation is requested for this ordinance so that the boiler and HVAC systems can be in working condition prior to the winter months to avoid any functionality issues during the cold weather.\n \nFiscal Impact:  An amendment to the 2024 Capital Improvement Budget and a transfer of cash and appropriation within the Construction Management Capital Fund will be necessary for this expenditure.\n \nTitle\n \nTo authorize the Director of the Department of Finance and Management, on behalf of the Facilities Management Division, to enter into contracts with Farber Corporation and 2K General Co. for the Municipal Court Renovations Project; to authorize an amendment to the 2024 Capital Improvement Budget; to authorize a transfer and expenditure of $111,669.00 within the Construction Management Capital Improvement Fund; and to declare an emergency. ($111,669.00)\nBody\n \n \nWHEREAS, bids for multiple components of the Municipal Court Renovations Project were received and opened in the office of the Director of Finance and Management on September 9th, 11th, 16th, and 30th , 2024; and\n \nWHEREAS, the lowest, best, most responsive and responsible bid for the Municipal Court Building Domestic Water Booster Pump Replacement was from Farber Corporation in the amount of $62,710.00; and\n \nWHEREAS, the lowest, best, most responsive and responsible bid for the Municipal Court Building Air Compressor Pump Replacement was from Farber Corporation in the amount of $10,915.00; and\n \nWHEREAS, the lowest, best, most responsive and responsible bid for the Municipal Court Building Boiler Flue Replacement was from Farber Corporation in the amount of $23,555.00; and\n \nWHEREAS, the lowest, best, most responsive and responsible bid for the Municipal Court Building Sanitary Vent Replacement was from 2K General Co. in the amount of $14,489.00; and\n \nWHEREAS, it is necessary to authorize the Director of Finance and Management to award and execute  construction contracts for the Municipal Court Renovations Project; and \n \nWHEREAS, it is necessary to authorize a transfer of cash and appropriation and an expenditure of funds within the Construction Management Capital Improvement Fund; and\n \nWHEREAS, it in necessary to authorize an amendment to the 2024 Capital Improvement Budget; and\n \nWHEREAS, an emergency exists in the usual and daily operation of the Department of Finance and Management, Facilities Management Division, in that it is immediately necessary to authorize the Director of Finance and Management to enter into contract with Farber Corporation and 2K General Co.  for the Municipal Court Renovations Project so that the boiler and HVAC systems at the Municipal Court Building can be in working condition prior to the winter months to avoid any functionality issues during the cold weather, all for the immediate preservation of the public health, peace, property, safety, and welfare; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Finance and Management, on behalf of the Facilities Management Division, is authorized to enter into contract with Farber Corporation and 2K General Co. for the Municipal Court Renovations Project, in an amount up to $111,669.00\n \nSECTION 2. That the transfer of $111,669.00 or so much thereof as may be necessary in regard to the actions authorized in SECTION 1, is hereby authorized in Fund 7733 - Construction Management Capital Improvement Fund, in Object Class 06, Capital Outlay, per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That the expenditure of $111,669.00, or so much thereof as may be necessary in regard to the actions authorized in SECTION 1, is hereby authorized in Fund 7733 - Construction Management Capital Improvement Fund, in Object Class 06, Capital Outlay, per the accounting codes in the attachment to this ordinance.\n \nSECTION 4. That the 2024 Capital Improvement Budget is hereby amended per the accounting codes in the attachment to this ordinance.\n \nSECTION 5.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 6.  That the City Auditor is hereby authorized and directed to transfer any unencumbered balance in the project account to the unallocated balance within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies no longer required for said project; except that no transfer shall be made from a project account by monies from more than one source.\n \nSECTION 7.  That the City Auditor is authorized to establish proper project accounting numbers as appropriate.\n \nSECTION 8.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 9. That for the reasons stated in the preamble hereto, which is hereby made a part thereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 126,
    "meeting_date": "2024-11-04",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}