{
  "success": true,
  "vote": {
    "id": 10655,
    "item_number": "CA-6",
    "title": "To authorize the City Attorney to modify an existing contract for special legal counsel services with Vorys, Sater, Seymour and Pease LLP, for the Litigation Matters that are currently pending in the Common Pleas Court of Franklin County, OH and any other litigation arising from the data security intrusion; to authorize the expenditure of $250,000.00 from the Department of Technology Operating Fund; and to declare an emergency. ($250,000.00)",
    "description": "Explanation\n \nBACKGROUND: \nThe cases of Doe, et al. v. City of Columbus, Case No. 24cv006195 and Doe, et al. v. City of Columbus, Case No. 24cv006428 (collectively “Litigation Matters”), are currently pending in the Common Pleas Court of Franklin County, OH, arising from a recently publicized data security intrusion experienced by the City. Due to a potential conflict of interest, it was necessary for the City Attorney’s office to retain outside counsel to represent the City. The City Attorney’s office entered into a special legal counsel contract with Vorys, Sater, Seymour and Pease LLP on September 24, 2024.  Vorys, Sater, Seymour and Pease LLP will represent the City in the above cases and any additional litigation that may be filed as a result of the data security intrusion.  It is now necessary to modify that contract in order to continue to provide the statutorily required representation. \n \nFISCAL IMPACT:  This contract modification will be funded by the Department of Technology Operating Fund.  The amount of this contract modification is $250,000.00.\n \nEMERGENCY DESIGNATION: Emergency action is requested as funds are needed immediately to ensure these services can continue without interruption.\n \nCOMPANY: Vorys, Sater, Seymour and Pease LLP, Vendor Number 006042\n \nTitle\n \nTo authorize the City Attorney to modify an existing contract for special legal counsel services with Vorys, Sater, Seymour and Pease LLP, for the Litigation Matters that are currently pending in the Common Pleas Court of Franklin County, OH and any other litigation arising from the data security intrusion; to authorize the expenditure of $250,000.00 from the Department of Technology Operating Fund; and to declare an emergency. ($250,000.00)\n \nBody\n \nWHEREAS, due to a conflict of interest, the City Attorney has need for special legal services with regard to the Litigation Matters that are currently pending in the Common Pleas Court of Franklin County, OH and any other litigation arising from the data security intrusion; and \n \nWHEREAS, the City Attorney and Vorys, Sater, Seymour and Pease LLP entered into a special counsel contract on September 24, 2024 to provide special legal services for the first phase of the representation on behalf of the City Attorney and the Department of Technology with regard to matters pertaining to the Litigation Matters; and\n \nWHEREAS, this modification will provide for continuation of those services; and\n \nWHEREAS, the Department of Technology has determined that additional funds are needed for this modification; and\n \nWHEREAS, funds will be provided by the Department of Technology Operating Fund; and\n \nWHEREAS, an emergency exists in the usual daily operation of the City Attorney's Office in that it is necessary to authorize the City Attorney to modify the contract with Vorys, Sater, Seymour and Pease LLP immediately in order to provide for uninterrupted services in their representation, for the immediate preservation of the public health, peace, property, safety and welfare; and NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the City Attorney is hereby authorized and directed to modify the contract entered into on September 24, 2024 with Vorys, Sater, Seymour and Pease LLP for special legal counsel to provide special legal services to the City Attorney and the Department of Technology with regard to the Litigation Matters that are currently pending in the Common Pleas Court of Franklin County, OH and any other litigation arising from the data security intrusion.  \n \nSECTION 2. That for the purposes stated in Section 1, the amount of two hundred fifty thousand dollars ($250,000.00) or so much thereof as may be necessary, be and is hereby authorized in Fund 5100 Department of Technology Operating Fund, per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5.  That for the reasons stated in the preamble hereto which are hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and immediately after its passage and signature by the Mayor, or within 10 days thereafter if the Mayor neither signs nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 126,
    "meeting_date": "2024-11-04",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}