{
  "success": true,
  "vote": {
    "id": 10662,
    "item_number": "CA-13",
    "title": "To authorize the Director of the Office of Diversity and Inclusion to modify a professional services contract with NK Industries, LLC for software implementation and supplier diversity support services; and to authorize an expenditure of up to $150,000.00 from the General Fund; and to declare an emergency.  ($150,000.00)",
    "description": "Explanation\n1.   BACKGROUND: This ordinance authorizes the Director of the Office of Diversity and Inclusion to modify a professional services contract with NK Industries, LLC for the B2GNow software implementation and supplier diversity support services. \nAmount of additional funds to be expended:  $150,000.00\nOriginal Contract                                                                              $45,000.00 (PO461898)\nModification #1                                                                                $150,000.00 (This Ordinance)\nThe contract amount including all modifications:                                                                      $195,000.00\nReason additional goods/services could not be foreseen: This modification was not anticipated at the time of the original contract due to unforeseen requirements that emerged during project implementation. These additional services became necessary as the project evolved to meet the City's objectives.\nReasons other procurement processes are not used: NK Industries, LLC is uniquely qualified to accomplish this project and to provide expert consultation on the supplier diversity program.\nHow cost of modification was determined:The costs of this contract modification are consistent with the direct labor, overhead, and market standards established within the original contract.\n2.   CONTRACT COMPLIANCE: NK Industries, LLC | Exp. 12/04/2025 | # CC-0475243.   FISCAL IMPACT: Funding in the amount of $150,000.00 is available within the General Fund.\n4.  MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nNK Industries, LLC is certified as an MBE and WBE by the Office of Diversity and Inclusion.\nTitle\nTo authorize the Director of the Office of Diversity and Inclusion to modify a professional services contract with NK Industries, LLC for software implementation and supplier diversity support services; and to authorize an expenditure of up to $150,000.00 from the General Fund; and to declare an emergency.  ($150,000.00)\nBody\nWHEREAS, the original contract number, PO461898 was created and approved on August 1, 2024, for the B2GNow software implementation and supplier diversity support services, and\n WHEREAS, it is necessary to authorize an expenditure of up to $150,000.00 from the General Fund, Fund 1000; and\n WHEREAS, an emergency exists in the usual daily operation of the Office of Diversity and Inclusion in that it is immediately necessary to authorize the Director of the Office of Diversity and Inclusion to modify a professional services contract with NK Industries, LLC for the B2GNow software implementation and supplier diversity support services, to stay on schedule, for the public health, peace, property, safety and welfare; now, therefore, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1.  That the Director of the Office of Diversity and Inclusion is hereby authorized to modify an existing professional services agreement NK Industries, LLC, for the B2GNow software implementation and supplier diversity support services, in accordance with the terms and conditions of the contract on file in the office of the Office of Diversity and Inclusion.\nSECTION 2.  That the expenditure of up to $150,000.00 is hereby authorized from the General Fund, Fund 1000 per the accounting codes attached to this ordinance.\nSECTION 3.  That the funds are deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 126,
    "meeting_date": "2024-11-04",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}