{
  "success": true,
  "vote": {
    "id": 10672,
    "item_number": "CA-23",
    "title": "To authorize the appropriation of $213,573.66 within the Recreation and Parks Permanent Improvement Fund; to authorize an expenditure correction of $169,615.11 from the Recreation and Parks Operating Fund 2285 to the Recreation and Parks Permanent Improvement Fund 7747 for facility furniture and fixture projects; to authorize the expenditure of $43,958.55 from the Recreation and Parks Permanent Improvement Fund to replace purchase order PO460774; and to declare an emergency. ($213,573.66)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the appropriation of $213,573.66 in the Recreation and Parks Permanent Improvement Fund 7747 to be applied towards the costs of facility furniture and fixture improvements projects via an expenditure correction.  \n \nThe Recreation and Parks Department completed some facility furniture and fixture projects earlier this year. These were originally funded with the Recreation and Parks Operating Fund 2285. In working with the Department of Finance and Management, it has been determined that these were capital eligible expenditures. In order to capitalize these expenditures, the Recreation and Parks Department is seeking authorization to perform an expenditure correction to move these costs to the Recreation and Parks Permanent Improvement Fund 7747. PO432267, PO428822, PO431666, and PO464269 have been identified as the purchase orders to be expenditure corrected. These expenditures are a total of $169,615.11. PO460774, in the amount of $43,958.55, has not been invoiced. This purchase order will be cancelled and replaced with a new purchase order with the corrected funding. \n \nEmergency Justification: Emergency action is being requested in order to capitalize the expenditures and replenish the Recreation and Parks Operating Fund 2285 as soon as possible leading into the end of the 2024 Fiscal Year. \n \nBenefits to the Public: This project improved the aesthetics and functionality of outdated Recreation and Parks facilities.     \n \nCommunity Input Issues: The community has expressed the desire for well-kept and updated facilities through public workshops, social media, and direct contact with City staff. \n \nArea(s) Affected: Citywide (99)\n \nMaster Plan Relation: This project supports the Columbus Recreation and Parks Department’s Master Plan by helping to ensure that facilities remain safe and user friendly.\n \nFiscal Impact: $213,573.00 is budgeted and available from within the Recreation and Parks Permanent Improvement Fund 7747 to meet the financial obligations of these fiscal actions.  \n \nTitle\n \nTo authorize the appropriation of $213,573.66 within the Recreation and Parks Permanent Improvement Fund; to authorize an expenditure correction of $169,615.11 from the Recreation and Parks Operating Fund 2285 to the Recreation and Parks Permanent Improvement Fund 7747 for facility furniture and fixture projects; to authorize the expenditure of $43,958.55 from the Recreation and Parks Permanent Improvement Fund to replace purchase order PO460774; and to declare an emergency. ($213,573.66)\n \nBody\n \nWHEREAS, it is necessary to authorize the appropriation of $213,573.66 within the Recreation and Parks Permanent Improvement Fund 7747; and\n \nWHEREAS, it is necessary to authorize an expenditure correction of $169,615.11 from the Recreation and Parks Operating Fund 2285 to the Recreation and Parks Permanent Improvement Fund 7747 for facility furniture and fixture projects; and\n \nWHEREAS, it is necessary to authorize the expenditure of $43,958.55 from the Recreation and Parks Permanent Improvement Fund 7747 to replace purchase order PO460774; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Recreation and Parks Department in that it is immediately necessary to authorize this expenditure correction in order to capitalize the expenditures and replenish the Recreation and Parks Operating Fund 2285 as soon as possible leading into the end of the 2024 Fiscal Year, all for the preservation of public health, peace, property, safety, and welfare; NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the appropriation of $213,573.66 is authorized within the Recreation and Parks Permanent Improvement Fund 7747.  \n \nSECTION 2. That an expenditure correction of $169,615.11 is hereby authorized from the Recreation and Parks Operating Fund 2285 to the Recreation and Parks Permanent Improvement Fund 7747 for facility furniture and fixture projects.\n \nSECTION 3. That the transfer of $213,573.66 or so much thereof as may be needed, is hereby authorized between projects within the Recreation and Parks Permanent Improvement Fund 7747 per the account codes in the attachment to this ordinance.\n \nSECTION 4. That the 2024 Capital Improvements Budget Ordinance 1907-2024 is hereby amended as follows in order to provide sufficient budget authority for this ordinance and future projects.\n \nFund / Project / Project Name / Current Revised Authority / Current Remaining Authority / Change / Amended Revised Authority / Amended Remaining Authority\n \nFund 7747 / P747999-100000; Unallocated Balance Fund 7747 (Recreation and Parks Permanent Improvement Carryover) / $700,374 / $700,374 / ($213,574) / $486,800 / $486,800\n \nFund 7747 / P510040-100000 / Recreation and Parks Equipment (Recreation and Parks Permanent Improvement Carryover) / $17,500 / $0 / $213,574 / $231,074 / $213,574\n \nSECTION 5. That the expenditure of $43,958.55, intended to replace purchase order PO460774, be and is hereby authorized from the Recreation and Parks Permanent Improvement Fund 7747  in object class 06 Capital Outlay per the accounting codes in the attachments to this ordinance.  \n \nSECTION 6. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 7. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 8. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 9.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or 10 days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 126,
    "meeting_date": "2024-11-04",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}