{
  "success": true,
  "vote": {
    "id": 10699,
    "item_number": "SR-7",
    "title": "To authorize the City Clerk to enter into a contract with Foundations Worldwide, Inc. for baby changing stations; to waive the competitive bidding provisions of the Columbus City Code; to authorize an appropriation and expenditure within the Neighborhood Initiatives subfund; and to declare an emergency. ($25,000.00)",
    "description": "Explanation\nThis ordinance authorizes the City Clerk to enter into a contract with the Foundations Worldwide, Inc. for baby changing stations.\n \nThe City of Columbus has created a diaper changing grant program to increase equal access to diaper changing stations throughout Columbus in small businesses and organizations for all parents and guardians in the city. With the help of the the Dadass Podcast and CBUS Dads Blog Council is raising awareness for the need of changing stations in men's rooms and gender-neutral bathrooms at \"family friendly\" locations throughout Columbus, OH while advocating for the benefits for businesses, families and all.\n \nFoundations Worldwide, Inc. is the leading supplier of children’s furnishings to professional childcare centers, the worldwide leader in supplying cribs and children’s hospitality products to hotels, and a leading manufacturer of wall mounted baby changing stations for public facilities.\n \nEmergency action is necessary to purchase baby changing stations from Foundations Worldwide, Inc. to allow fathers and males to be involved in parenting functions.\n \nFiscal Impact: Funding is available within the Neighborhood Initiatives subfund.\n \nTitle\nTo authorize the City Clerk to enter into a contract with Foundations Worldwide, Inc. for baby changing stations; to waive the competitive bidding provisions of the Columbus City Code; to authorize an appropriation and expenditure within the Neighborhood Initiatives subfund; and to declare an emergency. ($25,000.00) \n \nBody\nWHEREAS, the City of Columbus is a city of over 900,000 residents, with over twenty-three percent of the population under the age of 18 and nearly even split between male and female residents; and\nWHEREAS, many public facilities only offer changing tables in women’s restrooms, making them inaccessible to fathers and males involved in parenting functions; and\nWHEREAS, the National Center for Health Statistics reports that ninety percent of fathers who live with their children bathe, diaper, and dress their children every day or several times a week; and\n \nWHEREAS, it is in the best interest of the City of Columbus to waive the competitive bidding provisions of Columbus City Code 329 to authorize this contract; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Clerk's Office in that it is immediately necessary to authorize a contract with Foundations Worldwide, Inc. for baby changing stations to allow fathers and males to be involved in parenting functions, thereby preserving the public health, peace, property, safety and welfare;  NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the City Clerk is hereby authorized to enter into a contract with Foundations Worldwide, Inc. for baby changing stations.\n \nSECTION 2. That the City Auditor is hereby authorized and directed to appropriate $25,000.00 in the Neighborhood Initiatives subfund, fund 1000, subfund 100018, to Columbus City Council per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That the expenditure of $25,000.00 or so much thereof as may be needed pursuant to the action authorized in SECTION 1, is hereby authorized in the Neighborhood Initiatives subfund, fund 1000, subfund 100018, per the accounting codes in the attachment to this ordinance.\n \nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.  That this Council finds it is in the best interest of the City of Columbus to waive the provisions of Chapter 329 of the City Code related to competitive bidding for the procurement of any materials or supplies purchased with the appropriations authorized by SECTION 1 of this ordinance, and does hereby waive the same.\n \nSECTION 7. That for the reason stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 126,
    "meeting_date": "2024-11-04",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}