{
  "success": true,
  "vote": {
    "id": 10712,
    "item_number": "3",
    "title": "To Recognize and Commend Kevin Wheeler for his 37 Years of Distinguished Service to the City of Columbus",
    "description": "Title\n \nTo Recognize and Commend Kevin Wheeler for his 37 Years of Distinguished Service to the City of Columbus\n \nBody\n \nWHEREAS, Kevin Wheeler has worked as a city planner in Columbus for thirty-five years, beginning his service with Columbus in 1987 as a graduate intern with the city’s historic preservation program; and\n \nWHEREAS, After serving the City of Columbus as an intern, he was hired to work on the city’s 1993 Comprehensive Plan. After the plan’s adoption, he coordinated the selection process for a $225 million bond package and administered the first round of the city’s Urban Infrastructure Recovery Fund. During this period, he was instrumental in obtaining several hundred thousand dollars in grant and capital funding for street tree planting throughout the city; and\n \nWHEREAS, Over his career, Kevin managed countless efforts including area plans, plan amendments, and innumerable special projects, including the development of the Short North Design Guidelines, Downtown Design Guidelines, Downtown Code, the Big Darby Watershed Master Plan, and the Columbus Citywide Planning Policies; and\n \nWHEREAS, Kevin has spent years as a leading expert in growth policy, passionately advocating for responsible and fiscally sound development. His commitment to sustainable growth principles has made him a trusted voice in the field; and \n \nWHEREAS, Kevin has meticulously reviewed thousands and thousands of parcels, playing a crucial role in city land use planning over several decades and significantly shaping the urban landscape; and\n \nWHEREAS, Kevin has navigated and negotiated thousands of rezoning and variance requests, leading to improved development outcomes across numerous sites in the city; and \n \nWHEREAS, Kevin has been a leader in advancing the role of city planning in Columbus and Central Ohio. During his tenure, he has played a major role in representing the importance of many things that are taken for granted today, including walkability, sidewalks, bicycle facilities, environmental conservation and protection, parks, design guidelines for new development, and other important elements of quality development; and\n \nWHEREAS, Kevin finished his career with the City by being the project lead for Zone In, which just successfully rezoned 140 miles of Columbus corridors, a generational success that will pave the way for decades of equitable development in Columbus; now, therefore \n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: \nThat this Council recognizes and commends Kevin Wheeler for his 37 years of distinguished service to the City of Columbus.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 127,
    "meeting_date": "2024-11-18",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}