{
  "success": true,
  "vote": {
    "id": 10752,
    "item_number": "CA-39",
    "title": "To authorize the City Clerk to enter into a grant agreement with Dress for Success Columbus in support of the FABSales program; and to authorize an appropriation and expenditure within the Neighborhood Initiatives subfund. ($10,000.00)",
    "description": "Explanation\nTo authorize the City Clerk to enter into a grant agreement with Dress for Success Columbus in support of FABSales\n \nDress for Success Columbus (DFSC) has partnered with the City of Columbus since 2019. In direct alignment with City Council’s overall vision of “Promoting Workforce Development and Jobs,” DFSC’s career advancement programming moves disadvantaged women toward economic security and resilience. FAB (or fill-a-bag) is a community shopping experience and grassroots fundraiser to support the mission of Dress for Success Columbus.\n \nDFSC recognizes that the rise of fast fashion has serious environmental repercussions. According to the U.S. EPA, an estimated 11.3 million tons of textile waste end up in landfills across the country every year (that’s 81.5lbs/person annually). By design, DFSC’s Styling Sessions -where DFSC provides thousands of women with donated professional workplace attire annually- bring numerous environmental benefits by actively diverting clothing from landfills. One successful green initiative, which has been a recent focal point, are FabSales, where DFSC sells excess inventory from our boutique to reduce waste, engage the community, and generate revenue for the organization.\n \nFabSales started in 2011 as an annual community engagement, and now by popular demand, DFSC will hold three FabSales annually (typically May, August, and November). Building on the success of this initiative, DFSC is in the process of developing a plan to expand environmental sustainability efforts.  Because the money DFSC raises from FabSales directly supports programming, 100% of this contribution will support the direct costs associated with delivering and expanding DFSC’s core workforce development programming. DFSC provides all services free of charge and relies on donations, grants, and fundraising revenues to sustain programs. While DFSC services do not generate organizational revenue, they generate substantial community impact that results in increased earnings and assets for every client served.\n \nFiscal Impact: Funding is available within the Neighborhood Initiatives subfund.\n \nTitle\nTo authorize the City Clerk to enter into a grant agreement with Dress for Success Columbus in support of the FABSales program; and to authorize an appropriation and expenditure within the Neighborhood Initiatives subfund. ($10,000.00)\n \nBody\nWHEREAS, Dress for Success Columbus (DFSC) has partnered with the City of Columbus since 2019; and\nWHEREAS, FAB (or fill-a-bag) is a community shopping experience and grassroots fundraiser to support the mission of Dress for Success Columbus; and\n \nWHEREAS, FabSales started in 2011 as an annual community engagement, and now by popular demand, DFSC will hold three FabSales annually; and\n \nWHEREAS, 100% of this contribution will support the direct costs associated with delivering and expanding DFSC’s core workforce development programming; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the City Clerk is authorized to enter into a grant agreement with Dress for Success Columbus in support of the FABSales program.\n \nSECTION 2. That the appropriation and expenditure of $10,000.00, or so much thereof as may be needed pursuant to the action authorized in SECTION 1, is authorized in the Neighborhood Initiatives subfund, fund 1000, subfund 100018, per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That the funds necessary to carry out the purpose of this ordinance are deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5. That this ordinance shall take effect at the earliest date allowable by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 2,
    "absent": 0,
    "meeting_id": 127,
    "meeting_date": "2024-11-18",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "ABSTAIN"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSTAIN"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Grants"
    ]
  }
}