{
  "success": true,
  "vote": {
    "id": 10769,
    "item_number": "CA-56",
    "title": "To authorize the Director of Public Utilities to enter into a contract, in accordance with sole source provisions of City Code, with ADS Environmental Services for the purchase of PRISM cloud-based data management software for the Division of Sewerage and Drainage; and to authorize the expenditure of $49,000.00 from the Sewer Operating Sanitary Fund. ($49,000.00)",
    "description": "Explanation\n \nThis legislation authorizes the Director of Public Utilities to enter into a the contract with ADS Environmental Services for the continued usage of PRISM cloud-based data management software for the Division of Sewerage and Drainage (DOSD). This contract will be established in accordance with the relevant provisions of Chapter 329 of City Code relating to sole source procurement.  \n \nThe DOSD Sewer System Engineering Section’s (SSES) Flow Monitoring Group supports roughly 150 flow meters and 30 rain gauges through an obsolete desktop program that no longer receives vendor support. Previous software program was increasingly difficult to run and frequently crashed. In 2022, SSES implemented PRISM. ADS Environmental Services’ PRISM software will serve as a more efficient and accessible way to store, monitor, and utilize flow data. The contract will provide the City with an annual license for up to 25 users and 200 live devices and ADS’ cloud-based software imposes no hosting or other IT resource requirements on the City. ADS will also provide two online training sessions over the course of the contract, in addition to other resources available through online help or prior training videos.\n \nPRISM is the only data warehouse platform capable of performing the critical tasks specific to ADS flow meters and rain gauges. Several of these tasks require proprietary access to and knowledge of ADS Environmental Services’ hardware. Additionally, PRISM can auto poll all the flow meters, which will allow SSES to completely abandon the obsolete software. No other platform can communicate with the meters so choosing a different cloud-based data management option would also require continued operation of the obsolete software. \n \nIn addition to its proprietary advantages, PRISM provides mapping, storage, exporting, dashboard, reporting, and data editing tools that allow for the scrubbing of raw flow data to provide meaningful insights. The City will be able to import historic data as well as have the ability to create active locations directly through the PRISM interface by entering GPS coordinates, device IP address, and other required site details.\n \nSUPPLIER:  \n \nADS LLC dba ADS Environmental Services. (Vendor #010326), Expires January 5, 2026.\n \nADS LLC. does not hold MBE/WBE status.\n \nThe company is not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.\n \nFISCAL IMPACT:  \n \n$49,000.00 was budgeted and needed for this expenditure.\n \n$0.00 was spent in 2021\n$48,000.00 was spent in 2022\n \n \nTitle\n \n \nTo authorize the Director of Public Utilities to enter into a contract, in accordance with sole source provisions of City Code, with ADS Environmental Services for the purchase of PRISM cloud-based data management software for the Division of Sewerage and Drainage; and to authorize the expenditure of $49,000.00 from the Sewer Operating Sanitary Fund. ($49,000.00) \n \n \nBody\n \nWHEREAS, the Department of Public Utilities has a need to enter into a contract with ADS Environmental Services for the purchase of its PRISM cloud-based data management software; and\n \nWHEREAS, ADS Environmental Services’ PRISM software is the only data warehouse platform capable of performing the critical tasks specific to ADS flow meters and rain gauges and thus choosing a different cloud-based data management option would require continued operation of the obsolete software; and\n \nWHEREAS,  the software enables the City to import historic data as well as have the ability to create active locations directly through the PRISM interface by entering GPS coordinates, device IP address, and other required site details; and\n \nWHEREAS, the Department of Public Utilities wishes to enter into a contract, in accordance with the relevant provisions of Chapter 329 of City Code relating to sole source procurement, for a period of one (1) year in effect from the date of contract execution; and\n \nWHEREAS, the contract will continue to provide an annual license for up to 25 users and 200 live devices and imposes no hosting or other IT resource requirements on the City; and\n \nWHEREAS, the expenditure of $49,000.00, or so much thereof as may be needed, is hereby authorized in Fund 6100, Sewer Operating Sanitary Fund, in object class 03, Services, per the accounting codes in the attachment to this ordinance; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities, Division of Sewerage and Drainage, to authorize Director of Public Utilities to enter into a contract with ADS Environmental Services for the purchase of its PRISM cloud-based data management software; NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Public Utilities is authorized to enter into a contract with ADS LLC dba ADS Environmental Services, 340 The Bridge Street, Suite 204, Huntsville, AL 35806, for its PRISM cloud-based data management software for a period of one (1) year in accordance with the relevant provisions of Chapter 329 of City Code relating to sole source procurement.     \n \nSECTION 2. That the expenditure of $49,000.00, or so much thereof as may be needed, is hereby authorized in Fund 6100, Sewer Operating Sanitary Fund, in object class 03, Services, per the accounting codes in the attachment to this ordinance.\n  \nSECTION 3. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5. That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 127,
    "meeting_date": "2024-11-18",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}