{
  "success": true,
  "vote": {
    "id": 10792,
    "item_number": "SR-15",
    "title": "To authorize the Board of Health to enter into a grant agreement with the Tony R. Wells Foundation in an amount up to $700,015.00 to provide assistance to Primary One Health to continue access to care for the residents of Columbus; to authorize the appropriation and expenditure of $700,015.00 to the Health Department from the City’s Emergency Human Service Funds; and to declare an emergency. ($700,015.00)",
    "description": "Explanation\n \n \nBACKGROUND:       \nThis ordinance authorizes the Board of Health to enter into a grant agreement with the Tony R Wells Foundation in an amount of $700,015.00 to provide immediate advanced funding assistance to Columbus Neighborhood Health Centers, Inc., dba PrimaryOne Health, to continue primary care services for residents of the City of Columbus. The funds have already been accrued prior to the date of the agreement to ensure that payroll is met by PrimaryOne Health and is specifically to be used for personnel costs only. \n \nEmergency action is requested to allow the financial transaction to be posted in the City's accounting system as soon as possible to ensure primary care services continue with residents of Columbus. Up to date financial posting promotes accurate accounting and financial management.\n \nFISCAL IMPACT:  Funding for this ordinance is available in the amount of $700,015.00 in the City’s Emergency Human Services Funds, 2231, Subfund 223125.\n  \nTitle\nTo authorize the Board of Health to enter into a grant agreement with the Tony R. Wells Foundation in an amount up to $700,015.00 to provide assistance to Primary One Health to continue access to care for the residents of Columbus; to authorize the appropriation and expenditure of $700,015.00 to the Health Department from the City’s Emergency Human Service Funds; and to declare an emergency. ($700,015.00)\n \nBody\n \nWHEREAS, Columbus City Code Section 371.02 allows for a portion of the allocation of the City’s Emergency Human Services Funds to be used to assist agencies with operating costs of delivering services; and,\n \nWHEREAS, it’s imperative that City residents have access to care; and,\n \nWHEREAS, the Board wishes to enter into a grant agreement with the Tony R Wells Foundation to reimburse funds provided to Columbus Neighborhood Health Centers, Inc., dba PrimaryOne Health for payroll assistance to allow for the continued provision of access to care; and,\n \nWHEREAS, this ordinance is submitted as an emergency so as to allow the financial transaction to be posted in the City's accounting system as soon as possible.  Up to date financial posting promotes accurate accounting and financial management; and,\n \nWHEREAS, an emergency exists in that it is immediately necessary to enter into a grant agreement with the Tony R. Wells Foundation for the immediate preservation of the public health and welfare and to avoid any delay in necessary primary care services to clients; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     That the Board of Health is hereby authorized to enter into a grant agreement with the Tony R Wells Foundation in an amount up to $700,015.00 to reimburse funds provided to Columbus Neighborhood Health Centers, Inc., dba PrimaryOne Health to allow them to continue to provide access to care to residents of the City of Columbus.                      \n \nSECTION 2.                     That from the unappropriated monies in the City’s Emergency Human Services Funds, Fund No. 2231, Subfund 223125, and from all monies estimated to come into said Fund from any and all sources for the period ending December 31, 2024, the sum of $700,015.00 is hereby appropriated to the Board of Health, Division No. 50-01, per the accounting codes in the attachment to this ordinance.                      \nSECTION 3.                     That to pay the cost of said grant agreement, the expenditure of $700,015.00, or so much thereof as may be necessary, is hereby authorized from the Emergency Human Services Fund 2231, Subfund 223125, per the accounting codes in the attachment to this ordinance.                     \n \nSECTION 4.                     That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.                     That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 127,
    "meeting_date": "2024-11-18",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}