{
  "success": true,
  "vote": {
    "id": 10807,
    "item_number": "CA-2",
    "title": "To honor the service and civil work of Cindy Turvy as an LGBTQ+ veteran in the community.",
    "description": "Title\nTo honor the service and civil work of Cindy Turvy as an LGBTQ+ veteran in the community.\nBody\nWHEREAS, Cindy Turvy served as an officer in the U.S. Marine Corps for over three years, and was stationed at three different duty sites including Quantico, Philadelphia, and Parris Island; and,\nWHEREAS, after her time in the Marine Corps, Cindy Turvy transitioned to civil service, devoting 27 years to the Ohio Department of Rehabilitation and Correction as a social worker, including work at the Ohio Penitentiary; and, \nWHEREAS, afterwards, she spent time as a grants administrator for the Department of Transportation; and,\nWHEREAS, Cindy Turvy also oversaw public sector fundraising for United Way for six years, continuing her passion for civil service; and,\nWHEREAS, Cindy Turvy built her career on fairness and dedication to her community, being awarded the Donald R. Hallman LGBTQ+ Veterans Award earlier this year, recognizing and honoring her service in the U.S. Marine Corps, as well as her career as a public servant; and,\nWHEREAS, she continues to bring joy and connection to those around her, and her legacy acts as a pillar of strength and inspiration to the Veteran and LGBTQ+ community in Columbus; now, therefore, \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: That this Council proclaims, recognizes, and celebrates the service and civil work of Cindy Turvy.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 128,
    "meeting_date": "2024-11-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}