{
  "success": true,
  "vote": {
    "id": 10800,
    "item_number": "0",
    "title": "To amend Chapter 1163 of the Columbus City Codes to enact new electric service rates for the year beginning January 1, 2025; to repeal the existing sections being amended; to authorize the Director of the Department of Public Utilities to implement a new low income adjustment and update the senior citizen adjustment; and to add a representative of the Division of Power to the Sewer and Water Advisory Board, assign it review of electric rates, and rename it the Utility Advisory Board.",
    "description": "Explanation\nBACKGROUND\n \nThis ordinance authorizes an increase in electric rates effective January 1, 2025 for the Division of Power and amends Chapter 1163 of the Columbus City Codes, 1959.  This ordinance also authorizes the Director of the Department of Public Utilities to implement a new low income adjustment and updates the senior citizen adjustment.  Finally, this ordinance changes the Sewer and Water Advisory Board to include a representative of the Division of Power, assigns it review of electric rates, and renames it the Utility Advisory Board.\n \nThe Division of Power provides electricity services to approximately 18,000 customers, 15,000 of which are residential, and maintains approximately 55,000 street lights throughout the City.  The Division of Power purchases its power from public and private utilities and resells the electricity wholesale to its customers; it does not generate any electricity.  The Division of Power’s closest competitor locally is American Electric Power (AEP).\n \nThe Division of Power has not raised rates for the majority of their customers for over ten years.  The Division of Power customers are divided into four (4) major categories - Residential, Small Commercial, Commercial, and Industrial.  The current commercial and industrial customer rate structures for Rates 20, 20A, 22, 22A, 23P, and 23PP, and 39 have been in place since 2016 in accordance with Ordinance 2132-2015, passed November 23, 2015.  The current residential and commercial customer rate structures for Rates 10 and , 11, 23S and 31 have been in place since 2013 in accordance with Ordinance 2398-2012, passed December 3, 2012.  The current commercial and industrial customer rate structures for Rates 23P, 23S, and 31 has been in place since 2007 in accordance with Ordinance 1911-2006, passed November 20, 2006. \n \nThe Department of Public Utilities conducted a financial study that included a revenue needs assessment, a rate competitiveness assessment, cash reserve level evaluation, and a capital investment needs analysis. The study found that existing revenues are not sufficient to fund future costs. The adjustments in rates are from the study's findings and result in electric service rate increases across all residential and commercial customer classes. The ordinance makes adjustments to monthly service charges, and monthly energy and demand charges. Such changes to customer classes will allow the Division of Power to remain competitive with other public and private utilities and provide the additional revenue to invest in its infrastructure. \n \nFor residential customers, depending on rate class, they will see a new monthly bill increase between $10.26 - $15.46 $5.85 - $8.90 per month, or roughly $123.12 - $185.52 $70.17 - $106.74 per year. For small commercial class customers, depending on rate class, will see a new monthly bill increase estimated between $1.05 - $8.87 per month, or roughly $12.60 - $106.44 per year. Standard commercial customers, depending on rate class, will see a new monthly bill increase estimated between $102.13 - $119.48 per month or $1,225.67 - $1,433.76 per year. Large commercial customers, depending on rate class, will see a new monthly bill amount between $708.50 - $969.36 per month or $8,502 - $11.632.32 per year. Large commercial primary and large commercial premium will see a new monthly bill amount estimated between $6,373.09 - $28,350.11, or $76,477.08 - $340,201 per year.\n \nThe ordinance also makes changes to the Power Cost Reserve Adjustment in Section 1163.03 of the Columbus City Code. The ordinance adjusts how the power cost base is calculated and removes the codified base of $.05773. The new power cost base is the projected cost of purchase power per kWh, based on the total estimated cost of purchase power and the total estimated net electricity purchased, for the upcoming fiscal year. Since this base does not reflect the actual cost of purchased power for a given month, the monthly power cost adjustment formula is used the to adjust the power cost base to the actual cost of purchase power per kWh for a given month. Based on these adjustments, a more accurate Power Cost Base will be determined at the begin beginning of each fiscal year. The ordinance does not make changes to the Operating Reserve Allocation component of the Power Cost Reserve Adjustment. \n \nThe ordinance consolidates and eliminates various existing rate classes due to low customer participation in such rate classes. For small commercial, the ordinance eliminates rate 20A and customers currently in that class will be moved to small commercial rate 22A. For commercial, the ordinance eliminates rate 22 and rate 39 and customers currently in that class will be moved to rate 22. Rate 22P will be eliminated. For large commercial and industrial secondary electric service the ordinance eliminates rate 31 and customers currently in that class will move to KW23.  \n \nIn addition to the rate changes, to be consistent with existing sewer and water discounts, and because utility charges disproportionately effect lower income groups, the Division of Power is establishing a low income adjustment that discounts the total energy charge of their monthly bill by 25%.  The Division of Power is also updating its senior citizen adjustment to be consistent with the sewer and water programs and expanding eligibility to 200% of the federal poverty level.\n \nFinally, the Department of Public Utilities is changing the Sewer and Advisory Water Board by adding a representative of the Division of Power, assigning it review of electric rates, and renaming it the Utility Advisory Board.  This will provide consistency with the Division of Water and Division of Sewerage and Drainage rate process.  Also, the Division of Power is planning to evaluate the need for rate increases annually going forward, so this will allow for third-party review and recommendations before rate increases are presented to City Council for approval.\n \nFISCAL IMPACT: The proposed rate adjustments will generate approximately $13.4 $12.3 million in additional revenue in FY2025.\n \nTitle\n \nTo amend Chapter 1163 of the Columbus City Codes to enact new electric service rates for the year beginning January 1, 2025; to repeal the existing sections being amended; to authorize the Director of the Department of Public Utilities to implement a new low income adjustment and update the senior citizen adjustment; and to add a representative of the Division of Power to the Sewer and Water Advisory Board, assign it review of electric rates, and rename it the Utility Advisory Board.\n \nBody\n \nWHEREAS, it is necessary for the Division of Power to update electric rates, effective January 1, 2025; and\n \nWHEREAS, the Division of Power has not raised rates for the majority of its customers for over ten years; and\n \nWHEREAS, the current commercial and industrial customer rates and customer charges for Rates 23P, 23S, and 31 has been in place since 2007 in accordance with Ordinance 1911-2006, passed November 20, 2006; and\n \nWHEREAS, the current residential customer rates and customer charges for Rates 10 and 11 have been in place since 2013 in accordance with Ordinance 2398-2012, passed December 3, 2012; and\n \nWHEREAS, the current commercial and industrial customer rates and customer charges for Rates 20, 20A, 22, 22A, 23PP, and 39 have been in place since 2016 in accordance with Ordinance 2132-2015, passed November 23, 2015; and\n \nWHEREAS, the rate study concluded that the City is not competitive with other utilities in regard to its service charge, energy charge, and demand changes, and that additional capital investments are needed at the Division. \n \nWHEREAS, the adjustments to the Division of Power's customer rates and charges will result in additional revenue to support additional capital investments; and   \n \nWHEREAS, it is the recommendation of the Division of Power to make adjustments to the Power Cost Reserve Adjustment and change the formula for the Power Cost base and the frequency of updating the Power Cost Base to annually, and \n \nWHEREAS, increased water rates disproportionately impact low income residents, including senior citizens.  Low income residents already pay a higher percentage of their household income in utility bills, and this percentage would increase with higher rates; and\n \nWHEREAS, past rate increases in the City have demonstrated that increasing rates leads to increased delinquencies among the City's customers; delinquency rates are higher among low income residents.  It is well recognized that increased delinquencies are expensive for the City and its customers; and\n \nWHEREAS, adopting a discounted rate for low income users is a recognized method for helping to alleviate the impacts of increased utility rates; and\n \nWHEREAS, it is appropriate to establish a discount rate for Division of Power low income residential customers at 20% to assist those least able to manage the impacts of increased electric rates; and\n \nWHEREAS, it is appropriate to expand the existing senior citizen adjustment from 150% of the poverty level to include customers that have a total income of less than 200% of the poverty level as published by the U.S. Department of Commerce, Bureau of Census.  Also, it is appropriate to change the existing senior citizen adjustment from a percentage discount on monthly electric charges to be a waiver of the Customer Charge; and\n \nWHEREAS, the Division of Power is planning to periodically evaluate the need for rate increases going forward; and\n \nWHEREAS, the Division of Power is not currently a member of the Sewer and Water Advisory Board.  The Sewer and Water Advisory Board reviews and makes recommendations on the adequacy and proposed changes of rates for the Division of Water and Division of Sewerage and Drainage.  By adding the Division of Power as a member, it allows for third-party review and recommendations before rate increases are presented to City Council for approval and provides consistency with the Division of Water and Division of Sewerage and Drainage rate process; and\n \nWHEREAS, it is necessary and appropriate to change the composition of the Sewer and Advisory Water Board by adding a representative of the Division of Power, to assign it review of electric rates, and to rename it the Utility Advisory Board; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. City Council finds that the requested changes in rates, adjustments to the Power Cost Reserve Adjustment, low income and senior citizen adjustments, and the composition and name of the Sewer and Water Advisory Board are equitable.\n \nSECTION 2. That effective January 1, 2025, Section 1163.01 of the Columbus City Codes is hereby amended to read as follows:\nSEE ATTACHMENT 1 - SECTION 1163.01.\nSECTION 3.  That effective January 1, 2025, Section 1163.03 is hereby amended to read as follows:\nSEE ATTACHMENT 1 - SECTION 1163.03.\nSECTION 4.  That effective January 1, 2025, Section 1163.04 is hereby amended to read as follows:\nSEE ATTACHMENT 1 - SECTION 1163.04.\nSECTION 5.  That effective January 1, 2025, Section 1163.05 is hereby amended to read as follows:\nSEE ATTACHMENT 1 - SECTION 1163.05.\nSECTION 6.  That effective January 1, 2025, Section 1163.06 is hereby amended to read as follows:\nSEE ATTACHMENT 1 - SECTION 1163.06.\nSECTION 7.  That effective January 1, 2025, Section 1163.065 is hereby amended to read as follows:\nSEE ATTACHMENT 1 - SECTION 1163.065.\nSECTION 8.  That effective January 1, 2025, Section 1163.07 is hereby amended to read as follows:\nSEE ATTACHMENT 1 - SECTION 1163.07.\nSECTION 9.  That effective January 1, 2025, Section 1163.075 is hereby amended to read as follows:\nSEE ATTACHMENT 1 - SECTION 1163.075.\nSECTION 10.  That effective January 1, 2025, Section 1163.077 is hereby amended to read as follows:\nSEE ATTACHMENT 1 - SECTION 1163.077.\nSECTION 10.  That effective January 1, 2025, Section 1153.01 is hereby amended to read as follows:\nSEE ATTACHMENT 2 - SECTION 1153.01.\nSECTION 11. That the existing Sections 1163.01, 1163.03, 1163.04, 1163.05, 1163.06, 1163.065, 1163.066, 1163.07, 1163.075, 1163.077, 1163.14, and 1163.16 are hereby repealed.\nSECTION 12. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 128,
    "meeting_date": "2024-11-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Community Services",
      "Infrastructure"
    ]
  }
}