{
  "success": true,
  "vote": {
    "id": 10822,
    "item_number": "CA-17",
    "title": "To accept various deeds for parcels of real property to be used as road right-of-way; to dedicate these parcels as public rights-of-way; and to name said rights-of-way as public roadways as described within this Ordinance.  ($0.00)",
    "description": "Explanation\n1. BACKGROUND\nFrom time to time, various parcels of land are deeded to the City of Columbus for public street and/or alley purposes.  One such example when this occurs is streets included in the Columbus Thoroughfare Plan.  Streets listed within the Plan have a pre-defined amount of required right-of-way.  If that right-of-way width is lacking for a particular property, then the additional right-of-way must be deeded to the City when that property is sold or is being redeveloped.  Another example is when developers install sidewalks, turn lanes, etc., on a property within the public right-of-way.  The City requires such improvements to be located entirely within the public right-of-way.  If any part of such improvements are outside of the public right-of-way, the developer must deed that part of the land to the City.  Many of the deeded amounts are for very small pieces of land.  All of the deeded land transactions go through the City Attorney's Office.       \n \nThe Department of Public Service maintains a list of the deeded land and periodically submits the list to City Council for acceptance of the deeded land.  Ohio Revised Code Chapter 723.03 requires that property proposed for use as a public street or alley must be accepted and dedicated as public right-of-way by an ordinance specifically passed for such purpose.  This Ordinance provides for the City to accept deeds for various parcels of real property, to dedicate the parcels as road right-of-way, and to name the parcels as public roadways to comply with Ohio Revised Code Chapter 723.03.  Passage of this Ordinance also exempts the property deeded to the City from property taxes.\n \n2.  FISCAL IMPACT\nThere is no expenditure associated with this Ordinance.\n \nTitle\nTo accept various deeds for parcels of real property to be used as road right-of-way; to dedicate these parcels as public rights-of-way; and to name said rights-of-way as public roadways as described within this Ordinance.  ($0.00)\n \nBody\n \nWHEREAS, Ohio Revised Code Chapter 723.03 requires that property to be used as a public street or alley must be accepted and dedicated as public right-of-way by an ordinance specially passed for such purpose; and\n \nWHEREAS, the City of Columbus has been asked to accept various deeds for real property, to dedicate those parcels of real property for the purpose of road right-of-way, and to name said property as public roadways; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on September 25, 2024 as Instrument Number 202409250100240, Vedic Welfare Society of Columbus has deeded property to the City of Columbus, to be used as Westerville Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on September 11, 2024 as Instrument Number 202409110093073, Quicker Property Holdings LLC., has deeded property to the City of Columbus, to be used as Trabue Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on September 11, 2024 as Instrument Number 202409110093074, KDL Properties LLC., has deeded property to the City of Columbus, to be used as South High Street right-of-way; and \n                     \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on September 11, 2024 as Instrument Number 202409110093075 2112 South High LLC., has deeded property to the City of Columbus, to be used as South High Street right-of-way; and\n \nWHEREAS, by virtue of a LIMITED WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on September 11, 2024 as Instrument Number 202409110093076, CLS West Broad, LLC., has deeded property to the City of Columbus, to be used as West Broad street and Galloway Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on July 17, 2024 as Instrument Number 202407180071712, Riverside Methodist Hospital, INC., NKA Riverside United Methodist Hospital has deeded property to the City of Columbus, to be used as Olentangy River Road right-of-way; and\n                     \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on July 17, 2024 as Instrument Number 202407180071713, QT Apartments III, LLC., has deeded properties to the City of Columbus, to be used as Old Dublin Road and Dublin Road right-of-way; and\n                     \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office, on August 27, 2024 as Instrument Number 202408280087550, CRI Outparcels, LLC., has deeded property to the City of Columbus, to be used as Sawmill Road right-of-way; and \n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office, on August 27, 2024 as Instrument Number 202408280087551, K and K Rehab and Rentals LLC., has deeded property to the City of Columbus, to be used as Sullivant Avenue right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office, on August 13, 2024 as Instrument Number 202408130081443, Allison E. Kunze has deeded property to the City of Columbus, to be used as Weybridge Road right-of-way; and\n                     \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office, on August 22, 2024 as Instrument Number 202408230086215, Jaber Al Khader, LLC., has deeded property to the City of Columbus, to be used as Weber Road right-of-way; and \n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office, on July 30, 2024 as Instrument Number 202407300076287, Hospital Properties, INC., has deeded property to the City of Columbus, to be used as Olentangy River Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office, on June 24, 2024 as Instrument Number 202406250062483, Harmon Avenue LLC., has deeded property to the City of Columbus, to be used as Harmon Avenue right-of-way; and\n                     \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office, on July 24, 2024 as Instrument Number 202406250062486, Sprucecommonsplus, LLC., has deeded property to the City of Columbus, to be used as Central College Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office, on June 20, 2024 as Instrument Number 202406200061185 Columbus Business Storage, LLC., has deeded property to the City of Columbus, to be used as Scioto Darby Executive Court right-of-way; and\n                     \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office, on June 10, 2024 as Instrument Number 202406110057096, G & F Oozb LLC., has deeded property to the City of Columbus, to be used as Taylor Avenue right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office, on June 10, 2024 as Instrument Number 202406110057097, Sala Motor Freight Line, LLC., has deeded property to the City of Columbus, to be used as Georgesville Road right-of-way; and\n                     \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office, on June 06, 2024 as Instrument Number 202406060055795, Ebenezer United Methodist Church has deeded property to the City of Columbus, to be used as Westerville Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office, on June 06, 2024 as Instrument Number 202406060055796, Board of Trustees of Columbus Metropolitan Library has deeded property to the City of Columbus, to be used as Cleveland Avenue and a 20 foot un-named Alley right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office on June 06, 2024 as Instrument Number 202406060055797, Seven Properties of Ohio, LLC., has deeded property to the City of Columbus, to be used as Dyer Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office on May 24, 2024 as Instrument Number 202405240051410, Heritage Day Health Centers has deeded property to the City of Columbus, to be used as Livingston Avenue right-of-way; and\n                     \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office on May 14, 2024 as Instrument Number 202405150047349, 3501 Groveport East LLC., has deeded property to the City of Columbus to be used as Groveport Pike right-of-way; and\n                     \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office on May 14, 2024 as Instrument Number 202405150047350, Erie Land Co., LLC., have deeded property to the City of Columbus to be used as Livingston Avenue right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office on May 14, 2024 as Instrument Number 202405150047351, Riverside United Methodist Hospital NKA Ohio Health Corporation has deeded property to the City of Columbus to be used as Olentangy River Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office on May 16, 2024 as Instrument Number 202404170036939, Leaniz Real Estate Investment Trust has deeded property to the City of Columbus to be used as West Broad Street right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office on April 12, 2024 as Instrument Number 202404120035786, Trabue Links, LLC., has deeded property to the City of Columbus to be used as Trabue Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office on March 21, 2024 as Instrument Number 202403220027878, Fairmont Apartments Too LLC., has deeded properties to the City of Columbus to be used as Warner Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office on March 21, 2024 as Instrument Number 202403220027879, Fairmont Apartments LLC., has deeded property to the City of Columbus to be used as Warner Road, and Central Avenue right-of-way; and\n                     \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office on March 21, 2023 as Instrument Number 202403220027880, Koon & Kahwash Properties, LLC., has deeded property to the City of Columbus to be used as Morse Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office on February 27, 2024 as Instrument Number 2024402270019556, Stelzer Industrial LLC., has deeded property to the City of Columbus to be used as Stelzer Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office on February 27, 2024 as Instrument Number 202402270019557, Dering Family Homes Owner LLC., has deeded property to the City of Columbus to be used as Fornof Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Delaware County, Ohio Recorder’s Office on February 15, 2024 as Book 2076 Pages 1708 to 1712, Solomon Realty Company, LLC., has deeded property to the City of Columbus to be used as Polaris Parkway right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Delaware County, Ohio Recorder’s Office on February 16, 2024 as Book 2076 Pages 2184 to 2187, Polaris Shtz, LLC., has deeded property to the City of Columbus to be used as Polaris Parkway right-of-way; and\n                     \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office on February 21, 2024 as Instrument Number 202402210017582, The Pinnacleat Parkside Village LLC., have deeded property to the City of Columbus to be used as Hall Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office on February 21, 2024 as Instrument Number 202402210017583, The Reserve at Parkside Village LLC., has deeded property to the City of Columbus to be used as Galloway Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office on February 21, 2024 as Instrument Number 202402210017584, Parkside Commercial LLC., has deeded properties to the City of Columbus to be used as Hall Road and Galloway Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office on February 08, 2024 as Instrument Number 202402090013654, Campus View Holdings LLC., deeded property to the City of Columbus to be used as Campus View Boulevard right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office on February 08, 2024 as Instrument Number 202402090013655, the Sam’s Real Estate Business Trust have deeded property to the City of Columbus to be used as Westchester Woods Boulevard right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in The Franklin County, Ohio Recorder’s Office on February 08, 2024 as Instrument Number 202402090013656, Faduma Hasan has deeded property to the City of Columbus to be used as Cleveland Avenue right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office on February 08, 2024 as Instrument Number 202402090013657, Columbus Walcutt, LLC., has deeded properties to the City of Columbus to be used as Roberts Road and Walcutt Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office on February 08, 2024 as Instrument Number 202402090013658, Alkire Meadows LLC., has deeded properties to the City of Columbus to be used as Alkire Road right-of-way; and\n                     \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office on January 31, 2024 as Instrument Number 202401310010102, Pingree 2000 Real Estate Holdings, LLC., has deeded property to the City of Columbus to be used as Schrock Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office on January 25, 2024 as Instrument Number 202401250008278, Campus Hotel, LLC., has deeded property to the City of Columbus to be used as Olentangy River Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office on January 25, 2024 as Instrument Number 202401250008279, Moment 23, LLC., has deeded property to the City of Columbus to be used as North High Street right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio Recorder’s Office on January 18, 2024 as Instrument Number 2024401180005981, Oxford Park LLC., has deeded property to the City of Columbus to be used as Central College Road right-of-way; and\n \nWHEREAS, the City desires to accept these deeds for property that will be used for road right-of-way; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Vedic Welfare Society of Columbus and dedicates and names such property as Westerville Road.\n \nSECTION 2.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Quicker Property Holdings LLC., and dedicates and names such property as Trabue Road.\n \nSECTION 3.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from KDL Properties LLC., and dedicates and names such property as South High Street.\n \nSECTION 4.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from 2112 South High LLC., and dedicates and names such property as South High Street.\n \nSECTION 5.  That the City of Columbus hereby accepts the property more fully described in the previously referenced LIMITED WARRANTY DEED from CLS West Broad, LLC., and dedicates and names such property as West Broad street and Galloway Road.\n \nSECTION 6.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Riverside Methodist Hospital, INC., NKA Riverside United Methodist Hospital and dedicates and names such property as Olentangy River Road.\n \nSECTION 7.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from QT Apartments III, LLC., and dedicates and names such property as Old Dublin Road and Dublin Road.\n                     \nSECTION 8.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from CRI Outparcels, LLC., and dedicates and names such properties as Sawmill Road.\n \nSECTION 9.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from K and K Rehab and Rentals LLC., and dedicates and names such property as Sullivant Avenue.\n \nSECTION 10.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Allison E. Kunze and dedicates and names such property as Weybridge Road.\n \nSECTION 11.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Jaber Al Khader, LLC., and dedicates and names such property as Weber Road.\n                     \nSECTION 12.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Hospital Properties, INC., and dedicates and names such property as Olentangy River Road.\n \nSECTION 13.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Harmon Avenue LLC., and dedicates and names such property as Harmon Avenue.\n \nSECTION 14.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Sprucecommonsplus, LLC., and dedicates and names such property as Central College Road.\n \nSECTION 15.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Columbus Business Storage, LLC., and dedicates and names such property as Scioto Darby Executive Court.\n                     \nSECTION 16.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from G & F Oozb LLC., and dedicates and names such property as Taylor Avenue.\n \nSECTION 17.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Sala Motor Freight Line, LLC., and dedicates and names such property as Georgesville Road.\n \nSECTION 18.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Ebenezer United Methodist Church and dedicates and names such property as Westerville Road.\n \nSECTION 19.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Board of Trustees of Columbus Metropolitan Library and dedicates and names such property as Cleveland Avenue and a 20 foot un-named Alley.\n                     \nSECTION 20.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Seven Properties of Ohio, LLC., and dedicates and names such property as Dyer Road.\n \nSECTION 21.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Heritage Day Health Centers and dedicates and names such property as Livingston Avenue.\n                     \nSECTION 22.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from 3501 Groveport East LLC., and dedicates and names such property as Groveport Pike.\n \nSECTION 23.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Erie Land Co., LLC., and dedicates and names such property as Livingston Avenue.\n                     \nSECTION 24.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Riverside United Methodist Hospital NKA Ohio Health Corporation and dedicates and names such property as Olentangy River Road.\n \nSECTION 25.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Leaniz Real Estate Investment Trust and dedicates and names such property as West Broad Street.\n \nSECTION 26.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Trabue Links, LLC., and dedicates and names such property as Trabue Road.\n \nSECTION 27.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Fairmont Apartments Too LLC., and dedicates and names such property as Warner Road.\n \nSECTION 28.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Fairmont Apartments LLC., and dedicates and names such property as Warner Road, and Central Avenue.\n \nSECTION 29.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Koon & Kahwash Properties, LLC., has and dedicates and names such properties as Morse Road.\n                     \nSECTION 30.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Stelzer Industrial LLC., and dedicates and names such property as Stelzer Road.\n \nSECTION 31.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Dering Family Homes Owner LLC., and dedicates and names such property as Fornof Road.\n                     \nSECTION 32.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Solomon Realty Company, LLC., and dedicates and names such property as Polaris Parkway.\n \nSECTION 33.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Polaris Shtz, LLC., and dedicates and names such property as Polaris Parkway.\n \nSECTION 34.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from The Pinnacleat Parkside Village LLC., and dedicates and names such property as Hall Road.\n                     \nSECTION 35.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from The Reserve at Parkside Village LLC., and dedicates and names such property as Galloway Road.\n \nSECTION 36.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from the Parkside Commercial LLC., and dedicates and names such property as Hall Road and Galloway Road.\n \nSECTION 37.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from the Campus View Holdings LLC., and dedicates and names such properties as Campus View Boulevard.\n \nSECTION 38.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from the Sam’s Real Estate Business Trust and dedicates and names such property as Westchester Woods Boulevard.\n                     \nSECTION 39.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from the Faduma Hasan and dedicates and names such property as Cleveland Avenue.\n \nSECTION 40.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Columbus Walcutt, LLC. and dedicates and names such property as Roberts Road and Walcutt Road.\n \nSECTION 41.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Alkire Meadows LLC., and dedicates and names such properties as Alkire Road.\n \nSECTION 42.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Pingree 2000 Real Estate Holdings, LLC., and dedicates and names such property as Schrock Road.\n \nSECTION 43.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Campus Hotel, LLC., and dedicates and names such property as Olentangy River Road.\n \nSECTION 44.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Moment 23, LLC., and dedicates and names such properties as North High Street.\n \nSECTION 45.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from Oxford Park LLC., and dedicates and names such property as Central College Road.\n \nSECTION 46.  That all of these properties identified in Sections 1 through 45 shall be used for road right-of-way purposes.\n \nSECTION 47.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 128,
    "meeting_date": "2024-11-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Property & Real Estate",
      "Transportation"
    ]
  }
}