{
  "success": true,
  "vote": {
    "id": 10821,
    "item_number": "CA-16",
    "title": "To declare the improvements to Franklin County Tax ID Parcel Nos. 010-300599, 010-300608, and 010-300609 to be a public purpose and exempt from real property taxation pursuant to R.C. 5709.41 to establish the new Scioto Peninsula II TIF; to require the owners of those parcels to make service payments in lieu of taxes; to require the distribution of the applicable portion of those service payments to the Columbus City Schools; to establish an urban redevelopment tax increment equivalent fund for the deposit of the remainder of those non-school service payments for the purposes described herein. ($0.00)",
    "description": "Explanation\n \nBACKGROUND: The City, Downtown Columbus, Inc. (formerly Columbus Downtown Development Corporation), an Ohio not-for-profit corporation, and Scioto Peninsula Holdings Ltd. (“SPH”), an Ohio nonprofit limited liability company, entered into the Economic Development Agreement dated as of February 7, 2017 (the “EDA”) authorized by Ordinance No. 3121-2016. The EDA provides for SPH to redevelop City-owned property between Broad Street, Starling Street, Town Street, and Belle Street leased to SPH pursuant to that certain Lease Agreement dated as of July 14, 2017 authorized by Ordinance No. 0193-2017. As the urban redevelopment was contemplated to occur over one or more phases, the City, pursuant to Ordinance No. 1498-2020, established a tax increment financing area pursuant to R.C. Section 5709.40(B) (the “Scioto Peninsula TIF”) over phase one between Capital Street, Starling Street, Chapel Street, and Belle Street. The Scioto Peninsula TIF provides financing for public infrastructure improvements to those streets and alleys surrounding the leased property. \n \nIn 2025, SPH anticipates commencing phase two comprising the $120 million urban redevelopment project along Broad Street consisting of a 13-story tower, 250 multi-family units, 450 parking spaces, and 35,000 square feet of grocery. The City is engaged in urban redevelopment with SPH in support of the 2022 Downtown Strategic Plan adopted by Resolution No. 0164X-2022, and it will establish an additional tax increment financing area pursuant to R.C. Section 5709.41 (the “Scioto Peninsula II TIF”) over the remaining parcels owned or controlled by SPH and outside of the Scioto Peninsula TIF (including the aforesaid project). This Ordinance establishes the Scioto Peninsula II TIF pursuant to R.C. Section 5709.41 to provide for a one-hundred percent (100%) exemption from real property taxation on improvements to the parcels within the Scioto Peninsula II TIF for separate periods of not more than 30 years on each designated phase. Annual service payments in lieu of taxes will be made by the owners of each parcel with respect to the improvements to the Scioto Peninsula II TIF parcels. Columbus City Schools will receive, in the same manner as usual, all amounts that it would have received in real property taxes had this exemption not been granted. The applicable portion of the service payments will be distributed directly to Columbus City Schools. The remaining non-school portion of those service payments will be paid to the City for deposit into the appropriate TIF fund established by this Ordinance to be used for the purposes described in this Ordinance. \n \nFISCAL IMPACT: No funding is required for this legislation. The City is foregoing one-hundred percent (100%) of the real property tax revenue that it would have received from development of the Scioto Peninsula II TIF parcels. Instead, the non-school portion of that revenue will be diverted to the new TIF fund.\n \nTitle\n \nTo declare the improvements to Franklin County Tax ID Parcel Nos. 010-300599, 010-300608, and 010-300609 to be a public purpose and exempt from real property taxation pursuant to R.C. 5709.41 to establish the new Scioto Peninsula II TIF; to require the owners of those parcels to make service payments in lieu of taxes; to require the distribution of the applicable portion of those service payments to the Columbus City Schools; to establish an urban redevelopment tax increment equivalent fund for the deposit of the remainder of those non-school service payments for the purposes described herein. ($0.00)\n \nBody\n \nWHEREAS, the City, Downtown Columbus, Inc. (formerly Columbus Downtown Development Corporation), an Ohio not-for-profit corporation, and Scioto Peninsula Holdings Ltd. (“SPH”), an Ohio nonprofit limited liability company, entered into the Economic Development Agreement dated as of February 7, 2017 (the “EDA”) authorized by Ordinance No. 3121-2016; and\n \nWHEREAS, the EDA provides for SPH to redevelop City-owned property between Broad Street, Starling Street, Town Street, and Belle Street leased to SPH pursuant to that certain Lease Agreement dated as of July 14, 2017 authorized by Ordinance No. 0193-2017; and\n \nWHEREAS, since the urban redevelopment was contemplated to occur over one or more phases, the City, pursuant to Ordinance No. 1498-2020, established a tax increment financing area pursuant to R.C. Section 5709.40(B) (the “Scioto Peninsula TIF”) over phase one between Capital Street, Starling Street, Chapel Street, and Belle Street; and\n \nWHEREAS, the Scioto Peninsula TIF provides financing for public infrastructure improvements to those streets and alleys surrounding the leased property; and \n \nWHEREAS, in 2025, SPH anticipates commencing phase two comprising the $120 million urban redevelopment project along Broad Street consisting of a 13-story tower, 250 multi-family units, 450 parking spaces, and 35,000 square feet of retail and grocery; and \n \nWHEREAS, the City is engaged in urban redevelopment with SPH in support of the 2022 Downtown Strategic Plan adopted by Resolution No. 0164X-2022, and it will establish an additional tax increment financing area pursuant to R.C. Section 5709.41 (the “Scioto Peninsula II TIF”) over the remaining parcels outside of the Scioto Peninsula TIF that are currently owned or controlled by SPH (including the aforesaid project), as depicted on Exhibit A attached hereto (the “Parcels”); and\n \nWHEREAS, pursuant to R.C. Section 5709.41(B), which requires the City to hold or have held fee title to the Parcels prior to enacting this Ordinance and to convey or lease the Parcels prior to or after enacting this Ordinance, the City holds or held  fee title to the Parcels (not including the aforesaid parcel) via deeds recorded with the Franklin County Recorder’s Office as Instrument Nos. 200604060064791, 199911050279096, 200102070025151, 200002140030136, 200501180010020, 200210300275287, 200501070005473, 200210300275283, 200210300275285, 200302180048418, 201812270173969, and 201912170169651 (collectively, the “Deeds”) and leased Franklin County Tax ID Parcel Nos. 010-300599, 010-300608, and 010-300609 in 2020 via a Memorandum of Lease, as amended by its first and second amendments, recorded with the Franklin County Recorder’s Office as Instrument Nos. 201707200099614, 202001090003812, and 202001160007289 (collectively, the “Lease”); and\n \nWHEREAS, this Council has determined that it is necessary and appropriate and in the best interest of the City to exempt from taxation one hundred percent (100%) of the improvements to each of the Parcels  as permitted and provided for in R.C. Sections 5709.41, 5709.42, and 5709.43 (the “TIF Statutes”) for separate periods of up to thirty (30) years for each phase of urban redevelopment, as depicted on Exhibit A attached hereto (collectively, the “Phases,” and individually, a “Phase”), and to simultaneously direct and require the current and future owner(s) of each of the Parcels (each such owner individually, an “Owner,” and collectively, the “Owners”) to make annual service payments in lieu of taxes, including any penalties and interest (collectively, the “Service Payments”), in the same amount as they would have made real property tax payments but for the exemption provided by this Ordinance; and\n \nWHEREAS, the City has determined that a portion of the Service Payments shall be paid directly to the Columbus City School District (the “School District”) in an amount equal to the real property taxes that School District would have been paid if the improvement to each of the Parcels located within that School District had not been exempt from taxation pursuant to this Ordinance; and\n \nWHEREAS, pursuant to R.C. Section 5709.43(B), this Council has determined to establish an urban redevelopment tax increment equivalent fund in which there shall be deposited the remaining non-school Service Payments distributed to the City as provided herein; and\n \nWHEREAS, notice of this proposed Ordinance has been delivered to the Board of Education of the School District in accordance with and within the time periods prescribed in R.C. Sections 5709.41 and 5709.83; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSection 1. Parcels of the Scioto Peninsula II TIF. That the Parcels, as currently or subsequently configured, subject to this Ordinance are identified and depicted on Exhibit A. Pursuant to the TIF Statutes, the Parcels will be included in a new tax increment financing area known hereafter as the Scioto Peninsula II TIF the boundaries of which shall correspond with the boundary of, and shall include, the Parcels.\n \nSection 2. Urban Redevelopment and Chain of Title. That this Council finds that the City is engaged in urban redevelopment pursuant to the 2022 Downtown Strategic Plan adopted October 3, 2022 (the “Plan”); that the City holds or held fee title to Franklin County Tax ID Parcel Nos. 010-300599, 010-300608, and 010-300609 (the “Leased Parcels”) prior to 2020 and passage of this Ordinance via the Deeds and entered into a long term lease in 2020 for the Leased Parcels via the Lease.\n \nSection 3. Exemption. That pursuant to R.C. Section 5709.41, this Council hereby finds and determines that one-hundred percent (100%) of the increase in assessed value, i.e. market value, of the Leased Parcels subsequent to the adoption of the Plan in 2022  (which such increases in assessed value, i.e. market value, are hereinafter referred to as the “Improvement” as defined in R.C. Section 5709.41(A)) are hereby declared to be a public purpose and exempt from taxation for a period commencing on January 1st of the tax year in which at least an aggregate of five million dollars ($5,000,000) of Improvement based on the assessed value, i.e. market value, would appear on the tax list and duplicate for such tax year for each such Phase (the intent that each Phase be one of two separate Phases exempt for separate 30 year terms as depicted on Exhibit A) were it not for the exemption granted by this Ordinance and ending on the earlier of: (a) thirty (30) years after such commencement or (b) the date on which the City can no longer require service payments in lieu of taxes, all in accordance with the requirements of the TIF Statutes (the “TIF Exemption”). The TIF Exemption provided by this Ordinance is subordinate to any exemption for a Parcel granted pursuant to R.C. Section 3735.65 et. seq. (community reinvestment area), R.C. Section 5709.61 et. seq. (enterprise zone) and R.C. Section 5709.08 (government and public property) (collectively, the “Authorized Superior Exemptions”). In accordance with R.C. Section 5709.911(B), by this duly enacted Ordinance, this Council provides its duly authorized written consent to any Authorized Superior Exemptions to the Parcels applied for after the TIF Exemption.\n \nSection 4. Service Payments. That as provided in R.C. Section 5709.42, each Owner and collectively the Owners are hereby required to make the Service Payments with respect to the Improvement allocable to each Parcel to the Franklin County Treasurer or its designee on or before the final dates for payment of real property taxes. The Service Payments will be charged and collected in the same manner and in the same amount as the real property taxes that would have been charged and collected against that Improvement if it were not exempt from taxation pursuant to this Ordinance. The Service Payments, and any other payments with respect to each Improvement that are received in connection with the reduction required by R.C. Sections 319.302, 321.24, 323.152 and 323.156, as the same may be amended from time to time, or any successor provisions thereto as the same may be amended from time to time (the “Property Tax Rollback Payments”), will be deposited and distributed in accordance with this Ordinance.\n \nSection 5. TIF Fund. That this Council establishes, pursuant to and in accordance with the provisions of R.C. Section 5709.43, the Scioto Peninsula II Urban Redevelopment Tax Increment Equivalent Fund (the “Scioto Peninsula II TIF Fund,” or the “TIF Fund”) into which the appropriate Service Payments and Property Tax Rollback Payments collected with respect to the Parcels and not required pursuant to this Ordinance to be distributed to the School District will be deposited to the City. The TIF Fund will be maintained in the custody of the City. The City may use amounts deposited into the TIF Fund only for the purposes authorized in the TIF Statutes and this Ordinance (as it may be amended). The TIF Fund will remain in existence so long as the Service Payments and Property Tax Rollback Payments are collected and used for the aforesaid purposes, after which time the TIF Fund will be dissolved and any surplus funds remaining therein transferred to the City's General Fund, all in accordance with R.C. Section 5709.43.\n \nSection 6. Distributions; Payment of Costs. Pursuant to the TIF Statutes, the Franklin County Treasurer is requested to distribute the Service Payments and Property Tax Rollback Payments as follows:\n \na.                     To the School District, an amount equal to the amount the School District would otherwise receive as real property tax payments (including the applicable portion of any Property Tax Rollback Payments) derived from the Improvement to each Parcel if the Improvement had not been exempt from taxation pursuant to this Ordinance.\n \nb.                     To the City, all remaining amounts for further deposit into the TIF Fund for payment of costs of urban redevelopment, including, without limitation, to pay debt charges on any securities of or loans undertaken to pay or to reimburse financing costs of those costs of urban redevelopment.\n \nAll distributions required under this Section are to be made at the same time and in the same manner as real property tax distributions. \n \nSection 7. Further Authorizations. This Council hereby authorizes the Director of the Department of Development, the City Clerk, or other appropriate officers of the City (or each’s designee) to deliver a copy of this Ordinance to the Ohio Development of Development and to make such arrangements as are necessary and proper for collection of the Service Payments and Property Tax Rollback Payments. This Council further authorizes the Director of the Department of Development, the City Clerk, the City Attorney, or other appropriate officers of the City (or each’s designee) to prepare and sign all agreements and instruments and to take any other actions as may be appropriate to implement this Ordinance.\n \nSection 8. Effective Date. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 128,
    "meeting_date": "2024-11-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Economic Development",
      "Property & Real Estate"
    ]
  }
}