{
  "success": true,
  "vote": {
    "id": 10847,
    "item_number": "CA-42",
    "title": "To authorize the Director of the Department of Public Utilities to enter into a contract with Northeast-Western Energy Systems USA LLC for a service, maintenance and support contract for the Division of Sewerage and Drainage under the City’s sole source procurement provision; and to authorize the expenditure of up to $522,400.00 from the Sewerage and Drainage Operating Fund; and to declare an emergency. ($522,400.00)",
    "description": "Explanation     \n \nBACKGROUND: This legislation authorizes the Director of the Department of Public Utilities to enter into a service contract with Northeast-Western Energy Systems USA LLC for the two large biogas cogeneration engines at the Jackson Pike Wastewater Treatment Plant in an amount of up to $522,400.00. The engines are being installed as part of a CIP project and will need on-going support, maintenance and repair to maintain peak performance. This long term service contract supports the equipment during the payback period. \n \nThis contract will provide for a ten year service contract with Northeast-Western Energy Systems USA LLC (NES) to perform routine maintenance and repair for Jenbacher engines, including but not limited to oil and coolant changes, vibration analysis, emissions testing, minor overhauls, major overhauls and purchasing of additional mechanical components. The contract will also include field services, remote engineering support and remote monitoring services by the vendor, including life cycle historical data, live access to current alarms, operation conditions and remote start and stop capabilities. Additionally, Northeast-Western Energy Systems USA LLC is the sole source provider in the northeastern United States for Jenbacher parts, warranty, factory authorized maintenance and repair as provided under this contract. \n \nIf unforeseen issues or difficulties are encountered that would require additional funding, a modification would be required.\n \nSOLE SOURCE PROCUREMENT: Northeast-Western Energy Systems USA LLC is the only factory authorized provider in the northeastern United States for Jenbacher parts, warranty and factory authorized maintenance. A proposal was received for the services that will be provided.\n \nCONTRACT AMOUNTS/TIMELINE\nThis Contract will remain in force for one (1) year from the construction completion date (estimated to be December 2024) by the City of Columbus with the option to renew annually for nine (9) additional one (1) year periods upon mutual agreement between the parties, availability of budgeted funds and approval by City Council. If unforeseen issues or difficulties are encountered that would require additional funding, a modification would be requested. \n \nThe agreement cost will increase on an annual basis on the basis of an agreed upon Consumer Price Index (CPI), not to exceed 5% annually for the initial three (3) year period. In the calculated total contract value below, a 5% CPI was used over the 10 year period.\n \nCost summary: \nOriginal Contract - Year 1:                                 $522,400.00\n*Renewal/Modification - Year 2:                         $548,520.00 (estimated amount)\n*Renewal/Modification - Year 3:                         $575,946.00 (estimated amount)\n*Renewal/Modification - Year 4:                         $604,743.30 (estimated amount)\n*Renewal/Modification - Year 5:                         $634,980.47 (estimated amount)\n*Renewal/Modification - Year 6:                         $666,729.49 (estimated amount)\n*Renewal/Modification - Year 7:                         $700,065.96 (estimated amount)\n*Renewal/Modification - Year 8:                         $735,069.26 (estimated amount)\n*Renewal/Modification - Year 9:                         $771,822.72 (estimated amount)\n*Renewal/Modification - Year 10:                       $810,413.86 (estimated amount)\nEstimated Contract Total:                                               $6,570,691.06\n \nSUPPLIER / CONTRACT COMPLIANCE INFORMATION\nNortheast-Western Energy Systems USA LLC, cc #050767, expires (pending)\n \nThe certification of Northeast-Western Energy Systems USA LLC was in good standing at the time of the contract award. The company is not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search. \n \nMINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM: This contract opportunity was submitted to the City’s Office of Diversity and Inclusion (ODI) for review an MBE/WBE goal.  ODI determined there was not an opportunity for MBE/WBE participation in this contract and did not assign a goal due to the proprietary nature of the equipment. This contract will not be implemented with a City of Columbus MBE/WBE Program goal and the requirements of the City’s MBE/WBE Program are not applicable to this contract. The anticipated MBE/WBE spend for this project is 0%. There are no subcontractors on this project.\n \nEMERGENCY DESIGNATION: The Department of Public Utilities respectfully requests this legislation be considered emergency to have the service contract in place once the project is completed (estimated in December).\n \nFISCAL IMPACT\n$522,400.00 funds are budgeted and available for this expenditure \n$0.00 was spent in 2023\n$0.00 was spent in 2022 \n \n \nTitle\n \nTo authorize the Director of the Department of Public Utilities to enter into a contract with Northeast-Western Energy Systems USA LLC for a service, maintenance and support contract for the Division of Sewerage and Drainage under the City’s sole source procurement provision; and to authorize the expenditure of up to $522,400.00 from the Sewerage and Drainage Operating Fund; and to declare an emergency. ($522,400.00) \n \n \nBody\n \nWHEREAS, the Department of Public Utilities is in process of installing two large cogeneration engines as part of a CIP project; and\n \nWHEREAS, the engines will require on-going support, maintenance and service to maintain the performance; and\n \nWHEREAS, Northeast-Western Energy Systems USA LLC is currently is the sole provider of Jenbacher parts, factory authorized maintenance and service in the northeastern United States; and\n \nWHEREAS, due to the proprietary nature, it is necessary to enter into this contract with Northeast-Western Energy Systems USA LLC in accordance with the sole source provisions of Chapter 329 of the Columbus City Codes; and\n \nWHEREAS, it is necessary to authorize the expenditure of $522,400.00 or so much thereof as is needed for the purchase from and within the Sewerage and Drainage Operating Fund; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Utilities in that it is immediately necessary to authorize the Director of Public Utilities to enter into contract with Northeast-Western Energy Systems USA LLC for ongoing support, maintenance and service and to have a service contract in place once the project is completed (estimated in December) in accordance with the terms, conditions of the proposal on file, all for the immediate preservation of the public health, peace, property, safety and welfare; and NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Utilities be and is hereby authorized to enter into a contract with Northeast-Western Energy Systems USA LLC for on-going support, maintenance and service pursuant to the sole source provisions of City Code, as it is the sole provider of support, maintenance and repair of Jenbacher engines in the northeastern United States.\n \nSECTION 2. That this contract is in accordance with the relevant provisions of Chapter 329 of City Code.\n \nSECTION 3. That the expenditure of $522,400.00 or as much thereof as may be needed, is hereby authorized in Fund 6100 (Sanitary Sewer Operating); in Object Class 03 Services per the accounting codes in the attachment to this ordinance.\n \nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 128,
    "meeting_date": "2024-11-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}