{
  "success": true,
  "vote": {
    "id": 1085,
    "item_number": "CA-42",
    "title": "To appropriate and authorize the expenditure of $4,730.27 from the Old Dublin Road Public Improvement Equivalent Fund (7467) to the Tolles Career & Technical Center; to authorize the Director of Development to enter into a school compensation agreement with Tolles Career & Technical Center; and to declare an emergency. ($4,730.27)",
    "description": "Explanation\nBACKGROUND: Pursuant to Ohio Revised Code (“R.C.”) Section 5709.40 to 5709.43 and as authorized by Ordinance 1237-2015, Council established the non-school Old Dublin Road TIF, required those property owners to make service payments, and established the Old Dublin Road Public Improvement Equivalent Fund (the “Old Dublin Road TIF Fund”) for the deposit of those service payments. The Old Dublin Road TIF was later expanded by Ordinance 3168-2019. R.C. Section 5709.42 requires the service payments to be collected in the same manner as real property taxes and to distribute those service payments to the applicable municipal corporation and school districts. However, unlike for city, local, or exempted village school districts, R.C. Section 5709.42 does not specify if the county treasurer or the municipal corporation is responsible for the distribution of the service payments to a public joint vocational school district (a “JVS”). The county treasurer distributed JVS service payments to the City unbeknownst to it. This legislation appropriates and authorizes the expenditure of service payments from the Old Dublin Road TIF Fund to the Tolles Career & Technical Center (“Tolles”), and authorizes the Director of Development to enter into a school compensation agreement with Tolles in order to come to terms on the remittance of JVS service payments to Tolles that were first distributed by the county treasurer to the City for deposit in the Old Dublin Road TIF Fund.\n \nEMERGENCY JUSTIFICATION: Emergency action is requested in order to minimize the fiscal impact and to expedite payment to Tolles to compensate them for their service payments distributed by the county treasurer to the City.\n \nFISCAL IMPACT: The City will remit $4,730.27 from the Old Dublin Road Public Improvement Equivalent Fund (7467) to Tolles.\n \nTitle\nTo appropriate and authorize the expenditure of $4,730.27 from the Old Dublin Road Public Improvement Equivalent Fund (7467) to the Tolles Career & Technical Center; to authorize the Director of Development to enter into a school compensation agreement with Tolles Career & Technical Center; and to declare an emergency. ($4,730.27)\n \nBody\nWHEREAS, pursuant to Ohio Revised Code Sections 5709.40 to 5709.43 (the “TIF Statutes”) and as authorized by Ordinance 1237-2015 passed June 8, 2015 (the “2015 Ordinance”), this Council established the non-school Old Dublin Road tax increment financing area with a 100% exemption for thirty (30) years (the “2015 TIF Exemption”), required the property owners in the Old Dublin Road TIF area to make service payments in lieu of taxes (the “Service Payments”) on exempted improvements, and established the Old Dublin Road Public Improvement Equivalent Fund (the “TIF Fund”) to receive those Service Payments; and \n \nWHEREAS, pursuant to Ordinance No. 3168-2019 passed on December 16, 2019 (the “2019 Ordinance”), the 2015 Ordinance was subsequently amended to one-hundred percent (100%) exempt improvements on additional parcels during a separate 30-year term from the 2015 TIF Exemption (the “2019 TIF Exemption”) and required those additional Service Payments from the 2019 TIF Exemption to be deposited into the TIF Fund; and\n \nWHEREAS, pursuant to Section 5709.42 of the TIF Statutes, moneys collected as Service Payments from the 2015 TIF Exemption and the 2019 TIF Exemption shall be distributed by the county treasurer at the same time and in the same manner as real property tax payments to be distributed to the municipal corporation and to the city, local, or exempted village school district in which the exempted improvements are located; and \n \nWHEREAS, the school Service Payments shall be in an amount equal to the property tax payments the school district would have received from the portion of the improvements exempted from taxation had the improvements not been exempted, as directed in the ordinances establishing the tax increment financing (“TIF”); and\n \nWHEREAS, pursuant to the 2015 Ordinance and the 2019 Ordinance, the City requested the Franklin County, Ohio Treasurer’s Office (the “County Treasurer”), at the same time and in the same manner as real property tax payments, to distribute the school Service Payments to the city, local, or exempted village school district and the public joint vocational school district (the “JVS”) in which the exempted improvements are located in an amount equal to the property tax payments the school districts would have received from the portion of the improvements exempted from taxation had the improvements not been exempted; and\n \nWHEREAS, since Section 5709.42 of the TIF Statutes does not specify if a county treasurer or the municipal corporation is the entity responsible for distributing the school Service Payments to a JVS, a county treasurer may and did distribute JVS Service Payments to the City for remittance to a JVS; and\n \nWHEREAS, it is now necessary to appropriate and authorize the expenditure of JVS Service Payments in the amount of $4,730.27 (the “Compensation”) from the TIF Fund (7467); and\n \nWHEREAS, it is necessary and appropriate to authorize the Director of Development to enter into a school compensation agreement(the “Agreement”) with Tolles Career & Technical Center to provide for the remittance of the Compensation to Tolle s Career & Technical Center; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to authorize the Agreement for payment of the Compensation to the Tolles Career & Technical Center to minimize the fiscal impact thereby preserving the public health, peace, prosperity, safety and welfare; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That from the unappropriated monies and from all monies estimated to come into the Old Dublin Road Public Improvement Equivalent Fund (7467) from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2021, the sum of $4,730.27 is appropriated in the Old Dublin Road Public Improvement Equivalent Fund (7467), Dept-Div 44-02 (Economic Development), Project P467001-100000, in Object Class 05 (Other Expenditures), per the accounting codes in the attachment to this ordinance.\n \nSECTION 2. That for the purpose stated herein the expenditure is hereby authorized in the amount of $4,730.27 or so much thereof as may be needed, in the Old Dublin Road Public Improvement Equivalent Fund (7467), Dept-Div 44-02 (Economic Development), Project P467001-100000, in Object Class 05 (Other Expenditures), per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That the City Auditor is authorized to make payments from Fund 7467 in accordance with the Agreement, defined herein, upon order of the Director or his or her designee and that no order shall be drawn or money paid except by voucher, the form of which shall be approved by the City Auditor.\n \nSECTION 4. That the Director of the Development (the “Director”), for and in the name of the City, is hereby authorized to execute a school compensation agreement (the “Agreement”) presently on file with the Director along with any changes or amendments thereto not inconsistent with this Ordinance and not substantially adverse to the City and which shall be approved by the Director and the City Attorney, and the character of those changes and amendments as not being substantially adverse to the City, shall be evidences conclusively by the Director’s execution and delivery thereof.\n \nSECTION 5. That the Director or other appropriate officers of the City are authorized to execute such other agreements and instruments, subject to approval by the City Attorney’s Office, and to take all actions as may be necessary to implement this Ordinance and the transactions contemplated by the Agreement.\n \nSECTION 6. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 7. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 8.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 9. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in full force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 17,
    "meeting_date": "2021-06-14",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}