{
  "success": true,
  "vote": {
    "id": 10901,
    "item_number": "CA-7",
    "title": "To authorize the Director of the Department of Finance and Management to enter into two (2) Universal Term Contracts for the option to purchase Traffic Control Devices with Bain Enterprises, LLC and All in Safety Corp.; to authorize the expenditure of $2.00; and to declare an emergency. ($2.00).",
    "description": ". .Explanation\n \nBACKGROUND:  This legislation authorizes the Finance and Management Director to establish two (2) Universal Term Contracts (UTC) for the option to purchase Traffic Control Devices with Bain Enterprises, LLC and All in Safety Corp.  The Division of Traffic Management is the primary user for traffic control products.  Traffic cones, snow barriers, and barricades are used to assist with traffic flow and road construction around the City. The term of the proposed option contracts would be approximately two (2) years, expiring October 31, 2026, with the option to renew for one (1) additional year.  The Purchasing Office opened formal bids on July 18, 2024. In addition, the expenditure of $2.00 is hereby authorized from General Budget Reservation BRPO002726.                     \n \nThe Purchasing Office advertised and solicited competitive bids in accordance with the relevant provisions of Section 329.18 relating to competitive bidding (Request for Quotation No. RFQ028025). Two (2) bids were received.  \n \nThe Purchasing Office is recommending award to the overall lowest, responsive, responsible and best bidders as follows:\n \nBain Enterprises, LLC, CC# 011176 expires 10/21/2026, Items# 7-21, 26 & 29-33, $1.00\nAll in Safety Corp., CC# 014737 expires 10/30/2026, Items# 1-5 & 22, $1.00\nThere were no bids received on items# 6, 23-25 & 27-28. These items will need to be sourced through informal bidding.  \nTotal Estimated Annual Expenditure: $50,000.00, Division of Traffic Management, the primary user\n \nEmergency Designation:  The Finance and Management Department respectfully requests this legislation to be considered an emergency ordinance because product will not be available on any existing contracts.\n \nThe companies are not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.   \n \nFISCAL IMPACT: The expenditure of $2.00 is hereby authorized from General Budget Reservation BRPO002726.   City Agencies will be required to obtain approval to expend from their own appropriations for their estimated annual expenditures.  \n \nTitle\n \nTo authorize the Director of the Department of Finance and Management to enter into two (2) Universal Term Contracts for the option to purchase Traffic Control Devices with Bain Enterprises, LLC and All in Safety Corp.; to authorize the expenditure of $2.00; and to declare an emergency. ($2.00).\n \nBody\n \nWHEREAS, the Traffic Control Devices UTC will provide for the purchase of traffic cones, street barricades, snow fences and various styles of flags that are used to assist with directing traffic during construction; and,  \n \nWHEREAS, the Purchasing Office advertised and solicited formal bids on July 18, 2024 and selected the overall lowest, responsive, responsible and best bidders; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service to ensure these items are readily available for purchase for the Division of Traffic Management in that it is necessary to authorize the Finance and Management Director to immediately enter into two (2) Universal Term Contracts for the option to purchase Traffic Control Devices, all for the immediate preservation of the public health, peace, property, and safety; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Finance and Management is hereby authorized to enter into the following Universal Term Contracts for the option to purchase Traffic Control Products in accordance with Request for Quotation RFQ028025 for a term of approximately two (2) years, expiring October 31, 2026, with the option to renew for one (1) additional year, as follows:\n \nBain Enterprises, LLC, Items# 7-21, 26 & 29-33, $1.00\nAll in Safety Corp., Items# 1-5 & 22, $1.00\n \nSECTION 2. That the expenditure of $2.00 is hereby authorized from General Budget Reservation BRPO002726 of this ordinance to pay the cost thereof.\n \nSECTION 3.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That for the reason stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 129,
    "meeting_date": "2024-12-09",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}