{
  "success": true,
  "vote": {
    "id": 10937,
    "item_number": "CA-43",
    "title": "To authorize the Director of the Department of Public Service to enter into agreements with and to accept payments from VeoRide, Inc. relative to the Columbus and Central Ohio Shared Mobility Program; and to declare an emergency. ($0.00)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Service, or a designee, to enter into agreements with VeoRide, Inc. dba Veo and to accept payments from the same relative to the Columbus and Central Ohio Shared Mobility Program.\n \nThe intent of this contract is to provide the City of Columbus, Department of Public Service, and its regional partners with the ability to implement, manage and operate a shared micromobility system. Currently, the micromobility program consists of two primary elements: a permit application for dockless devices, such as e-scooters, regulated by Shared Mobility Devices (SMD) rules and regulations, and a City-owned traditional docked bike share system known as CoGo. \nThe Department of Public Service and its regional partners desire to operate a shared mobility program in a strategic, financially sustainable, and collaborative partnership to provide a positive user experience and advance broader goals related to equity, sustainability, economic development, and community livability. The goal of the program is to expand a safe and organized shared mobility program for residents, employees, and visitors while being mindful of accessibility for all users of public space. This includes targeted equity strategies to provide transportation options for residents who do not have a vehicle or who require more robust options to reduce their vehicle dependency.  \nThe Department of Public Service, Office of Support Services, issued a Request for Proposals for the shared mobility program.  The project was formally advertised on the Vendor Services and Bonfire web site from June 27, 2024, to September 12, 2024.  The City received six (6) responses.  All proposals were deemed responsive and were fully evaluated when the Evaluation Committee met on September 19, 2024.  The three highest scoring firms, Lime, Spin, and Veo, were then invited to interview with the Evaluation Committee between October 10, 2024 and October 21, 2024. Based on those interviews, the Evaluation Committee narrowed the field down to two firms: Spin and Veo, and both firms were sent additional questions to answer via email. After the answers to the final questions were provided, the Evaluation Committee met to discuss those responses on October 31, 2024, and the scores of the three firms interviewed were adjusted based on the presentations and interviews. The responding firms were:  \nCompany Name                                               City/State                                 Majority/MBE/MBR/F1/AS1/PHC\nNeutron Holdings Inc. dba Lime                                           Worthington, OH                     Majority\nDrop Mobility                                                                                    San Francisco, CA                     Unknown\nPheenix USH LLC, dba Spin                                          Winnetka, IL                                          Unknown\nTandem Mobility LLC                                                               Northville, MI                                          Unknown\nTrip Technology                                                               Columbus, OH                                          Majority\nVeoRide Inc. dba Veo                                                               Santa Monica, CA                     MBE\n \nVeo received the highest score from the Evaluation Committee and will be awarded the Shared Mobility Program contract. \n \nPursuant to a proposed revenue sharing agreement, Veo would be obligated to pay the Department of Public Service an annual per device fee and an additional per trip revenue share for rides initiated within City limits. It may also be necessary for Public Service and Veo to execute a separate service level agreement or other instruments outlining the logistics of the program. Similar agreements will be executed between Veo and the cities of Dublin and Upper Arlington and Ohio State University. Other participating municipalities and regional partners also will be invited and encouraged to execute similar agreements as part of a comprehensive system. \n \nAdditionally, Veo has committed to make certain infrastructure improvements necessary to the successful operation of a shared mobility program at no cost to the City or its regional partners and to improve device parking solutions in order to address concerns related to obstructing sidewalks and ADA curb ramps. \n \nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against Veo.\n \n2.  CONTRACT COMPLIANCE\nVeoRide Inc’s contract compliance number is CC 049938 and expires August 1, 2026.  \n \n3.  FISCAL IMPACT\nNo funding is required to support this contract is not required as Veo has agreed to bear any and all costs associated with or expenses incurred during the provision of services, including all operations and maintenance costs and expenses, and to share a portion of the revenue it generates generated with the Department of Public Service pursuant to the terms of the proposed revenue sharing agreement.\n \n4. EMERGENCY DESIGNATION\nEmergency action is requested so implementation of the project can start at the beginning of 2025, to align with the expiration date of the current SMD permits, and to ensure a more seamless transition for the traveling public.\n \nTitle\nTo authorize the Director of the Department of Public Service to enter into agreements with and to accept payments from VeoRide, Inc. relative to the Columbus and Central Ohio Shared Mobility Program; and to declare an emergency. ($0.00)\n \nBody\nWHEREAS, the City of Columbus, Department of Public Service, and its regional partners desire to establish and operate a safe and organized shared mobility program for residents, employees, and visitors in Columbus and neighboring communities while being mindful of accessibility for all users of public space; and\n \nWHEREAS, the Department of Public Service, Office of Support Services, recently issued a Request for Proposals for the Columbus and Central Ohio Shared Mobility Program; and\n \nWHEREAS, VeoRide, Inc. dba Veo submitted the best overall proposal for this project; and\n \nWHEREAS, this legislation seeks to authorize the Director of Public Service, or a designee, to enter into a revenue sharing agreement and any other instrument as may be necessary, including potentially a separate service level agreement, with VeoRide, Inc. to facilitate the establishment and operation of a shared mobility program under an exclusive provider model; and\n \nWHEREAS, pursuant to the terms of the executed agreement(s), Veo would be obligated to pay the Department of Public Service an annual per device fee and an additional per trip revenue share for rides initiated within City limits and to make certain infrastructure and technological improvements necessary to the successful operation of a shared mobility program at no cost to the City; and \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to authorize the passage of this legislation so implementation of the project can start at the beginning of 2025, to align with the expiration date of the current SMD permits, and to ensure a more seamless transition for the traveling public, all for the immediate preservation of the public health, peace, property, and safety; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Public Service be, and hereby is, authorized to enter into a revenue sharing agreement and any other instrument as may be necessary, including potentially a separate service level agreement, with VeoRide, Inc. dba Veo, of 1334 Third Street Promenade, Suite 300, Santa Monica, California 90401, to facilitate the successful implementation and operation of the Columbus and Central Ohio Shared Mobility Program and to accept payments from Veo relative to that program.\n \nSECTION 2.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 129,
    "meeting_date": "2024-12-09",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Emergency Services",
      "Public Works"
    ]
  }
}