{
  "success": true,
  "vote": {
    "id": 11060,
    "item_number": "0",
    "title": "To authorize the Director of Public Utilities to enter into an agreement with Thomas Scientific LLC for drinking water pitchers, for the Division of Water; to authorize the transfer of $92,260.00 between object classes in the Water Operating Fund; and to authorize the expenditure of $92,260.00 within the Water Operating Fund. ($92,260.00)",
    "description": "Explanation\n \nBACKGROUND:  This ordinance authorizes the Director of Public Utilities to enter into an agreement with Thomas Scientific LLC for drinking water pitcher filters and authorizes a fund transfer within the Water Operating Fund. \nThis will provide 2800 new, unused and the most current model drinking water pitcher filters to customers after replacing a lead service line; this will comply with Ohio EPA rules. \nPROCUREMENT:\nThe Department of Public Utilities solicited competitive bids through the Vendor Services from October 8, 2024 to November 21, 2024 for drinking water pitcher filters in accordance with the relevant provisions of Chapter 329 of City Code (RFQ028917). Four (4) bids, all by majority vendors, were received. After evaluation of the bids, the Division of Water has determined the bid from Thomas Scientific LLC as the lowest, responsive, responsible, and best bidder.\n \nThe following bids were received: \n \n    Name                                                   Bid Amount________City/State                  Status                     \n1.Ferguson Enterprises Inc.                                 $93,324.00              Boston, MA                     MAJ\n2.Thomas Scientific LLC.                                                  $92,260.00                          Swedesboro, NJ                MAJ\n3.Safaricross LLC.                                                                $148,120.00                          Westerville, OH                              MAJ\n4.TruePani Inc.                                                                                    $117,600.00                          Knoxville, TN                              MAJ\n \nSUPPLIER / CONTRACT COMPLIANCE\nThomas Scientific LLC, cc # 026078, expires 3/23/2025.\nThe company is not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.\n \nFISCAL IMPACT: This is an annual expenditure and the Division of Water has allocated $92,260.00 for this project in the 2024 operating budget. However, other unexpected or overbudget expenditures within the division have resulted in an object class 02 fund balance less than this amount. $92,260.00 will be transferred between object classes within the Water Operating Fund to support the purchase of these drinking water pitcher filters. There is sufficient budget authority available in the 2024 Water Operating Fund's Budget to fund the transfer. \n$0 was spent for this project in 2023.\n$0 was spent for this project in 2022.\n \n \nTitle\n \nTo authorize the Director of Public Utilities to enter into an agreement with Thomas Scientific LLC for drinking water pitchers, for the Division of Water; to authorize the transfer of $92,260.00 between object classes in the Water Operating Fund; and to authorize the expenditure of $92,260.00 within the Water Operating Fund. ($92,260.00)\n \n \nBody\n \nWHEREAS, it is necessary to authorize the Director of the Department of Public Utilities to enter into contract with Thomas Scientific LLC for drinking water pitcher filters ; andWHEREAS, the Department of Public Utilities opened formal bids on October 8th, 2024; andWHEREAS, the Department of Public Utilities, Division of Water, recommends an award be made to the most responsive and responsible bidder, Thomas Scientific LLC; and\n \nWHEREAS, the Division of Water has a need to transfer $92,260.00 between object classes with the 2024 Water Operating Fund budget. Funds for the transfer have been identified and are available in Object Class 06; andWHEREAS, it is necessary to authorize the expenditure of $92,260.00 from the Water Operating Fund; andWHEREAS, it has become necessary in the usual daily operations of the Department of Public Utilities in that it is necessary to authorize the Director to enter into an agreement with Thomas Scientific LLC for drinking water pitcher filters; NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Utilities be and is hereby authorized to enter into an agreement with Thomas Scientific LLC on behalf of the Division of Water for drinking water pitcher filters.\n \nSECTION 2. That this contract is in accordance with the relevant provisions of Chapter 329 of City Code.\n \nSECTION 3. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4. That the transfer of $92,260.00 or so much thereof as may be needed is hereby authorized between Object Classes within Fund 6000 Water Operating Fund per the accounting codes in this attachment to this ordinance.\n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.  That the expenditure of $92,260.00 or as much thereof as may be needed, is hereby authorized within the Water Operating Fund 6000 in object class 02 Materials and Supplies per the accounting codes in the attachment to this ordinance.\n \nSECTION 7.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 130,
    "meeting_date": "2024-12-16",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Economic Development"
    ]
  }
}