{
  "success": true,
  "vote": {
    "id": 11076,
    "item_number": "0",
    "title": "To authorize the Director of the Department of Public Utilities to enter into a design contract with Ribway Engineering Group, Inc. for the West Franklinton Area Sewer Reconfiguration project; to authorize an amendment to the 2024 Capital Improvement Budget; to appropriate funds within the Sanitary - Fresh Water Market Rate Fund; to make this ordinance contingent upon the Ohio Water Development Authority approving a loan for this project; and to authorize the expenditure of $219,939.69 from the Sanitary - Fresh Water Market Rate Fund.  ($219,939.69)",
    "description": "Explanation    \n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Utilities to enter into a professional services contract with Ribway Engineering Group, Inc. via the City’s Request for Proposal process for the West Franklinton Area Sewer Reconfiguration, CIP P650860-122210, in an amount up to $219,939.69.\n \nThis project includes removing existing sewers and reinstalling with modified sizing or elevations. This project will be fully designed with this contract and will not include future design phases. The project will take place on South Central Avenue near the intersections of West State Street, and along West Town Street from South Central Avenue to Brehl Avenue.  \n \nThis project is located within the Community Area, 54 - Franklinton.\n \nTIMELINE: The duration of the engineering agreement will be from the Notice To Proceed until the construction is completed and accepted by the City.  This is anticipated to be approximately four years \n \nESTIMATED COST OF PROJECT:  The bid amount and proposed award amount is $219,939.69, including a 20% construction contingency amount that will be utilized to fund needed and approved changes in the work.  No contract modifications are anticipated at this time; however, design exigency might later compel modification of this contract, if unforeseen difficulties are encountered.\n \nCost summary: \n \nOriginal Contract                                          $219,939.69\nFuture Anticipated Costs                     $          0.00\nCONTRACT TOTAL                                          $219,939.69 \n \n2.  ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT\nThis project will increase the level of service for DSR 94 to a 10-year level of service. Increased level of service will reduce overflows to waterbodies and water in basement events, improving health and quality of life.\n \n3.  BID INFORMATION\nThis project was formally advertised on the Vendor Services and Bonfire websites from May 6, 2024 through May 31, 2024.   Two proposals were received:\n \n Name                                                                                                         C.C. No.      Exp. Date                     City/State           Status                     \nRibway Engineering Group, Inc.                           CC005279       11/21/26                                          Columbus/OH        MBE\nMoody Engineering, LLC                                      CC012301       5/30/25                                          Columbus/OH       MBE \n \nAll proposals were deemed responsive.  The evaluation committee reviewed the proposals and recommended the contract for the West Franklinton Area Sewer Reconfiguration project be awarded to Ribway Engineering Group, Inc.\n \nRibway Engineering Group, Inc.’s certification was in good standing at the time of the contract award. \n \n4.  CONTRACT COMPLIANCE INFORMATION\nRibway Engineering Group, Inc.’s contract compliance number is CC005279 and expires 11/21/26.  \n \n5.  MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract was advertised with an anticipated City of Columbus MBE/WBE Program goal of 12% as assigned by the City’s Office of Diversity and Inclusion (ODI). Ribway Engineering Group, Inc.is certified as an MBE firm.  After ODI’s review of the Utilization Plan and other related information the contractor submitted with their bid response, ODI has approved an MBE/WBE Program goal of 12% for this contract.  \n \nAs part of their proposal, Ribway Engineering Group, Inc. has proposed the following subcontractors to perform contract work:\n \nCompany Name                                          City/State                                     ODI Certification Status \nDLZ Ohio, Inc.                                                               Columbus, Ohio                                              MBE                                \nTerracon Consultants, Inc.                     Columbus, Ohio                                              MAJ\nFeeCorp Inc.                                                               Columbus, Ohio                                              MAJ  \n                                                                                                                                                                               \nThe certification of Ribway Engineering Group, Inc. and the above companies was in good standing at the time the bid was awarded.\n \n6.  FISCAL IMPACT\nFunding for this contract will be obtained through the Ohio Water Development Authority Direct Loan Program.  City Council authorized this loan application and acceptance of loan funding via Ordinance 0652-2024, passed by Council on 3/25/24.  This was not one of the projects specifically listed in the ordinance as anticipated to be funded with this loan type.  Section 2 of the Ordinance states projects can be added to the list without amending the original ordinance.  This ordinance will request City Council’s approval to loan fund this specific project.  This loan is expected to be approved at the January OWDA Board meeting.  This ordinance is contingent upon the OWDA Board approving the loan application. \n \nThe Ohio Water Development Authority (OWDA) Direct Loan Program is a reimbursement program.  Purchase orders will need to be established to Ribway Engineering Group, Inc. for this contract.  Public Utilities will need to pay invoices directly to Ribway Engineering Group, Inc. and then submit reimbursement requests based upon these paid invoices to OWDA for OWDA to reimburse Public Utilities.   \nThe 2024 Capital Improvement Budget will need to be amended to align budget authority with the proper project.  Funds will need to be appropriated in the Sanitary - Fresh Water Market Rate Fund, Fund 6124.\n  \nTitle\nTo authorize the Director of the Department of Public Utilities to enter into a design contract with Ribway Engineering Group, Inc. for the West Franklinton Area Sewer Reconfiguration project; to authorize an amendment to the 2024 Capital Improvement Budget; to appropriate funds within the Sanitary - Fresh Water Market Rate Fund; to make this ordinance contingent upon the Ohio Water Development Authority approving a loan for this project; and to authorize the expenditure of $219,939.69 from the Sanitary - Fresh Water Market Rate Fund.  ($219,939.69)\n \nBody\nWHEREAS, the Department of Public Utilities is engaged in the West Franklinton Area Sewer Reconfiguration project; and\n \nWHEREAS, two proposals for the West Franklinton Area Sewer Reconfiguration project were received and opened on May 31, 2024; and\n \nWHEREAS, the evaluation committee recommended Ribway Engineering Group, Inc. be awarded the contract for this project; and \n \nWHEREAS, Ordinance 0652-2024 authorized Department of Public Utilities projects to be funded by loans obtained through the Ohio Water Development Authority Direct Loan Program; and \n \nWHEREAS, the West Franklinton Area Sewer Reconfiguration project was not listed as a project anticipated to be loan funded through the Ohio Water Development Authority Direct Loan Program in Ordinance 0652-2024; and \n \nWHEREAS, Section 2 of Ordinance 0652-2024 authorized the Director of Public Utilities to make changes to the list of loan projects funded via the Ohio Water Development Authority Direct Loan Program without seeking Council approval to modify the list; and\n \nWHEREAS, this ordinance seeks Council approval to obtain a loan from the Ohio Water Development Authority Direct Loan Program to finance this project; and \n \nWHEREAS, this ordinance is contingent upon that loan being approved; and\n \nWHEREAS, it is necessary to amend the 2024 Capital Improvement Budget to align budget authority for the project; and \n \nWHEREAS, it is necessary to appropriate funds in the Sanitary - Fresh Water Market Rate Fund, Fund 6124; and\n \nWHEREAS, it is necessary to authorize the Director of the Department of Public Utilities to enter into a  professional services contract with Ribway Engineering Group, Inc. for the West Franklinton Area Sewer Reconfiguration project; and\n \nWHEREAS, it is necessary to expend funds to pay for the services Ribway Engineering Group, Inc. provides under this contract; NOW, THEREFORE,  \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2024 Capital Improvements Budget authorized by Ordinance 1907-2024 be amended as follows to establish sufficient budget authority for this project:\n \nFund / Project Number / Project Name (Funding Source) / Current Authority / Revised Authority / Change \n6124 / P650860-122210 / West Franklinton Area Sewer Reconfiguration (OWDA Direct Loan) / $0.00 / $219,940.00 / $219,940.00 (To match loan amount)\n \nSECTION 2.  That the appropriation of $219,939.69, or so much thereof as may be needed, is hereby authorized in the Sanitary - Fresh Water Market Rate Fund, Fund 6124, per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That the Director of the Department of Public Utilities be and hereby is authorized to enter into a contract for professional engineering services for the West Franklinton Area Sewer Reconfiguration, CIP 650860-122210 with Ribway Engineering Group, Inc., 300 East Broad Street, Suite 500, Columbus, Ohio 43215; in accordance with the terms and conditions of the contract on file in the Department of Public Utilities.\n \nSECTION 4.  City Council authorizes the Director of the Department of Public Utilities to apply for a loan from the Ohio Water Development Authority (OWDA) Direct Loan program to finance a design contract modification for the West Franklinton Area Sewer Reconfiguration, CIP P650860-122210, to accept the loan funding if offered under terms agreeable to the City of Columbus, and to execute the documents needed to accept the loan.\n \nSECTION 5.  That this ordinance is contingent upon the Ohio Water Development Authority's Board approving the loan for this project. \n \nSECTION 6.  That the expenditure of $219,939.69, or so much thereof as may be needed, is hereby authorized to pay for this contract per the accounting codes in the attachment to this ordinance. \n \nSECTION 7.  That funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\nSECTION 8.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 9.  That the City Auditor is authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\nSECTION 10.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 130,
    "meeting_date": "2024-12-16",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}