{
  "success": true,
  "vote": {
    "id": 11123,
    "item_number": "CA-38",
    "title": "To authorize the Director of the Department of Public Service to execute those documents necessary for the transfer of 0.174 acre portion of right-of-way near Mound Street to Evans Carpet Junkyard Inc.",
    "description": "Explanation\n \nBackground:  The City of Columbus, Department of Public Service, received a request from Evans Carpet Junkyard, Inc. asking that the City transfer them a 7,571 square foot (0.174 acre) portion of the right-of-way near Mound Street.  The right-of-way area is one street north of Mound Street with Brehl Avenue abutting at the east and Central Avenue abutting at the west of the requested portion.\n \nTransfer of this right-of-way will be to allow the consolidation of applicant’s parcels in order to construct and operate a car wash facility at this location.  The Department of Public Service has agreed to transfer the right-of-way via a quitclaim deed as described and shown within attached legal description and exhibit, and extinguishes its need for this public right-of-way.  \n \nPer current practice, comments were solicited from interested parties, including City agencies, private utilities and the applicable area commission, before it was determined that, subject to the retention of a general utility easement for those utilities currently located within this right-of-way, the City will not be adversely affected by the transfer of this right-of-way.  \n \nThe Department of Public Service submitted a request to the City Attorney’s Office, asking that they establish a value for this right-of-way, and a value of $26,498.00 was established.  \n \nThis request went before the Land Review Commission on May 16, 2024.  After review of the request, the Land Review Commission voted to recommend the above referenced right-of-way be transferred to Evans Carpet Junkyard Inc. at the cost of $26,498.00 to them.\n                     \nFISCAL IMPACT:  The City will receive a total of $26,498.00 and the funds are to be deposited in Fund 7748, Project P537650, as consideration for the transfer of the requested right-of-way.\n \nTitle\n \nTo authorize the Director of the Department of Public Service to execute those documents necessary for the transfer of 0.174 acre portion of right-of-way near Mound Street to Evans Carpet Junkyard Inc. \n \nBody\n \nWHEREAS, The City of Columbus, Department of Public Service, received a request from Evans Carpet Junkyard, Inc. asking that the City transfer them a 7,571 square foot (0.174 acre) portion of the right-of-way near Mound Street.  The right-of-way area is one street north of Mound Street with Brehl Avenue abutting at the east and Central Avenue abutting at the west of the requested portion; and \n \nWHEREAS, transfer of this right-of-way will be to allow the consolidation of applicant’s parcels in order to construct and operate a car wash facility at this location; and\n \nWHEREAS, the Department of Public Service has agreed to transfer via quitclaim deed the right-of-way as described and shown within attached legal description and exhibit, and extinguishes its need for this public right-of-way; and\n \nWHEREAS, per current practice, comments were solicited from interested parties, including City agencies, private utilities and the applicable area commission, before it was determined that, subject to the retention of a general utility easement for those utilities currently located within this right-of-way, the City will not be adversely affected by the transfer of this right-of-way; and\n \nWHEREAS, the Department of Public Service submitted a request to the City Attorney’s Office, asking that they establish a value for this right-of-way; and\n \nWHEREAS, a value of $26,498.00 was established; and\n \nWHEREAS, this request went before the Land Review Commission on May 16, 2024; and\n \nWHEREAS, after review of the request, the Land Review Commission voted to recommend the above referenced right-of-way be transferred to Evans Carpet Junkyard Inc. at the cost of $26,498.00; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.    That the Director of the Department of Public Service be, and hereby is, authorized to execute a quitclaim deed and other incidental instruments prepared by the City Attorney’s Office, necessary to transfer the right-of-way described below and depicted in the attached exhibit which is incorporated into this ordinance for reference, to Evans Carpet Junkyard Inc.; to-wit:\n \n \nDescription of two alleys and part of two lots, Hamilton Place Addition\n \nSITUATED in the State of Ohio, County of Franklin, City of Columbus, and being a part of Virginia Military Survey No. 1393, and being part of a 0.054 acre tract (part of Lots 360 and 361) and all of a 0.021 acre tract (part of Lot 350), conveyed to the City of Columbus, Ohio in Instrument (Instr.) No. 202306300065017, and being part of Lots 350 and 360, part of the east-west 16 foot wide alley, and all of the westerly north-south 16 foot wide alley, as shown on Hamilton Place Addition, Plat Book (P.B.) 5, pg. 127, Franklin County Recorder’s Office;\n \nAll records referred to are those of record in the Franklin County Recorder’s Office, unless otherwise noted;\n \nBEGINNING at a found 5/8” iron pin w/ cap stamped “Campbell & Assocs PS 7809, being the northwest corner of Lot 358 and the northeast corner of Lot 359 of the said Hamilton Place Addition, being a point in the south right of way line of the said east-west 16 foot wide alley, and being the northwest corner of Parcel Two, conveyed to Evans Carpet Junkyard in Instr. No. 200407300177541;\n \nTHENCE North 19 degrees 18 minutes 57 seconds West 32.20 feet, crossing the said east-west 16 foot wide alley, the said 0.054 acre tract, and the said Lot 360, to a set iron pin, being a point in a north line of the said 0.054 acre tract;\n \nTHENCE with a curve turning to the left, with an arc length of 1.70 feet, a radius of 39.00 feet, a chord bearing of South 87 degrees 22 minutes 18 seconds East, a chord length of 1.70 feet, and a delta angle of 02 degrees 29 minutes 27 seconds, along a north line of the said 0.054 acre tract and crossing the said Lot 360, to a  set iron pin, being a corner of the said 0.054 acre tract;\n \nTHENCE South 88 degrees 37 minutes 01 seconds East 1.49 feet, along a north line of the said 0.054 acre tract and crossing the said Lot 360, to a  set iron pin, being a corner of the said 0.054 acre tract;\n \nTHENCE with a curve turning to the left, with an arc length of 45.45 feet, a radius of 129.20 feet, a chord bearing of North 81 degrees 07 minutes 45 seconds East, a chord length of 45.22 feet, and a delta angle of 20 degrees 09 minutes 20 seconds, along a north line of the said 0.054 acre tract and crossing the said Lot 360, to a  set iron pin, being a corner of the said 0.054 acre tract;\n \nTHENCE South 19 degrees 07 minutes 30 seconds East 1.00 feet, along an east line of the said 0.054 acre tract and crossing the said Lot 360, to a set iron pin, being a corner of the said 0.054 acre tract;\n \nTHENCE North 70 degrees 52 minutes 30 seconds East 53.01 feet, along a north line of the said 0.054 acre tract and crossing the said Lot 360, to a set iron pin, being a corner of the said 0.054 acre tract;\n \nTHENCE with a curve turning to the left, with an arc length of 20.26 feet, a radius of 15.00 feet, a chord bearing of North 32 degrees 10 minutes 24 seconds East, a chord length of 18.76 feet, and a delta angle of 77 degrees 24 minutes 11 seconds, along a north line of the said 0.054 acre tract and crossing the said Lots 360 and 361, to a set iron pin, being the northeast corner of the said 0.054 acre tract, a point in the east line of the said Lot 361 and in the west right of way line of the said north-south 16 foot wide alley;\n \nTHENCE North 08 degrees 31 minutes 31 seconds West 79.17 feet, along the west right of way line of the said north-south 16 foot wide alley, the east line of the said Lot 361, and the east line of Lot 362 of the said Hamilton Place Addition, to a point referenced by a found 3/4\" iron pipe (0.02’ S, 0.05’ W), being the northeast corner of the said Lot 362, the east corner of Parcel Four Tract Two conveyed to Evans Carpet Junkyard in Instr. No. 200407300177541, and being a corner of a 1.271 acre tract (Tract Two) conveyed to Caspian Group, LLC in Instr. No. 201905090054063;\n \nTHENCE North 70 degrees 46 minutes 40 seconds East 16.28 feet, along the north line of the said north-south 16 foot wide alley and a south line of the said 1.271 acre tract, to a found 5/8” iron pin, being the northwest corner of Lot 348 of the said Hamilton Place Addition and the northeast corner of the said north-south 16 foot wide alley;\n \nTHENCE South 08 degrees 31 minutes 55 seconds East 73.11 feet, along the east right of way line of the said north-south 16 foot wide alley, the west lines of Lots 348 and 349 of the said Hamilton Place Addition, and the west line of the said Lot 350, to a set iron pin, being the northwest corner of the said 0.021 acre tract;\n \nTHENCE with a curve turning to the left, with an arc length of 26.29 feet, a radius of 15.00 feet, a chord bearing of South 58 degrees 54 minutes 38 seconds East, a chord length of 23.05 feet, and a delta angle of 100 degrees 25 minutes 45 seconds, along a north line of the said 0.021 acre tract and crossing the said Lot 350, to a set iron pin, being a corner of the said 0.021 acre tract;\n \nTHENCE North 70 degrees 52 minutes 30 seconds East 119.24 feet, along a north line of the said 0.021 acre tract and crossing the said Lot 350, to a set Mag nail, being the northeast corner of the said 0.021 acre tract, and being a point in the east line of the said Lot 350 and a point in the west right of way line of Brehl Ave. (50’ wide, P.B. 5, pg. 127);\n \nTHENCE South 08 degrees 23 minutes 10 seconds East 6.11 feet, along the east line of the said 0.021 acre tract and of the said Lot 350, and the west right of way line of the said Brehl Ave., to a found 3/4\" iron pin, being the southeast corner of the said 0.021 acre tract and the said Lot 350, and being the intersection of the north right of way line of the said east-west 16 foot wide alley and the west right of way line of the said Brehl Ave.;\n \nTHENCE South 08 degrees 36 minutes 52 seconds East 16.27 feet, crossing the said east-west 16 foot wide alley, to a set Mag nail, being the northeast corner of Lot 351 of the said Hamilton Place Addition, and the intersection of the south right of way line of the said east-west 16 wide alley and the west right of way line of the said Brehl Ave.;\n \nTHENCE South 70 degrees 52 minutes 30 seconds West 262.29 feet, along the south right of way line of the said east-west 16 foot wide alley and the north line of the said Lot 351, and the north lines of Lots 352 through 358 of the said Hamilton Place Addition, to the point of beginning,\nhaving an area of 7,570 square feet or 0.174 acres, of which the present road occupies 0.174 acres, and of which 0.021 acres is out of the said 0.054 acre tract, all of the said 0.021 acre tract, and 0.132 acres out of the said 16 foot wide alleys,  according to a survey by J&J Surveying Services, Inc. in April of 2022, under the direct supervision of Raymond J. Wood, P.S. 7745;\n \nThe bearings described herein are based on the Ohio State Plane Coordinate System, South Zone, NAD83 (2012) Epoch 2203.  Said bearings originated from a field traverse which was referenced to said coordinate system by GPS observations and observations of selected stations in the Ohio Department of Transportation Real-Time-Network (ODOT RTN).  The north right of way line of W. Mound St. as being South 70 degrees 52 minutes 30 seconds West, is designated as the Basis of Bearing for this description; \n \nAll iron pins set are 5/8” in diameter, 30” long, with a cap stamped “J&J SURVEYING”.\n \nSECTION 2.    That the attached referenced real property shall be, and hereby is, considered excess road right-of-way and the public rights therein shall terminate upon the Director's execution and delivery of said quitclaim deed to the grantee thereof.\n \nSECTION 3.    That a general utility easement in, on, over, across and through the legal description and attached exhibit describing the right-of-way shall be retained unto the City of Columbus for those utilities located within said right-of-way.\n \nSECTION 4.    That upon notification and verification of the relocation of all utilities located within the retained general utility easement area the Director of the Department of Public Service is hereby authorized to execute those documents necessary to release the retained general utility easement with no additional compensation due to the City and with no further legislative action required by the City.\n \nSECTION 5.  That the $26,498.00 to be received by the City as consideration for the sale of these rights-of-way shall be deposited in Fund 7748, Project P537650.\n \nSECTION 6.    That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 130,
    "meeting_date": "2024-12-16",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Property & Real Estate",
      "Public Works"
    ]
  }
}