{
  "success": true,
  "vote": {
    "id": 11134,
    "item_number": "CA-49",
    "title": "To authorize the Director of the Recreation and Parks Department to enter into contract with CAP-Stone and Associates, Inc. for the Lincoln Park Lighting, Court and Path Additions Project; to authorize the appropriation of $150,540.98 within the Recreation and Parks Permanent Improvement Fund; to authorize the transfer of $150,540.98 within the Recreation and Parks Permanent Improvement Fund; to authorize the amendment of the 2024 Capital Improvements Budget; and to authorize the expenditure of $150,540.98 from the Recreation and Parks Permanent Improvement Fund. ($150,540.98) (Amended by ord. 0072-2026 passed on 2/9/2026 -LG)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Director of the Recreation and Parks Department to enter into contract with CAP-Stone and Associates, Inc. for the Lincoln Park Lighting, Court, and Path Additions Project. The contract amount is $135,540.98, with a contingency of $15,000.00, for a total of $150,540.98 being authorized by this ordinance.\n \nThe last improvements to Lincoln Park were constructed in 2012. This construction project will include an expansion of the loop walk for an additional quarter mile in the northeast portion of the park. The project will also include a new futsal court and drainage improvements around the north side of the Barack Community Center. Even though there are existing storm basins located throughout this area, additional basins and grading are needed to direct the water runoff to specific management points. Additionally, the project will include security lighting for the existing pool, pathways and new path extension.\n \nVendor Bid/Proposal Submissions (Office of Diversity and Inclusion designation status): Proposals were advertised to firms that were pre-qualified through the bi-annual Request for Statement of Qualification (RSFQ) process, in accordance with City Code Section 329, on October 10, 2024 and received by the Recreation and Parks Department on October 22, 2024. Request for proposals were received by the following companies:\nCAP-Stone and Associates (WBE)\nResource International (WBE)\nOHM (MAJ)\nEnvironmental Development Group (MAJ)\n \nOf note, professional services contracts are quality based selections and not based on price. Costs were not requested nor were they part of this evaluation.\n \nIn accordance with City Code, a selection team evaluated the proposals and recommended CAP-Stone and Associates, Inc. be selected to perform the work. The firm was chosen based on their referenced projects, experience, qualifications, availability, timeline and project approach.\n \nAs part of their bid, CAP-Stone and Associates, Inc. has proposed the following vendors to fulfill the Office of Diversity and Inclusion project goal:\nCAP-Stone and Associates, Inc. (WBE)\n \nCertification of the MBE’s and WBE’s being proposed are in good standing at the time the bid is being awarded.\n \nPrincipal Parties: \nCAP-Stone and Associate, Inc.\n3700 Corporate Drive, Suite 125, Columbus, Ohio 43231\nFrances Rubio Rourke, (614) 865-1874\nContract Compliance Number: 004933\nContract Compliance Expiration Date: June 6, 2026\n \nBenefits to the Public: The new path and futsal court additions will enhance the park for the community. This project will also provide path and security lighting during evening hours.\n \nCommunity Input/Issues: Community requests were received for preserving greenspace, providing recreational opportunities, and creating gathering spaces to promote safe inclusive park use.\n \nArea(s) Affected: South Side (63)\n \nMaster Plan Relation: This project will support the Recreation and Parks Master Plan by working with neighborhood groups to improve and update one community park per year.\n \nFiscal Impact: $150,540.98 is budgeted and available from within the Recreation and Parks Permanent Improvement Fund 7747 to meet the financial obligations of this contract. Appropriation, transfer, and amendment of the 2024 Capital Improvement Budget will be required.\n Title\nTo authorize the Director of the Recreation and Parks Department to enter into contract with CAP-Stone and Associates, Inc. for the Lincoln Park Lighting, Court and Path Additions Project; to authorize the appropriation of $150,540.98 within the Recreation and Parks Permanent Improvement Fund; to authorize the transfer of $150,540.98 within the Recreation and Parks Permanent Improvement Fund; to authorize the amendment of the 2024 Capital Improvements Budget; and to authorize the expenditure of $150,540.98 from the Recreation and Parks Permanent Improvement Fund. ($150,540.98) (Amended by ord. 0072-2026 passed on 2/9/2026 -LG)\nBody\n \nWHEREAS, it is necessary to authorize the Director of the Recreation and Parks to enter into contract with CAP-Stone and Associates, Inc. for the Lincoln Park Lighting, Court and Path Additions Project; and\n \nWHEREAS, it is necessary to authorize the appropriation of $150,540.98 from the Recreation and Parks Permanent Improvement Fund; and, \n \nWHEREAS, it is necessary to authorize the transfer of $150,540.98 from the Recreation and Parks Permanent Improvement Fund; and, \n \nWHEREAS, it is necessary to authorize the amendment of the 2024 Capital Improvements Budget Ordinance 1907-2024 in order to provide sufficient budget authority for this and future projects; and\n \nWHEREAS, it is necessary to authorize the expenditure of $150,540.98 from the Recreation and Parks Permanent Improvement Fund; and\n \nWHEREAS, it has become necessary in the usual daily operations of the Recreation and Parks Department in that it is necessary to authorize the Director to enter into contract with CAP-Stone and Associates, Inc. for the Lincoln Park Lighting, Court and Path Additions Project, NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Recreation and Parks Department be and is hereby authorized to enter into contract with CAP-Stone and Associates, Inc. for the Lincoln Park Lighting, Court and Path Additions Project. \n \nSECTION 2. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 4. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 5. That the appropriation of $150,540.98 is authorized within the Recreation and Parks Permanent Improvement Fund 7747 per the accounting codes in the attachment to this ordinance.  \n \nSECTION 6. That the transfer of $150,540.98, or so much thereof as may be needed, is hereby authorized between projects within the Recreation and Parks Permanent Improvement Fund 7747 per the account codes in the attachment to this ordinance.\n \nSECTION 7. That the 2024 Capital Improvements Budget Ordinance 1907-2024 is hereby amended as follows in order to provide sufficient budget authority for this ordinance and future projects.\n \nFund / Project / Project Name / Current Revised Authority / Current Remaining Authority / Change / Amended Revised Authority / Amended Remaining Authority\n \nFund 7747 / P510057-100000 / Parkland Donations - Near South (Rec & Parks Perm Improv Carryover) / $3,251 / $3,251 / ($3,250) / $1 / $1\nFund 7747 / P510763-100000 / CC South Side - Parkland Dedication (Rec & Parks Perm Improv Carryover) / $398,686 / $398,686 / ($147,291) / $251,395 / $251,395\n \nFund 7747 / P511057-100000 / Lincoln Park Improvements (Rec & Parks Perm Improv Carryover) / $0 / $0 / $150,541 / $150,541  / $150,541\n \nSECTION 8. That for the purpose stated in Section 1, the expenditure of $150,540.98, or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Recreation and Parks Permanent Improvement Fund 7747 in object class 06 Capital Outlay per the accounting codes in the attachments to this ordinance.  \n \nSECTION 9. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 130,
    "meeting_date": "2024-12-16",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Parks & Recreation"
    ]
  }
}