{
  "success": true,
  "vote": {
    "id": 11178,
    "item_number": "CA-93",
    "title": "To authorize the Director of the Department of Public Utilities to modify and increase the contract with T&M Associates Foundation Inc. for the DPU General Engineering Consultant Services #5 Project; to authorize an amendment to the 2024 Capital Improvement Budget; and to authorize an expenditure of $500,000.00 within the Sanitary Bond Fund to pay for the contract modification.  ($500,000.00)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Utilities to enter into a planned contract modification for general engineering services with T&M Associates Foundation Inc. for the DPU General Engineering Consultant Services (GEC) #5, CIP #650260-100400, in an amount up to $500,000.00.\n \nGeneral Engineering Consultant (GEC) Services are necessary to provide technical and engineering assistance to the Department of Public Utilities (DPU). Initial services are for Division of Sewerage and Drainage (DOSD) facilities. Additional DPU facilities may be added in the future.   The GEC services may include the following tasks for small projects: investigations, inspections and evaluations of existing conditions, surveying, preparation of engineering or architectural drawings and specifications, review of contractors’ submittals including shop drawings, maintenance and operation (M&O) manuals, Standard Operating Procedures (SOPs).  The GEC services may also include assistance with new equipment or systems start-up and commissioning, instrumentation & control (I&C) work such as Human Machine Interface (HMI) and Programmable Logic Controller (PLC) programming, uploading documents onto the City’s Project Management Information System (PMIS), computerized maintenance software, preparation of record plan drawings for small projects, technical assistance in the preparation of Facilities/Equipment Maintenance (FEM) documents, and other similar related tasks. Small projects that may, on occasion, require engineering services under this contract include small Capital Improvement Projects (formerly known as “Plant Improvement Projects” or “PIPs”) and FEM service contracts. The small Capital Improvement Projects (CIP) will vary in nature and can include replacement and upgrade of equipment, materials, structural features,  electrical, or instrumentation & control (I&C) work and their associated appurtenances that have served its useful life.\n \n \nPlanning Area: 99 - Citywide\n \n1.1 Amount of additional funds to be expended:  $500,000.00\nOriginal Contract Amount:                                     $500,000.00  (ORD 2939-2021 PO308113)\nModification #1 Amount:                                                  $500,000.00 (ORD 2105-2023 PO407380)\nModification #2 Amount:                                                  $500,000.00 (current)   \nTotal (Orig. + Modification):                                             $1,500,000.00\n \n1.2. Reason other procurement processes are not used:  \nThis contract was put in place as a three-year contract.  This is the second of two planned modifications to add funding to the contract.\n \n1.3. How cost of modification was determined:\nThe cost of the modification was determined based upon rates and allowable expenses already established in the contract.\n \n2. ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT:  \nThe performance of this project’s activities to provide engineering and technical services for CIPs and FEMs at DPU facilities will help them maintain peak operational performance. If left unperformed, the required work could become larger and more expensive that could produce a major impact to the budget. No community outreach is considered for this project.\n3.  CONTRACT COMPLIANCE INFORMATION:  \nT&M Associates Foundation Inc.’ contract compliance number is CC001614 and expires 4/10/26.\n \nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against T&M Associates Foundation Inc.\n \n4.  MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract was put in place prior to the implementation of the City of Columbus MBE/WBE Program and is not subject to the requirements of that program.  T&M Associates Foundation Inc. is classified as a majority company by the City’s Office of Diversity and Inclusion.  T&M Associates Foundation Inc. anticipates performing the work on this contract modification with the use of sub-consultants, one of which is an MBE and one of which is a WBE.  The MBE/WBE percentage cannot be determined until tasks are assigned to the contract.\n \nAs part of their proposal, T&M Associates Foundation Inc. has proposed the following three subcontractors to perform contract work:\n \nCompany Name                                            City/State                                     ODI Certification Status\nBrown and Caldwell                                                             Columbus, Ohio                                                                          MAJ\nAndover Associates, Ltd.                                                      Columbus, Ohio                                                                                    WBE\nDynotec                                                                                         Columbus, Ohio                                                                                     MBE\n \nThe certification of T&M Associates Foundation Inc. and the above companies was in good standing at the time the bid was awarded.\n \n5.  FISCAL IMPACT\nFunds are available and appropriated for project P650260-100400 within the Sanitary Bond Fund, Fund 6109.  An amendment to the 2024 Capital Improvement Budget is needed to align budget authority with the proper project.\n \nTitle\nTo authorize the Director of the Department of Public Utilities to modify and increase the contract with T&M Associates Foundation Inc. for the DPU General Engineering Consultant Services #5 Project; to authorize an amendment to the 2024 Capital Improvement Budget; and to authorize an expenditure of $500,000.00 within the Sanitary Bond Fund to pay for the contract modification.  ($500,000.00)\n \nBody\nWHEREAS, the Department of Public Utilities is engaged in the DPU General Engineering Consultant Services (GEC) #5 Project; and\n \nWHEREAS, Contract No. PO308113 was authorized by Ordinance No. 2939-2021, for the DPU General Engineering Consultant Services (GEC) #5 Project; and\n \nWHEREAS, a planned contract modification is needed to fund continued engineering services; and\n \nWHEREAS, it is necessary for Council to authorize the Director of Public Utilities to modify the professional engineering services agreement with T&M Associates Foundation Inc. for the DPU General Engineering Consultant Services (GEC) #5 Project to continue services performed under the contract; and\n \nWHEREAS, an amendment to the 2024 Capital Improvement Budget is needed to align budget authority with the proper project; and \n \nWHEREAS, it is necessary to expend funds from the Sanitary Bond Fund to pay for the contract modification; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2024 Capital Improvement Budget authorized by Ordinance 1907-2024 be amended as follows to establish sufficient budget authority for this project:\n \nFund / Project Number / Project Name (Funding Source) / Current Authority / Revised Authority / Change \n6109 / P650260-103000 / SWWTP Small Capital Projects (Voted Sanitary Carryover) / $247,050.00 / $0.00 / ($247,050.00)\n6109 / P650260-103015 / SWWTP CFS Bridge and RSP Cooling Upgrade (Voted Sanitary Carryover) / $258,119.00 / $5,169.00 / ($252,950.00) \n \n6109 / P650260-100400 / General Engineering Consultant Services (GEC) #5 Mod 2 (Voted Sanitary Carryover) / $0.00 / $500,000.00 / $500,000.00\n \nSECTION 2.  That the Director of the Department of Public Utilities is hereby authorized to modify and increase the general engineering services contract with T&M Associates Foundation Inc., 4675 Lakehurst Ct Suite 250, Dublin, Ohio 43016; for the DPU General Engineering Consultant Services (GEC) #5 project, in an amount up to $500,000.00.\n \nSECTION 3.  That an expenditure of $500,000.00, or so much thereof as may be needed, is hereby authorized from the Sanitary Bond Fund, Fund 6109, to pay for this contract modification per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That funds are hereby deemed appropriated and expenditures authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 7.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 130,
    "meeting_date": "2024-12-16",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}