{
  "success": true,
  "vote": {
    "id": 11185,
    "item_number": "CA-100",
    "title": "To authorize the Director of Public Utilities to enter into an agreement with Irvin Public Relations for Communications Support services; and to authorize the expenditure of $100,000.00 from the Electricity Operating Fund. ($100,000.00)",
    "description": "Explanation \n \nBackground: This ordinance authorizes the Director of Public Utilities to enter into an agreement with Irvin Public Relations for Communications Support services. The contract amount being authorized by this ordinance is $100,000.00.\n \nThe Sustainable Columbus office works to reduce climate change impact in our community to protect the environment and improve the quality of life for today’s residents and for future generations. The office shapes policy, creates actionable programming to improve the city’s environment, and gives residents the tools to incorporate sustainability into their everyday lives. The work is guided by the Columbus Climate Action Plan, which commits the Columbus community to carbon neutrality by 2050 and a 45% reduction in emissions while imparting equity and improving quality of life for our most climate vulnerable residents. \nTo better support Sustainable Columbus staff, cross-Departmental City staff, external partners, and stakeholders, Sustainable Columbus recently went through a strategic branding and messaging process. Building on that foundation, the professional communications and marketing services vendor will assist with earned media, digital media, social media, engagement opportunities, and events that will employ behavior change marketing strategies. The communication support will increase visibility and provide an understanding of Sustainable Columbus, its programs, resources, and assist in connecting residents to climate solutions while creating social norms around climate action in Columbus.\nThis contract will be in effect from December 20, 2024 up to and including December 31, 2025 with the option to renew annually for two (2) additional one (1) year periods upon mutual agreement between the parties, availability of budgeted funds, and approval by City Council. This contract will not automatically renew. If unforeseen issues or difficulties are encountered that would require additional funding, a modification would be requested.\n \nProcurement: \nThe Department of Public Utilities solicited competitive proposals through Vendor Services and Bonfire from October 4, 2024 to November 1, 2024 for strategic communication services in accordance with the relevant provisions of Chapter 329 of City Code, RFQ028883. Seven proposals were received, two by majority vendors, one by a woman-owned enterprise, two by a minority-owned business, and two not listed. They were all deemed responsive and were evaluated on November 13, 2024. The evaluation committee determined that Irvin Public Relations, LLC. submitted the strongest proposal because of the relevant experience of its project team, its understanding of the Department’s needs, and presented a tailored approach to address those needs.\nThe following proposals were received:\n \nVendor                                                                                                         City/State                                                               CC#                                            Status______                     \n1. Irvin Public Relations                                                               Columbus, OH                                                                                     002045                           WBE\n2. 4th Street Strategies, LLC                                          Columbus, OH                                                                                    PENDING\n3. Blue Strike Environmental Inc.                     Monterey, CA                                                                                    047472                                              MAJ\n4. Canvaas Consulting LLC                                          Columbus, OH                                                                                     031214                                              MBE\n5. Citadel Safety Group                                                               Grosse Pointe Farms, MI                                          050658                                              MAJ\n6. Digilign LLC                                                                                    Santa Monica, CA                                                               PENDING\n7. Sky Nile Consulting LLC                                          Columbus, OH                                                                                     042248                                              MBE\n \nMinority and Women Owned business Enterprise & Small Local Business Enterprise Program:\nThis contract opportunity was submitted to the City’s Office of Diversity and Inclusion (ODI) for review and assignment of an MBE/WBE goal prior to bidding. After review of the utilization plan and other related information the contractors submitted, ODI approved an MBE/WBE Program goal of 15% for this contract.  Failure by the contractor to meet this goal subjects the contractor to the Penalties for Non-Compliance as described in the “City’s Minority and Women-Owned Business Enterprise & Small Local Business Enterprise Program Manual” and in the bid documents for this contract.\nThere are no subcontractors on this project.\nPrincipal Parties: \nIrvin Public Relations, LLC.\n61 Jefferson Avenue\nColumbus, Ohio 43215                                        \nSarah Irvin Clark, 614-225-9100\nContract Compliance Number: 002045\nContract Compliance Expiration Date: September 22, 2025\nMWBE Certification Status: WBE\nMWBE Certification Expiration Date: PENDING RENEWAL UPDATE\n \nThe company is not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.\n  \nFiscal Impact: $100,000.00 is budgeted and available from within the Electricity Operating Fund to meet the financial obligations of this contract.\n \nTitle\n \nTo authorize the Director of Public Utilities to enter into an agreement with Irvin Public Relations for Communications Support services; and to authorize the expenditure of $100,000.00 from the Electricity Operating Fund. ($100,000.00)\n \nBody\n \nWHEREAS, it is necessary to authorize the Director of the Department of Public Utilities to enter into contract with Irvin Public Relations for Communications Support services; and\n \nWHEREAS, the Department of Public Utilities opened formal bids on November 1st, 2024; and\n \nWHEREAS, the Department of Public Utilities, Division of Power, recommends an award be made to the most responsive and responsible bidder, Irvin Public Relations; and\n \nWHEREAS, it is necessary to authorize the expenditure of $100,000.00 from the Electricity Operating Fund; and\n \nWHEREAS, it has become necessary in the usual daily operations of the Department of Public Utilities in that it is necessary to authorize the Director to enter into an agreement with Irvin Public Relations for Communications Support services; NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Public Utilities be and is hereby authorized to enter into an agreement with Irvin Public Relations for Communications Support services.\n \nSECTION 2. That this contract is in accordance with the relevant provisions of Chapter 329 of City Code.\n \nSECTION 3. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 5. That for the purpose stated in Section 1, the expenditure of $100,000.00 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized in Fund 6300, Electricity Operating Fund, in object class 03 Services, per the accounting codes in the attachments to this ordinance.\nSECTION 6. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 130,
    "meeting_date": "2024-12-16",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}