{
  "success": true,
  "vote": {
    "id": 11206,
    "item_number": "SR-3",
    "title": "To authorize the Finance and Management Director to enter into a contract for the option to purchase Data Services with Ohio Bell Telephone Company LLC dba AT&T; to authorize the expenditure of $1.00; and to waive the provisions of competitive bidding; and to declare an emergency. ($1.00)",
    "description": "Explanation\n \nBACKGROUND:  This ordinance authorizes the Finance and Management Director to enter into a Universal Term Contract to purchase data services with Ohio Bell Telephone Company LLC dba AT&T.  This contract provides for data service, equipment delivering the services, maintenance and repairs.   The Department of Technology uses this contract to provide internet services citywide.  The term of the proposed contract would be for three (3) years expiring March 31, 2027, with the option to renew for one (1) additional year period.  In addition, the expenditure of $1.00 is hereby authorized from General Budget Reservation BRPO002726. \n \nThe contract, PO007219, for Data Services, was established in accordance with the relevant provisions of Columbus City Code Chapter 329.  The Purchasing Office did not advertise or solicit competitive bids.  The contract was authorized under Ordinance Number 0427-2016, passed March 14, 2016 and Ordinance 0915-2021, passed April 26, 2021 modifying the contract for three years, expiring March 31, 2024. \n \nThis ordinance, in accordance with Ordinance Number 0427-2016, also waives the competitive bidding process of the Columbus City Codes for the above-mentioned Universal Term option Contract.  Given the complexity of the systems and services being provided and embedded nature of these items it is not practical to bid any of these services.   The City and AT & T agreed to enter into a contract which allows for the contract to be extended for future dates, subject to an annual mutual agreement and approval of proper City Authorities.  At this time and for the immediate future, AT&T is the only feasible provider of these services.  This determination was made after extensive consultation between the Department of Technology and the assigned Purchaser of this commodity area.\n \nAT & T, CC006413; Expired 1/7/2021 (Pending)\nTotal Estimated Annual Expenditure: $1,900,000.00; Department of Technology, primary user.\n \n \nEmergency Designation:  The Finance and Management Department respectfully requests this legislation be considered an emergency ordinance because a contract is needed to ensure there is no interruption of data services citywide.\n \nThis company is not debarred according to the Excluded Parties listing of the Federal Government and are not listed in the Auditor of States database for Findings for Recovery.\n \nFISCAL IMPACT: The expenditure of $1.00 is hereby authorized from General Budget Reservation BRPO002726.   City agencies will be required to obtain approval to expend from their own appropriations for their estimated annual expenditures.\nTitle\n \nTo authorize the Finance and Management Director to enter into a contract for the option to purchase Data Services with Ohio Bell Telephone Company LLC dba AT&T; to authorize the expenditure of $1.00; and to waive the provisions of competitive bidding; and to declare an emergency. ($1.00)\n \n \nBody\n \nWHEREAS, it is necessary to authorize the Finance and Management Director to enter into a contract with AT&T for the purchase of Data Services used citywide; and \n \nWHEREAS, because of the complexity of the systems and services being provided and embedded nature of these items it is not practical to bid out data services; therefore, it is in the best interest of the City of Columbus to waive the competitive bidding requirements for the purchase; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Technology that data services, equipment delivering the services, maintenance and repairs are needed for citywide operations in that it is necessary to authorize the Finance and Management Director to immediately enter into a Universal Term Contract with AT & T for the option to purchase Data Services with no interruptions and to ensure internet services are available citywide and to ensure that data services, equipment delivering the services, maintenance and repairs are available for citywide operations, all for the immediate preservation of the public health, peace, property, safety and welfare; and now, therefore: \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Finance & Management Director be and is hereby authorized to enter into the following contract for the option to purchase Data Services in accordance with a negotiated contract for a term of approximately three years, expiring March 31, 2027, with the option to renew for one (1) additional year, as follows: \n \nOhio Bell Telephone Company LLC dba AT & T, $1.00\n \nSECTION 2.  This Council finds it is in the best interest of the City of Columbus to waive the relevant provisions of Columbus City Code Section 329 to permit the aforementioned purchase.  \n \nSECTION 3.  That the expenditure of $1.00 is hereby authorized from General Budget Reservation BRPO002726 of this ordinance to pay the cost thereof.\n \nSECTION 4.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.   That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 130,
    "meeting_date": "2024-12-16",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}