{
  "success": true,
  "vote": {
    "id": 11217,
    "item_number": "SR-14",
    "title": "To authorize the Executive Director of the Office of CelebrateOne to accept a grant from the Department of Health and Human Services/Centers for Disease Control and Prevention, through the Ohio Department of Health for the Ohio Health Improvement Zones Project in the amount of $156,000.00; to authorize the appropriation of $156,000.00 from the unappropriated balance of the General Government Grants Fund; to authorize the Executive Director of the Office of CelebrateOne to expend and enter into contract for community engagement and outreach services with multiple community partner sub-grantees for the amounts previously stated that total $235,000.00; to waive the competitive bidding requirements of the Columbus City Code; and to declare an emergency.  ($156,000.00)",
    "description": "Explanation\n \nBACKGROUND:  The Office of CelebrateOne has been awarded a grant from the Ohio Department of Health via the federal Department of Health and Human Services/Centers for Disease Control and Prevention (CDC).  This ordinance is needed to accept and appropriate $156,000.00 in grant monies to fund the Ohio Health Improvement Zones Pilot Project from the date of acceptance and appropriation through June 30th, 2025. These funds paired with the remainder of funding accepted by Ord. 3388-2022 will allow the continued work of the OHIZ Grant through contracts with the five vendors listed below.\n \nThe Ohio Health Improvement Zones Pilot Project will work to improve infant mortality in this area by addressing health care access and quality as well as the social and community context. CelebrateOne is committed to developing/designing a connected and consistent care experience for mothers, babies, and families utilizing public-private partnerships to implement safe, place-based, culturally appropriate resources centers to enhance access to healthcare and promote healthy behaviors, reduce racial disparities in infant mortality, and set families up to thrive. This funding will be utilized to support several aspects of this mission. These funds will help provide services including, but not limited to, comprehensive breastfeeding services to pregnant and postpartum women, deliver perinatal mental health peer support and care navigation for pregnant and new moms, legal aid services for new and expecting mothers, assist with covering financial burden of healthcare costs of new and expecting mothers.   \n \nThe target area represents Columbus’ Eastland and Blacklick Estates neighborhoods within the 43232 zip code. The zip code in which the target census tracks are located has been identified as an overlapping hotspot for infant mortality, emergency room visits, drug overdose deaths, and Narcan administration. \n \n\n\n\nThis ordinance will allow CelebrateOne and the City of Columbus to establish a contract with Urban Family Development Center, Heart of Ohio Family Health Centers, Legal Aid of Southeast and Central Ohio, Mental Health America of Ohio Inc. and Project Milk Mission for community engagement and outreach within the census tracts in the 43232 postal code area.  It is in the City's best interests to waive the competitive bidding requirements to enter into these contracts.\n\n\n \nVendors Information: \nUrban Family Development Center, Vendor Number 042886, CC-042886\nHeart of Ohio Family Health Centers, Vendor Number 007697, CC-007697\nLegal Aid of Southeast & Central Ohio, Vendor Number 004239, CC-04239\nMental Health America of Ohio, Inc., Vendor Number 006116, CC-006116\nProject Milk Mission, Vendor Number 042127, CC-042127\n \n \n \nEMERGENCY ACTION is requested at this time in order to meet project timelines and deliverables.\n \nFISCAL IMPACT:  This ordinance authorizes the acceptance and appropriation of $156,000.00 of federal funding awarded through the Ohio Department of Health. These funds will be paired with the $79,000.00 of the remaining funds that were accepted and appropriated by Ord.3388-2022 to form contracts with each of the five vendors in the amounts listed below to assist with community engagement and outreach within the target zip code and census tracts. \n\n\n\nUrban Family Development Center\n\n$60,000.00\n\n\n\nHeart of Ohio Family Health Centers\n\n$50,000.00\n\n\n\nLegal Aid of Southeast & Central Ohio \n\n$65,000.00\n\n\n\nMental Health America of Ohio Inc.\n\n$40,000.00\n\n\n\nProject Milk Mission\n\n$20,000.00\n\n\n\nTOTAL\n\n$235,000.00\n\n\n  \n \nTitle\nTo authorize the Executive Director of the Office of CelebrateOne to accept a grant from the Department of Health and Human Services/Centers for Disease Control and Prevention, through the Ohio Department of Health for the Ohio Health Improvement Zones Project in the amount of $156,000.00; to authorize the appropriation of $156,000.00 from the unappropriated balance of the General Government Grants Fund; to authorize the Executive Director of the Office of CelebrateOne to expend and enter into contract for community engagement and outreach services with multiple community partner sub-grantees for the amounts previously stated that total $235,000.00; to waive the competitive bidding requirements of the Columbus City Code; and to declare an emergency.  ($156,000.00)\n \nBody\n \nWHEREAS, $156,000.00 in grant funds from the Department of Health and Human Services, Centers for Disease Control and Prevention, have been made available through the Ohio Department of Health for the date of execution through June 30th, 2025 for the Ohio Health Improvement Zones Pilot Project; and\n \nWHEREAS, it is necessary to accept and appropriate these funds from the Department of Health and Human Services, Centers for Disease Control and Prevention through the Ohio Department of Health; and\n \nWHEREAS, this ordinance is being submitted as an emergency measure to allow the financial transactions to be posted in the City’s accounting system as soon as possible so that timely services can begin; and\n \nWHEREAS, it is in the City's best interests to waive the competitive bidding requirement of Columbus City Code in order to utilize these funds combined with previously awarded funds from Ord. 3388-2022 to award service agreements and expend $235,000.00 of the awarded grant monies with multiple community partner sub-grantees for community engagement and outreach services for the Ohio Health Improvement Zone Pilot Project; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Office of CelebrateOne in that it is immediately necessary to accept these grant funds to allow these financial transactions to be posted in the City’s accounting system in order to meet project timelines and deliverables as soon as possible, for the immediate preservation of the public health, peace, property, safety and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Executive Director of the Office of CelebrateOne is hereby authorized to accept and appropriate $156,000.00 from the Department of Health and Human Services, Centers for Disease Control and Prevention through the Ohio Department of Health.\n \nSECTION 2. That the Executive Director of the Office of CelebrateOne is hereby authorized to utilize these funds along with $79,000.00 in funds from Ord. 3388-2022 to establish service contracts for community engagement and outreach services with multiple community partner sub-grantees for a total amount of $235,000.00 in support of the Ohio Health Improvement Zones Pilot Project.\n \nSECTION 3. That this Council finds that it is in the City's best interests to waive the competitive bidding requirements of City Code to enter into this contract.\n \nSECTION 4. That to pay the costs of said contract referenced in Section 2 and the programs administered by CelebrateOne, the expenditure is hereby authorized from the General Government Grant Fund 2220, per the accounting codes in the attachment to this ordinance.  \n \nSECTION 5. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance and to make any accounting changes necessary to ensure that these contracts are properly accounted for and recorded accurately on the City’s financial records.  \n \nSECTION 7.  That, at the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements.\n \nSECTION 8. That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 130,
    "meeting_date": "2024-12-16",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Community Services",
      "Contracts & Agreements"
    ]
  }
}