{
  "success": true,
  "vote": {
    "id": 11231,
    "item_number": "SR-28",
    "title": "To enact Chapter 4518 of the Columbus City Codes to create a Residential Property Wholesaler Registry.",
    "description": "Explanation\n \nBACKGROUND: This legislation enacts Chapter 4518 of the Columbus City Codes to create a Residential Property Wholesaler Registry.  \n \nTitle\n \nTo enact Chapter 4518 of the Columbus City Codes to create a Residential Property Wholesaler Registry.  \n \nBody\n \nWHEREAS, properties in our neighborhoods are being bought at an alarming rate by out of state investors; and\n \nWHEREAS, wholesaling remains an unregulated industry; and \n \nWHEREAS, ensuring that our most vulnerable residents are protected is of the utmost importance; and\n \nWHEREAS, requiring wholesalers to register will help to ensure ethical, transparent, and responsible practices associated with wholesaling; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     That Chapter 4518 of the Columbus City Codes be enacted to read as follows:\n \nChapter 4518 REGISTRY OF RESIDENTIAL PROPERTY WHOLESALERS\n \n4518.01 Registry of Residential Property Wholesalers.\nThere is hereby created in the Department a Registry of Residential Property Wholesalers. The purpose of this registry is to ensure ethical, transparent and responsible practices associated with wholesaling Residential Property Wholesaling. The registry will help develop a structure for regular reporting, verification, and information collection on wholesaling Residential Property Wholesaling transactions. Additionally, the registry will help to promote and uphold a high standard of ethical conduct for wholesaling Residential Property Wholesaling by requiring the disclosure of all pertinent information that that will assist individuals in making an informed decision when entering into a wholesaling Residential Property Wholesaling transaction. This registry shall be available for public inspection during regular business hours of the Department. The Director is authorized to promulgate rules and regulations related to the operation and enforcement of the Registry of Residential Property Wholesalers consistent with the registry’s purpose.\n \n4518.02. Definitions\n(A)                     The following definitions taken from Chapter 4735 of the Ohio Revised Code apply:\n1.                     \"Bona fide\" means made in good faith or without purpose of circumventing license law.\n2.                     \"Commercial real estate\" means any parcel of real estate in this state other than real estate containing one to four residential units. \"Commercial real estate\" does not include single-family residential units such as condominiums, townhouses, manufactured homes, or homes in a subdivision when sold, leased, or otherwise conveyed on a unit-by-unit basis, even when those units are a part of a larger building or parcel of real estate containing more than four residential units.\n3.                     \"Foreign real estate\" means real estate not situated in this state and any interest in real estate not situated in this state.\n4.                     \"Foreign real estate dealer\" includes any person, partnership, association, limited liability company, limited liability partnership, or corporation, foreign or domestic, who for another, whether pursuant to a power of attorney or otherwise, and who for a fee, commission, or other valuable consideration, or with the intention, or in the expectation, or upon the promise of receiving or collecting a fee, commission, or other valuable consideration, does or deals in any act or transaction specified or comprehended in R.C. §4735.01(L)(A) with respect to foreign real estate.\n5.                     \"Foreign real estate salesperson\" means any person associated with a licensed foreign real estate dealer to do or deal in any act or transaction specified or comprehended in R.C. §4735.01 (L)(A)with respect to foreign real estate, for compensation or otherwise.\n6.                     \"Inactive license\" means the license status in which a salesperson's license is in the possession of the division, renewed as required under the Ohio Revised Code or rules adopted under to the Ohio Revised Code and not associated with a real estate broker.\n7.                     “Licensee\" means any individual licensed as a real estate broker or salesperson by the Ohio real estate commission pursuant to the Ohio Revised Code.\n8.                     \"Management level licensee\" means a licensee who is employed by or affiliated with a real estate broker and who has supervisory responsibility over other licensees employed by or affiliated with that real estate broker.\n9.                     \"Oil and gas land professional\" means a person regularly engaged in the preparation and negotiation of agreements for the purpose of exploring for, transporting, producing, or developing oil and gas mineral interests, including, but not limited to, oil and gas leases and pipeline easements.\n10.                     \"Reactivate\" means the process prescribed by the superintendent of real estate and professional licensing to remove a license from an inactive, suspended, or broker's license on deposit status to allow a licensee to provide services that require a license under to the Ohio Revised Code.\n11.                     \"Real estate\" includes leaseholds as well as any and every interest or estate in land situated in this state, whether corporeal or incorporeal, whether freehold or nonfreehold, and the improvements on the land, but does not include cemetery interment rights.\n12.                     “Real Estate Broker” includes any person, partnership, association, limited liability company, limited liability partnership, or corporation, foreign or domestic, who for another, whether pursuant to a power of attorney or otherwise, and who for a fee, commission, or other valuable consideration, or with the intention, or in the expectation, or upon the promise of receiving or collecting a fee, commission, or other valuable consideration does any of the following:\n(1)                     Sells, exchanges, purchases, rents, or leases, or negotiates the sale, exchange, purchase, rental, or leasing of any real estate;\n(2)                     Offers, attempts, or agrees to negotiate the sale, exchange, purchase, rental, or leasing of any real estate;\n(3)                     Lists, or offers, attempts, or agrees to list, or auctions, or offers, attempts, or agrees to auction, any real estate;\n(4)                     Buys or offers to buy, sells or offers to sell, or otherwise deals in options on real estate;\n(5)                     Operates, manages, or rents, or offers or attempts to operate, manage, or rent, other than as custodian, caretaker, or janitor, any building or portions of buildings to the public as tenants;\n(6)                     Advertises or holds self out as engaged in the business of selling, exchanging, purchasing, renting, or leasing real estate;\n(7)                     Directs or assists in the procuring of prospects or the negotiation of any transaction, other than mortgage financing, which does or is calculated to result in the sale, exchange, leasing, or renting of any real estate;\n(8)                     Is engaged in the business of charging an advance fee or contracting for collection of a fee in connection with any contract whereby the broker undertakes primarily to promote the sale, exchange, purchase, rental, or leasing of real estate through its listing in a publication issued primarily for such purpose, or for referral of information concerning such real estate to brokers, or both, except that this division does not apply to a publisher of listings or compilations of sales of real estate by their owners;\n(9)                     Collects rental information for purposes of referring prospective tenants to rental units or locations of such units and charges the prospective tenants a fee.\n13.                     \"Real estate salesperson\" means any person associated with a licensed real estate broker to do or to deal in any acts or transactions set out or comprehended by the definition of a real estate broker, for compensation or otherwise.\n14.                     \"Residential property\" shall mean parcel of land within the corporate limits of the city of Columbus which contains a dwelling or structure that provides living accommodations for persons.\n15.                     \"Resigned\" means the license status in which a license has been voluntarily and permanently surrendered to or is otherwise in the possession of the division of real estate and professional licensing, may not be renewed or reactivated in accordance with the requirements specified in the Ohio Revised Code or the rules adopted pursuant to it, and is not associated with a real estate broker.\n16.                     \"Revoked\" means the license status in which the license is void and not eligible for reactivation.\n17.                     \"Seller\" means a party in a real estate transaction who is the potential transferor of property. \"Seller\" includes an owner of property who is seeking to sell the property and a landlord who is seeking to rent or lease property to another person.\n18.                     \"Suspended license\" means the license status that prohibits a licensee from providing services that require a license under the Ohio Revised Code for a specified interval of time.\n19.                     Any person, partnership, association, limited liability company, limited liability partnership, or corporation, who, for another, in consideration of compensation, by fee, commission, salary, or otherwise, or with the intention, in the expectation, or upon the promise of receiving or collecting a fee, does, or offers, attempts, or agrees to engage in, any single act or transaction contained in the definition of a real estate broker, whether an act is an incidental part of a transaction, or the entire transaction, shall be constituted a real estate broker or real estate salesperson under this chapter.\n20.                     (1) The terms \"real estate broker,\" \"real estate salesperson,\" \"foreign real estate dealer,\" and \"foreign real estate salesperson\" do not include a person, partnership, association, limited liability company, limited liability partnership, or corporation, or the regular employees thereof, who perform any of the acts or transactions specified or comprehended in R.C. §4735.01 (L)(A), whether or not for, or with the intention, in expectation, or upon the promise of receiving or collecting a fee, commission, or other valuable consideration:\n(a)                     With reference to real estate situated in this state owned by such person, partnership, association, limited liability company, limited liability partnership, or corporation, or acquired on its own account in the regular course of, or as an incident to the management of the property and the investment in it;\n(b)                     As receiver or trustee in bankruptcy, as guardian, executor, administrator, trustee, assignee, commissioner, or any person doing the things mentioned in this section, under authority or appointment of, or incident to a proceeding in, any court, or as a bona fide public officer, or as executor, trustee, or other bona fide fiduciary under any trust agreement, deed of trust, will, or other instrument that has been executed in good faith creating a like bona fide fiduciary obligation;\n(c)                     As a public officer while performing the officer's official duties;\n(d)                     As an attorney at law in the performance of the attorney's duties;\n(e)                     As a person who engages in the brokering of the sale of business assets, not including the sale, lease, exchange, or assignment of any interest in real estate;\n(f)                     As a person who engages in the sale of manufactured homes as defined in section 3781.06 of the Revised Code, or of mobile homes as defined in section 4501.01 of the Revised Code, provided the sale does not include the negotiation, sale, lease, exchange, or assignment of any interest in real estate;\n \n(g)                     As a person who engages in the sale of commercial real estate pursuant to the requirements of section 4735.022 of the Revised Code;\n \n(h)                     As an oil and gas land professional in the performance of the oil and gas land professional's duties, provided the oil and gas land professional is not engaged in the purchase or sale of a fee simple absolute interest in oil and gas or other real estate and the oil and gas land professional complies with section 4735.023 of the Revised Code;\n \n(i)                     As an oil and gas land professional employed by the person, partnership, association, limited liability company, limited liability partnership, or corporation for which the oil and gas land professional is performing the oil and gas land professional's duties.\n(2)                     A person, partnership, association, limited liability company, limited liability partnership, or corporation exempt under R.C. §4735.01 (U)(I)(1)(a) shall be limited by the legal interest in the real estate held by that person or entity to performing any of the acts or transactions specified in or comprehended by R.C. §4735.01 (L)(A).\n(B)                     “Residential Property Wholesaler” means a person, partnership, association, limited liability company, limited liability partnership, or corporation who engages in the business of buying, selling, or assigning a residential property located Residential Property Wholesaling within the corporate boundaries of the City of Columbus.  \n(C)                     “Residential Property Wholesaling” means undertaking to promote the sale, exchange or purchase of an equitable interest or other interest in residential property with the intent to assign, novate, sell or otherwise transfer the interest for a fee, commission or other valuable monetary consideration without having taken title as the owner of record of the interest.\n \n4518.03 Engaging in Real Estate Transactions Without a License\n(A)                     No person, partnership, association, limited liability company, limited liability partnership, or corporation shall act as a real estate broker or real estate salesperson, or advertise or assume to act as such, without first being licensed as provided in Chapter 4735 of the Ohio Revised Code.\n(B)                     This section shall not apply to any person, partnership, association, limited liability company, limited liability partnership, or corporation that has been licensed or whose license has been placed in inactive or resigned status, or is suspended, or revoked and who has not thereafter reactivated the license or received a new license.\n \n4518.04 Residential Property Wholesaler Registry\n(A)                     All Residential Property Wholesalers doing business in the city of Columbus shall register with the Department of Building and Zoning Services on a form, or in a manner approved by the Director. This provision shall not apply to either of the following:\n1.                     A real estate broker or real estate salesperson that has been licensed under Chapter 4735 of the Ohio Revised Code; or\n2.                     An attorney that has been licensed under Chapter 4705 of the Ohio Revised Code.\n(B)                     No Residential Property Wholesaler who is required to register pursuant to division (A) shall engage in the business of buying, selling, or assigning a residential property located Residential Property Wholesaling within the corporate boundaries of the City of Columbus without being registered with the Department. \n4518.05 Residential Property Wholesaler registration fee\n(A)                     At the time of registration and annually thereafter, the Residential Property Wholesaler shall pay a non-refundable registration fee of fifty dollars. The fees shall be reasonably related to:\n1.                     The administrative costs for registering and processing the registry form;\n2.                     Any other related purposes as set forth in this Chapter.\n(B)                     A Residential Property Wholesaler shall renew their registration annually.\n(C)                     At the time of initial registration or upon registration renewal, a Residential Property Wholesaler can submit a request for relief from registration fees to the Property Maintenance Appeals Board. If the Residential Property Wholesaler is able to demonstrate significant financial hardships, the Property Maintenance Appeals Board may waive the Residential Property Wholesaler’s registration fee requirement.\n4518.06 Prohibited Conduct \n(A)                     No registered Residential Property Wholesaler shall do either of the following:\n1.                     With purpose to solicit residential property for Residential Property Wholesaling within the corporate boundaries of the City of Columbus, make any material misrepresentation or false statement.\n2.                     Knowingly provide false or misleading information when completing a Residential Property Wholesaler registration.\n(B)                     A violation of division (A) of this section shall be cause for the refusal of a Residential Property Wholesaler registration application or the refusal of a renewal of a Residential Property Wholesaler registration application or the revocation of a Residential Property Wholesaler registration.\n(C)                     A Residential Property Wholesaler may appeal a decision to refuse to issue or to refuse to renew or to revoke a Residential Property Wholesaler registration under this section to the Property Maintenance Appeals Board.\n4518.07 Required Disclosures\nA registered Residential Property Wholesaler that is buying, selling, or assigning residential property Residential Property Wholesaling within the corporate boundaries of the City of Columbus shall, in writing, on a form approved by the Director of Building and Zoning Services, disclose all of the following to any individual engaged for the purpose of wholesaling Residential Property Wholesaling:\n(A)                     That the Residential Property Wholesaler is a wholesaler and holds an equitable interest in the property and may not be able to convey title to the property.\n(B)                     That the Residential Property Wholesaler does not hold an active real estate broker or real estate salesperson license under Chapter 4735 of the Ohio Revised Code. \n(C)                     That the individual is advised to seek independent legal advice before entering into the agreement. \n(D)                     That the Residential Property Wholesaler is registered and the wholesaler’s registration number.\n(E)                     A link to the city’s wholesaler portal.\n4518.08 Marketing\nA registered Residential Property Wholesaler shall in the course of marketing for the purchase, sale or assignment of a residential property, initiate the first direct communication to any individual solicited for the purpose of wholesaling Residential Property Wholesaling in writing. That communication shall include the disclosures required under section 4518.07 of this chapter. \n4518.99 Penalties\n(A)                     Except as otherwise provided in division (B), whoever violates sections 4518.03, 4518.07, or 4518.08 is guilty of a misdemeanor of the first degree.\n(B)                     If the individual who is solicited for the purpose of wholesaling Residential Property Wholesaling is 65 years or older, then whoever violates section 4518.08 is guilty of an unclassified misdemeanor which shall punishable by a minimum fine of two thousand five hundred dollars ($2500.00).  Organizations found guilty of a violation of section 4518.08 shall be punishable by a minimum fine of ten thousand dollars ($10,000.00)\n(C)                     In addition to any other remedy or penalty provided in this Housing Code or the Ohio Revised Code, whoever violates section 4518.04 shall incur a civil penalty of one thousand dollars ($1,000.00) and a six-month registration suspension for the first offense and two thousand five hundred dollars ($2,500.00) and a one-year registration suspension for each additional offense.\n(D)                     Each instance of engaging in act in violation of division (B) of section 4518.04 constitutes a separate offense.\n(E)                     Except when a mens rea is provided, strict liability is intended to be imposed for a violation of this Chapter.\n(F)                     Organizational criminal liability as provided for in Section 2301.23 is contemplated for a violation of this Chapter. \n(G)                     Upon conviction of a violation of Section 4518.03, the City Attorney or its designee shall notify the Ohio Department of Commerce, Division of Real Estate.\nSECTION 2. That this ordinance shall take effect on July 1, 2025.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 1,
    "absent": 0,
    "meeting_id": 130,
    "meeting_date": "2024-12-16",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSTAIN"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Housing",
      "Property & Real Estate"
    ]
  }
}