{
  "success": true,
  "vote": {
    "id": 11259,
    "item_number": "SR-3",
    "title": "To authorize and direct the City Attorney to settle all claims with Allison Meade related to three employment discrimination charges filed with the Ohio Civil Rights Commission (OCRC) and the Equal Employment Opportunities Commission (EEOC); to authorize the expenditure of Sixty-Five Thousand Dollars and Zero Cents ($65,000.00) in settlement of the administrative charges; to authorize the transfer of said funds from the Citywide Account into the Department of Public Safety’s General Fund; and to declare an emergency. ($65,000.00)",
    "description": "Explanation\n \nBackground:\n \nThis Ordinance is submitted to settle the charges pending before the Ohio Civil Rights Commission (“OCRC”) and the Equal Employment Opportunities Commission (“EEOC”), as well as any potential future claims Ms. Meade has or may have as of September 26, 2024, in the amount of Sixty-Five Thousand Dollars and Zero Cents ($65,000.00).  Ms. Meade is a current employee of the Department of Public Safety, Division of Fire.  Ms. Meade has alleged sexual harassment, sex discrimination, and/or retaliation at her place of employment. \n \nFiscal Impact:\n \nFunds were not specifically budgeted for this settlement; however, sufficient monies are available within the appropriate account to pay the amount of this claim.  \n \nEmergency Designation:\n \nEmergency designation is requested in order to settle this claim as quickly as possible.\n \nTitle\n \nTo authorize and direct the City Attorney to settle all claims with Allison Meade related to three employment discrimination charges filed with the Ohio Civil Rights Commission (OCRC) and the Equal Employment Opportunities Commission (EEOC); to authorize the expenditure of Sixty-Five Thousand Dollars and Zero Cents ($65,000.00) in settlement of the administrative charges; to authorize the transfer of said funds from the Citywide Account into the Department of Public Safety’s General Fund; and to declare an emergency. ($65,000.00)\n \nBody\n \nWHEREAS, Allison Meade is currently employed by the City of Columbus as a Firefighter; and\n \nWHEREAS, Ms. Meade filed Charge No. COL71(004904)02092024; 22A-2024-02836 with the OCRC and EEOC, alleging sexual harassment, sex discrimination, and retaliation related to an altercation between Ms. Meade and another firefighter that was investigated by the Equal Employment Office; and\n \nWHEREAS, Ms. Meade filed Charge No. COL71(005658)03152024; 22A-2024-03066 with the OCRC and EEOC, alleging sex discrimination related to personnel files requested through a public records request; and\n \nWHEREAS, Ms. Meade filed Charge No. COL71(006231)04102024; 22A-2024-03231 with the OCRC and EEOC, alleging sexual harassment, sex discrimination, and retaliation related to alleged retaliatory behavior within the canine unit; and\n \nWHEREAS, following the evaluation of the claims and the risk of potential litigation of the claims against the City, the parties reached an agreement to settle this matter in the amount of Sixty-Five Thousand Dollars and Zero Cents ($65,000.00) which was deemed acceptable by the City of Columbus, Department of Public Safety, Division of Fire; and \n \nWHEREAS, settlement of the charges along with dismissal with prejudice and a release of the City of Columbus and its employees from further liability is in the best interests of the City of Columbus; and \n \nWHEREAS, sufficient funds are available within the Citywide Account, which will be transferred into the Department of Public Safety General Fund to cover this settlement; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Department of Public Safety, Division of Fire in that it is necessary for this ordinance to be effective immediately in order for the parties to effectuate the settlement of these claims in accordance with the terms of the settlement agreement, which is in the best interest of the City, and to pay the agreed to sum without delay, all for the immediate preservation of the public health, peace, property, and safety; and NOW, THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the City Attorney be and hereby is authorized and directed to settle all claims against the City of Columbus, its officers, agents, and employees in the Charges pending before the OCRC and EEOC by payment of Sixty-Five Thousand Dollars and Zero Cents ($65,000.00) as a reasonable and fair amount and in the best interest of the City of Columbus.\n \nSECTION 2. That the City Auditor be and is hereby authorized and directed to transfer the sum of Sixty-Five Thousand Dollars and Zero Cents ($65,000.00) from the Citywide Account to the Department of Public Safety’s General Fund.  \n \nSECTION 3. That for the purposes of paying this settlement, there be and hereby is authorized to be expended by the City of Columbus, from the Department of Public Safety’s General Fund, in the amount of Sixty-Five Thousand Dollars and Zero Cents ($65,000.00).\n \nSECTION 4. That upon receipt of an invoice and a release approved by the City Attorney, the City Auditor be and is hereby authorized to draw two warrants upon the City Treasurer: one in the amount of Forty-Three Thousand Three Hundred and Fifty-Five Dollars and Zero Cents ($43,355.00) payable to Allison Meade; and one in the amount of Twenty-One Thousand Six Hundred and Forty-Five Dollars and Zero Cents ($21,645.00) payable to Marshall, Foreman, Schlein, LLC, counsel for Ms. Meade.\n \nSECTION 5. That for the reasons stated in the preamble hereto, which is made a part hereof, this ordinance is hereby declared to an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 131,
    "meeting_date": "2025-01-06",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services"
    ]
  }
}