{
  "success": true,
  "vote": {
    "id": 11272,
    "item_number": "CA-5",
    "title": "To authorize the Director of the Department of Public Service to execute those documents necessary for the transfer of 0.004 acre portion of right-of-way adjacent to 222 W Lane Avenue to Lane and Norwich Columbus Owner, LLC. ($0.00)",
    "description": "Explanation\n \nBackground:  The City of Columbus, Department of Public Service, received a request from Lane and Norwich Columbus Owner, LLC asking that the City transfer them a 175 square foot (0.004 acre) portion of the right-of-way adjacent to 222 W Lane Avenue.  The right-of-way area runs north to south for approximately 90 feet and is 2 feet wide. \n \nTransfer of this right-of-way will be used to facilitate the construction a retaining wall for a multi-use development property at 222 W Lane Avenue.  The Department of Public Service has agreed to transfer the right-of-way via a quitclaim deed as described and shown within attached legal description and exhibit, and extinguishes its need for this public right-of-way.  \n \nPer current practice, comments were solicited from interested parties, including City agencies, private utilities and the applicable area commission, before it was determined that, subject to the retention of a general utility easement for those utilities currently located within this right-of-way, the City will not be adversely affected by the transfer of this right-of-way.  \n \nThe Department of Public Service submitted a request to the City Attorney’s Office, asking that they establish a value for this right-of-way, and a value of $7,000.00 was established.  \n \nThis request went before the Land Review Commission on September 19, 2024.  After review of the request, the Land Review Commission voted to recommend the above referenced right-of-way be transferred to Lane and Norwich Columbus Owner, LLC at the cost of $7,000.00 to them.\n                     \nFISCAL IMPACT:  The City will receive a total of $7,000.00 and the funds are to be deposited in Fund 7748, Project P537650, as consideration for the transfer of the requested right-of-way.\n \nTitle\n \nTo authorize the Director of the Department of Public Service to execute those documents necessary for the transfer of 0.004 acre portion of right-of-way adjacent to 222 W Lane Avenue to Lane and Norwich Columbus Owner, LLC. ($0.00)\n                     \nBody\n \nWHEREAS, the City of Columbus, Department of Public Service, received a request from Lane and Norwich Columbus Owner, LLC asking that the City transfer them a 175 square foot (0.004 acre) portion of the right-of-way adjacent to 222 W Lane Avenue.  The right-of-way area runs north to south for approximately 90 feet and is 2 feet wide; and \n \nWHEREAS, transfer of this right-of-way will be used to facilitate the construction of a multi-use development at 222 W Lane Avenue; and\n \nWHEREAS, the Department of Public Service has agreed to transfer via quitclaim deed the right-of-way as described and shown within attached legal description and exhibit, and extinguishes its need for this public right-of-way; and\n \nWHEREAS, per current practice, comments were solicited from interested parties, including City agencies, private utilities and the applicable area commission, before it was determined that, subject to the retention of a general utility easement for those utilities currently located within this right-of-way, the City will not be adversely affected by the transfer of this right-of-way; and\n \nWHEREAS, the Department of Public Service submitted a request to the City Attorney’s Office, asking that they establish a value for this right-of-way; and\n \nWHEREAS, a value of $7,000.00 was established; and\n \nWHEREAS, this request went before the Land Review Commission on September 19, 2024; and\n \nWHEREAS, after review of the request, the Land Review Commission voted to recommend the above referenced right-of-way be transferred to Lane and Norwich Columbus Owner, LLC at the cost of $7,000.00; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.    That the Director of the Department of Public Service be, and hereby is, authorized to execute a quitclaim deed and other incidental instruments prepared by the City Attorney’s Office, necessary to transfer the right-of-way described below and depicted in the attached exhibit which is incorporated into this ordinance for reference, to Lane and Norwich Columbus Owner, LLC; to-wit:\n \nLEGAL DESCRIPTION\n0.004 ACRE RIGHT-OF-WAY PURCHASE\n \nSituated in the State of Ohio, County of Franklin, City of Columbus, and being in Quarter Township 3, Township 1, Range 18, United States Military Lands, being part of a 0.085 acre tract of land conveyed to CITY OF COLUMBUS, OHIO by deed of record in Instrument Number 202208240122148, being of record in the Recorder’s Office, Franklin County, Ohio, and being more particularly described as follows:\n \nCOMMENCING at the intersection of the easterly right-of-way line of Tuttle Park Place (50 feet wide) and the southerly right-of-way line of Norwich Avenue (50 feet wide), also being the northwesterly corner of Lot 43 of JACOB WEBER PLACE of record in Plat Book 17, Page 28, and also being referred to by a 1” iron pipe found at 0.25 feet east and 1.30 feet south;\nThence along the southerly right-of-way line of said Norwich Avenue, South 86°11’07” East, 210.01 feet, passing a 3/4” iron pipe found at 60.03 feet, passing a 3/4” iron pipe found at 90.00 feet, and passing a 3/4” iron pipe found at 149.95 feet, to the northeasterly corner of a tract of land conveyed to ITHACA I, L.L.C., referred to as PARCEL TWO, as recorded by deed in Instrument Number 200504260077505, and also being on the northerly line of Lot 16 of C.E. JUSTICE’S NORTHERN HEIGHTS ADD. as recorded by plat in Plat Book 7, Page 372, and being referenced by a 3/4” iron pipe found at 0.15 feet west and 0.18 feet south, said corner also being the TRUE POINT OF BEGINNING;\nThence continuing along said southerly right-of-way line and said northerly line, South 86°11’07” East, 2.50 feet to an iron pin set;\nThence leaving said southerly right-of-way line and said northerly line and across said 0.085 acre tract and said Lot 16 for the following two (2) courses:\n1)                     South 03°19’58” West, 70.48 feet to an iron pin set;\n2)                     North 86°40’02” West, 2.50 feet to Mag Nail set on the easterly line of said ITHACA I, L.L.C. tract;\nThence along said easterly line and continuing across said Lot 16, North 03°19’58” East, 70.50 feet to the TRUE POINT OF BEGINNING.\nContaining 0.004 acres (177 S.F.) and occupying 0.004 acres of present right-of-way.\nSubject however to all legal easements, restrictions, and rights of way of record and of records in the respective utility offices. \nIron pins set are 5/8” rebar, 30” in length with a yellow plastic cap with “EP FERRIS SURVEYOR 8342” inscribed on top unless otherwise noted. Mag Nails set are magnetic nails with a 1.5” diameter brass washer with “EP FERRIS SURVEYOR 8342” inscribed on top.\nBearings referenced herein are based on the Ohio State Plane Coordinate System, Ohio South Zone, NAD83 (2011) as determined by ODOT RTN observations, with the centerline of Norwich Avenue bearing South 86°11’07” East.\nThis description was prepared by Matthew Lee Sloat, Ohio Registered Professional Surveyor 8342 and is based on field surveys conducted by E.P. Ferris & Associates, Inc. from February, 2020 through June, 2020.\nThis description was prepared on February 2, 2024.\n \nSECTION 2.    That the attached referenced real property shall be, and hereby is, considered excess road right-of-way and the public rights therein shall terminate upon the Director's execution and delivery of said quitclaim deed to the grantee thereof.\n \nSECTION 3.    That a general utility easement in, on, over, across and through the legal description and attached exhibit describing the right-of-way shall be retained unto the City of Columbus for those utilities located within said right-of-way.\n \nSECTION 4.    That upon notification and verification of the relocation of all utilities located within the retained general utility easement area the Director of the Department of Public Service is hereby authorized to execute those documents necessary to release the retained general utility easement with no additional compensation due to the City and with no further legislative action required by the City.\n \nSECTION 5.  That the $7,000.00 to be received by the City as consideration for the sale of this right-of-way shall be deposited in Fund 7748, Project P537650.\n \nSECTION 6.    That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 132,
    "meeting_date": "2025-01-13",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Property & Real Estate",
      "Public Works"
    ]
  }
}