{
  "success": true,
  "vote": {
    "id": 1131,
    "item_number": "SR-12",
    "title": "To authorize the Director of Public Utilities to enter into a construction contract with Columbus Asphalt Paving Inc. for the Holt/Somersworth Stormwater System Improvements project; to authorize the appropriation and transfer of $1,320,004.25 from the Storm Sewer Reserve Fund to the Ohio Water Development Authority (OWDA) Storm Sewer Loan Fund; to authorize the expenditure of $1,320,004.25 from the Ohio Water Development Authority (OWDA) Storm Sewer Loan Fund; to authorize the transfer within and expenditure of up to $2,000.00 from the Storm Sewer Bond Fund to the Department of Public Service to provide for Prevailing Wage Administration Costs for the Division of Sewerage and Drainage, Stormwater Section; and to amend the 2020 Capital Improvements Budget. ($1,322,004.25)",
    "description": "Explanation\n \nBACKGROUND: This legislation authorizes the Director of Public Utilities to enter into a construction contract with Columbus Asphalt Paving Inc. for the Holt/Somersworth Stormwater System Improvements project, CIP 611010-100000. This project consists of constructing 1,800 feet of permeable paver parking lane and over 2,000 feet of 12’’- 36’’ storm sewer, and other such work as may be necessary to complete the contract, in accordance with the plans and specifications set forth in the Invitation For Bid.\nPlanning area is 49 - “North Central”.\n \nPROJECT TIMELINE: All work shall be substantially complete within 300 calendar days of the Notice to Proceed, with final completion to occur within 365 calendar days. The City anticipates issuing a Notice to Proceed on or about June 15, 2021.\nPROCUREMENT INFORMATION: The Department of Public Utilities advertised for competitive bids for the Holt/Somersworth Stormwater System Improvements project, in accordance with the provisions of Section 329 of Columbus City Codes. The bids were opened on April 7, 2021. The following seven companies submitted bids for this project:\n \n1.                                          Columbus Asphalt Paving Inc. = $1,320,004.25\n2.                     Trucco Construction Co., Inc. = $1,449,555.68\n3.                     Complete General Construction = $1,459,387.11\n4.                     Facemyer Company = $1,482,831.26\n5.                     Elite Excavating Co. of Ohio, Inc. = $1,617,404.5\n6.                     Double Z Construction Company = $1,735,185.22\n7.                     Shelly & Sands, Inc. = $2,058,882.45\n \nThe bids were evaluated using the bid tab and quality factor forms and it was determined that Columbus Asphalt Paving Inc. was the lowest responsive, responsible, and best bid.\n \nThis company is not debarred according to the Federal Excluded Parties Listing or the State Auditor's Findings for Recovery Database.\n \nCONTRACT COMPLIANCE No.:  31-0857095 | MAJ | Exp.  11/4/21 DAX #4394\n \n \nEMERGENCY DESIGNATION:  Emergency designation is not requested. \n \nECONOMIC IMPACT: This is a neighborhood flooding mitigation project.  The project is needed to mitigate structure flooding and backyard and street flooding in the vicinity of Holt Ave. and Somersworth Dr.\n \nFISCAL IMPACT: This ordinance authorizes the appropriation and transfer of $1,320,004.25 from the Storm Sewer Reserve Fund 6207 to the Ohio Water Development (OWDA) Storm Sewer Loan Fund 6211; authorizes the expenditure of up to $1,320,004.25 from the OWDA Storm Sewer Loan Fund 6211. This transaction is a temporary measure that is required until such time as the division is able to execute a loan with the OWDA Loan Fund and reimburse the Sanitary Sewer Reserve Fund. The loan is expected to be approved in June 2021.  Additionally $2,000.00 is necessary for Prevailing Wage Services from the Department of Public Service. The transfer and expenditure of $2,000.00 is needed from the Storm Sewer General Obligation Bond Fund 6204. An amendment to the 2020 Capital Improvement Budget is also necessary to align the authority.\n \nTitle\nTo authorize the Director of Public Utilities to enter into a construction contract with Columbus Asphalt Paving Inc. for the Holt/Somersworth Stormwater System Improvements project; to authorize the appropriation and transfer of $1,320,004.25 from the Storm Sewer Reserve Fund to the Ohio Water Development Authority (OWDA) Storm Sewer Loan Fund; to authorize the expenditure of $1,320,004.25 from the Ohio Water Development Authority (OWDA) Storm Sewer Loan Fund; to authorize the transfer within and expenditure of up to $2,000.00 from the Storm Sewer Bond Fund to the Department of Public Service to provide for Prevailing Wage Administration Costs for the Division of Sewerage and Drainage, Stormwater Section; and to amend the 2020 Capital Improvements Budget. ($1,322,004.25)\n \nBody\n \nWHEREAS, the Department of Public Utilities advertised for competitive bids for the Holt/Somersworth Stormwater System Improvements project on the City's Vendor Services website and in the City Bulletin in accordance with the overall provisions of Chapter 329 of the Columbus City Code; and \n \nWHEREAS, seven (7) companies submitted bids for this project on April 7, 2021, and Columbus Asphalt Paving Inc. was selected using the bid tabulation and quality factor process; and\n \nWHEREAS, it is necessary to authorize the Director of the Department of Public Utilities to execute a construction contract with Columbus Asphalt Paving, Inc. for the Holt Somersworth Stormwater System Improvements Project and to encumber and expend funds to provide for prevailing wage services; and\n \nWHEREAS, the Ohio Water Development Authority (OWDA) will approve an Ohio EPA WPCLF loan agreement with the City of Columbus in the October 2021 award period, in the amount of $1,320,004.25 to provide financing for the above listed project with eligible costs including the construction contract and contingency; and\n \nWHEREAS, it is necessary to both appropriate $1,320,004.25 from the Storm Sewer System Reserve Fund 6207, and to authorize the transfer of said funds to the OWDA Storm Sewer Loan Fund 6211 in order to temporarily fund this expenditure until such time as the City receives loan proceeds for the above stated purpose and reimburses the Storm Sewer Reserve Fund; and\n \nWHEREAS, the aggregate principal amount of obligations which the City will issue to finance this construction contract  will not exceed $1,320,004.25; and\n \nWHEREAS, it is necessary to authorize the expenditure of up to $1,320,004.25 from the OWDA Storm Sewer Loan Fund 6211; and\n \nWHEREAS, the City anticipates incurring certain Original Expenditures (as defined in Section 1.150-2(c) of the Treasury Regulations (the “Treasury Regulations”) promulgated pursuant to the Internal Revenue Code of 1986, as amended) with respect to the project described in this ordinance (the “Project”); and\n \nWHEREAS, it is necessary to authorize the transfer within and expenditure of up to $2,000.00 from the Storm Sewer Bond Fund 6204 for Prevailing Wage Services to the Department of Public Service; and\n \nWHEREAS, it is necessary to amend the 2020 Capital Improvement Budget in order to provide sufficient authority; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities to authorize the Director to enter into a construction contract with Columbus Asphalt Paving Inc. for the Holt/Somersworth Stormwater System Improvements project,, CIP 611010-100000, for the preservation of the public health, peace, property, safety; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Public Utilities is hereby authorized to enter into a construction contract with Columbus Asphalt Paving Inc., 1196 Technology Dr., Gahanna, Ohio 43230 ; for the Holt/Somersworth Stormwater System Improvements project, pursuant to the terms and conditions as shown in the agreement on file in the office of the Division of Sewerage and Drainage.\n \nSECTION 2.  That from the unappropriated monies in the Storm Sewer Reserve Fund 6207 and from all monies estimated to come into said fund from any and all sources, and unappropriated for any other purpose during the fiscal year ending December 31, 2021, the sum of $1,320,004.25 is appropriated, per the account codes in the funding attachment to this ordinance.\n \nSECTION 3. That the transfer of $1,320,004.25 or so much thereof as may be needed, is hereby authorized between the Storm Sewer Reserve Fund 6207 and OWDA Storm Sewer Loan Fund 6211 per the accounting codes in the attachment to this ordinance. \n \nSECTION 4. That the appropriation and expenditure of $1,320,004.25, or so much thereof as may be needed, is hereby authorized in the OWDA Storm Sewer Loan Fund 6211 per the accounting codes in the attachment to this ordinance.\n \nSECTION 5.  That the transfer within and expenditure of up to $2,000.00 is authorized from the Storm Sewer Bond Fund 6204 per the accounting codes in the attachment to this ordinance.\n \nSECTION 6.  That the 2020 Capital Improvement Budget is amended per the accounting codes in the attachment to this ordinance.\n \nSECTION 7.  That the said firm, Columbus Asphalt Paving Inc., shall perform the work to the satisfaction of the Director of Public Utilities and the Administrator of the Division of Sewerage and Drainage.\n \nSECTION 8. That the City Auditor is hereby authorized to transfer any unencumbered balance in the project account to the unallocated balance within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project; except that no transfer shall be made from a project by monies from more than one source. \n \nSECTION 9.   That the City Auditor is authorized to establish proper project accounting numbers as appropriate.\n \nSECTION 10.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 11.   That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 12. That upon obtaining other funds for the purpose of funding sanitary sewer system capital improvement work, the City Auditor is hereby authorized to repay the Storm Sewer Reserve Fund 6207 the amount transferred above (Section 3), and said funds are hereby deemed appropriated for such purposes.\n \nSECTION 13.  That the City intends that this Ordinance constitute an \"official intent\" for purposes of Section 1.150-2(e) of the Treasury Regulations, and that the City reasonably expects to reimburse itself for certain Original Expenditures incurred with respect to the Project from the proceeds of obligations to be issued by the City in a principal amount currently estimated to be $1,320,004.25 (the \"Obligations\").\n \nThe City intends to make a reimbursement allocation on its books for the Original Expenditures not later than eighteen months following the later to occur of the date of the Original Expenditure to be reimbursed or the date the Project for which such Original Expenditures were made is \"placed in service\" within the meaning of Treasury Regulations Section 1.150-2(c).  Upon the issuance of the Obligations, the proceeds of such Obligations shall be used to reimburse the Storm Sewer Reserve Fund 6207, which is the fund from which the advance for costs of the Project will be made.\n \nSECTION 14. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 17,
    "meeting_date": "2021-06-14",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}