{
  "success": true,
  "vote": {
    "id": 11322,
    "item_number": "CA-6",
    "title": "To Honor, Recognize, and Celebrate Linda S. Henry for her Lifelong Dedication to Public Service and Extensive Record of Community Leadership",
    "description": "Title\n \n To Honor, Recognize, and Celebrate Linda S. Henry for her Lifelong Dedication to Public Service and Extensive Record of Community Leadership\nBody\n \nWHEREAS, Linda S. Henry, of Columbus, Ohio, was born on September 27th, 1951, and has been a pillar in the Columbus community for decades; and\n \nWHEREAS, Linda dedicated her personal and professional career to public service, becoming a crucial civic pillar of Columbus, working for several critical city programs, community organizations, and activist efforts to better Columbus; and\nWHEREAS, Linda has been a tireless advocate for violence prevention and criminal justice for many years, serving as President of South Side Neighbors Against Crime, helping lead the Coalition for a Non-Violent Columbus, and was an active member of the Vassor Village and the Reeb/Hosack block watch programs, ensuring neighborhood safety and supporting the needs of Southside Columbus; and\nWHEREAS, Linda’s unwavering dedication to violence prevention led her to become an indispensable leader and resource for Southside and Columbus as a whole, receiving training and certifications by the Sheriff Academy, FBI Academy, Citizen’s Police Academy, as well as recognition by 311 for her community cleanup work and being named Citizen of the Year by Crime Stoppers; and\nWHEREAS, dedication to community is embodied in all facets of Linda’s life, regularly spending her holidays volunteering to help those experiencing homelessness and providing food for those in need, as well as working with code enforcement and CPD on monitoring abandoned houses; and\nWHEREAS, the City of Columbus wants to celebrate and lift up the tireless, and all too often unsung, heroes of the city who have worked throughout the decades to make Columbus a safer, more vibrant community; now, therefore,\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: That this Council hereby honors, recognizes, and celebrates Linda S. Henry for her lifelong dedication to public service and extensive record of community leadership.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 135,
    "meeting_date": "2025-01-27",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions",
      "Public Works"
    ]
  }
}