{
  "success": true,
  "vote": {
    "id": 11321,
    "item_number": "CA-5",
    "title": "To honor, recognize, and celebrate the life of the Reverend Dr. Jefferey P. Kee, 1961-2024",
    "description": "Title\n \nTo honor, recognize, and celebrate the life of the Reverend Dr. Jefferey P. Kee, 1961-2024\n \nBody\n \nWHEREAS, the Reverend Dr. Jefferey P. Kee, “pastor for the master,” was born on August 5th, 1961 to his late parents, James and Johnnie Mae Kee; and\n \nWHEREAS, the Rev. Dr. Kee was a prolific and deeply loved faith leader, serving for nearly 35 years at New Faith Baptist Church of Christ as senior pastor, who was known as a funny, wise, down-to-earth friend and confidant by the community, growing the size of his congregation and significantly expanding the physical and spiritual presence of New Faith Baptist in Columbus; and\n \nWHEREAS, the Rev. Dr. Knee was towering figure in the Columbus social justice community, emphasizing the inseparable link between faith and justice, helping found the interfaith community organization B.R.E.A.D (Building Responsibility Equality And Dignity) as well as leading the Area Religious Coalition, both dedicated to combating all forms of injustice; and\nWHEREAS, the Rev. Dr. Kee was deeply loved by his congregation and the entire faith and social justice community and embodied his faith in every aspect of his life, cultivating the next generation of city leaders and leaving a legacy of spiritual stewardship; and\nWHEREAS, the City of Columbus extends its sincere condolences to the friends and family of the Reverend Dr. Jefferey P. Kee, including his daughter, Jazmine M. Kee-Lovette; fiancée, Monique Smoot; siblings, Jennifer, Jacquelyn, Jameel, James, and Joreece Kee, and countless other family members, friends, faith leaders, and loved ones across Columbus and beyond; now, therefore,\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: That this Council does hereby honor, recognize, and celebrate the life of the Reverend Dr. Jefferey P. Kee.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 135,
    "meeting_date": "2025-01-27",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}