{
  "success": true,
  "vote": {
    "id": 11404,
    "item_number": "CA-26",
    "title": "To authorize the Director of Public Utilities to maintain membership with the Ohio Utilities Protection Service; and to authorize the expenditure of $62,901.36 split between the Electricity, Water, Sanitary Sewer, and Stormwater Operating Funds. ($62,901.36)",
    "description": "Explanation\n \nThe purpose of this legislation is to authorize the Director of Public Utilities to maintain membership with the Ohio Utilities Protection Service (OUPS). Ohio Revised Code 3781.26(A) requires “Each utility that owns or operates underground utility facilities shall participate in and register the location of its underground facilities with a protection service that serves the area where the facilities are located.” OUPS is recognized as a protection service and continued membership allows for compliance with the Ohio Revised Code. Annually, the Department of Public Utilities (DPU) receives approximately 145,000 excavation notices from OUPS, which allows DPU to proactively protect our valuable underground infrastructure from damage due to excavation and provide a safe working and living environment for our residents. \n \nPrincipal Party:\n \nOhio Utilities Protection Service\nPO Box 729 \n12467 Mahoning Avenue\nNorth Jackson, OH 44451                                                                      \nDenise Burgy, 800-362-2764\nContract Compliance Number: 006597\nContract Compliance Expiration Date: February 12, 2026\n \nThe company is not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.\n \nFiscal Impact:  $62,901.36 is budgeted and available from within the Public Utilities Operating Funds to meet the financial obligations of this contract renewal. This ordinance is contingent on the passage of the 2025 Operating Budget, Ordinance #3036-2024.\n \n$66,823.76 was spent in 2024\n$63,029.05 was spent in 2023\n$54,552.77 was spent in 2022\n \nTitle\n \nTo authorize the Director of Public Utilities to maintain membership with the Ohio Utilities Protection Service; and to authorize the expenditure of $62,901.36 split between the Electricity, Water, Sanitary Sewer, and Stormwater Operating Funds. ($62,901.36)\n \nBody\n \nWHEREAS, Ohio Revised Code 3781.26(A) requires “Each utility that owns or operates underground utility facilities shall participate in and register the location of its underground facilities with a protection service that serves the area where the facilities are located”; and\n \nWHEREAS, the Ohio Utilities Protection Service (\"OUPS\") is recognized as a protection service and continued membership allows for compliance with the Ohio Revised Code; and\n \nWHEREAS, annually the Department of Public Utilities (DPU) receives approximately 145,000 excavation notices from OUPS, which allows DPU to proactively protect our valuable underground infrastructure from damage due to excavation and provide a safe working and living environment for our residents; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities to authorize the Director of Public Utilities to maintain membership with the OUPS; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Utilities be and is hereby authorized to pay membership fees to the Ohio Utilities Protection Service (OUPS) for Fiscal Year 2025.\n \nSECTION 2.  That the expenditure of $62,901.36, or so much thereof as may be needed, be and is hereby authorized per the accounting codes in the attachment to this ordinance.\nSECTION 3. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5. That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 136,
    "meeting_date": "2025-02-03",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Health & Safety",
      "Infrastructure"
    ]
  }
}