{
  "success": true,
  "vote": {
    "id": 11501,
    "item_number": "SR-22",
    "title": "To supplement the Columbus Zoning Code, Title 33, by amending or adding various code sections for land uses and definitions associated with the Ohio Division of Cannabis Control, the General Offenses Code, Title 23, and the Fire Prevention Code, Title 25, to repeal the corresponding existing city code provisions, and to repeal Sections 3389.09 and 3389.115, which require a Special Permit from the Board of Zoning Adjustment for certain uses.",
    "description": "Explanation \n \nBACKGROUND:\nIn response to the creation of the Ohio Medical Marijuana Control Program in 2018, the Zoning Code was updated to specify which zoning districts the uses licensed under the State program would be allowed in based upon already codified similar land uses. In addition, it created the requirement and review standards for obtaining a Special Permit from the Columbus Board of Zoning Adjustment for the establishment of an Ohio Medical Marijuana Control Program Retail Dispensary.\n \nIn November 2023, Issue 2 was placed on the ballot for Ohio voters to decide whether to commercialize, regulate, and legalize the adult use of cannabis in the State of Ohio. Specifically, Issue 2 legalized and provided for the regulation of recreational marijuana for adults aged 21 and above, including cultivation, processing, sale, and purchase.\n \nThe Special Permit requirement for Medical Marijuana Dispensaries was added as a way to require the Owner to present certain information to their neighbors. Now, the Ohio Division of Cannabis Control has its own regulations for all cannabis uses, both medical and adult use (non-medical), and maintains lists of the Owners on its website with a mapping feature to show the locations of the dispensaries. Based on these stringent requirements, and the fact that existing dispensaries have not posed harm to Columbus’ public safety and welfare, the Special Permit is unnecessary for all dispensary uses. These code changes will not alter, change, lessen, or abrogate any of the state level standards or requirements for any licensed facility under the control of the Ohio Division of Cannabis Control.\n \nThese code changes also include updates to prohibited uses and redefined terms to align with Title 23, the General Offenses Code, and Title 25, the Fire Prevention Code, which were requested by the City Attorney’s Office.\n \n \nFISCAL IMPACT: None\n \nTitle\n \nTo supplement the Columbus Zoning Code, Title 33, by amending or adding various code sections for land uses and definitions associated with the Ohio Division of Cannabis Control, the General Offenses Code, Title 23, and the Fire Prevention Code, Title 25, to repeal the corresponding existing city code provisions, and to repeal Sections 3389.09 and 3389.115, which require a Special Permit from the Board of Zoning Adjustment for certain uses.\n \nBody\n \nWHEREAS, in response to the passage of Issue 2 in November 2023, this code change is necessary to amend various sections of the Zoning Code to specify which zoning districts the uses licensed under the State program would be allowed in based upon already codified similar land uses for land uses associated with the Ohio Division of Cannabis Control; and\n \nWHEREAS, these code changes repeal the requirement for obtaining a Special Permit from the Columbus Board of Zoning Adjustment for the establishment of an Ohio Medical Marijuana Control Program Retail Dispensary; and\n \nWHEREAS, these code changes will not alter, change, lessen, or abrogate any of the state level standards or requirements for any licensed facility under the control of the Ohio Division of Cannabis Control; and\n \nWHEREAS, these code changes also include updates to prohibited uses and redefined terms to align with Title 23, the General Offenses Code, and Title 25, the Fire Prevention Code, which were requested by the City Attorney’s Office; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS: \n \nSECTION 1. That the existing Section 3303.05 of the Columbus City Codes is hereby amended to read as follows:\n3303.05 Letter E.\n\"Explosives\" means any materials or combination of materials classified as an explosive under C.C. Chapter 25562256.\nSECTION 2. That the existing Section 3303.06 of the Columbus City Codes is hereby amended to read as follows:\n3303.06 Letter F.\n\"Fireworks\" means any pyrotechnic devices classified as fireworks under C.C. Chapter 2533 2556.\nSECTION 3. That Section 3303.15 of the Columbus City Codes is hereby amended to read as follows: \n \n3303.15 - Letter O.\n\"Occupancy\" means the portion of a building or premises owned, leased, rented, or otherwise occupied for a given use. The term also pertains to the purpose for which a building or part of a building is used or intended to be used. Change of occupancy is not construed to include change of tenants or proprietors, when a nonconforming use is being considered.\nOff-Premises Sign. See \"Sign.\"\n\"Ohio Division of Cannabis Control Licensed Facility\" means Ohio Division of Cannabis Control Testing Laboratory, Ohio Division of Cannabis Control Retail Dispensary, Ohio Division of Cannabis Control Cultivator, and Ohio Division of Cannabis Control Processors, for both adult-use and medical purposes.\n\"Ohio Division of Cannabis Medical Marijuana Control Program Testing Laboratory\" means an independent laboratory located in Ohio licensed or receiving a certificate of operation under Title 37 Chapter 3796 of the Ohio Revised Code and any rules promulgated thereunder to have custody and use of controlled substances for scientific and medical purposes and for purposes of instruction, research, or analysis.\n\"Ohio Division of Cannabis Medical Marijuana Control Program Dispensary\" means an entity licensed or receiving a certificate of operation under Title 37 Chapter 3796 of the Ohio Revised Code and any rules promulgated thereunder to sell adult-use or medical marijuana to qualifying patients and caregivers customers.\n\"Ohio Division of Cannabis Medical Marijuana Control Program Cultivator\" means an entity licensed or receiving a certificate of operation under Title 37 Chapter 3796 of the Ohio Revised Code and any rules promulgated thereunder to grow, harvest, package, and transport adult-use or medical marijuana.\n\"Ohio Division of Cannabis Medical Marijuana Control Program Processor\" means an entity licensed or receiving a certificate of operation under Title 37 Chapter 3796 of the Ohio Revised Code and any rules promulgated thereunder to manufacture adult-use or medical marijuana products.\nOn-Premises Sign. See \"Sign.\"\n\"Opaque\" means a completely nontransparent and nontranslucent material.\n\"Open court\" means open, uncovered, unoccupied space on the same lot with a building wholly surrounded by or bordered on two or more sides by the building walls.\nOpen Porch. See \"Porch.\"\nOutdoor amphitheater\" means any non-publicly owned or operated land or open faced structure or building designed, intended to be used, or used to accommodate patrons in tiered seating and exclusive from motor vehicles.\nOutline Lighting and Neon Outline Lighting.\n\"Outline lighting\" means an arrangement of lights, lamps or electric discharge tubing that outlines or calls attention to certain features of a building such as its shape or the decoration of a window.\n\"Neon outline lighting\" means outline lighting formed in whole or part with neon.\n\"Overlay\" means an additional special classification together with regulations therefore which is superimposed on an area already subject to a district classification and general zoning regulations.\n\"Owner\" means any person, as defined in C.C. 3303.16, who is the owner of record as shown on the current tax list of the county auditor; the mortgage holder of record, if any, as shown in the mortgage records of the county recorder, and any purchaser under a land contract. \"Owner\" also means any person who has a freehold or lesser estate in the premises; a mortgagee or vendee in possession; or any person who has charge, care or control of the premises as agent, executor, administrator, assignee, receiver, trustee, guardian or lessee.\n \nSECTION 4. That Section 3353.03 of the Columbus City Codes is hereby amended to read as follows: \n \n3353.03 - Permitted uses.\nThe following are uses permitted in the C-2, Office Commercial District; however these are not meant to be exhaustive nor an exclusive listing. The Director has the authority to decide if an unnamed use is of similar enough character and nature to warrant inclusion into the C-2 district.\nThe North American Industry Classification System, or its successor document, is the reference document used to provide use families for this chapter. The Director may use the current NAICS or its successor, as one document in making decisions as to the appropriateness of any future use permitted to be in the C-2, district.\nA. Offices for administrative and support services, examples include:\nAdministrative and Support Services\nBusiness Service Centers and Support Services\nCollection Agencies\nConvention and Visitors Bureaus\nCourt Reporting and Stenotype Services\nCredit Bureaus\nDocument Preparation Services\nEmployment Services and Placement Agencies\nFacilities Support Services\nProfessional Employer Organizations\nRepossession Services\nTelephone Answering Services\nTelemarketing Bureaus\nTelephone Call Centers\nTemporary Help Services\nTour Operators\nTravel Agencies, Travel Arrangement and Reservation Services\nB. Offices and/or Clinics for Health Care and Social Assistance, examples include:\nAmbulatory Health Care Services\nChiropractors, Dentists, Optometrists, Physicians and Podiatrists\nDiagnostic Imaging Centers\nFamily Planning Centers\nFreestanding Ambulatory Surgical and Emergency Centers\nHMO Medical Centers (Urgent Care)\nHome Health Care Services\nKidney Dialysis Centers\nMedical and Diagnostic Laboratories\nMental Health Practitioners\nMiscellaneous Health Practitioners\nOutpatient Care Centers\nOutpatient Mental Health Centers\nPhysical, Occupational and Speech Therapists and Audiologists\nSocial Services\nC. Offices for Finance and Insurance, examples include:\nBanking, Commercial and Personal\nBrokerage, Commodity and Securities Exchanges\nClaims Adjusting Offices\nCommodity Contracts Brokerage and Dealing\nConsumer Lending\nCredit Unions\nDirect Casualty, Health, Life, Medical, Property and Title Insurance Carriers\nFinancial Transactions Processing, Reserve and Clearinghouse Activities\nFunds, Trusts, and Other Financial Vehicles\nInsurance Agencies, Brokerages, Carriers and Employee Benefit Funds\nInternational Trade Financing\nInvestment Advice and Banking and Securities Dealing\nMortgage and Non-mortgage Loan Brokers\nPension Funds\nSavings Institutions\nTrusts, Estates, Fiduciary and Agency Accounts\nD. Offices for Public and Miscellaneous Purposes, examples include:\nBusiness, Professional, Labor, Political and Similar Organizations\nConservation, Environment and Wildlife Organizations\nCivic and Social Organizations\nHuman Rights Organizations\nLibraries\nLocal, County, State and Federal Government\nPublic Fire Stations\nReligious, Grant making, Civic, Professional and Similar Organizations\nSocial Advocacy Organizations\nVoluntary Health Organizations\nE. Offices for Professional, Scientific and Technical Services examples include:\nAccounting and Bookkeeping Services\nAdvertising Services\nAdministrative and General Management Consulting Services\nArchitectural, Drafting, Engineering, Graphic and Landscape Design Services\nBank Holding Companies\nCertified Public Accountants\nContractors\nComputer Centers, Programming and Systems Design Services\nCorporate, Subsidiary and Regional Managing\nDisplay Advertising\nHuman Resources and Executive Search Consulting Services\nInterior Design Services\nIndustrial Design Services\nLawyers and Legal Services\nManagement, Companies and Enterprises and Consulting Services\nMarketing Consulting, Public Opinion Polling and Research Services\nNotaries\nPayroll Services\nProcess, Physical Distribution and Logistics Consulting Services\nPublic Relations Agencies\nReal Estate Agents and Brokers\nSurveying and Mapping Services\nTax Preparation Services\nTitle Abstract and Settlement\nTranslation and Interpretation Services\nF. Non-Office Commercial Facilities including:\nArt Studios (No retail sales)\nElectronic and Telephone Mail Order Processing Centers\nEducational Facility, Business, Computer, Management and Training Facilities\nEducational Facility, Professional, Secretarial, Technical and Trade\nInternet Providers, Web Search Portals and Data Processing Services\nLibraries and Museums\nMusic Publishers\nOhio Division of Cannabis Medical Marijuana Control Program Testing Laboratory\nPhotography Studios, Commercial and Portrait\nPost Offices\nPublic Park and Recreation Centers\nRadio and Television Broadcasting Stations and Studios\nRecording Studios\nReligious Facilities\nSchools (as defined in C.C. 3303)\nG. Non-Office Commercial Uses, subject to the additional provisions of C.C. 3353, including:\nAdult and Child Day Care Centers\nMonopole Telecommunication Antennas\nVeterinarians (Limited practice)\nH. Dwelling units, as allowed under C.C. 3353.05.\n \nSECTION 5. That Section 3356.03 of the Columbus City Codes is hereby amended to read as follows: \n \n3356.03 C-4 permitted uses.\nThe following are uses permitted in the C-4, Commercial District; however these are not meant to be exhaustive nor an exclusive listing. The Director has the authority to decide if an unnamed use is of similar enough character and nature to warrant inclusion into the C-4 district.\nThe North American Industry Classification System, or its successor document, is the reference document used to provide use families for this chapter. The Director may use the current NAICS or its successor, as one document in making decisions as to the appropriateness of any future use permitted to be in the C-4, district.\nA. All uses listed in C.C. 3351, C.C. 3353 and C.C. 3355. B. Commercial uses allowing dwelling units above the primary use, including:\nAppliance Stores\nAutomotive Accessories, Parts and Tire Stores\nAutomobile and Light Truck Dealers\nAutomobile Driving Training Facility\nAutomotive Sales, Leasing and Rental\nBars, Cabarets and Nightclubs\nBlood and Organ Banks\nBuilding Material and Supplies Dealers\nCaterers\nCheck Cashing and Loans\nCommunity Food Pantry\nConsumer Goods Rental\nDiscount Department Stores\nElectronics Stores\nFloor Covering Stores\nFurniture and Home Furnishings Stores\nGeneral Merchandise Stores\nHome Centers\nHousehold and Personal Goods Maintenance and Repair\nLinen and Uniform Supply\nMissions/Temporary Shelters\nMotorcycle, Boat, and Other Motor Vehicle Dealers\nMotor Vehicle Accessories and Parts Dealers\nOhio Division of Cannabis Medical Marijuana Control Program Dispensary\nOutdoor Power Equipment Stores\nParking Lots and Parking Garages as allowed in C.C. 3356.05\nPawn Brokers\nRecreational Vehicle Dealers\nReupholster and Furniture Repair\nSporting Goods and Outfitters Stores\nSupermarkets\nTruck, Utility Trailer, and RV (Recreational Vehicle) Sales, Rental and Leasing\nUsed Merchandise Stores\nVending Machine Operators\nWarehouse Clubs and Super Centers\nC. Commercial uses not allowing dwelling units above the primary use, including:\nAutomotive Maintenance and Repair\nBowling Centers\nCarpet and Upholstery Cleaning Services\nDrive-In Motion Picture Theaters\nExterminating and Pest Control Services\nFarm Equipment and Supply Stores\nGarden, Landscaping and Nursery Centers and Sales\nHotels and Motels\nHotels, Extended Stay\nHospitals\nJanitorial Services\nLawn and Garden Equipment and Supplies Stores\nLimousine and Taxi Service\nPaint and Wallpaper Stores\nPerforming Arts, Spectator Sports and Related Industries\nTheaters, Dance Companies and Dinner Theaters\nD. Commercial uses not allowing dwelling units above the primary use and subject to the additional provisions of C.C. 3356.05, including:\nAnimal Shelter\nAmusement Arcade\nHalfway House\nVeterinarians (unlimited practice)\nE. Dwelling units, as allowed under C.C. 3356.05.\n \nSECTION 6. That Section 3363.08 of the Columbus City Codes is hereby amended to read as follows: \n \n3363.08 Miscellaneous uses-less objectionable uses.\nMiscellaneous uses less objectionable uses permitted in M-Manufacturing Districts, subject to the provisions of this Zoning Code are:\nManufacture, compounding, processing, assembling, packaging or treatment of goods, materials and products not involving operations which are obnoxious or offensive by reason of odor, dust, smoke, gas, fumes, vibration, noise or other cause:\nCigar or cigarette manufacture\nDry cleaning and dyeing plant\nFur finishing\nLeather goods manufacture (not including tanning)\nLaundry (employing more than three persons)\nMonument shop\nMotion-picture producing\nOhio Division of Cannabis Medical Marijuana Control Program Cultivator\nOhio Division of Cannabis Medical Marijuana Control Program Processor\nPaint and shellac (excluding manufacture of lacquer, varnish colors, pigments, thinners and removers)\nPlastic products\nPrinting, publishing or engraving (other than as permitted in Commercial Districts)\nResearch and development laboratories, computer laboratories, and offices in connection with such laboratories\nShow printing\nSteam laundry\n \nOther uses of similar character which are not obnoxious or offensive, as defined in this section.\n \nSECTION 7. That Section 3365.08 of the Columbus City Codes is hereby amended to read as follows: \n \n3365.08 Miscellaneous uses-less objectionable uses.\nMiscellaneous uses less objectionable uses permitted in M-1 Manufacturing Districts, subject to the provisions of this Zoning Code are:\nManufacture, compounding, processing, assembling, packaging or treatment of goods, materials and products not involving operations which are obnoxious or offensive by reason of odor, dust, smoke, gas, fumes, vibration, noise or other cause:\nCigar or cigarette manufacture\nCommercial radio transmitting or television station and appurtenances thereto\nDry cleaning and dyeing plant\nFur finishing\nLeather goods manufacture (not including tanning)\nLaundry (employing more than three persons)\nMonument shop\nMotion-picture production\nOhio Division of Cannabis Medical Marijuana Control Program Cultivator\nOhio Division of Cannabis Medical Marijuana Control Program Processor\nPaint and shellac (excluding manufacture of lacquer, varnish colors, pigments, thinners and removers)\nPlastic products\nPrinting, publishing or engraving (other than as permitted in Commercial Districts)\nResearch and development laboratories, computer laboratories, and offices in connection with such laboratories\nResidence for a resident watchman\nShow printing\nSteam laundry\nOther uses of similar character which are not obnoxious or offensive, as defined in this section.\n \nSECTION 8. That Section 3367.08 of the Columbus City Codes is hereby amended to read as follows: \n \n3367.08 Miscellaneous uses-less objectionable uses.\nMiscellaneous uses, less objectionable uses permitted in M-2 manufacturing districts, subject to the provisions of this Zoning Code are:\nManufacture, compounding, processing, assembling, packaging or treatment of goods, materials and products not involving operations which are obnoxious or offensive by reason of odor, dust, smoke, gas, fumes, vibration, noise or other cause:\nCigar or cigarette manufacture\nCommercial radio transmitting or television station and appurtenances thereto\nDry cleaning and dyeing plant\nFur finishing\nLeather goods manufacture (not including tanning)\nLaundry (employing more than three persons)\nMonument shop\nMotion-picture production\nOhio Division of Cannabis Medical Marijuana Control Program Cultivator\nOhio Division of Cannabis Medical Marijuana Control Program Processor\nPaint and shellac (excluding manufacture of lacquer, varnish colors, pigments, thinners and removers)\nPlastic products\nPrinting, publishing or engraving (other than as permitted in commercial districts)\nResidence of a resident watchman\nResearch and development laboratories, computer laboratories, and offices in connection with such laboratories\nShow printing\nSteam laundry\nOther uses of similar character which are not obnoxious or offensive, as defined in this section.\n \nSECTION 9. That the existing Section 3387.01 of the Columbus City Codes is hereby amended to read as follows:\n3387.01 Prohibited uses specified.\nWithin the City, no buildings or premises shall be used, and no buildings or structures shall be erected which are arranged, intended or designed to be used for any of the following uses:\n(1) Acid manufacture or sale including hydrochloric, nitric, sulfuric, sulfurous or hydrofluoric acid;\n(2) Bronze powder or other metallic powder manufacture or sale;\n(3) Explosives manufacture, storage or sale;\n(4) Fireworks manufacture, storage or sale;\n(5) Landfill or dump for refuse;\n(6) Outdoor firing range.;\n(7) Slaughtering of animals (except poultry), stock yards;\n(8) Any other use prohibited under Chapter 2329.\nException: Use prohibitions 1, 2, 3, and 4 listed above shall not apply to facilities in experimental and analytical laboratories when permission for such use has been obtained in writing from the state Department of Industrial Relations, nor in laboratories of state accredited schools, colleges, and other similar institutions for the purpose of instruction or experiment when approved by the Fire Chief of the City of Columbus, or designee. The use prohibition in (4) above shall not apply to the display and sale of fountain devices in accordance with the Ohio Revised Code.\n \nSECTION 10. That Columbus City Codes are hereby supplemented with the repeal of existing Section 3389.09:\n \n3389.09 - Slaughterhouse or stockyard.\nA slaughterhouse or a stockyard requires a Special Permit and shall only be located in an M or M-1 Manufacturing District.\n \nSECTION 11. That Columbus City Codes are hereby supplemented with the repeal of existing Section 3389.151:\n \n3389.151 Ohio Medical Marijuana Control Program Retail Dispensary.\nAn Ohio Medical Marijuana Control Program Retail Dispensary requires a Special Permit and shall only be located in any zoning district permitting C-4 Commercial District uses. In addition to complying with the underlying zoning standards, an Ohio Medical Marijuana Control Program Retail Dispensary shall provide proof that their proposed location provides a minimum 500-foot separation from other Ohio Medical Marijuana Control Program Retail Dispensaries. Distance separation as required in this section is measured from the closest point on a parcel line containing the Ohio Medical Marijuana Control Program Retail Dispensary and the closest point on a parcel line containing the zoning district or use it is to be separated from.\nThe board of zoning adjustment shall grant a special permit for a Medical Marijuana Retail Dispensary only when it finds that the following conditions have been met:\n(a)                     Applicants shall provide proof of compliance of providing notice to all property owners within 250 feet of the proposed location.\n(b)                     Applicant shall also provide a presentation to the applicable area commission or civic association, if established, that shall include the following information:\n(i)                     an introduction of the company along with background, anticipated earliest opening date, operating hours and days of the week, and an emergency contact name and number.\n \nSECTION 12. That prior existing sections 3303.05, 3303.06, 3303.15, 3353.03, 3356.03, 3363.08, 3365.08, 3367.08, and 3387.01 of the Columbus City Codes are hereby repealed.\n \nSECTION 13. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 137,
    "meeting_date": "2025-02-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services",
      "Planning & Development"
    ]
  }
}