{
  "success": true,
  "vote": {
    "id": 11510,
    "item_number": "CA-1",
    "title": "To Congratulate the Founder of Legacy Academy of Excellence and Team for Hosting their Annual Black History Program for the Community",
    "description": "Title\nTo Congratulate the Founder of Legacy Academy of Excellence and Team for Hosting their Annual Black History Program for the Community\n \n \n \nBody\nWHEREAS, Dr. Emmanuel D. Anthony is the founder and CEO of Legacy Academy of Excellence and Ascension Investment Group LLC, an education management company designed to create, develop and lead innovative community schools systems in urban communities across the United States; and\nWHEREAS, He serves and empowers socio-economically challenged communities within the city of Columbus OH and around the nation both spiritually and educationally. He advocates for the civil-rights of those who are marginalized and discriminated against. He fights against all acts of injustice, racism and inequality against African Americans; and\nWHEREAS, He was inspired by the story of his great grandfather who courageously launched a school in Jackson TN in the year 1870. His audacity to envision an institution that would empower his community shortly after emancipation, along with his fathers example of leadership became Dr. Anthony’s motivation to strive for collective community empowerment. Emmanuel’s forefathers understood that education is crucial for escaping from poverty, and advancing; and\nWHEREAS, Generations later, Dr. Anthony picked up the mantle and endeavored to continue the legacy. Dr. Anthony identified that one of the root causes for the urban trifecta (mass incarceration, economic exploitation, and poor education) in the 21st century was directly tied to poor education. He saw that the African American youth were trapped in a failing school system that reinforced the school to prison pipeline and fell short of preparing them to be competitive for college, career, and life. Thus, he launched Legacy Academy of Excellence in 2021. A school in the inner-city that focuses on STEAM (Science, Technology, Engineering, Arts, Math), rites of passage through mentorship programs, and leadership development; and\nWHEREAS, Legacy Academy of Excellence has been dedicated to serving school-age students, with a particular focus on economically disadvantaged and at-risk students in the Linden community of Columbus, OH, an area facing some of the highest educational disparities and economic challenges; and\nWHEREAS, To date, Legacy Academy of Excellence has successfully narrowed the educational gap by improving math and reading scores for its students by over 63% schoolwide, provided housing support for families, and contributed to a reduction in crime rates through the provision of behavioral and mental health services to its students; and\nWHEREAS, each year, the school hosts a Black History program at no cost to the community, highlighting African American history and celebrating the arts, now, therfore\nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: That this Council hereby honor and salute Dr. Emmanuel D. Anthony and the Legacy team for work of community empowerment through educational excellence.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 138,
    "meeting_date": "2025-03-03",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}