{
  "success": true,
  "vote": {
    "id": 11550,
    "item_number": "CA-41",
    "title": "To authorize the Board of Health to renew contracts with Access 2 Interpreters LLC, Effectiff LLC, and Sign Language USA Inc to provide language services; to authorize the Board of Health to modify those contracts and to freely allocate the requested funds amongst the contracts without the need for additional legislation; and to authorize an expenditure from the Health Special Revenue Fund to pay the costs thereof. ($470,400.00)",
    "description": "Explanation\n \nBACKGROUND:  \nThis ordinance authorizes the Board of Health to renew and, if needed, modify contracts with Access 2 Interpreters LLC, Effectiff LLC, and Sign Language USA Inc to provide language services, which includes document translation, in-person interpretation, telephone interpretation, and video interpretation for a total amount not to exceed $470,400.00. These services will be provided at Columbus Public Health, located at 240 Parsons Avenue, and/or within the communities served by Columbus Public Health staff. The contract period for each contract is from April 1, 2025 through March 31, 2026.  The initial contracts for the renewal years are established  in the following amounts:\n \nAccess 2 Interpreters LLC CC010229: $60,000.00\nEffectiff LLC CC041262: $50,000.00\nSign Language USA Inc, CC024678: $20,000.00\n \nTOTAL INITIAL CONTRACTS IN AN AMOUNT NOT TO EXCEED:  $130,000.00\n \nTOTAL CONTRACTS, INCLUDING MODIFICATIONS, NOT TO EXCEED:  $470,400.00\nIt is particularly difficult to accurately predict the volume of language and translation services year-over-year. In order to maximize use of funds and avoid termination of services for our clientele, CPH is requesting flexibility in the amount to modify these language contracts. Therefore, this ordinance authorizes the Board of Health to modify the three aforementioned contracts and freely allocate the remaining balance of $340,400.00 requested funds amongst the contracts based on projected use and without the need for additional legislation.  \n \nThis period will represent year 4 of a 5-year agreement with Access 2 Interpreters LLC and Effectiff LLC, established by Ordinances 0897-2022 and 0896-2022, respectively. The Board of Health retains the option to renew both contracts for 1 additional year, ending March 31, 2027.\n \nThis period also represents year 3 of a 5-year agreement with Sign Language USA Inc established by Ordinance 1081-2023. The Board of Health retains the option to renew for 2 additional years, ending March 31, 2028.\n \nTitle VI of the Civil Rights Act of 1964 requires recipients of Federal financial assistance to take reasonable steps to make their programs, services, and activities accessible by eligible persons with Limited English Proficiency (LEP). This ordinance is submitted as an emergency to ensure that there is not a gap in these essential services.\n \nFISCAL IMPACT:  Expenditures to provide these services are budgeted in the 2025 Health Special Revenue Fund, Fund No. 2250, contingent upon passage of Ordinance 3036-2024. ($470,400.00)  \n \nTitle\n \nTo authorize the Board of Health to renew contracts with Access 2 Interpreters LLC, Effectiff LLC, and Sign Language USA Inc to provide language services; to authorize the Board of Health to modify those contracts and to freely allocate the requested funds amongst the contracts without the need for additional legislation; and to authorize an expenditure from the Health Special Revenue Fund to pay the costs thereof. ($470,400.00)  \n \nBody\n \nWHEREAS, the Board of Health has a need for language services for the Columbus Public Health Department located at 240 Parsons Avenue; and\n \nWHEREAS, the Board of Health will renew contracts with Access 2 Interpreters LLC, Effectiff LLC, and Sign Language USA Inc, who will provide language services; and\n \nWHEREAS, the Board of Health has a need to modify contracts for language services with Access 2 Interpreters LLC, Effectiff LLC, and Sign Language USA LLC and to freely allocate the requested funds amongst the contracts based on projected use and without the need for additional legislation. The respective dollar amounts for each contract is to be determined at a later date and not to exceed total funds authorized by this ordinance. Total amount needed for these contracts, including modifications, shall not exceed $470,400.00; and\n \nWHEREAS, this is year 4 of a 5-year agreement with Access 2 Interpreters LLC established by Ordinance 0897-2022, and with Effectiff LLC established by Ordinance 0896-2022. This is year 3 of a 5-year agreement with Sign Language USA Inc established by Ordinance 1081-2023; and\n \nWHEREAS, Access 2 Interpreters LLC, Effectiff LLC, and Sign Language USA Inc have the expertise and resources required to provide these services to the clients of Columbus Public Health; and\n \nWHEREAS, Title VI of the Civil Rights Act of 1964 requires recipients of Federal financial assistance to take reasonable steps to make their programs, services, and activities accessible by eligible persons with Limited English Proficiency (LEP); and\n \nWHEREAS, it has become necessary in the usual daily operation of the Board of Health to authorize Columbus Public Health to renew and, if needed, modify contracts with Access 2 Interpreters LLC, Effectiff LLC, and Sign Language USA Inc for language services; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Board of Health is hereby authorized to renew and, if needed, modify contracts for a total amount not to exceed $470,400.00 for language services, which includes document translation, in-person interpretation, telephone interpretation, and video interpretation for the period of April 1, 2025 through March 31, 2026, with Access 2 Interpreters LLC, Effectiff LLC, and Sign Language USA LLC. The Board of Health retains the option to renew the contracts with Access 2 Interpreters LLC and Effectiff LLC for 1 additional year, ending March 31, 2027. The Board of Health retains the option to renew the contract with Sign Language USA Inc for 2 additional years, ending March 31, 2028.\n \nSECTION 2.  That the expenditure of $470,400.00 is hereby authorized from the Health Special Revenue Fund, Fund No. 2250, Department of Health, Division No. 5001, in object class 03 - Services, per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That the Board of Health is hereby authorized to modify those contracts for language services with Access 2 Interpreters LLC, Effectiff LLC, and Sign Language USA LLC and to freely allocate the requested funds amongst the contracts without the need for additional legislation. The respective dollar amounts for each contract is to be determined at a later date and not to exceed total funds authorized by this ordinance.\n \nSECTION 4.  That these contracts are in compliance with Chapter 329 of the Columbus City Code.\n \nSECTION 5.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance and to make any accounting changes necessary to ensure that this contract is properly accounted for and recorded accurately on the City's financial records.\n \nSECTION 7.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 138,
    "meeting_date": "2025-03-03",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Economic Development"
    ]
  }
}