{
  "success": true,
  "vote": {
    "id": 11572,
    "item_number": "CA-63",
    "title": "To authorize and direct the Director of the Department of Development to file a petition for the annexation of 988.81 +/- acres within Blendon Township, Franklin County Ohio as provided in Sections 709.021 and 709.022 of the Ohio Revised Code (“Petition”); to provide for acceptance of the property by the City of Columbus upon approval of the Petition by the Franklin County Board of Commissioners; and to declare an emergency.",
    "description": "Explanation\n \nBACKGROUND: This ordinance is being submitted to authorize the Director of the Department of Development to file a municipal annexation petition of a 988.81 +/- acre site in Blendon Township, Franklin County.  This ordinance provides for the acceptance of the property by the City upon approval of the petition by the Franklin County Board of Commissioners.  The City is party to an annexation agreement with Blendon Township, which requires the annexation of property into the City of Columbus currently within Blendon Township to be undertaken pursuant to the Expedited Type-1 Annexation Procedure described in Sections 709.021 and 709.022 of the Ohio Revised Code.  Upon approval by City Council, a certified copy of this ordinance and the annexation agreement with Blendon Township will be provided to the Franklin County Board of Commissioners.\n \nFISCAL IMPACT:  This ordinance has no direct fiscal impact.  Provision of municipal services does represent cost to the City; however, the annexation of land also has the potential to create revenue to the City. \n \n \nTitle\n \nTo authorize and direct the Director of the Department of Development to file a petition for the annexation of 988.81 +/- acres within Blendon Township, Franklin County Ohio as provided in Sections 709.021 and 709.022 of the Ohio Revised Code (“Petition”); to provide for acceptance of the property by the City of Columbus upon approval of the Petition by the Franklin County Board of Commissioners; and to declare an emergency. \n \n \nBody\n \nWHEREAS, the City of Columbus owns 988.481 +/- acres in Blendon Township, generally located on and adjacent to Hoover Reservoir and to the centerline of East Walnut Street, and more fully described in Section 1 below (“City of Columbus Parcel”); and\n \nWHEREAS, the Franklin County Board of Commissioners owns 0.329 +/- acres in Blendon Township, which consists of a portion of county highway right-of-way contiguous to the City of Columbus Parcel, generally located south of the centerline of East Walnut Street and southeast of the City of Columbus Parcel, and more fully described in Section 1 below (“Franklin County Right of Way”); and \n \nWHEREAS, the City of Columbus Parcel and Franklin County Right of Way are each located within Blendon Township, Franklin County, Ohio (collectively, the “Property”); and \n \nWHEREAS, Sections 709.021 and 709.022 authorize owners of contiguous property to a municipal corporation to petition the board of county commissioners to annex that property into the boundaries of the municipal corporation (“Expedited Type-1 Annexation Procedure”); and\n \nWHEREAS, per Section 709.02(E) of the Ohio Revised Code, the Franklin County Board of Commissioners, as a political subdivision that owns the 0.329 acre right of way, is not considered an “owner” of the Franklin County Right of Way for purposes of providing written consent to the annexation of the Franklin County Right of Way into the City of Columbus corporate boundaries or being a signatory to the annexation petition filed with the Franklin County Board of Commissioners; and  \n \nWHEREAS, the City is able to provide municipal services to the Property; and \n \nWHEREAS, the City is party to an annexation agreement with Blendon Township, attached and incorporated herein by reference, requiring annexation petitions within Blendon Township be submitted and accepted pursuant to the Expedited Type-1 Annexation Procedure (“Agreement”); and\n \nWHEREAS, authorization by City Council is necessary for submission of the Petition and Agreement to the Franklin County Board of Commissioners; and \n \nWHEREAS, pursuant to Section 709.021 and Section 709.022 of the Ohio Revised Code, upon receipt of the Petition and by the City to annex the Property and the Agreement, the Board of Franklin County Commissioners shall, at the Board’s next regular session, enter upon its journal a resolution granting the annexation, without holding a hearing; and \n \nWHEREAS, the City of Columbus desires to add the Property described in detail in Section 1 below to the City’s boundaries upon approval of the Petition by the Franklin County Board of Commissioners; and \n \nWHEREAS, an emergency exists in that it is immediately necessary to approve the filing of the Petition to ensure that the Property is annexed into the corporate boundaries of the City of Columbus due to interest by neighboring municipal corporations in the same property, all for the immediate preservation of the public peace, health, property, and safety; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS: \n \nSECTION 1.  That the Director of the Department of Development is authorized and directed to file a petition for annexation, per Sections 709.021 and 709.022 of the Ohio Revised Code, to annex 988.81 +/- acres in Blendon Township, Franklin County, Ohio, located generally on and adjacent to Hoover Reservoir, consisting of the City of Columbus Parcel and the Franklin County Right of Way, and described more specifically as follows and on the attached map, which description and map are incorporated herein by reference, and per the Blendon Township Annexation Agreement, which is also incorporated herein by reference: \n \nExhibit A - Legal Description and Engineering Map \nExhibit B - General Description and Map \nExhibit C - Blendon Township Annexation Agreement \n \nSECTION 2.  That the City of Columbus will accept the territory described in Section 1 upon approval of the Petition by the Franklin County Board of Commissioners. \n \nSECTION 3.  That the City Clerk is hereby authorized and directed to perform such acts as set forth in Chapter 709 of the Ohio Revised Code, or as otherwise required by law, in order to ensure the proper recording of the annexation of the Property and all other necessary acts under the law, upon approval of the Petition by the Franklin County Board of Commissioners. \n \nSECTION 4.  That for the reasons stated in the preamble hereinabove, this Ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after the passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 138,
    "meeting_date": "2025-03-03",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services",
      "Property & Real Estate"
    ]
  }
}