{
  "success": true,
  "vote": {
    "id": 1159,
    "item_number": "CA-8",
    "title": "To authorize the Director of Public Utilities to enter into an agreement with F.K. Enzor, dba Panic Lighting Company, for professional engineering services for the SMART Street Lighting Control System project for the Division of Power; to authorize a transfer within of up to $416,999.10 and an expenditure in an amount up to $416,999.10 within the Electricity General Obligation Bond Fund; and to amend the 2020 Capital Improvements Budget.  ($416,999.10)",
    "description": "Explanation\n \nBACKGROUND:  This legislation authorizes the Director of Public Utilities to enter into a professional engineering services agreement with F.K. Enzor, dba Panic Lighting Company for the SMART Street Lighting Control System project, in an amount up to $416,999.10, for Division of Power, CIP No. 670878-100007. \n \nThe purpose of this project is to purchase and install a control system that will operate the streetlights as smart lighting is implemented.  The intent is to modify this agreement on an annual basis as additional lights are converted and communication is installed for connection to the system.\n \nPlanning Area is 99 (City-wide).\n \nFUTURE MODIFICATION(S):  It is anticipated that there will be future modifications for this project. The Division of Power is currently planning on bidding out the next phase of the overall Smart Lighting project this fall, which will trigger a modification to this agreement to account for the lights in that phase.  Moving forward, the Division of Power plans on doing one phase per year, which will include a new phase of lights being converted to smart technology and a modification to this contract for the controls.\n \nTIMELINE: It is anticipated that this phase of the project will be completed in the fall of 2021.  \n \nECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT:  \nAs smart lighting is implemented, the Division of Power will see an improvement in its response time as it will be notified immediately of a light that is no longer working.  The smart lighting project will also replace all existing HPS lights with LED, which will significantly decrease the City’s greenhouse gas emissions.\n \nBID INFORMATION: The selection of the firm providing the professional engineering services has been performed in accordance with the procedures set forth in Columbus City Code, Section 329, \"Awarding professional service contracts through requests for proposals.\"  \nProposals were opened on October 21, 2020. The Department received eight (8) proposals from F.K. Enzor, dba Panic Lighting Company; Sensus; ST Engineering; Tilson Technology Management; MS Consultants; RealTerm; Signify; and Fybyr.   \n \nAn evaluation committee reviewed the proposals and scored them based on the criteria within Columbus City Code Section 329.  The Department of Public Utilities recommends the agreement be awarded to F.K. Enzor, dba Panic Lighting Company. \n \nThe Contract Compliance Number for F.K. Enzor, dba Panic Lighting Company is 31-4174560 (expires 5/18/2023, MAJ, DAX #006021).\n \nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against F.K. Enzor, dba Panic Lighting Company.  \n \n \nFISCAL IMPACT: This ordinance requires a transfer within of up to $416,999.10, and an expenditure of up to $416,999.10 from the Electricity General Obligation Bond Fund 6303.  An amendment to the 2020 Capital Improvement Budget is necessary to align the authority with the expenditure.\n \n \nTitle\n \nTo authorize the Director of Public Utilities to enter into an agreement with F.K. Enzor, dba Panic Lighting Company, for professional engineering services for the SMART Street Lighting Control System project for the Division of Power; to authorize a transfer within of up to $416,999.10 and an expenditure in an amount up to $416,999.10 within the Electricity General Obligation Bond Fund; and to amend the 2020 Capital Improvements Budget.  ($416,999.10)\n \n \nBody\n \nWHEREAS, eight (8) technical proposals for professional engineering services for the Northwest Stormwater Study Project were received on October 21, 2020; and\n \nWHEREAS, the Department of Public Utilities recommends that the agreement be awarded to F.K. Enzor, dba Panic Lighting Company; and\n \nWHEREAS, it is necessary to authorize a transfer within of $416,999.10 and an expenditure of $416,999.10 within the Electricity General Obligation Bond Fund 6303 for the Division of Power; and  \n \nWHEREAS, it is necessary to authorize an amendment to the 2020 Capital Improvements Budget for the purpose of providing sufficient spending authority for the aforementioned project expenditure; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Division of Power, Department of Public Utilities, to authorize the Director of Public Utilities to enter into a professional engineering services agreement with F.K. Enzor, dba Panic Lighting Company, for the SMART Street Lighting Control System Project for the preservation of the public health, peace, property and safety; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Utilities is hereby authorized to enter into a professional engineering services agreement for the SMART Street Lighting Control System Project with F.K. Enzor, dba Panic Lighting Company (FID# 31-4174560), 3251 Silver Drive, Columbus, Ohio 43224; for an expenditure up to $416,999.10; in accordance with the terms and conditions of the agreement on file in the Office of the Division of Power.\n \nSECTION 2. That the transfer of $416,999.10 or so much thereof as may be needed, is hereby authorized between projects within Fund 6303 - Electricity General Obligation Bond Fund, per the account codes in the attachment to this ordinance.\n \nSECTION 3. That an expenditure of $416.999.10 or so much thereof as may be needed, is hereby authorized per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the funds necessary to carry out the purpose of this Ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That the City Auditor is hereby authorized and directed to transfer any unencumbered balance in the project account to the unallocated balance within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies no longer required for said project; except that no transfer shall be made from a project account by monies from more than one source.\n \nSECTION 6.  That the City Auditor is authorized to establish proper project accounting numbers as appropriate.\n \nSECTION 7.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this Ordinance.\n \nSECTION 8.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 18,
    "meeting_date": "2021-06-21",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}