{
  "success": true,
  "vote": {
    "id": 11590,
    "item_number": "SR-12",
    "title": "To authorize the Director of the Department of Public Safety to enter into a contract with Lexipol LLC to provide access to the Cordico wellness application; to authorize the expenditure of $125,000.00 from the General Government Grant Fund; to waive competitive bidding provisions of the Columbus City Codes; and to declare an emergency. ($125,000.00)",
    "description": "Explanation\n \nBACKGROUND:  The Department of Public Safety was awarded an ARPA grant by the State of Ohio to help first responders cope with mental health and wellness challenges magnified during the Covid pandemic. The Department is seeking to provide resources that support the mental health and wellness of Public Safety first responders including Police Officers, Firefighters, and 911 Dispatchers through a wellness application.  The Public Safety Department requests to enter into contract with Lexipol LLC to provide this wellness app for the benefit of its first responders.  This app will address:\n•                     Counseling services\n•                     Stress related physical conditions \n•                     Depression and anxiety issues\n•                     Resiliency and the ability to bounce back\n•                     Ability to manage family life challenges\n•                     Increased resiliency for decision making and increased effectiveness while on duty\n \nBID INFORMATION: The Division of Police advertised a formal bid, RFQ025437, for this application.  There were two proposals received and evaluated by the selection committee.  Proposals were submitted by First Response Mental Health and Lexipol LLC.  The committee was comprised of a Police Officer, Firefighter, Support Services personnel, Employee Assistance Program personnel, and Department of Technology personnel.  Through the evaluation process, it was determined that Lexipol LLC, who is offering an application called Cordico wellness solution, was the lowest and best bid to meet the City’s needs.  The bid allows for three possible renewals.  The contract was awarded to Lexipol pursuant to Ordinance No. 3063-2023, adopted by City Council on December 4, 2023.  We are now requesting a bid waiver to enter into a new contract with Lexipol to continue using the app to enhance the wellness of our officers.  Due to lack of time we were unable to enter into the renewal prior to the first contract expiring, so we are asking for a bid-waiver to enter into a new contract with Lexipol with the option of three renewals.  Therefore, the Division of Police requests to waive competitive bid provisions of the Columbus city code. \n \nThis company is not debarred according to the Federal excluded parties listing or prohibited from being awarded a contract according to the Auditor of State unresolved findings for recovery certified search. \n \nEMERGENCY DESIGNATION: Emergency legislation is requested to continue this Wellness App to meet the grant requirements and ensure reimbursement from said grant. \n \nCONTRACT COMPLIANCE: CC-046189 Expires 10/31/2025\n \nFISCAL IMPACT: The funding for the application has been appropriated and authorized by Ordinance 1614-2023 passed on June 12, 2023.  This expenditure of $125,000.00 is funded by General Government Grant Fund (G332304). \n \nTitle\n \nTo authorize the Director of the Department of Public Safety to enter into a contract with Lexipol LLC to provide access to the Cordico wellness application; to authorize the expenditure of $125,000.00 from the General Government Grant Fund; to waive competitive bidding provisions of the Columbus City Codes; and to declare an emergency. ($125,000.00) \n \nBody\n \nWHEREAS, the Public Safety Department is seeking to provide resources that support the mental health and wellness of Public Safety first responders, and\n \nWHEREAS, the Department of Public Safety issued a Request for Proposals for a Wellness and Mental Health software application; and\n \nWHEREAS, two proposals were received via RFQ025437, and the evaluation committee determined that Lexipol LLC was the lowest and best offeror; and \n \nWHEREAS, the bid allowed for 3 renewals; however due to time constraints we can not use the renewal process under the City Code and it is in the best interest of the City to waive competitive bidding for this purchase due to the time and cost restraints of the grant award and funds associated with said award.  \n \nWHEREAS, this ordinance authorizes the Director of Public Safety to enter into contract with Lexipol LLC for the Cordico wellness solution, with two (2) one-year renewal options; and\n \nWHEREAS, the funding has been appropriated and authorized by Ordinance 1614-2023 passed on June 12, 2023; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Safety in that it is necessary to enter into contract with Lexipol LLC to meet grant requirements and to ensure reimbursement through this funding source in order to support the mental health and wellness of Public Safety first responders, all for the immediate preservation of the public health, peace, property, welfare, and safety; NOW, THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Department of Public Safety be and is hereby authorized and directed to enter into a contract with Lexipol LLC for licenses to the Cordico wellness solution.  This contract may be renewed for two (2) one-year renewal terms.\n \nSECTION 2. That the expenditure of $125,000.00, or so much thereof as may be needed, be and the same is hereby authorized in the General Government Grant Fund (G332304) in object class 03 per the accounting codes in the attachment of this ordinance.\n \nSECTION 3. That this Council finds it in the best interest of the City to waive the competitive bidding provisions of the Columbus City Codes to permit the aforementioned purchase contract and does hereby waive the same.\n \nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5. That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 138,
    "meeting_date": "2025-03-03",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}