{
  "success": true,
  "vote": {
    "id": 11591,
    "item_number": "SR-13",
    "title": "To authorize the Director of Public Safety to enter into contract with LexisNexis Risk Solutions FL Inc. for access to the Accurint database, to waive the competitive bidding provisions of the Columbus City Code; to authorize the expenditure of $164,774.19 from the Law Enforcement Contraband Seizure Fund contingent upon passage of Ordinance 0201-2025; and to declare an emergency ($164,774.19)",
    "description": "Explanation\n \nBACKGROUND: This ordinance seeks to authorize the Director of Public Safety to enter into a contract with LexisNexis Risk Solutions FL Inc. for the purpose of continuing instant computer access to the investigative database (Accurint), allowing the most efficient investigative record searches for administrative, investigative, and enforcement personnel users.\n \nBid Information: The City of Columbus first contracted with LexisNexis in 2007 to obtain access to the Accurint computer database system. This database is a vital tool in the investigative process in obtaining data from across the country and within the state on criminal activity and individuals.  LexisNexis provides an unparalleled comprehensive database not provided by another organization that also integrates with the City’s Premier One system.  With daily access, this vital tool is paramount to operations, investigations and solving crimes within the City.  Therefore, the Division of Police requests a bid waiver to continue services with this vendor.\nThis company is not debarred according to the Federal excluded parties listing or prohibited from being awarded a contract according to the Auditor of State unresolved findings for recovery certified search.\n \nContract Compliance No: CC007871, LexisNexis Risk Solutions FL Inc., expires 04/05/2026\n \nEmergency Designation: Emergency legislation is requested so that the Division of Police may immediately enter into said contract to continue these vital and important services without interruption. \n \nFISCAL IMPACT: This ordinance authorizes an expenditure of $164,774.19 from the Law Enforcement Contraband Seizure Fund with LexisNexis Risk Solutions FL Inc. for the Division of Police contingent on the passage of Ordinance 0201-2025. The Division of Police encumbered or spent $159,000.00 in 2024, $152,500.00 in 2023, and $147,000.00 in 2022 for these services. \n \nTitle\n \nTo authorize the Director of Public Safety to enter into contract with LexisNexis Risk Solutions FL Inc. for access to the Accurint database, to waive the competitive bidding provisions of the Columbus City Code; to authorize the expenditure of $164,774.19 from the Law Enforcement Contraband Seizure Fund contingent upon passage of Ordinance 0201-2025; and to declare an emergency ($164,774.19)\n \nBody\n \nWHEREAS, the Director of Public Safety wishes to enter into a contract for computer database access for investigative record searches with LexisNexis Risk Solutions FL Inc.; and,\n \nWHEREAS, this database search availability is crucial to Division administrative, investigative, and enforcement personnel; and,\n \nWHEREAS, LexisNexis Risk Solutions FL, Inc. is the provider of Accurint Virtual Crime Center in North America, and provides an unparalleled comprehensive database not provided by another organization that also integrates with the City’s Premier One system. Therefore, it is in the City's best interest to waive the competitive bidding provisions of Chapter 329 of the City Code; and,\n \nWHEREAS, the expenditure of $164,774.19 will be funded through the Law Enforcement Contraband Seizure Fund; and,\n \nWHEREAS, an emergency exists in the usual daily operation of the Division of Police, Department of Public Safety, in that it is immediately necessary to authorize the Director to enter into a contract with LexisNexis Risk Solutions FL Inc., for computer database access used to obtain data from across the country and within the state on criminal activity and individuals as part of the Department's investigative tools to prevent an interruption in service, all for the immediate preservation of the public health, peace, property, safety, and welfare; and NOW THEREFORE:\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Public Safety, be and is hereby authorized to enter into a contract with LexisNexis Risk Solutions FL Inc, for computer database access for investigative record searches for the Division of Police, Department of Public Safety.\n \nSECTION 2.  That the expenditure of $164,774.19, or so much thereof as may be needed, is hereby authorized in the Law Enforcement Contraband Seizure Fund 2219, contingent on the passage of Ordinance 0201-2025, in object class 03 Maintenance of Software per the accounting codes in the attachment to this ordinance. \n \nSECTION 3. That this Council finds it is in the City's best interests to waive the competitive bidding provisions of City Code to enter into this contract\n \nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated upon the approval of Ordinance 0201-2025, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance and to make any accounting changes necessary to ensure that this contract is properly accounted for and recorded accurately on the City's financial records.\n \nSECTION 6.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 138,
    "meeting_date": "2025-03-03",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}