{
  "success": true,
  "vote": {
    "id": 11624,
    "item_number": "CA-18",
    "title": "To authorize the Director of the Department of Development to execute an amendment to the Neighborhood Structured Parking Incentive Contribution Agreement dated May 12, 2021 by and among the City, The Gravity Project 2, LLC, and its affiliates who are a party thereof to change the completion deadline for McDowell Place to align with the original intent under the Economic Development Agreement dated September 27, 2019 and to add 935 Cassady LLC as a party; to authorize the Director of the Department of Development to enter into and execute other documents pertinent to the disposition of the Gravity 2 project from the current owner(s) to new owner(s), to the extent applicable, including but not limited to, consenting to such transaction(s), certifying certain requirements met under current agreements described herein related to the Gravity 2 project for which the City is a party, and approving assignment and assumptions of such agreements; and to declare an emergency.",
    "description": "Explanation\n \nBackground: The Gravity Project 2, LLC (the “Developer”) designed and constructed the mixed-use urban redevelopment project consisting of 189,330 sq. ft. of commercial office, a 257-unit apartment tower, 24 townhomes, and a 105-co-living unit midrise with each of these uses on separate tax parcels (altogether, “Gravity 2”) located along the east side of McDowell Street between Broad and State Streets. Adjacent to Gravity 2, Columbus Housing Partnership, Inc. (“Homeport”) designed and constructed a 50-unit low income housing tax credit project (“McDowell Place”). The Developer committed to dedicate at least two-hundred (200) parking spaces for public use (the “Dedicated Public Spaces”) and another sixty (60) parking spaces for McDowell Place (the “McDowell Place Spaces”) within the eight-hundred eighty-six (886) parking spaces of Gravity 2’s structured parking facility located on the same tax parcel as the apartment tower (the “Parking Facility Project”) if the City would provide a capital grant to pay a portion of the costs of the Dedicated Public Spaces. The Columbus-Franklin County Finance Authority (the “CFCFA”) also agreed to issue bonds to pay for the acquisition, design, and construction of the Parking Facility Project, and the City agreed to repay through tax increment financing a portion of the bonds issued on the condition that additional parking spaces beyond the required Dedicated Public Spaces would also be available for general public use. \n \nIn order to effectuate these commitments, among others, the City entered into a series of agreements with the aforesaid parties, the Developer’s affiliates who control separate parts of Gravity 2 (the “Developer Affiliates”), and the Gravity II New Community Authority (the “NCA”). Ordinance No. 1732-2019 authorized the City, Developer, and Homeport to enter into an Economic Development Agreement dated September 27, 2019 (the “EDA”). Pursuant to Ordinance No. 0911-2020, the City entered into a Neighborhood Structured Parking Incentive Contribution Agreement dated May 12, 2021 (the “Contribution Agreement”) with the Developer and the Developer Affiliates. Two of the Developer Affiliates then recorded the Declaration of Public Parking Garage Covenants dated May 12, 2021 with the Franklin County Recorder’s Office as Instrument No. 202105190089050 (the “Parking Declaration”). The Developer, one of the Developer Affiliates, the NCA, the CFCFA, and the City, as authorized by Ordinance No. 0976-2020, entered into the Cooperative Agreement dated as of May 1, 2021 (the “Cooperative Agreement”). The Developer, through its Developer Affiliates, now desires to dispose of the separate private portions of Gravity 2 with the office portion being conveyed to 935 Cassady LLC. The Developer, potential buyers, and potential lenders are requesting the City to take the intended actions (described in the following sentence) under each of the EDA, the Parking Declaration, the Contribution Agreement, and the Cooperative Agreement if and when such transfers were to occur. This legislation will authorize an amendment to the Contribution Agreement to change the completion deadline for McDowell Place to align with the original intent under the EDA and to add 935 Cassady LLC as a party; this legislation will also authorize the Director of the Department of Development to provide any certifications, consents, or approvals for any acknowledgments, assignments and assumptions, or such other instruments contemplated by the aforementioned agreements or as requested by the aforementioned parties in order to allow for the immediate piecemeal disposition of Gravity 2.\n \nEmergency Justification:\nEmergency legislation is requested in order to allow the City to execute such instruments prior to the disposition of the Gravity 2 properties by the mid to late March closing, which such earlier closing will allow the new owner(s) to take immediate proactive steps to increasing the occupancy of the properties that in turns assists the City with reducing its housing deficit and bringing in additional income taxpayers to the City.  \n \nFiscal Impact: No funding is required for this legislation.\n \nTitle\n \nTo authorize the Director of the Department of Development to execute an amendment to the Neighborhood Structured Parking Incentive Contribution Agreement dated May 12, 2021 by and among the City, The Gravity Project 2, LLC, and its affiliates who are a party thereof to change the completion deadline for McDowell Place to align with the original intent under the Economic Development Agreement dated September 27, 2019 and to add 935 Cassady LLC as a party; to authorize the Director of the Department of Development to enter into and execute other documents pertinent to the disposition of the Gravity 2 project from the current owner(s) to new owner(s), to the extent applicable, including but not limited to, consenting to such transaction(s), certifying certain requirements met under current agreements described herein related to the Gravity 2 project for which the City is a party, and approving assignment and assumptions of such agreements; and to declare an emergency.\n \nBody\n \nWHEREAS, pursuant to Ordinance No. 1732-2019, the City and Columbus Housing Partnership, Inc. (“Homeport”) entered into an Economic Development Agreement dated September 27, 2019 (the “EDA”) with The Gravity Project 2, LLC (the “Developer”); and\n \nWHEREAS, the Developer designed and constructed the mixed-use urban redevelopment project (“Gravity 2”) located along the east side of McDowell Street between Broad and State Streets, and adjacent to Gravity 2, Homeport designed and constructed a 50-unit low income housing tax credit project (“McDowell Place”) as envisioned by the EDA; and\n \nWHEREAS, the Developer committed under the EDA to dedicate at least two-hundred (200) parking spaces for public use (the “Dedicated Public Spaces”) and another sixty (60) parking spaces for McDowell Place (the “McDowell Place Spaces”) within the eight-hundred eighty-six (886) parking spaces of Gravity 2’s structured parking facility (the “Parking Facility Project”); and\n \nWHEREAS, Ordinance No. 0911-2020 authorized the City to enter into a Neighborhood Structured Parking Incentive Contribution Agreement dated May 12, 2021 (the “Contribution Agreement”) with the Developer and its affiliates who control separate parts of Gravity 2 (the “Developer Affiliates”) to provide for a capital contribution grant from the City for the Dedicated Public Spaces if McDowell Place was completed; and\n \nWHEREAS, as a condition of the grant not being refunded over time by the Developer, the EDA required Homeport to complete McDowell Place within two years of Homeport receiving a carryover allocation of low income housing tax credits (“LIHTC”) from the Ohio Housing Finance Agency; and\n \nWHEREAS, the parties anticipated Homeport would receive the LIHTC allocation in 2021 and the parties therefore set in the Contribution Agreement the completion deadline for McDowell Place as December 31, 2023, but due to unforeseen circumstances, Homeport did not receive the LIHTC allocation until 2022 causing McDowell Place to not be completed until 2024, which was still within two years of actually receiving the allocation; and\n \nWHEREAS, two of the Developer Affiliates recorded the Declaration of Public Parking Garage Covenants dated May 12, 2021 with the Franklin County Recorder’s Office as Instrument No. 202105190089050 (the “Parking Declaration”) to encumber the Parking Facility Project property with the required Dedicated Public Spaces and McDowell Place Spaces; and\n \nWHEREAS, the Developer, one of the Developer Affiliates, the Gravity II New Community Authority, the Columbus-Franklin County Finance Authority (the “CFCFA”), and the City, as authorized by Ordinance No. 0976-2020, entered into the Cooperative Agreement dated as of May 1, 2021 (the “Cooperative Agreement”) where the CFCFA agreed to issue bonds to pay for the acquisition, design, and construction of the Parking Facility Project; and\n \nWHEREAS, the City agreed thereunder to repay through tax increment financing a portion of the tax-exempt bonds issued on the condition that additional parking spaces beyond the required Dedicated Public Spaces would also be available for general public use; and\n \nWHEREAS, the Developer, through its Developer Affiliates, now desires to dispose of the separate private portions of Gravity 2; and\n \nWHEREAS, 935 Cassady LLC acquired the office on Franklin County Tax Parcel No 010-301921 from one of the Developer Affiliates on February 12, 2025, so the parties have agreed to add 935 Cassady LLC as a party to the Contribution Agreement; and\n \nWHEREAS, in order for this to occur, the Developer, potential buyers, and potential lenders are requesting the City to take the intended actions (described in the following sentence) under each of the EDA, the Parking Declaration, the Contribution Agreement, and the Cooperative Agreement; and\n \nWHEREAS, this legislation will authorize an amendment to the Contribution Agreement to address the aforesaid issue with the deadline and to add 935 Cassady LLC as a party as well as authorize the Director of the Department of Development to provide any certifications, consents, or approvals for any acknowledgments, assignments and assumptions, or such other instruments contemplated by the aforementioned agreements or as requested by the aforementioned parties in order to allow for the immediate piecemeal disposition of Gravity 2; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development to allow the Director to execute such documents pertinent to the disposition of the Gravity 2 properties by the mid to late March closing, which such earlier closing will allow the new owner(s) to take immediate proactive steps to increasing the occupancy of the properties that in turns supports the City with reducing its housing deficit and with bringing in additional income taxpayers to the City, all for the immediate preservation of the public health, peace, property, safety and welfare; and NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Department of Development, or his or her designee, (together, the “Director”), on behalf of the City, is hereby authorized to enter into an amendment to the Contribution Agreement with the Developer the Developer Affiliates, and 935 Casssady LLC, presently on file with the Department of Development, along with any changes or amendments thereto not inconsistent with this Ordinance and not substantially adverse to the City and which shall be approved by the Director and the City Attorney, provided that the approval of such changes and amendments thereto, and the character of those changes and amendments as not being substantially adverse to the City shall be evidenced conclusively by the execution of said amendment to the Contribution Agreement; the purpose of such amendment being to modify the date of completion for McDowell Place to align with the parties’ original intent under the EDA and to add 935 Cassady LLC as a party.\n \nSECTION 2. That the Director be and hereby is authorized to approve any assignment and assumption agreements related to the EDA, the Contribution Agreement, and the Cooperative Agreement as well as any other instruments, certifications, or consents pertinent to those aforementioned agreements and the disposition of Gravity 2, presently on file with the Department of Development, along with any changes or amendments thereto not inconsistent with this Ordinance and not substantially adverse to the City and which shall be approved by the Director and the City Attorney, provided that the approval of such changes and amendments thereto, and the character of those changes and amendments as not being substantially adverse to the City shall be evidenced conclusively by the executions thereof.\n \nSECTION 3. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in full force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 139,
    "meeting_date": "2025-03-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Economic Development",
      "Emergency Services"
    ]
  }
}