{
  "success": true,
  "vote": {
    "id": 11620,
    "item_number": "CA-14",
    "title": "To establish a new authorized strength ordinance for various divisions in the City of Columbus to be consistent with the adopted 2025 budget; to repeal ordinance 0291-2025; and to declare an emergency. (Repealed by Ord. 1283-2025 passed on 6/2/2025 -LG).",
    "description": "Explanation\n \nBACKGROUND: This ordinance amends the current authorized strength, as set forth in ordinance 0291-2025, by establishing authorized strength levels for city departments in alignment with the 2025 operating budget.\n \nThe strength levels for most general fund agencies are set to be equal to the 2025 budget as amended by City Council (including the Departments of Health and Recreation and Parks).  Authorized strength levels of smaller non-general fund agencies are set to be equal to the adopted 2025 budget as amended, while the strength levels of certain larger non-general fund agencies may have their strength set slightly higher to allow for flexibility in hiring.\n \nThe Municipal Court Clerk will increase authorized strength by one full-time position to account for increased activity in the Office of Information Services.  The Mayor’s Office Administration will add five full-time positions to increase flexibility around planned hiring and transfers.  Within the Department of Civil Service an increase of four full-time positions is requested to improve flexibility in hiring.  Human Resources is requesting an increase of one full-time position for flexibility.  The Department of Technology will change one part-time position to full-time to account for increasing workload. The Department of Technology will change one part-time position to full-time to account for increasing workload. Recreation and Parks requests an increase of two full-time positions for increased flexibility.\n \nFiscal Impact: Funds for these strength levels are budgeted and/or the positions will not be filled until revenues have been clearly identified and appropriated.  In all cases, the ability to hire will be monitored by the Division of Finance and Management.  As such, there is no fiscal impact associated with passage of this ordinance.\n \nEmergency Justification: Emergency action is requested to allow for the filling of budgeted vacant positions in certain departments in order to assure the immediate preservation of the public health, safety, and welfare.\n \nTitle\n \nTo establish a new authorized strength ordinance for various divisions in the City of Columbus to be consistent with the adopted 2025 budget; to repeal ordinance 0291-2025; and to declare an emergency.\n \nBody\n \nWHEREAS, the Mayor's Executive 2025 budget was submitted to City Council on November 13, 2024 for consideration; and\n \nWHEREAS, City Council adopted said budget on February 10, 2025; and,\n \nWHEREAS, this ordinance repeals authorized strength ordinance 0291-2025; and\n \nWHEREAS, an emergency exists in the usual daily operation of the City of Columbus in that it is immediately necessary to establish a new authorized strength ordinance to provide for the efficient operation of the city, and for the immediate preservation of the public health, peace, property, safety, and welfare; NOW, THEREFORE:\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That pursuant to Section 14 of the City Charter, the maximum number of officers and employees authorized to be employed within the various Departments, Boards and Offices of the City is hereby fixed and established as follows: \n \n-1- Refer to attachment ORD0593-2025currentstrength.xlsx\n-2- Refer to attachment ORD0593-2025previousstrength.xlsx\n \nThe foregoing positions authorized include all positions within each department, division, board, office or commission, whether appointed or elected except the members of any board or commission authorized by charter or ordinance. No Appointing Authority shall appoint full-time or part-time personnel in excess of the maximum permitted by this ordinance unless authorized by ordinance of City Council.\n \nSECTION 2. Such of the positions within the Division of Fire as the Director of Public Safety and Fire Chief shall designate, shall be within the uniformed ranks and all other positions therein shall be deemed civilian positions, provided there shall not be in excess of five (5) Fire Assistant Chiefs and there shall not be in excess of four (4) Fire Deputy Chiefs; as a normal complement, in excess of thirty-seven (37) Fire Battalion Chiefs nor as a temporary complement, in excess of thirty-eight (38) Fire Battalion Chiefs at any one time; sixty-five (65) Fire Captains nor as a temporary complement, in excess of sixty-six (66) Fire Captains at any one time; in excess of four (4) Fire Executive Officers; one (1) Fire Chief; and two-hundred seventeen (217) Fire Lieutenants.  The complements of fire captains and fire lieutenants are intended to be temporary, subject to review and change at any time.\n \nSuch of the positions within the Division of Police as the Director of Public Safety and the Police Chief shall designate, shall be within the uniformed ranks and all other positions therein shall be deemed civilian positions, provided there shall not be, as a normal complement, in excess of twenty (20) Police Commanders, nor as a temporary complement, in excess of twenty-one (21) Police Commanders at any one time; one (1) Police Chief; four (4) Police Assistant Chiefs; in excess of, as a normal complement, six (6) Police Deputy Chiefs, nor as a temporary complement, in excess of nine (9) Police Deputy Chiefs at any one time;  in excess of, as a normal complement, sixty-seven (67) Police Lieutenants, nor as a temporary complement, in excess of sixty-nine (69) Police Lieutenants at any one time; in excess of, as a normal complement, two hundred forty-five (245) Police Sergeants, nor as a temporary complement, in excess of two hundred forty-nine (249) Police Sergeants at any one time.\n \nSECTION 3.  Temporary appointments are not subject to the authorized strength ordinance.  Additionally, limited appointments made to cover full-time and part-time employees on authorized leave (injury, disability or military leave) are not subject to the authorized strength ordinance. Student intern positions are not subject to the authorized strength ordinance.\n \nSECTION 4.  That Ordinance No. 0291-2025 and all other ordinances relative to the authorization of employees for any department, division, board or commission and all other ordinances in conflict herewith be and the same are hereby repealed.\n \nSECTION 5.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 139,
    "meeting_date": "2025-03-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services"
    ]
  }
}