{
  "success": true,
  "vote": {
    "id": 11653,
    "item_number": "CA-47",
    "title": "To authorize the Director of the Department of Public Utilities to enter into a professional services contract with HDR Engineering, Inc. for the Gerbert Road Area Water Line Improvements project; to authorize an amendment to the 2024 Capital Improvement Budget; to appropriate funds within the Water - Fresh Water Market Rate Fund; to make this ordinance contingent upon the Ohio Water Development Authority approving a loan for this project; to authorize the expenditure of $394,302.75 from the Water - Fresh Water Market Rate Fund. ($394,302.75)",
    "description": "Explanation    \n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Utilities to enter into a professional services contract with HDR Engineering, Inc for the Gerbert Road Area Water Line Improvements, CIP 690236-100166, Contract 2389, in an amount up to $394,302.75.\n \nThe purpose of this project is to construct necessary improvements to the water distribution system in the Gerbert Rd Area.  The improvements identified in the scope of work will replace or rehabilitate water lines that have high break histories and require frequent maintenance.  This project includes replacing or rehabilitating approximately 9,800 linear feet of 6-inch, and 8-inch water lines and transferring existing services. The streets include Gerbert Road, East North Broadway, Dresden Street, Bremen Street, Eddystone Avenue, E Brighton Road, Moon Road, Beulah Road, Beulah Circle, and Ganson Drive.\n \nThis project is located within the following Community Planning Area, North Linden (40).\n \nTIMELINE: The duration of the design phase for this project is 13 months or until the scope of services is completed to the satisfaction of the City.  \n \nESTIMATED COST OF PROJECT:  The bid amount and proposed award amount is $394,302.75, including a 15% design contingency amount that will be utilized to fund needed and approved changes in the work.  No contract modifications are anticipated at this time; however, design exigency might later compel modification of this contract, if unforeseen difficulties are encountered.\n \nCost summary: \n \nOriginal Contract                                                                                         $                           394,302.75\nFuture Anticipated Needs                                                                    $                          0.00\nCONTRACT TOTAL                                                                   $                            394,302.75\n \n2.  ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT\nThe goal of this project is to replace or rehabilitate the existing water lines that have a high break frequency.  Replacement of these water lines will improve water service, decrease burden on water maintenance operations, and reduce water loss.  The Neighborhood Liaison(s) will be contacted and informed of this project during the design phase.  Further community outreach may result through the Neighborhood Liaison Program.\n \n3.  BID INFORMATION\nThis project was formally advertised on the Vendor Services and Bonfire websites from October 4, 2024 through November 1, 2024.  Six proposals were received:\n \n Name                     C.C. No.       Exp. Date                     City/State                     Status                     \nHDR Engineering Inc                                               CC008851                         3/11/26                     Columbus, OH                                                       MAJ\nAECOM Technical Svcs, Inc.                         CC010897        5/28/26                     Columbus, OH                                                      MAJ\nStantec Consulting Svcs, Inc.                          CC000462        7/26/25                     Columbus, OH                                      MAJ\nVS Engineering, Inc.                      CC031373       11/7/26                     Columbus, OH                                    MBE\nGHD                                                                                        CC031197         8/21/26                                   Columbus, OH                                                      MAJ\nOsborn Engineering, Inc.                                    CC006417        10/12/25                             Columbus, OH                                   MAJ\n \nAll proposals were deemed responsive.  The evaluation committee reviewed the proposals and recommended the contract for the Gerbert Road Area Water Line Improvements project be awarded to HDR Engineering, Inc.\n \nHDR Engineering, Inc.’s certification was in good standing at the time of the bid award. \n \n4.  CONTRACT COMPLIANCE INFORMATION\nHDR Engineering, Inc.’s contract compliance number is CC008851 and expires 3/1/26.  \n \n5.  MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract was advertised with an anticipated City of Columbus MBE/WBE Program goal of 10% as assigned by the City’s Office of Diversity and Inclusion (ODI).  After ODI’s review of the Utilization Plan and other related information the contractor submitted with their bid response, ODI has approved an MBE/WBE Program goal of 10% for this contract.  \n \nAs part of their proposal, HDR Engineering, Inc. has proposed the following subcontractors to perform contract work:\n \nCompany Name                                         City/State                                     ODI Certification Status \nDLZ Ohio, Inc.                                                          Columbus, Ohio                                              MBE                                \n                                                                                                                                                                               \nThe certification of HDR Engineering, Inc. and the above companies was in good standing at the time the bid was awarded.\n \n6.  FISCAL IMPACT\nFunding for this contract will be obtained through the Ohio Water Development Authority Direct Loan Program.  City Council authorized this loan application and acceptance of loan funding via Ordinance 0652-2024, passed by Council on 3/25/24.  This loan is expected to be approved at the March 2025 Board meeting.  This ordinance is contingent upon the OWDA Board approving the loan application. \n \nThe Ohio Water Development Authority (OWDA) Direct Loan Program is a reimbursement program.  Purchase orders will need to be established to HDR Engineering, Inc. for this contract.  Public Utilities will need to pay invoices directly to HDR Engineering, Inc., LLC and then submit reimbursement requests based upon these paid invoices to OWDA for OWDA to reimburse Public Utilities.   \nThe 2024 Capital Improvement Budget will need to be amended to align budget authority with the proper project.  Funds will need to be appropriated in the Water - Fresh Water Market Rate Fund, Fund 6014.\n \nTitle\nTo authorize the Director of the Department of Public Utilities to enter into a professional services contract with HDR Engineering, Inc. for the Gerbert Road Area Water Line Improvements project; to authorize an amendment to the 2024 Capital Improvement Budget; to appropriate funds within the Water - Fresh Water Market Rate Fund; to make this ordinance contingent upon the Ohio Water Development Authority approving a loan for this project; to authorize the expenditure of $394,302.75 from the Water - Fresh Water Market Rate Fund. ($394,302.75)\n  \nBody\nWHEREAS, the Department of Public Utilities is engaged in the Gerbert Road Area Water Line Improvements project; and\n \nWHEREAS, six proposals for the Gerbert Road Area Water Line Improvements project were received and opened on November 1, 2024; and\n \nWHEREAS, the evaluation committee recommended HDR Engineering, Inc. be awarded the contract for this project; and \n \nWHEREAS, Ordinance 0652-2024 authorized this contract to be funded by a loan to be obtained through the Ohio Water Development Authority Direct Loan Program; and \n \nWHEREAS, this ordinance is contingent upon that loan being approved; and\n \nWHEREAS, it is necessary to amend the 2024 Capital Improvement Budget to align budget authority for the project; and \n \nWHEREAS, it is necessary to appropriate funds in the Water - Fresh Water Market Rate Fund, Fund 6014; and\n \nWHEREAS, it is necessary to authorize the Director of the Department of Public Utilities to enter into a professional services contract with HDR Engineering, Inc. for the Gerbert Road Area Water Line Improvements project; and\n \nWHEREAS, it is necessary to expend funds to pay for the services HDR Engineering, Inc. provides under this contract; NOW, THEREFORE,  \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2024 Capital Improvements Budget authorized by Ordinance 1907-2024 be amended as follows to establish sufficient budget authority for this project:\n \nFund / Project Number / Project Name (Funding Source) / Current Authority / Revised Authority / Change \n6014 / P690236-100166 / Gerbert Road Area Water Line Improvements (OWDA Direct Loan) / $300,000.00 / $394,303 / $94,303 (To match loan amount)\n \nSECTION 2.  That the appropriation of $394,302.75, or so much thereof as may be needed, is hereby authorized in the Water - Fresh Water Market Rate Fund, Fund 6014, per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That the Director of Public Utilities be and hereby is authorized to enter into a contract for professional engineering services for the Gerbert Road Area Water Line Improvements project, CIP No. 690236-100166, with HDR Engineering, Inc., 8890 Lyra Dr. Suite 100, Columbus, Ohio 43240; in accordance with the terms and conditions of the contract on file in the Department of Public Utilities.\n \nSECTION 4.  That the expenditure of $394,302.75, or so much thereof as may be needed, is hereby authorized to pay for this contract per the accounting codes in the attachment to this ordinance. \n \nSECTION 5.  This ordinance is contingent upon the Ohio Water Development Authority's Board approving the loan for this project. \n \nSECTION 6.  That funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\nSECTION 7.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 8.  That the City Auditor is authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\nSECTION 9.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 139,
    "meeting_date": "2025-03-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}