{
  "success": true,
  "vote": {
    "id": 11664,
    "item_number": "CA-58",
    "title": "To transfer cash drawers from the Support Services division of the Department of Public Safety to the License and Weights & Measures sections of the Department of Building and Zoning Services; to transfer imprest petty cash funds from the Support Services division of the Department of Public Safety to the License and Weights & Measures sections of the Department of Building and Zoning Services; to authorize a decrease of the number of cash drawers for the Support Services division of the Department of Public Safety; to authorize a decrease of the imprest petty cash fund for the Support Services division of the Department of Public Safety; to authorize an increase of the number of cash drawers for the License and Weights & Measures sections of the Department of Building and Zoning Services from zero to five; and to authorize an increase of the imprest petty cash fund for the License and Weights & Measures sections of the Department of Building and Zoning Services. ($500.00)",
    "description": "Explanation\n \nLast year, Ordinance Number 0768-2024 transferred the License and Weights and Measures Sections from the Support Services division of the Department of Public Safety to the Department of Building and Zoning Services because their activities align with, and are beneficial to, the building and development community.  Ordinance 0766-2024 transferred the financials, fixed assets, and receivables of the License and Weights and Measures Sections and assigned it the division code 43-01. The transfer of five cash drawers used by the License and Weights & Measures sections and the $500.00 of imprest petty cash funds in these cash drawers was not included in the original transfer of assets and financials. Now, both departments desire to formally correct this omission.\n \nThis ordinance authorizes the transfer of five cash drawers and $500.00 of imprest petty cash funds from the Support Services division of the Department of Public Safety to the License and Weights & Measures sections of the Department of Building and Zoning Services, the decrease of the Support Services division’s number of cash drawers from five to zero, the decrease of the Support Services division’s imprest petty cash fund from $1,500.00 to $1,000.00, the increase of the License and Weights & Measures sections’ number of cash drawers from zero to five, and the increase of the License and Weights & Measures sections’ imprest petty cash fund from $500.00 to $1,000.00.\n \nFISCAL IMPACT:  This ordinance will result in a $500.00 decrease of the imprest petty cash fund for the Support Services division of the Department of Public Safety and a $500.00 increase of the imprest petty cash fund for the License and Weights & Measures sections of the Department of Building and Zoning Services. As this $500.00 is already in use in License and Weights & Measures’ cash drawers, there is a net-zero effect on the General Funded budgets of both departments.\n \nTitle\n \nTo transfer cash drawers from the Support Services division of the Department of Public Safety to the License and Weights & Measures sections of the Department of Building and Zoning Services; to transfer imprest petty cash funds from the Support Services division of the Department of Public Safety to the License and Weights & Measures sections of the Department of Building and Zoning Services; to authorize a decrease of the number of cash drawers for the Support Services division of the Department of Public Safety; to authorize a decrease of the imprest petty cash fund for the Support Services division of the Department of Public Safety; to authorize an increase of the number of cash drawers for the License and Weights & Measures sections of the Department of Building and Zoning Services from zero to five; and to authorize an increase of the imprest petty cash fund for the License and Weights & Measures sections of the Department of Building and Zoning Services. ($500.00)\n \nBody\n \nWHEREAS, the existing cash drawers used by the License and Weights & Measures sections of the Department of Building and Zoning Services are currently authorized to be used by the Support Services division of the Department of Public Safety; and\n \nWHEREAS, the existing cash drawer fund for the License and Weights & Measures sections of the Department of Building and Zoning Services is currently funded by the imprest petty cash fund of the Support Services division of the Department of Public Safety; and\n \nWHEREAS, the transfer of five cash drawers from the Department of Public Safety to the Department of Building and Zoning Services will correct the use authorization of these cash drawers; and\n \nWHEREAS, the transfer of $500.00 in imprest petty cash funds from the Department of Public Safety to the Department of Building and Zoning Services will correct the allocation of these cash drawer funds; and\n \nWHEREAS, this ordinance will decrease the number of authorized cash drawers for the Support Services division of the Department of Public Safety from five to zero; and \n \nWHEREAS, this ordinance will decrease the authorized imprest petty cash funds of the Support Services division of the Department of Public Safety from $1,500.00 to $1,000.00; and \n \nWHEREAS, this ordinance will increase the number of authorized cash drawers for the License and Weights & Measures sections of the Department of Building and Zoning Services from zero to five; and\n \nWHEREAS, this ordinance will increase the authorized imprest petty cash funds for the License and Weights & Measures sections of the Department of Building and Zoning Services from $500.00 to $1,000.00; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Building and Zoning Services to transfer this imprest petty cash; now therefore:\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1: That five cash drawers shall be transferred from the Support Services division of the Department of Public Safety to the License and Weights & Measures sections of the Department of Building and Zoning Services.\n \nSECTION 2: That $500.00 of imprest petty cash funds shall be transferred from the Support Services division of the Department of Public Safety to the License and Weights & Measures sections of the Department of Building and Zoning Services.\n \nSECTION 3: That the number of concurrently operable cash drawers within the Support Services division of the Department of Public Safety be decreased from five to zero.\n \nSECTION 4: That the City Auditor is authorized to decrease the imprest petty cash fund for the Support Services division of the Department of Public Safety from $1,500.00 to $1,000.00.\n \nSECTION 5: That the number of concurrently operable cash drawers within the License and Weights & Measures sections of the Department of Building and Zoning Services be increased from zero to five.\n \nSECTION 6: That the City Auditor is authorized to increase the imprest petty cash fund for the License and Weights & Measures sections of the Department of Building and Zoning Services from $500.00 to $1,000.00.\n \nSECTION 7: That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 139,
    "meeting_date": "2025-03-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services",
      "Planning & Development"
    ]
  }
}