{
  "success": true,
  "vote": {
    "id": 1169,
    "item_number": "CA-18",
    "title": "To authorize the Department of Public Utilities to modify past, present, and future contracts and purchase orders with EmNet, LLC because of a corporate merger and name change to Xylem Vue, Inc.; and to declare an emergency. ($0.00)",
    "description": "Explanation\n \nBACKGROUND:  This ordinance authorizes the Director of the Department of Public Utilities to modify past, present, and future contracts and purchase orders with EmNet, LLC, FID 20-1118177 (DAX # 001012) to reflect their new legal name, Xylem Vue, Inc., FID 85-1368169 (DAX # 034990).\n \nThere are two existing contracts that shall be reassigned from EmNet, LLC to Xylem Vue, Inc.:  CIPs #650009-100002 (PO153805 and PO209356) and #650009-100003 (PO257300).\n \nNo additional funds are necessary to modify the open contracts as requested. The original terms and conditions of all affected contracts remain in effect.\n \nFISCAL IMPACT: No additional monies are required to modify the contracts.  \n \nEMERGENCY ACTION is requested in order to update all existing contracts for review and payment to the renamed firm and new Federal Tax ID number.\n \nTitle\n \nTo authorize the Department of Public Utilities to modify past, present, and future contracts and purchase orders with EmNet, LLC because of a corporate merger and name change to Xylem Vue, Inc.; and to declare an emergency. ($0.00)\n \nBody\n \nWHEREAS, the Department of Public Utilities has multiple contracts and open purchase orders for projects with EmNet, LLC; and \n \nWHEREAS, EmNet, LLC has changed its legal corporate name to Xylem Vue, Inc. as the result of a corporate merger and has agreed to honor the past, present and future contracts and agreements; and \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Utilities, in that it is immediately necessary to modify all contracts and purchase orders established and in process with, EmNet, LLC to reflect the new name and Federal Tax ID number for Xylem Vue, Inc., thereby preserving the public health, peace, property, safety, and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Public Utilities is hereby authorized to modify all past, present and future contracts and purchase orders pursuant to those contracts to reflect the change from EmNet, LLC, FID 20-1118177 (DAX # 001012) to reflect their new legal name, Xylem Vue, Inc., FID 85-1368169 (DAX # 034990).\nSECTION 2.  That this modification is in accordance with applicable sections of the Columbus City Codes in relating to contract modifications.\n \nSECTION 3.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 18,
    "meeting_date": "2021-06-21",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Emergency Services",
      "Infrastructure"
    ]
  }
}