{
  "success": true,
  "vote": {
    "id": 11699,
    "item_number": "SR-19",
    "title": "To authorize the Director of the Department of Public Utilities to enter into a contract modification with Prime Construction Management & Survey, Inc. for the Construction Administration/Construction Inspection Services 2023-2025 contract; to appropriate funds within the Sanitary Revolving Loan Fund; to make this ordinance contingent upon the Ohio Water Development Authority approving a loan for this project; and to authorize the expenditure of up to $1,783,848.34 from the Sanitary Revolving Loan Fund to pay for the project.  ($1,783,848.34).",
    "description": "1.  BACKGROUND \nThis ordinance authorizes the Director of Public Utilities to enter into a contract modification with Prime Construction Management & Survey, Inc., for construction administration/inspection services for Department of Public Utilities construction projects bid during the calendar years 2023 through 2025 as part of the Construction Administration/Construction Inspection Services 2023-2025 contracts.  \n \nPrime Construction Management & Survey, Inc. will be assigned construction projects as tasks on their contract and will ensure the work is performed to City of Columbus construction standards and specifications.  As projects are added to the contract, the contract will be modified to authorize Prime Construction Management & Survey, Inc. to perform the work and to add funding to pay for the work.\n \nThe construction project to be administered by Prime Construction Management & Survey, Inc. under this contract modification is 650875-120210 Mainline Lining - James Livingston 5 Blueprint Area (CA/CI).\n \nThis work will primarily be performed in Community Planning Area “62 - Livingston Avenue Area”.\n \n1.1. Amount of additional funds to be expended:  $1,204,608.25\nOriginal Contract:                                  $201,851.31    (ORD 1727-2023; PO411801)\nModification #1:                                      $72,154.14    (ORD 1803-2023; PO419003)\nModification #2:                                  $1,204,608.25    (ORD 3237-2023; PO428570, PO428574, PO428580, PO428584, PO428589)\nModification #3:                                    $350,000.12    (ORD 1618-2024; PO461720)\nModification #4                                      $70,310.34     (ORD 1640-2024; PO469578)\nModification #5 (current)                     $1,783,848.34    (ORD 0180-2025)  \nTotal:                                                  $3,682,772.50   \n \n1.2. Reasons additional goods/services could not be foreseen:  \nThis is a three-year agreement for fiscal years 2023 - 2025 for which modifications were anticipated pursuant to the original authorizing legislation under Ordinance 1727-2023 to account for future construction projects being assigned to Prime Construction Management & Survey, Inc., as additional tasks requiring contract modifications to authorize Prime Construction Management & Survey, Inc., to perform those tasks and to add funding to pay for the additional work to be performed.\n \n1.3. Reason other procurement processes are not used:  \nThis is a multi-year contract that will be modified as required to provide construction administration/inspection services for construction projects that bid during the three year (2023-2025) timeframe.  Another procurement process is not required.   \n \n1.4. How cost of modification was determined:\nThe cost of this modification was determined by negotiations between Prime Construction Management & Survey, Inc. and Department of Public Utilities project staff based upon the existing contract labor titles, maximum labor rates, allowable contract expenses, and the time estimated to be needed to perform contract tasks.\n \n2. ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT\nThis work will ensure the Department’s construction projects are performed correctly and will last the anticipated service life.   No community outreach is planned at this time.\n \n3.  CONTRACT COMPLIANCE INFORMATION\nPrime Construction Management & Survey, Inc. contract compliance number is CC-024771 and expires 10/4/2024.  \nThe certification of Prime Construction Management & Survey, Inc. was in good standing at the time of this contract modification.\n                                                         \n4.  MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract opportunity was submitted to the City’s Office of Diversity and Inclusion (ODI) for review and assignment of an MBE/WBE goal prior to bidding.  ODI determined there was not an opportunity for MBE/WBE participation in this contract and did not assign a goal.  This contract was not bid with a City of Columbus MBE/WBE Program goal and the requirements of the City’s MBE/WBE Program are not applicable to this contract.  Prime Construction Management & Survey, Inc. is classified as a majority owned company by ODI.  Three subcontractors are anticipated to be used for these tasks on the contract.  The MBE/WBE percentage for this task is 22.6%.\n \nCompany Name                                            City/State                                     ODI Certification Status  \nDynotec, Inc.                                                Columbus, Ohio                                              MBE\nTrue Inspection Services, Inc.                        Urbana, Ohio                                                                                 MBE\nDLZ Ohio, Inc.                                             Columbus, Ohio                                              MBE \n \nPrime Construction Management & Survey, Inc. and all subcontractors were in good standing at the time of this contract modification. \n \n5.  FISCAL IMPACT\nThis project is anticipated to be financed with a loan from the Water Pollution Control Loan Fund (WPCLF), a program jointly administered by the Ohio EPA's Division of Environmental and Financial Assistance and the Ohio Water Development Authority (OWDA).  City Council authorized this loan application and acceptance of funding via Ordinance 2767-2023, passed by Council on 10/30/23.  This loan is expected to be approved at the OWDA January Board meeting.  This ordinance is contingent upon the loan being approved by OWDA.  The Department of Public Utilities will inform the Auditor's Office when this loan has been approved.  \n \nTitle\nTo authorize the Director of the Department of Public Utilities to enter into a contract modification with Prime Construction Management & Survey, Inc. for the Construction Administration/Construction Inspection Services 2023-2025 contract; to appropriate funds within the Sanitary Revolving Loan Fund; to make this ordinance contingent upon the Ohio Water Development Authority approving a loan for this project; and to authorize the expenditure of up to $1,783,848.34 from the Sanitary Revolving Loan Fund to pay for the project.  ($1,783,848.34).  \n \nBody\nWHEREAS, the Department of Public Utilities advertised a Request for Proposals for Construction Administration/Construction Inspection Services; and\n \nWHEREAS, Prime Construction Management & Survey, Inc. was one of six firms selected by the evaluation committee to provide these services; and \n \nWHEREAS, Ordinance 1727-2023 authorized the contract with Prime Construction Management & Survey, Inc. for these services and assigned the first task to be performed; and\n \nWHEREAS, additional construction inspection/administration tasks needs to be performed; and\n \nWHEREAS, the contract with Prime Construction Management & Survey, Inc. will need to be modified to add these tasks to the contract and to add funding to pay for the tasks; and \n \nWHEREAS, Ordinance 2767-2023 authorized this project to be funded by a loan to be obtained through the Water Pollution Control Loan Fund (WPCLF) Loan Account; and\n \nWHEREAS, this ordinance is contingent upon that loan being approved; and\n \nWHEREAS, funds must be expended to pay for the construction administration and inspection services Prime Construction Management & Survey, Inc. provides under the Construction Administration/Construction Inspection Services 2023-2025 contract; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Public Utilities is authorized to enter into a contract modification with Prime Construction Management & Survey, Inc, 8415 Pulsar Place, Suite 300 Columbus, OH 43240, for the Construction Administration/Construction Inspection Services 2023-2025 contract to perform additional construction administration and inspection services, in accordance with the terms and conditions as shown in the contract modification on file with the Department of Public Utilities, in an amount not to exceed $1,783,848.34.\n \nSECTION 2.  That the appropriation of $1,783,848.34, or so much thereof as may be needed, is hereby authorized in the Sanitary Revolving Loan Fund, Fund 6111, per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That Ordinance 2767-2023 authorized this project to be funded by a loan to be obtained through the Water Pollution Control Loan Fund (WPCLF) Loan Account;\n \nSECTION 4.  That this ordinance is contingent upon that loan being approved.\n \nSECTION 5. That an expenditure of $1,783,848.34, or so much thereof as may be needed, is authorized per the accounting codes in the attachment to this Ordinance.\n \nSECTION 6.  That funds are deemed appropriated and expenditures and transfers authorized to carry out the purposes of this Ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 7.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this Ordinance.\n \nSECTION 8.  That the City Auditor is authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 9.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 139,
    "meeting_date": "2025-03-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}