{
  "success": true,
  "vote": {
    "id": 11698,
    "item_number": "SR-18",
    "title": "To authorize the expenditure of $14,500,000.00 or so much thereof as may be necessary from the Division of Refuse Collection General Fund to pay 2025 waste disposal tipping fees for the Division of Refuse Collection; to authorize the Director of Public Service to establish an encumbrance of $14,500,000.00 to pay refuse tipping fees to the Solid Waste Authority of Central Ohio for the Division of Refuse Collection pursuant to an existing lease agreement; and to declare an emergency.  ($14,500,000.00)",
    "description": "Explanation\n1.  BACKGROUND\nThis legislation authorizes the Director of Public Service to establish an encumbrance within the General Fund to pay 2025 waste disposal tipping fees for the Division of Refuse Collection and to expend funds to pay the tipping fees.  This expense is necessary to safely and contractually dispose of the waste collected by the division in the course of pursuing its mission by providing residential refuse collection services to over 358,000 households weekly and picking up bulk items and illegally dumped items as needed.\n \nThe Department of Public Service has determined that $14,500,000.00 should be adequate for this purpose.  This number is based upon an estimated waste stream of 305,000 tons in 2025.  Actual tonnage is ultimately dependent on variables such as the weather, the actual number of households collected that cannot be specifically calculated at this time, and the unknown amount of bulk and illegally dumped items.  If necessary, additional legislation will be submitted to increase funds at a later date.  \n \nSWACO tipping fee rates are determined by SWACO's established rate-setting process.  Due to an existing contractual relationship where the City of Columbus participates in the rate-setting process, the City is required to use SWACO waste disposal services. \n \n2.  FISCAL IMPACT\nThis expense is budgeted and appropriated within the Department of Public Service, and the Division of Refuse Collection General Fund, Fund 1000. \n \n3.  EMERGENCY DESIGNATION\nEmergency action is requested to avoid delays of payment to SWACO that could result in the city incurring interest and penalties as specified within the contract.  \n \nTitle\nTo authorize the expenditure of $14,500,000.00 or so much thereof as may be necessary from the Division of Refuse Collection General Fund to pay 2025 waste disposal tipping fees for the Division of Refuse Collection; to authorize the Director of Public Service to establish an encumbrance of $14,500,000.00 to pay refuse tipping fees to the Solid Waste Authority of Central Ohio for the Division of Refuse Collection pursuant to an existing lease agreement; and to declare an emergency.  ($14,500,000.00)\n \nBody\nWHEREAS, the Division of Refuse Collection must encumber funds to continue refuse tipping at the Solid Waste Authority of Central Ohio (SWACO) facilities, pursuant to the lease agreement between the City and SWACO for those facilities; and\n \nWHEREAS, the Department of Public Service has determined that $14,500,000.00 should be adequate for this purpose and is based upon an estimated waste stream of 305,000 tons in 2025; and\n \nWHEREAS, actual tonnage is ultimately dependent on variables such as the weather, the actual number of households collected that cannot be specifically calculated at this time, and the unknown amount of bulk and illegally dumped items; and\n \nWHEREAS, if necessary, additional legislation will be submitted to increase funds at a later date; and  \n \nWHEREAS, an emergency exists in the usual daily operation of the Division of Refuse Collection, Department of Public Service, in that it is immediately necessary to authorize the Director to establish a purchase order (an encumbering document) with the Solid Waste Authority of Central Ohio for 2025 refuse disposal services to avoid incurring interest and penalties due to late payments, all for the immediate preservation of the public health, peace, property, safety and welfare; and now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Service be and hereby is authorized to establish a purchase order (an encumbrance) in the amount of $14,500,000.00 with SWACO for 2025 refuse tipping services for the Division of Refuse Collection at the various rate charges assigned to each tipping location and any legal subsequently adjusted rates.\n \nSECTION 2.  That the expenditure of $14,500,000.00, or so much thereof as may be needed, is hereby authorized in Fund 1000 General Fund in Object Class 03 (Purchased Services) per the accounting codes in the attachment to this ordinance. \nSECTION 3.  That, due to an existing contractual relationship where the City of Columbus participates in the rate-setting process, the City is required to use SWACO waste disposal services. \n \nSECTION 4.  That the City Auditor be and hereby is authorized to make any/all other accounting changes for the transactions discussed within this ordinance that are construed by the City Auditor to be reasonably consistent with the intent of this ordinance.\n \nSECTION 5.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 139,
    "meeting_date": "2025-03-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}