{
  "success": true,
  "vote": {
    "id": 11695,
    "item_number": "SR-15",
    "title": "To authorize the Finance and Management Director, on behalf of the Division of Fire, to associate General Budget Reservations resulting from this ordinance with the appropriate universal term contract purchase agreement(s) for the purchase of uniforms, turn-out gear, and SCBA equipment; to authorize the expenditure of $1,570,000.00 from the General Fund; and to declare an emergency. ($1,570,000.00)",
    "description": "Explanation\nBACKGROUND:  This legislation authorizes the Finance and Management Director to associate General Budget Reservations resulting from this ordinance with the appropriate universal term contract purchase agreement(s) on behalf of the Department of Public Safety, Division of Fire for the purchase of uniforms, turn-out gear and SCBA equipment from Galls, LLC, Lion First Responder PPE Inc., and Atlantic Emergency Solutions Inc., respectively, as required for approval by City Council in order for the division to expend more than $100,000.00, per City Code Section 329.19(g), for the Division of Fire.  These uniforms, turn-out gear, and breathing apparatus will provide replacement equipment for current division personnel, as well as new equipment for incoming recruits.  Fire uniforms consist of such items as pants, shirts, jackets, and boots; turnout gear and SCBA equipment is used by Firefighters as protective outerwear in firefighting situations.\n \nBid Information:  Universal term contracts exist for these expenditures ~ Galls, LLC (Vendor #007478 / PA006862 / 11-30-2026) $900,000.00;  Lion First Responder PPE Inc. (Vendor #030657 / PA004183 / Exp. 9-30-2025) $600,000.00;  Atlantic Emergency Solutions Inc. (Vendor #034448 / PA007286 / Exp. 5-31-2027) $70,000.00\n \nEmergency Designation:  This legislation is to be declared an emergency measure to make funding immediately available for the purchase of said fire uniforms, turn-out gear and SCBA equipment for division personnel so there is no interruption in the availability of these critical supplies.\n \nFISCAL IMPACT:  This ordinance authorizes an expenditure of $1,570,000.00 from the Division of Fire’s 2025 General Fund budget for uniforms and PPE gear for current personnel.  The Division of Fire’s General Fund budget includes funding for uniforms, turn-out gear/PPE, and SCBA equipment. Expenditures for this PPE were approximately $1.85M in 2024, $1.96M in 2023, $1.55M in 2022, $1.88M in 2021, and $1.43M in 2020.\n \nTitle\nTo authorize the Finance and Management Director, on behalf of the Division of Fire, to associate General Budget Reservations resulting from this ordinance with the appropriate universal term contract purchase agreement(s) for the purchase of uniforms, turn-out gear, and SCBA equipment; to authorize the expenditure of $1,570,000.00 from the General Fund; and to declare an emergency. ($1,570,000.00)\n \nBody\nWHEREAS, there is a need to purchase new and replacement uniforms, turn-out gear, and SCBA equipment for the Division of Fire; and,\n \nWHEREAS, universal term contracts established by the Purchasing Office with Galls, LLC, Lion First Responder PPE Inc., and Atlantic Emergency Solutions Inc. exist for these purchases; and,\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Safety, Division of Fire, in that it is immediately necessary to authorize the Director of Finance and Management to associate General Budget Reservations resulting from this ordinance with the appropriate universal term contract(s)/purchase agreement(s) on behalf of the Division of Fire for the purchase of uniforms, turn-out gear, and SCBA equipment so there is no interruption in the availability of these critical supplies, all for the immediate preservation of the public health, peace, property, safety, and welfare; and now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Finance and Management be and is hereby authorized to associate the General Budget Reservations resulting from this ordinance with the appropriate universal term contract purchase agreement(s) on behalf of the Division of Fire for the purchase of uniforms from Galls, LLC., turn-out gear from Lion First Responder PPE Inc., and SCBA equipment form Atlantic Emergency Solutions Inc.  \n \nSECTION 2.  That the expenditure of $1,570,000.00, or so much thereof as may be necessary for the purchase of uniforms, turnout gear, and SCBA equipment be and is hereby authorized from the General Fund, per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 139,
    "meeting_date": "2025-03-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}