{
  "success": true,
  "vote": {
    "id": 11707,
    "item_number": "SR-27",
    "title": "To authorize the Director of Public Service to renew the contract with Rumpke of Ohio, Inc., for yard waste and recycling collection services; to authorize the expenditure of $18,830,356.00 from the General Fund for the ninth year of the contract; and to declare an emergency.  ($18,830,356.00)",
    "description": "Explanation\n \n1. BACKGROUND\nThis ordinance authorizes the Director of Public Service to renew a contract to add funds for year nine of the Collection Services of Yard Waste & Recyclables 2017 Contract with Rumpke of Ohio, Inc., in the amount of $18,830,356.00, and to authorize the Director of Public Service to execute contract modifications if needed to clarify terms and conditions of the contract or to implement program improvements and enhancements.\n \nContinuation of a separate collection for yard waste and recyclable items is necessary to segregate them from the regular waste stream.  This serves to extend the life of the landfill operated by the Solid Waste Authority of Central Ohio (SWACO).  \n \nThe Collection Services of Yard Waste and Recyclables contract provides weekly collection of recyclables and bi-weekly collection of yard waste for residences, servicing of sidewalk recycling containers deployed along Broad Street and High Street and other areas in the downtown business district as part of the Pedestrian Recycling Program, glass pick-up from restaurants and bars along N. High Street and other areas of the downtown business district as part of the Recycle On High program. \n \nThe Department of Public Service issued a bid in 2016 to establish a contract to replace the expiring Collection Services of Yard Waste and Recyclables contract.  City Council approved awarding this contract to Rumpke via Ordinance 0479-2017, passed by Council on 3/13/17.  The contract is a five-year contract expiring 3/31/22, with five one-year renewal options.  This modification will be year four of five of the renewal options.  The current contract expires on 3/31/2025.\n \nOriginal Contract Amount:                                                                            $8,500,000.00   (Ordinance 0479-2017, PO052658)\nContract Year 2 (two) Amount:                                          $8,730,000.00   (Ordinance 0607-2018, PO113383)\nContract Year 3 (three) Amount:                                                        $9,017,736.00   (Ordinance 0927-2019, PO168307)\nContract Year 4 (four) Amount:                                          $9,226,776.00   (Ordinance 0441-2020, PO219470)\nContract Year 5 (five) Amount:                                           $9,540,336.00   (Ordinance 0583-2021, PO265724)\nContract Year 6 (six) Amount:                                           $10,379,496.00   (Ordinance 0813-2022, PO319900)\nContract Year 7 (seven) Amount:                            $16,314,036.00   (Ordinance 0775-2023, PO379141)\nContract Year 8 (eight) Amount:                                     $17,732,896.00   (Ordinance 0719-2024, PO437638)\nContract Year 9 (nine) Amount:                                       $18,830,356.00   (This Ordinance)\n Total Contract Amount:                               $108,271,632.00\n \nSearches in the System for Award Management (Federal) and the Findings for Recovery list (State) produced no findings against Rumpke of Ohio, Inc.\n \n2.  CONTRACT COMPLIANCE\nRumpke’s contract compliance number is CC005677 and expires TBD.  Rumpke of Ohio will need to update their City of Columbus vendor account prior to the execution of this contract modification.\n \n3.  FISCAL IMPACT\nThe Division of Refuse Collection's 2025 General Fund budget includes $18,830,356.00 available for this purpose.\n \n4.  EMERGENCY DESIGNATION\nEmergency action is requested to allow timely execution of this contract, to prevent a lapse of a recycling and yard waste collection contract in order to continue this service to residents. \n \nTitle\n \nTo authorize the Director of Public Service to renew the contract with Rumpke of Ohio, Inc., for yard waste and recycling collection services; to authorize the expenditure of $18,830,356.00 from the General Fund for the ninth year of the contract; and to declare an emergency.  ($18,830,356.00)\n \nBody\n \nWHEREAS, the City of Columbus provides yard waste and recyclable collection through a contract established through the bid process; and \n \nWHEREAS, a five-year contract with five one-year renewal options to perform these services was awarded to Rumpke of Ohio, Inc.; and\n \nWHEREAS, year 9 (nine) of the contract is about to begin; and \n \nWHEREAS, it is necessary to add funds to the contract to pay for year nine; and \n \nWHEREAS, it is necessary to authorize the expenditure of $18,830,356.00 from the Division of Refuse Collection General Fund to pay for year nine of the contract; and \n \nWHEREAS, it may be necessary to execute contract modifications to clarify terms and conditions of the contract, and to execute contract modifications to implement program improvements and enhancements; and\n  \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service, Refuse Collection Division, in that it is immediately necessary to authorize the Director to renew the contract with Rumpke of Ohio, Inc. to prevent a lapse in the contract and to allow the continuation of the service uninterrupted, all for the immediate preservation of the public health, peace, property, safety and welfare; and now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Public Service be and hereby is authorized to renew a contract with Rumpke of Ohio, Inc., 10795 Hughes Road, Cincinnati, OH, 45251, to pay for the Collection Services of Yard Waste & Recyclables 2025 contract. \n \nSECTION 2. That the expenditure of $18,830,356.00, or so much thereof as may be needed, is hereby authorized in Fund 1000, the General Fund in Object Class 03 (Purchased Services) per the accounting codes in the attachment to this ordinance.\n   \nSECTION 3. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 6. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 139,
    "meeting_date": "2025-03-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}