{
  "success": true,
  "vote": {
    "id": 1171,
    "item_number": "CA-20",
    "title": "To amend the 2020 Capital Improvement Budget; to authorize the City’s Chief Innovation Officer to execute a contract modification with Accenture relative to the Smart City Challenge; to authorize the expenditure of up to $665,000.00 from the Public Service Taxable Bonds Fund to pay for the contract modification; and to declare an emergency.  ($665,000.00)",
    "description": "Explanation\n1.  BACKGROUND \nThe Smart City Challenge is a U.S. Department of Transportation (USDOT) grant program seeking to “create a fully integrated, first-of-its kind city that uses data, technology and creativity to shape how people and goods move in the future.”  In 2016 the City of Columbus, acting through the Department of Public Service, applied for and won the Smart City Challenge, receiving a $40 million dollar grant from USDOT and a $10 million grant from the Paul G. Allen Family Foundation (Vulcan).  \n \nPursuant to Ordinance 0820-2018, the Department of Public Service initiated a procurement effort that resulted in the award and execution of a professional services contract with Pillar Technology Group LLC in the amount of up to $2,500,000.00 for design and delivery of advanced data and intelligent transportation systems related to the Smart City Challenge.  The contract deliverables include technologies and applications that can be used to reduce traffic congestion, keep travelers safe, use energy more efficiently, respond to climate change, connect and create opportunities for underserved communities, and support economic vitality.  \n \nThe first planned contract modification added funding to the original contract to allow for the continuation of requisite services by Pillar Technology Group LLC through October 31, 2018, but was cancelled.\n \nThe second planned contract modification replaced the first modification and added funding to the original contract to allow for the continuation of requisite services by Pillar Technology Group LLC.\n \nThe third planned contract modification authorized the assignment of all past, present, and future business done by the City of Columbus with Pillar Technology Group LLC to Accenture LLP and added funding to the original contract to allow for the continuation of requisite services in accordance with the USDOT schedule. \n \nThe fourth planned contract modification added funding to the original contract to allow for the continuation of requisite services by Accenture LLP, formerly known as Pillar Technology Group LLC, in accordance with the USDOT schedule.\n \nThe fifth contract modification for this project added funding to complete design and implement the Smart Columbus Operating System, a data management platform to manage the USDOT data and other city, regional, and statewide data.  \n \nThis modification is the sixth planned contract modification for this project and is intended to continue support for the Smart Columbus Operating System and to advance the three use cases 1) traffic management, 2) parking predictability and 3) a use case to be determined. The city is required to continue support for the Operating System and this investment will allow the team to develop the three use cases and finalize projects started inside the Smart City Challenge program that were unable to be finalized within the program timeline.\n \nThe contract dollar amount to date is as follows:  \n \nOriginal contract amount:                                                                                       $2,500,000.00 (Ord. 0820-2018, PO116406)                          \nTotal Modification No. 1:                                                                                    CANCELLED (Ord. 2121-2018)\nTotal Modification No. 2:                                                                                     $2,500,000.00 (Ord. 2125-2018, PO143587)\nTotal Modification No. 3:                                                                                    $2,500,000.00 (Ord. 0898-2019, PO172823)\nTotal Modification No. 4:                                                                                       $4,081,749.00 (Ord. 2494-2019, PO197469)\nTotal Modification No. 5:                                                                                    $600,000.00 (Ord. 2432-2020, PO253586)\nThis Modification No. 6:                                                                                                         $665,000.00 (This Ordinance)\nTotal Contract amount including all modifications:            $12,846,749.00   \n \nOrdinance 1901-2017 authorized the Public Service Director to transfer signature authority to the Chief Innovation Officer or the Chief Innovation Officer's designee for all past, present and future Smart Columbus, USDOT Smart City Challenge, and Paul G Allen Family Foundation (Vulcan) contracts, documents, and projects.\n \nAccenture is not debarred according to the System for Award Management Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the State of Ohio Unresolved Findings for Recovery Certified Search. \n \n2.  CONTRACT COMPLIANCE INFORMATION \nThe contract compliance number for Accenture LLP is CC023429 and expires 9/26/2021. \n \n3.  FISCAL IMPACT \nFunds in the amount of $665,000.00 are available within Fund 7708, the Public Service Taxable Bonds Fund.  An amendment to the 2020 Capital Improvement Budget is required to establish sufficient budget authority for the project.  The funds are appropriated.\n \n4.  EMERGENCY DESIGNATION \nEmergency designation is requested to allow for the timely execution of the contract modification to meet project deadlines established with USDOT for the Smart City grant.\n \nTitle\nTo amend the 2020 Capital Improvement Budget; to authorize the City’s Chief Innovation Officer to execute a contract modification with Accenture relative to the Smart City Challenge; to authorize the expenditure of up to $665,000.00 from the Public Service Taxable Bonds Fund to pay for the contract modification; and to declare an emergency.  ($665,000.00)\n \nBody\nWHEREAS, in 2016 USDOT awarded the City of Columbus up to $40 million in federal funds for the Smart City Challenge to assist in implementation of the City’s proposal to demonstrate how advanced data and intelligent transportation systems (ITS) technologies and applications can be used to reduce congestion, keep travelers safe, protect the environment, respond to climate change, connect underserved communities, and support economic vitality; and\n \nWHEREAS, Ordinance 0820-2018 authorized the Chief Innovation Officer to enter into a professional services contract with Pillar Technology Group LLC in an amount of up to $2,500,000.00 for the provision of various design services related to the Smart City Challenge; and\n \nWHEREAS, Ordinance 2121-2018 authorized the Chief Innovation Officer to enter into a first professional services contract modification with Pillar Technology Group LLC in an amount of up to $430,000.00 for the provision of various design services related to the Smart City Challenge, which was subsequently cancelled; and\n \nWHEREAS, Ordinance 2125-2018 authorized the Chief Innovation Officer to enter into a second professional services contract modification with Pillar Technology Group LLC in an amount of up to $2,500,000.00 for the provision of various design services related to the Smart City Challenge; and\n \nWHEREAS, Pillar Technology Group LLC was acquired by Accenture LLP, and in addition to notifying the City of the acquisition, Accenture LLP agreed to honor past, present and future purchase orders established from contract number PO116406; and \n \nWHEREAS, Ordinance 0898-2019 authorized the Chief Innovation Officer to modify all contracts and agreements by assigning all past, present, and future contracts and purchase orders with Pillar Technology Group LLC to Accenture LLP and to execute a third planned contract modification with Accenture LLP to add additional funding in the amount of $2,500,000.00 for the provision of various design services related to the Smart City Challenge; and\n \nWHEREAS, Ordinance 2494-2019 authorized the Chief Innovation Officer to enter into a fourth professional services contract modification with Accenture LLP in an amount of up to $4,081,749.00 for the provision of various design services related to the Smart City Challenge; and\n \nWHEREAS, Ordinance 2432-2020 authorized the Chief Innovation Officer to enter into a fifth professional services contract modification with Accenture LLP in an amount of up to $600,000.00 for the complete design and implement the Smart Columbus Operating System; and\n \nWHEREAS, it is necessary to execute a sixth contract modification with Accenture LLP to add additional funding to continue support for the Smart Columbus Operating System and to advance the three use cases; and\n \nWHEREAS, funding for this contract modification is available in Fund 7708, the Public Service Taxable Bonds Fund; and\n \nWHEREAS, it is necessary to amend the 2020 Capital Improvement Budget to establish budget authority in the proper project for this contract modification; and\n \nWHEREAS, it is necessary to expend funds to pay for work performed as part of the contract modification; and\n \nWHEREAS, Ordinance 1901-2017 authorized the Public Service Director to transfer signature authority to the Chief Innovation Officer or the Chief Innovation Officer's designee for all past, present and future Smart Columbus, USDOT Smart City Challenge, and Paul G Allen Family Foundation (Vulcan) contracts, documents, and projects; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Smart City Program in that it is immediately necessary to authorize the Chief Innovation Officer to execute a contract modification with Accenture LLP to meet project deadlines established with USDOT for the Smart City grant, thereby preserving the public health, peace, property, safety, and welfare; now, therefore, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2020 Capital Improvements Budget, authorized by Ordinance 2521-2020, be and is hereby amended as follows to establish sufficient budget authority for this project:\n \nFund / Project / Project Name / Current C.I.B. / Change / Amended C.I.B.\n7708 / P530163-100000 / Smart City Challenge (Voted Carryover) / $219,873.00 / $463,605.00 / $683,478.00 (to match cash)\n \n7708 / P530163-100000 / Smart City Challenge (Voted Carryover) / $683,478.00 / ($665,000.00) / $18,478.00\n7708 / P530163-100009 / Smart City Challenge - Project Management Services (Voted Carryover) / $0.00 / $665,000.00 / $665,000.00\n \nSECTION 2.  That the City’s Chief Innovation Officer, on behalf of the Department of Public Service, be and is hereby authorized to execute a professional services contract modification with Accenture LLP, 580 North 4th Street-Suite 190, Columbus, Ohio, 43215, in an amount of up to $665,000.00, for the completion of various design services related to the Smart City Challenge.\n \nSECTION 3.  That the expenditure of $665,000.00, or so much thereof as may be necessary, be and is hereby authorized in Fund 7708 (Public Service Taxable Bonds Fund), Dept-Div 5912 (Division of Design and Construction), Project P530163-100009 (Smart City Challenge - Project Management Services), Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Chief Innovation Officer administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 7.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or 10 days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 18,
    "meeting_date": "2021-06-21",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}