{
  "success": true,
  "vote": {
    "id": 11730,
    "item_number": "CA-14",
    "title": "To authorize the Director of Development to renew the agreement authorized under Ordinance No. 2044-2023 with Columbus Compact Corporation dba Columbus Empowerment Corporation, to add additional funding in an amount up to $178,501.87, and to extend the contract period for an additional 12-month term; to authorize the expenditure of $178,501.87 from the 2025 General Fund budget; and to declare an emergency. ($178,501.87)",
    "description": "Explanation\n \nBACKGROUND: \nThe Department of Development seeks to renew a contract, Renewal No. 1, with Columbus Compact Corporation in an amount not to exceed $178,501.87 to administer small business advising services for the Downtown Ground Floor Growth Initiative (formerly the Downtown Commercial Marketplace program).  \nOriginal Contract                     $150,000.00                     Ord. 2044-2023                                          PO406378\nRenewal No. 1                                          $178,501.87                     \nTotal Contract Amount                     $328,501.87\n \nThe City of Columbus has successfully launched the Downtown Ground Floor Growth Initiative to support existing businesses relocating or expanding to downtown Columbus to stimulate downtown commercial activity.  The business advisor assists the selected business in achieving financial success, measured through profit and loss statements through planning, counseling, and connecting businesses with other business development resources.  The advisor is also be responsible for reaching out to neighboring small businesses to offer business counseling and to offer to connect the businesses to business development resources. \nThe Department utilized the Request for Proposals (RFP) process in accordance with City procurements standards to solicit proposals.  Proposals were submitted in response to RFQ024861 in accordance with the relevant provisions of Chapter 329 of the Columbus City Codes. After careful review, the Proposal Evaluation Committee selected Columbus Compact Corporation to administer advising services to small businesses participating in the Downtown Commercial Marketplace Program.  RFQ024861 authorized up to two renewals. This legislation seeks to renew this contract for the first time.\nColumbus Compact aims to support businesses and economic development by creating assets.  Currently, by providing small business development services for local business owners; and supporting central city revitalization by investing in the stabilization of real estate.  Our overall objective is to assist in the capacity of Small Businesses (DBE/MBE/FBE/LMI); and empower them to achieve quantifiable and potentially sustainable growth. \nAs a non-profit, since 1995, the Columbus Compact dba Columbus Empowerment has a history of working with small businesses in general, a portion of which have been in the retail industry and a portion of which have been located downtown.  Restructured in 2019, the Organization has continued to be an ESO providing direct services to small businesses throughout the City of Columbus, Franklin County, and contiguous counties through 1-1 advisement, including assessment, plan of action development, and workshops for starting, scaling, obtaining sustainability and expansion.  Services include but are not limited to strategic business planning, obtaining financial resources, relocation, and private and public sector market expansion.\nIn accordance with C.C. 329.09(a): \n1.                     The amount of additional funds to be expended under this modification is $178,501.87.\n2.                     The initial funding amount of $150,000.00 was sufficient to carry out the scope of work outlined in the initial contract. The additional funding requested for the renewal of this contract will be for forthcoming work performed under the renewal of this contract.\n3.                     Another vendor is not in the interest of the City as the current vendor is already administering the program. Choosing another vendor would result in a less qualified administrator of this program and a less efficient and more costly outcome. \n4.                     The additional funding needs were determined through working with the vendor.\n \nFurther, this legislation seeks to declare an emergency to ensure that there are no delays in the continuation of the program, which includes the second round of the program which cannot be completed without additional funding.\nFISCAL IMPACT: Funding is available within the within the Department of Development, Economic Development Division’s 2025 General Fund budget.\n \nTitle\n \nTo authorize the Director of Development to renew the agreement authorized under Ordinance No. 2044-2023 with Columbus Compact Corporation dba Columbus Empowerment Corporation, to add additional funding in an amount up to $178,501.87, and to extend the contract period for an additional 12-month term; to authorize the expenditure of $178,501.87 from the 2025 General Fund budget; and to declare an emergency. ($178,501.87)\n \nBody\n \nWHEREAS, the City of Columbus is continuing to operate the Downtown Ground Floor Growth Initiative to support small businesses in Downtown Columbus in order to stimulate downtown commercial activity; and\nWHEREAS, the City of Columbus, utilized a Request for Proposals (RFP) process to identify and assess qualified firms; and\nWHEREAS, proposals were submitted in response to RFQ024861 in accordance with the relevant provisions of Chapter 329 of the Columbus City Code, and Columbus Compact Corporation received the highest overall score from the RFP committee; and\nWHEREAS, RFQ024861 authorized up to two renewals of the original agreement; and\nWHEREAS, the Director of Development seeks to renew the contract with Columbus Compact Corporation dba Columbus Empowerment Corporation for a business advisor to administer advising services to businesses participating in the Downtown Ground Floor Growth Initiative in an amount up to $178,501.87; and\nWHEREAS, to authorize an expenditure in an amount up to $178,501.87 from the Department of Development General Fund; and\nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to authorize the Director to renew the existing contract with Columbus Compact Corporation dba Columbus Empowerment Corporation which is scheduled to expire on March 30, 2025 to add additional funding and to extend the contract term for an additional 12-month term from March 31, 2025 to March 30, 2026, to ensure that there are no delays in the continuation of the Downtown Ground Floor Growth Initiative program, all for the immediate preservation of the public health, peace, property, safety, and welfare; and; NOW THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1.  That the Director of Development be and is hereby authorized to renew a contract, to add additional funding in an amount up to $178,501.87 and tofor a period of time not to exceed 12 months from March 31, 2025 to March 30, 2026, with Columbus Compact Corporation dba Columbus Empowerment Corporation, for the business advising portion of the Downtown Ground Floor Growth Initiative program.\n \nSECTION 2.  That for the purpose as stated in Section 1, the expenditure of $178,501.87, or so much thereof as may be necessary, is hereby authorized in fund 1000 (General Fund), Dept-Div 44-02 (Economic Development), object class 03 (Services) per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That the funds necessary to carry out the purpose of this ordinance are deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5.  That this renewal is made in accordance with the relevant provisions of the City Code Charter 329 relating to contract renewal.\n \nSECTION 6. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 140,
    "meeting_date": "2025-03-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}