{
  "success": true,
  "vote": {
    "id": 11740,
    "item_number": "CA-24",
    "title": "To authorize the Director of the Department of Finance and Management to associate all general budget reservations resulting from this ordinance with the Universal Term Contract Purchase Agreement with Workspace Ohio LLC, dba Dupler Office for the purchase of office furniture, the Universal Term Contract Purchase Agreement with 2K General Company for general contracting services, and the Universal Term Contract Purchase Agreement with E2 Optics, LLC for cabling, hardware and services; to authorize the appropriation, transfer, and expenditure of $126,242.00 from the General Permanent Improvement Fund; to amend the 2024 Capital Improvement Budget; and to declare an emergency ($126,242.00).",
    "description": "Explanation\n \n1. BACKGROUND \nThis ordinance authorizes the Director of the Department of Finance and Management to associate all General Budget Reservations resulting from this ordinance with the appropriate Universal Term Contract Purchase Agreements for the purchase of office furniture, general contracting services, cabling, hardware and services, and to appropriate and expend $126,242.00 for the purchase, delivery, and installation of office furniture, general contracting services, cabling, hardware and services for the Department of Human Resources from Fund 7748, the General Permanent Improvement Fund; and to declare an emergency.\n \nWorking with the Real Estate Management Office and the Division of Facilities Management the Department of Human Resources engaged in a computer lab renovation project to better utilize a Department of Human Resources, Citywide Training and Development computer lab within 1111 E. Broad Street, to provide a better workspace for individuals to train and develop themselves personally and professionally.  The Universal Term Contract Purchase Agreement established with Workspace Ohio LLC, dba Dupler Office authorized by Ordinance 1477-2023, is used for professional design services to analyze existing space layouts, prepare a new plan for space layout, and select appropriate office furnishings.  Additionally, a Universal Term Contract Purchase Agreement established with 2K General Company, authorized by Ordinance 2891-2023, and modified by Ordinance 0161-2025, is used for general contracting for maintenance, service, repairs, and renovations.  Finally, a Universal Term Contract Purchase Agreement established with E2 Optics LLC, authorized by Ordinance 2484-2021, is used to maintain, relocate, and repair interior network cabling. \n \nWorkspace Ohio LLC, dba Dupler Office: PA006655, Furniture Services\n2K General Company: PA005177, General Maintenance, Service, Repair\nE2 Optics LLC: PA005472, Cabling, Hdw & Svs\n \nWorkspace Ohio LLC, dba Dupler Office, 2K General Company, and E2 Optics LLC are not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.\n \n2. CONTRACT COMPLIANCE\nWorkspace Ohio LLC, dba Dupler Office’s contract compliance number is CC-040812 and WBE-040812 and expires on 1/9/2026 and 1/18/2025, respectively. \n \n2K General Company’s contract compliance number is CC-005739 and expires on 8/15/2026. \n \nE2 Optics LLC’s contract compliance number is EBE-030330, expiring on 12/15/2025.\n                                                                                   \n3. FISCAL IMPACT \nFunding for the purchase is available and shall be from the General Permanent Improvement Fund, Fund 7748, Project P748999-100000 ($126,242.00).  An amendment to the 2024 Capital budget will be necessary.\n \n4. EMERGENCY DESIGNATION\nDue to supply chain issues, long lead times are required from the order date to the furniture delivery. Emergency action is requested to ensure that needed office furniture can be ordered at the earliest date possible so that the project can be completed within a reasonable time frame so that the Department of Human Resources operations can benefit from the efficiency of the redesigned computer lab as soon as possible.\n \nTitle\n \nTo authorize the Director of the Department of Finance and Management to associate all general budget reservations resulting from this ordinance with the Universal Term Contract Purchase Agreement with Workspace Ohio LLC, dba Dupler Office for the purchase of office furniture, the Universal Term Contract Purchase Agreement with 2K General Company for general contracting services, and the Universal Term Contract Purchase Agreement with E2 Optics, LLC for cabling, hardware and services; to authorize the appropriation, transfer, and expenditure of $126,242.00 from the General Permanent Improvement Fund; to amend the 2024 Capital Improvement Budget; and to declare an emergency ($126,242.00).\n \nBody\n \nWHEREAS, suite renovations and reconfiguration and replacement of furniture at 1111 E. Broad St, LL01, is required to accommodate the training and development of City of Columbus employees in the computer lab; and\nWHEREAS, the City of Columbus, Purchasing Office has established a Universal Term Contract for the purchase of furniture and related services with Workspace Ohio LLC, dba Dupler Office, one for the general construction with 2K General Company, and one for cabling, hardware and services with E2 Optics LLC; and\n \nWHEREAS, it is necessary to authorize the Director of the Department of Finance and Management to associate all General Budget Reservations resulting from this ordinance with the Universal Term Contract Purchase Agreements; and\n \nWHEREAS, it is necessary to amend the 2024 Capital Improvement Budget; and\nWHEREAS, it is necessary for the appropriation, transfer, and expenditure of funds within the General Permanent Improvement Fund; and\nWHEREAS, an emergency exists in the usual daily operation of the Department of Human Resources in that it is immediately necessary to appropriate and expend funds to allow for the purchase of office furniture at the earliest possible date necessary for the redesign of the computer lab located at 1111 E. Broad St, LL01, occupied by the Department of Human Resources, in light of supply chain issues and long lead times required from the date of order to the delivery of furniture; all for the immediate preservation of the public health, peace, property, safety and welfare; and NOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Department of Human Resources is hereby authorized to appropriate and expend funds for the purchase of office furniture in accordance with the specifications of the Universal Term Contract Purchase Agreement established with Workspace Ohio LLC, dba Dupler Office.\n \nSECTION 2. The Director of the Department of Human Resources is hereby authorized to appropriate and expend funds for the purchase of general contracting services in accordance with the specifications of the Universal Term Contract Purchase Agreement established with 2K General Company.\n \nSECTION 3. That the Director of the Department of Human Resources is hereby authorized to appropriate and expend funds for the purchase of cabling, hardware and services in accordance with the specifications of the Universal Term Contract Purchase Agreement established with E2 Optics LLC.\n \nSECTION 4. That the 2024 Capital Improvement Budget be amended in Fund 7748 as follows:\n \nProject Number/Project Name/Funding Source/Original Auth. /Revised Auth./Change    \nP748999-100000/Unallocated Balance/GPIF Carryover/$439,275/$313,033/($126,242)\nP460006-100000/Human Resources - Furniture/GPIF Carryover/$0/$45,000/$45,000\nP460007-100000/Human Resources - General Contracting Services/GPIF Carryover/$0/$81,242/$81,242\n \nSECTION 5. That the appropriation of $126,242.00 or so much thereof as may be needed, is hereby authorized within the General Permanent Improvement Fund, Fund 7748 per the account codes in the funding attachment to this ordinance. \n \nSECTION 6. That the transfer of cash in the amount of $126,242.00 between projects in Fund 7748 is hereby authorized and approved per the accounting codes in the funding attachment to this ordinance.\n \nSECTION 7. That the expenditure of $126,242.00 or so much thereof as may be necessary in regard to the action authorized in Section 4, be and is hereby authorized and approved per the accounting codes in the funding attachment to this ordinance.\n \nSECTION 8. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 9. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 10. That the City Auditor is hereby authorized to transfer the unencumbered balance remaining for this project account to the unallocated balance account within the same fund upon receipt of proper notification from the Department of Finance and Management that the project has been completed and the monies are no longer required for this project.\n \nSECTION 11. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten (10) days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 140,
    "meeting_date": "2025-03-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}