{
  "success": true,
  "vote": {
    "id": 11768,
    "item_number": "CA-52",
    "title": "To authorize the Director of Public Utilities to enter into a contract with Tom Synnott Associates, Inc. DBA tsaADVET for software licenses, support, and maintenance of the Falcon Enterprise, Falcon DMS software, the sole source provider of the software; and to authorize the expenditure of $49,125.00 split between the Electricity, Water, Sanitary Sewer, and Stormwater Operating Funds. ($49,125.00)",
    "description": "Explanation \n \nBackground: This ordinance authorizes the Director of Public Utilities to enter into an agreement with Tom Synnott Associates, Inc. DBA tsaADVET for software licenses, support, and maintenance of the Falcon Enterprise, Falcon document management system (DMS) software. The contract amount being authorized by this ordinance is $49,125.00.\n \nThe Falcon Enterprise software includes the following: Falcon/DMS Document Management, Custom Electronic Form, Falcon/Indexer, Falcon/SVP, Falcon/Deliver, Falcon/Enterprise, Falcon/DMS Sentry PDF Publisher Module, Falcon/DMS Integration with Oracle WAM, and Falcon/API Developer Toolkit. This software has been utilized by the Department of Public Utilities for approximately 24 years and is used to support the Engineering plan review process for the Division of Water, Division of Power, and Division of Sewers and Drains.\n \nTom Synnott Associates, Inc. DBA tsaADVET is the sole developer of the software and will provide all licenses, support, and maintenance required to keep the system up to date. Therefore, the agreement for the Falcon Enterprise software license, support, and maintenance will be established in accordance with the pertinent provisions for Sole Source Procurement of Chapter 329 of the Columbus City Code. This contract will be in effect from April 1, 2025 up to and including March 31, 2026. This contract will not automatically renew. Renewal of this contract is subject to mutual agreement between the parties, approval of City Council, and certification of funds by the City Auditor.\n \nPrincipal Parties: \nTom Synnott Associates, Inc. DBA tsaADVET \n4722 Campbells Run Rd. \nPittsburgh, PA 15205\nAndrew Synnott, (412) 787-0980\nContract Compliance Number: 001939\nContract Compliance Expiration Date: April 25, 2026\n \nFiscal Impact: $49,125.00 is budgeted and available from within the Public Utilities Operating Funds to meet the financial obligations of this contract.\n \n$49,125.00 was spent in 2024\n$47,800.00 was spent in 2023\n \nTitle\nTo authorize the Director of Public Utilities to enter into a contract with Tom Synnott Associates, Inc. DBA tsaADVET for software licenses, support, and maintenance of the Falcon Enterprise, Falcon DMS software, the sole source provider of the software; and to authorize the expenditure of $49,125.00 split between the Electricity, Water, Sanitary Sewer, and Stormwater Operating Funds. ($49,125.00)\nBody\nWHEREAS, it is necessary to authorize the Director of the Department of Public Utilities to enter into contract with Tom Synnott Associates, Inc. DBA tsaADVET for software licenses, support, and maintenance of the Falcon Enterprise, Falcon DMS software; and\n \nWHEREAS, the Department of Public Utilities wishes to enter into a service agreement for a period of one (1) year to and including March 31, 2026; and\n \nWHEREAS, the Department of Public Utilities utilizes the Falcon Enterprise software programs by Tom Synnott Associates, Inc. DBA tsaADVET., the sole developer of this software; and\n \nWHEREAS, it is necessary to authorize the expenditure of $49,125.00 from the Public Utilities Operating Fund, split among the Electricity, Water, Sanitary Sewer, and Stormwater Operating Funds; and\n \nWHEREAS, it has become necessary in the usual daily operations of the Department of Public Utilities in that it is necessary to authorize the Director to enter into a contract with Tom Synnott Associates, Inc. DBA tsaADVET for software licenses, support, and maintenance of the Falcon Enterprise, Falcon DMS software; NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS: \n \nSECTION 1. That the Director of Public Utilities be and is hereby authorized to enter into a sole-source contract with Tom Synnott Associates, Inc. DBA tsaADVET for Software Support and Maintenance of the Falcon Enterprise, Falcon DMS software in accordance with the sole source procurement provisions of City Code Chapter 329.\n \nSECTION 2. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 4. That for the purpose stated in Section 1, the expenditure of $49,125.00 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from Public Utilities in object class 03 Services, split among the Electricity, Water, Sanitary Sewer, and Stormwater Operating Funds, per the accounting codes in the attachments to this ordinance.  \n \nSECTION 5.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 140,
    "meeting_date": "2025-03-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}