{
  "success": true,
  "vote": {
    "id": 11789,
    "item_number": "SR-10",
    "title": "To authorize the Executive Director of the Office of CelebrateOne to accept a grant extension from the Ohio Department of Medicaid for the Enhanced Maternal Health Program in the amount of $2,260,000.00; to authorize the appropriation of $2,260,000.00 from the unappropriated balance of the General Government Grants Fund; and to authorize contracts and expenditures with multiple community partner sub-grantees for the Enhanced Maternal Health Program in Columbus and Central Ohio up to $1,650,000.00; and to expend up to $610,000.00 of this grant for CelebrateOne Community Health Workers' work with CelebrateOne pregnant and parenting families and to declare an emergency. ($2,260,000.00)",
    "description": "Explanation\n \nBACKGROUND:  The Office of CelebrateOne has been awarded a grant extension from the Ohio Department of Medicaid which is administered by the State’s Managed Care Plans. This ordinance is needed to accept and appropriate $2,260,000.00 in grant monies to fund the Enhanced Maternal Health Program for the period January 1st, 2025 through December 31st, 2025 and to declare an emergency. \n \nThe Ohio Department of Medicaid awarded the 2022-2024 grant to the Office of CelebrateOne at the City of Columbus to coordinate the Enhanced Maternal Health Program in Franklin County. CelebrateOne has been designated as the primary grantee organization and administrator for this grant for Franklin County.  The Ohio Department of Medicaid extended the grant period from January 1st, 2025 to December 31, 2025.\n \nWith the extension funding, the Office of CelebrateOne will establish contracts with up to fourteen (14) community partners in order to provide health and education services to expecting moms and moms of children under one (1) year of age.  Many of the partners were contracted during the original grant period of July 1, 2022 through June 30, 2024 and they have remaining work to complete through the end of 2025. \n \nGrant funding will provide continued investment in Centering Pregnancy options in priority geographies through Heart of Ohio Family Health Centers and PrimaryOne Health, while also strengthening prenatal home visiting teams at Center for Healthy Families. Additional health care support for pre- and post-natal parents will be provided by Lower Lights Christian Health Center. \n \nIn addition, this grant provides support for culturally informed doula care with mOBINurses, Inc., maintains trauma-informed prenatal support through Moms2B, and provides support to the information and referral line, StepOne for a Healthy Pregnancy. This grant addresses gaps in service by increasing support for teen outreach through The Center for Healthy Families, provides new support for medical-legal issues through Legal Aid of Southeast and Central Ohio.\n \nFinally, this grant ensures that the community’s strong core of community health workers at CelebrateOne, the YMCA of Central Ohio continue to connect women and families to services and resources that support a healthy pregnancy.  In addition, the grant will fund some CelebrateOne Community Health Worker salaries as they also provide services to both pre- and post-natal parents.\n \nThe Ohio Department of Medicaid Grant Extension, in the amount of $2,260,000.00, has begun January 1st 2025 and is planned to conclude by December 31, 2025.  Expenditures are planned within CelebrateOne and fourteen (14) partnering agencies.  \n \n\n\n\nCelebrateOne (Connector Corps)\n\n $610,000.00 \n\n\n\nYoung Mens Christian Association of Central Ohio\n\n $150,000.00\n\n\n\nLegal Aid of Southeast and Central Ohio \n\n $100,000.00\n\n\n\nCity of Refuge Good Life Foundation\n\n $120,000.00\n\n\n\nThe Ohio State University (Moms 2 Be)\n\n $50,000.00\n\n\n\nPhysicians CareConnection\n\n $116,000.00\n\n\n\nProject Milk Mission\n\n $91,155.00\n\n\n\nMental Health America of Ohio, Inc.\n\n $101,504.00\n\n\n\nUrban Family Development Center/Dads2B\n\n $110,000.00\n\n\n\nPrimaryOne Health\n\n $150,000.00\n\n\n\nThe Center for Healthy Families, Inc.\n\n $130,000.00 \n\n\n\nOhioHealth\n\n $176,527.34 \n\n\n\nHeart of Ohio Family Health Centers\n\n $78,813.66\n\n\n\nmOBINurses Inc.\n\n $160,000.00\n\n\n\nLower Lights Christian Health Center, Inc.\n\n $116,000.00\n\n\n\nTOTAL\n\n $2,260,000.00\n\n\n \nEMERGENCY DESIGNATION: This ordinance is being submitted as an emergency in order to allow the continuation of program funding that is critical to the operation and goals of CelebrateOne and all the subsequent agencies dependent upon these grant for the continuation of programs for the health and prosperity of City of Columbus citizens\n \nFISCAL IMPACT:  This ordinance authorizes the acceptance and appropriation of $2,260,000.00 in Ohio Department of Medicaid grant monies to fund the Enhanced Maternal Health Program extension. This ordinance also authorizes contracts with up to fourteen (14) community agencies for the disbursement of grant monies to further work in infant and maternal health. This Ohio Department of Medicaid Grant program does not generate any revenue nor require a City match. \n \nTitle\nTo authorize the Executive Director of the Office of CelebrateOne to accept a grant extension from the Ohio Department of Medicaid for the Enhanced Maternal Health Program in the amount of $2,260,000.00; to authorize the appropriation of $2,260,000.00 from the unappropriated balance of the General Government Grants Fund; and to authorize contracts and expenditures with multiple community partner sub-grantees for the Enhanced Maternal Health Program in Columbus and Central Ohio up to $1,650,000.00; and to expend up to $610,000.00 of this grant for CelebrateOne Community Health Workers' work with CelebrateOne pregnant and parenting families and to declare an emergency. ($2,260,000.00)\n \nBody\n \nWHEREAS, $2,260,000.00 in grant funds have been made available through the Ohio Department of Medicaid for the Enhanced Maternal Health Program Extension for the period of July 1, 2024 through December 31, 2024; and\n \nWHEREAS, it is necessary to accept and appropriate these funds from the Ohio Department of Medicaid for the Enhanced Maternal Health program extension for Grant G402500; and\n \nWHEREAS, this ordinance authorizes the Executive Director of CelebrateOne to administer sub-grant contracts with up to fourteen (14) community partners engaged in the Enhanced Maternal Health programs in an amount of up to $1,650,000.00; and \n \nWHEREAS, this ordinance authorizes up to $610,000.00 to fund work by CelebrateOne Community Health Workers engaged in case management work with CelebrateOne pregnant and parenting families; and\n \nWHEREAS, it is necessary to allow the City Auditor to transfer appropriations between object classes and grant numbers for the Enhanced Maternal Health Program as needed upon request by CelebrateOne; and\n \nWHEREAS, an emergency exists in the usual daily operation of the CelebrateOne in that it is immediately necessary to authorize the Executive Director of CelebrateOne to accept these grant funds from the Ohio Department of Medicaid and to enter into multiple contracts with community grantees for the Enhanced Maternal Health Program, and to partially fund CelebrateOne Community Health Workers' salaries; without delay to allow the continuation of the works and programs of CelebrateOne and it’s grantees, for the immediate preservation of the public health, peace, property and safety; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Executive Director of the Office of CelebrateOne is hereby authorized to accept and appropriate $2,260,000.00 from the Ohio Department of Medicaid as CelebrateOne has been designated as the primary grantee organization and administrator for this grant extension in the central Ohio region.\n \nSECTION 2. That the Executive Director of the Office of CelebrateOne is hereby authorized to establish contracts with the following agencies in order to meet grant deliverables through December 31, 2025 and expend a total dollar amount not to exceed $1,650,000.00.\n \n\n\n\nYoung Mens Christian Association of Central Ohio      $150,000.00\n\n \n\n\n\nLegal Aid of Southeast and Central Ohio \n\n $100,000.00\n\n\n\nCity of Refuge GoodLife Foundation\n\n $120,000.00\n\n\n\nThe Ohio State University (Moms 2 Be)\n\n $50,000.00\n\n\n\nPhysicians CareConnection\n\n $116,000.00\n\n\n\nProject Milk Mission\n\n $91,155.00\n\n\n\nMental Health America of Ohio, Inc.\n\n $101,504.00\n\n\n\nUrban Family Development Center/Dads2B  \n\n $110,000.00\n\n\n\nPrimaryOne Health\n\n $150,000.00\n\n\n\nThe Center for Healthy Families, Inc.\n\n $130,000.00 \n\n\n\nOhioHealth\n\n $176,527.34 \n\n\n\nHeart of Ohio Family Health Centers\n\n $78,813.66\n\n\n\nmOBINurses Inc.\n\n $160,000.00\n\n\n\nLower Lights Christian Health Center, Inc.\n\n $116,000.00\n\n\nSECTION 3. That the Executive Director of CelebrateOne is hereby authorized to expend up to $610,000.00 to fund the salary costs associated with the CelebrateOne Community Health Workers.\n \nSECTION 4. That to pay the costs of said contracts and the programs administered by CelebrateOne, the expenditure is hereby authorized from the General Government Grant Fund 2220, per the accounting codes in the attachment to this ordinance.  \n \nSECTION 5. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6. That the City Auditor is hereby authorized to transfer appropriations between object classes and grant numbers for the Enhanced Maternal Health program as needed upon request by CelebrateOne to carry out the purpose of the grant.\n \nSECTION 7. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance and to make any accounting changes necessary to ensure that these contracts are properly accounted for and recorded accurately on the City’s financial records.  \n \nSECTION 8.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure, and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves or vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 140,
    "meeting_date": "2025-03-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}