{
  "success": true,
  "vote": {
    "id": 11823,
    "item_number": "CA-4",
    "title": "To Honor the Retirement of the Reverend Joshua C. Kelly from First Church of God",
    "description": "Title\n \nTo Honor the Retirement of the Reverend Joshua C. Kelly from First Church of God  \n \nBody\n \nWHEREAS, Reverend Joshua C. Kelly has faithfully served the body of Christ for over 25 years, ministering as a musician, singer, composer, evangelist, preacher, teacher, and servant leader with an impassioned and infectious style of preaching that has blessed thousands; and \n \nWHEREAS, The Reverend Kelly earned a Bachelor of Science degree from Bernard Baruch College (CUNY) majoring in Psychology and Education, a Master of Science degree in Computers and Education from C.W. Post, Long Island University, and furthered his theological education through the Bethel Bible Institute and Beacon university, reflecting his commitment to intellectual and spiritual growth; and\nWHEREAS, the Reverend Kelly previously served as the Senior Pastor of the Living Rock Christian Center of Far Rockaway, NY, where he led the congregation for 12 years, served as Treasurer for the Rockaway-Inwood Ministerial Coalition, and held leadership positions within the Church of God in Christ, 3rd Ecclesiastical Jurisdiction; and\nWHEREAS in August 2004, the Reverend Kelly accepted the call to serve as Executive Pastor at First Church of God under the leadership of his childhood friend, Bishop Timothy J. Clarke, where he has demonstrated unwavering commitment to the church’s growth and spiritual guidance; and \nWHEREAS, the Reverend Kelly has been a devoted husband to his wife, Latricia Patrice, since September 1982, and together they have raised four children and embraced the joy of four grandchildren, providing a loving and nurturing family environment grounded in faith; and\nWHEREAS, the Reverend Kelly’s ministry and leadership have profoundly impacted First Church of God and the broader Columbus community, leaving a legacy of faith, compassion, and service that will endure for generations; now, therefore,\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: That this Council hereby honors the retirement of the Reverend Joshua C. Kelly from First Church of God.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 141,
    "meeting_date": "2025-03-31",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}