{
  "success": true,
  "vote": {
    "id": 11845,
    "item_number": "CA-26",
    "title": "To authorize the expenditure of $295,680.00 from the Recreation and Parks Operating Fund for the 2025 lease-purchase payments to PNC Bank, National Association and Lake Erie Golf Cars, Inc.; to authorize the Director of Recreation and Parks to enter into the fifth year of a lease agreement with PNC Bank, National Association and Lake Erie Golf Cars, Inc. for the lease-purchase payments and maintenance of 385 golf riding carts; and to declare an emergency. ($295,680.00)",
    "description": "Explanation \n \nBackground:  This ordinance will authorize the Director of Recreation and Parks to enter into the fifth year of a lease agreement with PNC Bank, National Association and Lake Erie Golf Cars, Inc. for the lease-purchase payments and maintenance of 385 golf riding carts; the expenditure of $295,680.00 from the Recreation and Parks Operating Fund for the 2025 lease agreement payments; and declare an emergency.\n \nAs approved prior by Ordinance #1150-2020, the Golf Division has entered into a lease agreement with PNC Bank, National Association and Lake Erie Golf Cars Inc.for the lease-purchase payments and maintenance of 385 golf riding carts with the lease agreement ending after the 2025 golf season.  \n \nThe lease agreement includes three parties:\n•                     The City of Columbus\n•                     PNC is the source of financing \n•                     Golf cart lease agreements and payments would be with PNC\n•                     Yearly legislation would occur to fund payments \n•                     Lake Erie Golf is the golf cart maintenance company\n•                     Lake Erie Golf would provide all cart maintenance for the duration of all contracts\n•                     Lake Erie Golf does not receive payment for their contracted services\n•                     At the end of our lease agreement with PNC, Lake Erie Golf gains ownership of all 385 carts\n \n                     Principal Parties: \n                     PNC Bank, National Association \n                     655 Business Center Drive\n                     Horsham, PA  19044\n                     Staysi Garcia Morillo, 267-960-4076 \n CC-001606                     CC Exp: 02/08/2025           \n                                        \nEmergency Justification:  It is immediately necessary to authorize the Director to enter into a new lease agreement for the lease purchase payments of the golf riding carts as the payment is due April 1, 2025.\n \nBenefits to the Public:  Golf carts are necessary to the operation of the golf courses. \n \nArea(s) Affected:  All six municipal golf courses.\n \nFiscal Impact: $295,680.00 is required and is budgeted within the 2025 Recreation and Parks Operating budget to meet the financial obligations of this lease.  \n \n \nTitle\n \nTo authorize the expenditure of $295,680.00 from the Recreation and Parks Operating Fund for the 2025 lease-purchase payments to PNC Bank, National Association and Lake Erie Golf Cars, Inc.; to authorize the Director of Recreation and Parks to enter into the fifth year of a lease agreement with PNC Bank, National Association and Lake Erie Golf Cars, Inc. for the lease-purchase payments and maintenance of 385 golf riding carts; and to declare an emergency. ($295,680.00) \n \nBody\n \nWHEREAS, the golf division is entering the fifth year of a lease agreement with PNC Bank, National Association and Lake Erie Golf Cars, Inc. for the lease-purchase payments and maintenance of 385 golf riding carts.\n                     \nWHEREAS, it is necessary to authorize the expenditure of 295,680.00 from the Recreation and Parks Operation Fund 2285; and\n \nWHEREAS, this ordinance is contingent on 2025 operating budget being passed by Council; and \n \nWHEREAS, an emergency exists in the usual daily operation of the Recreation and Parks Department in that it is immediately necessary to authorize the Director to enter into a new lease agreement for the lease-purchase payments of the golf riding carts as the payment is due April 1, 2025, all for the immediate preservation of the public health, peace, property, safety and welfare; and NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Department of Recreation and Parks, on behalf of the Golf Division, is authorized to enter into the fifth year of a lease agreement with PNC Bank, National Association and Lake Erie Golf Cars, Inc. for the lease-purchase payments and maintenance of 385 golf riding carts.\n \nSECTION 2. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 3. That for the purpose stated in Section 1, the expenditure of $295,680.00, or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Recreation and Parks Operation Fund 2285.\n \nSECTION 4. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 141,
    "meeting_date": "2025-03-31",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}