{
  "success": true,
  "vote": {
    "id": 11882,
    "item_number": "SR-8",
    "title": "To authorize the Director of the Department of Public Utilities to enter into a professional engineering services contract with Burgess & Niple, Inc. for the Southerly WWTP Capacity Evaluation and Expansion/Optimization Study project; to authorize an amendment to the 2024 Capital Improvement Budget; to authorize the appropriation of funds within the Sewer Grants Sanitary Fund and the Sanitary Revolving Loan Fund; to make this ordinance contingent upon the Ohio Water Development Authority approving a loan for this project; to make the final contract amount contingent upon the execution of a contract with the Environmental Protection Agency for Community Project Funding; and to authorize the expenditure of $6,278,771.00 from the Sewer Grants Sanitary Fund and the Sanitary Revolving Loan Fund for the contract.  ($6,278,771.00)",
    "description": "Explanation    \n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Utilities to enter into a contract with Burgess & Niple, Inc. for professional engineering services for the Southerly WWTP Capacity Evaluation and Expansion/Optimization Study project, CIP #650380-100002, in an amount up to $6,278,771.00. \n \nThis contract is needed due to anticipated growth in the service area to maintain effluent quality in water in accordance with Ohio Environmental Protection Agency requirements.  An optimization approach of the project will attempt to re-rate the Southerly Waste Water Treatment Plant to handle the additional growth through leveraging new technologies while avoiding costly additional tankage construction.  This project will also provide guidance to the Department’s Capital Improvement Plan to accommodate growth in the City Facility Planning Area (FPA) through 2050.\n \nThe project scope consists of twelve distinct technical memoranda and a final report.  The technical memoranda are: Existing Plant Data Study and Loading Basis of Design; Process Optimization Study; Plant Hydraulics Study; Large Conduit Condition Assessment; Secondary Treatment Alternatives Analysis and Basis of Design; Secondary Clarifier Needs Evaluation; Electrical Coordination and Expansion Plan; Contract Consolidation and Implementation Schedule Development; Economic Impact Analysis; Mayor's Climate Action Plan Coordination Memorandum; Facility Staffing Impacts Study; and Permitting and Authorities Having Jurisdiction.  \n \nIt is expected several capital improvement projects will be needed to implement the improvements identified in this study.  \nCommunity Planning Area:  99 - Citywide\nTIMELINE:  The contract is planned for a 2 year and four month duration. Existing conditions, large conduit condition assessment, and model development will be completed in the first year. Modeling and alternatives will be developed in the second year. The project is expected to be complete in August, 2027.  \n \nESTIMATED COST OF PROJECT:  The proposed award amount is $6,278,771.00, including a 5% contingency amount that will be utilized to fund needed and approved changes in the work.  No contract modifications are anticipated at this time; however, modification of this contract may be required, if unforeseen difficulties are encountered.\n                     \n                     Original Contract                                               $6,278,771.00\n                     Future Anticipated Needs                           $            0.00\n        CONTRACT TOTAL                                         $6,278,771.00\n \n2.  ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT\nThe project intent is to re-rate the Southerly Waste Water Treatment Plant to accept additional dry weather flow, thus allowing the plant to accept more flow from continued growth in the facilities planning area. The City is bound by our National Pollutant Discharge Elimination System (NPDES) permit to plan for growth at key growth milestones and failure to comply could cause a building moratorium to be issued by OEPA where no additional permits to install sanitary facilities in the Columbus collection system are approved. The project will optimize the Southerly Waste Water Treatment Plant, thus improving environmental outcomes for the entire region as the plant serves the entirety of the collections system. Optimization is also much less expensive than new tank construction and will have a smaller impact on both rate payers and facility staff. \n3.  BID INFORMATION\nThis project was formally advertised on the Vendor Services and Bonfire websites from 7/9/2024 through 8/16/2024.   Three proposals were received:\n \nName                                                  C.C. No.            Exp. Date               City/State                Status                     \nArcadis U.S., Inc.                                                               CC-009409      01/27/2027                     Columbus, OH            MAJ\nBurgess & Niple, Inc.                                                               CC-004425|     01/10/2026                     Columbus, OH            MAJ                     \nHatch Associates Consultants, Inc.                 CC-025646|     02/26/2025                     Columbus, OH            MAJ     \n \nAll proposal were deemed responsive.  The evaluation committee reviewed the proposals and recommended the contract for the Southerly WWTP Capacity Evaluation and Expansion/Optimization Study project be awarded to Burgess & Niple, Inc.\n \nBurgess & Niple, Inc.’s certification was in good standing at the time of the contract award.\n \n4.  CONTRACT COMPLIANCE INFORMATION\nBurgess & Niple, Inc.’s contract compliance number is CC-004425 and expires 1/10/26.  Searches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against Burgess & Niple, Inc.\n \n5.  MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract is awarded with a 15.0% diversity goal that was approved by the City’s Office of Diversity and Inclusion (ODI).  Failure by the contractor to meet this goal subjects the contractor to the Penalties for Non-Compliance as described in the “City’s Minority and Women-Owned Business Enterprise & Small Local Business Enterprise Program Manual” and bid documents for this contract.\n \nAs part of their proposal, Burgess & Niple, Inc. has proposed using the following sub-consultants to perform contract work:\n \nCompany Name                                                     City/State                                     ODI Cert. Status\nBrown and Caldwell                                                Columbus, Ohio                                          MAJ\nHazen and Sawyer                                                  Columbus, Ohio                                          MAJ\nDLZ Ohio, Inc.                                                       Columbus, Ohio                                          MBE\nResource International, Inc.                                     Columbus, Ohio                                          WBE\nRegency Construction Services, Inc.                        Columbus, Ohio                                          WBE\nDHI Water and Environment Inc.                            Lakewood, Colorado                                   MAJ\n \nThe certification of Burgess & Niple, Inc. and the above companies was in good standing at the time of the contract modification. \n \n6.  FISCAL IMPACT\nThis project is anticipated to be partially financed with Community Project Funding (formerly known as an “earmark”) through the U.S. Environmental Protection Agency (EPA) in an amount of $750,000.00.  The Department of Public Utilities has been approved for this funding which was applied for via Ordinance 1851-2024, approved by City Council on 7/22/24.  This funding will function as a reimbursement grant.  The Department of Public Utilities will pay the contractor and then submit reimbursement requests to the EPA.  All project costs are eligible for reimbursement by the earmark.  The Department of Public Utilities intends to submit the first $750,000.00 of charges for this contract for reimbursement through the earmark.  \n \nThe US EPA will not execute the Community Project Funding contract until a contract for the Southerly WWTP Capacity Evaluation and Expansion/Optimization Study is executed by the City and Burgess & Niple, Inc.  The contract execution with Burgess & Niple, Inc. cannot occur until this ordinance is effective.  Public Utilities has requested a grant number from the Auditor’s Office for this project and is listed as “TBD” in this ordinance.  Funds in the amount of $750,000.00 will need to be appropriated in the Sewer Grants Sanitary Fund, Fund 6103. \n \nThe earmark amount of $750,000.00 is contingent upon execution of the Community Project Funding contract with the US EPA.  A second line item is requested for the Auditor’s Certificate in the amount of the $750,000.00 earmark.  The contract will be funded in two parts:  Part One will be the contract amount minus the $750,000.00 earmark; Part 2 will add the funding for the $750,000.00 earmark after the contract is executed with the US EPA and line 2 of the Auditor’s Certificate is available for use.\n \nWater Pollution Control Loan Fund (WPCLF)\nThe WPCLF program is jointly administered by the Ohio EPA's Division of Environmental and Financial Assistance and the Ohio Water Development Authority (OWDA) and will fund $5,528,771.00 of the project cost.  City Council authorized this loan application and acceptance of funding via Ordinance 2720-2024 passed by Council on 10/28/2024.  This loan is expected to be approved in February of 2025. This ordinance is contingent upon the loan being approved by OWDA.  An amendment to the 2024 Capital Improvement Budget is needed to show the actual loan amount.  Funds will need to be appropriated and expended in the Sanitary Revolving Loan Fund, Fund 6111.\n \nContract Amounts\nDue to the unusual circumstances of being approved for the $750,000.00 Community Project Funding but not being able to execute a contract for it until after the contract with Burgess & Niple, Inc. is executed (which requires passage of this ordinance to execute), City Council is requested to approve an initial contract amount of $5,528,771.00 that can be increased to $6,278,771.00 without legislating a contract modification.  This contract increase is contingent upon execution of the $750,000.00 Community Project Funding contract with the US EPA.  If the contract with the US EPA should not be executed, additional funding will need to be identified to substitute for the $750,000.00.  A contract modification will be required to add these additional funds to the contract so the Auditor’s Office can certify the additional funds are available.\n \nTitle\nTo authorize the Director of the Department of Public Utilities to enter into a professional engineering services contract with Burgess & Niple, Inc. for the Southerly WWTP Capacity Evaluation and Expansion/Optimization Study project; to authorize an amendment to the 2024 Capital Improvement Budget; to authorize the appropriation of funds within the Sewer Grants Sanitary Fund and the Sanitary Revolving Loan Fund; to make this ordinance contingent upon the Ohio Water Development Authority approving a loan for this project; to make the final contract amount contingent upon the execution of a contract with the Environmental Protection Agency for Community Project Funding; and to authorize the expenditure of $6,278,771.00 from the Sewer Grants Sanitary Fund and the Sanitary Revolving Loan Fund for the contract.  ($6,278,771.00) \n \nBody\nWHEREAS, the Department of Public Utilities is engaged in the Southerly WWTP Capacity Evaluation and Expansion/Optimization Study project; and\n \nWHEREAS, three proposals for the Southerly WWTP Capacity Evaluation and Expansion/Optimization Study project were received and evaluated by the evaluation committee; and\n \nWHEREAS, the evaluation committee recommended Burgess & Niple, Inc. be awarded the contract for this project; and \n \nWHEREAS, it is necessary to authorize the Director of the Department of Public Utilities to enter into a professional engineering services contract with Burgess & Niple, Inc. for the Southerly WWTP Capacity Evaluation and Expansion/Optimization Study project; and \n \nWHEREAS, the 2024 Capital Improvements Budget must be modified to align budget authority with the proper project; and\n \nWHEREAS, Ordinance 2720-2024 authorized this project to be funded by a loan to be obtained through the Water Pollution Control Loan Fund (WPCLF) Loan Account; and\n \nWHEREAS, this ordinance is contingent upon that loan being approved; and\n \nWHEREAS, Ordinance 1851-2024 authorized the Department of Public Utilities to apply for and accept a $750,000.00 Community Project Funding award from the United State Environmental Protection Agency; and\n \nWHEREAS, the Community Project Funding award is contingent upon this ordinance passing and a contract being executed with Burgess & Niple, Inc. for the Southerly WWTP Capacity Evaluation and Expansion/Optimization Study project; and\n \nWHEREAS, funds must be appropriated within the Sewer Grants Sanitary Fund, Fund 6103 and the Sanitary Revolving Loan Fund, Fund 6111, and \n \nWHEREAS, it is necessary to authorize an expenditure of funds from the Sewer Grants Sanitary Fund, Fund 6103, and the Sanitary Revolving Loan Fund, Fund 6111, to pay for the contracted services for the project; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2024 Capital Improvements Budget authorized by Ordinance 1907-2024 be amended as follows to establish sufficient budget authority for this project:\n \nFund / Project Number / Project Name (Funding Source) / Current Authority/ Revised Authority / Change \n6111 / P650380-100001 / SWWTP Far East Train (WPCLF) / $11,550,000.00 / $6,021,229.00 / ($5,528,771.00)\n \n6111 / P650380-100002 / Southerly WWTP Capacity Evaluation and Expansion Optimization Study (WPCLF Loan) / $0.00 / $5,528,771.00 / $5,528,771.00 \n \nSECTION 2.  That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2025, the sum of $750,000.00 is appropriated in Fund 6103 (Sewer Grants Sanitary Fund), and the sum of $5,528,771.00 is appropriated in Fund 6111 (Sanitary Revolving Loan Fund), per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That the Director of the Department of Public Utilities is hereby authorized to enter into a professional services and construction services contract for the Southerly WWTP Capacity Evaluation and Expansion/Optimization Study project with Burgess & Niple, Inc., 330 Rush Alley, Suite 700, Columbus, OH 43215, in an amount up to $6,278,771.00, in accordance with the terms and conditions of the contract on file in the Department of Public Utilities.\n \nSECTION 4.  That the initial contract amount will be no more than $5,528,771.00, and that contract amount can be increased up to $6,278,771.00 without a contract modification being approved by City Council contingent upon receipt of $750,000.00 of Community Project Funding from the United States Environmental Protection Agency that has been approved but cannot be finalized until a contract with Burgess & Niple, Inc. for the Southerly WWTP Capacity Evaluation and Expansion/Optimization Study project is executed.  If this funding should not be obtained from the United States Environmental Protection Agency, a contract modification approved by City Council is required to add additional funding to this contract.\n \nSECTION 5.  That Ordinance 2720-2024 authorized this project to be funded by a loan to be obtained through the Water Pollution Control Loan Fund (WPCLF) Loan Account;\n \nSECTION 6.  That this ordinance is contingent upon that loan being approved.\n \nSECTION 7.  That the expenditure of $6,278,771.00, or so much thereof as may be needed, is hereby authorized to pay for this contract per the accounting codes in the attachment to this ordinance.\n \nSECTION 8.  That funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 9.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 10.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 11.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 141,
    "meeting_date": "2025-03-31",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Grants"
    ]
  }
}