{
  "success": true,
  "vote": {
    "id": 11910,
    "item_number": "CA-14",
    "title": "To authorize the Director of the Department of Public Service to execute those documents necessary to release the portions of easements known as Trabue Subdivision, to allow for the property to clear title so the site can be redeveloped.  ($0.00)",
    "description": "Explanation\n1.                     Background\nIn 1976, pursuant to the recording of a plat known as Trabue Subdivision within Plat Book 51 Page 23 for Franklin County.  The City of Columbus obtained these easements for construction operation and maintenance of all public and private utilities. \n \nThe Department of Public Service recently received a request from the property owner, Columbia Gas of Ohio, Inc., asking that the City release these easements over the area to clear title so the site can be redeveloped. After receipt of this request the Department of Public Service Division of Infrastructure Management verified with all public and private utility companies that there are no public utilities or need for these easements, located within the requested area and that they have no objections to these portions of easements being released. \n \nThe following legislation authorizes the Director of the Department of Public Service to execute those documents necessary to release the portions of easements as described below and in the attached exhibit, to allow for the property to clear title so the site can be redeveloped.\n2.                     Fiscal Impact\nThe City will receive a total of $500.00, to be deposited in Fund 7748, Project P537650, for granting the request to release the easement.\nTitle\nTo authorize the Director of the Department of Public Service to execute those documents necessary to release the portions of easements known as Trabue Subdivision, to allow for the property to clear title so the site can be redeveloped.  ($0.00)\n \nBody\nWHEREAS, in 1976, pursuant to the recording of a plat known as Trabue Subdivision within Plat Book 51 Page 23 for Franklin County the City of Columbus obtained these easements for construction operation and maintenance of all public and private utilities; and \n \nWHEREAS, the Department of Public Service recently received a request from the property owner, Columbia Gas of Ohio, Inc., asking that the City release these easements over the area to clear title so the site can be redeveloped; and\n \nWHEREAS, the Department of Public Service Division of Infrastructure Management verified with all public and private utility companies that there are no public utilities or need for these easements, located within the requested area and that they have no objections to these portions of easements being released; and\n \nWHEREAS, a value of $500.00 was established; and\n \nWHEREAS, the Director of the Department of Public Service is authorized to execute those documents necessary to release the portions of easements as described below and within the attached exhibit, to allow for the property to clear title so the site can be redeveloped; and \n \nNOW, THEREFORE; \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSection 1.  To authorize the Director of the Department of Public Service to execute those documents necessary to release the portions of easements as described below and in the attached exhibit, to allow for the property to clear title so the site can be redeveloped: \n \nEasement Areas to be released:\n \nDESCRIPTION OF EASEMENT TO BE VACATED WITHIN\nLOT 2, LOT 3, LOT 4 AND LOT 16 OF TRABUE SUBDIVISION\n \nSituated in the City of Columbus, in Franklin County, Ohio and being part of Lot 2, Lot 3, Lot 4 and Lot 16 of Trabue Subdivision as recorded in Plat Book 51, Page 23 and part of land conveyed to Sagal Hussein Mahmoud by Instrument No. 201511230165456 and lands conveyed to Columbia Gas of Ohio, Inc. by Instruments numbered 202208110116554, 202212300175050, and 202209190132701, and described further as follows: COMMENCING at an iron pipe found on a southerly line of land conveyed to Columbia Gas Transmission Corporation by Deed Book 3176, Page 194 and marking the northeasterly corner of Lot 2 and the most westerly corner of Lot 16 of Trabue Subdivision; thence on and along Line “A” and the line between said Lot 2 and Lot 16, S 11° 54' 36\" E, a distance of 15.00 feet to the northerly platted easement line and the TRUE POINT OF BEGINNING;\nB)                     Thence on and along the platted easement line passing within Lot 16, N 78° 47' 13\" E, a distance of 5.00 feet to a point;\nC)                     Thence continuing on and along the platted easement line within Lot 16, S 11° 54' 36\" E, a distance of 40.79 feet to a point;\nD)                     Thence continuing on and along the platted easement line within Lot 16, N 87° 47' 46\" E, a distance of 40.58 feet to a point;\nE)                     Thence continuing on and along the platted easement line within Lot 16, N 11° 54' 38\" W, a distance of 39.54 feet to a point;\nF)                     Thence S 61° 52' 02\" E, a distance of 13.06 feet to a point on the platted easement line within Lot 16;\nG)                     Thence on and along the platted easement line within Lot 16, S 11° 54' 38\" E, a distance of 32.85 feet to a point;\nH)                     Thence on and along the platted easement line within Lot 16, N 87° 47' 46\" E, a distance of 39.59 feet to a point on the easterly line of Lot 16 and the westerly line of Lot 15 of Trabue Subdivision;\nI)                     Thence on and along the line between Lot 15 and Lot 16, S 3° 10' 32\" W, a distance of 10.04 feet to an iron pin set by Kleinfelder Inc. during a previous survey, being on the northerly line of Lot 4 and marking the southeast corner of Lot 16 and the southwest corner of Lot 15;\nJ)                     Thence on and along the Southerly line of Lot 15 and the northerly line of Lot 4, N 87° 47' 46\" E, a distance of 8.73 feet to the northeast corner of Lot 4 and the northwest corner of Lot 5 of Trabue Subdivision;\nK)                     Thence on and along the line between said Lot 4 and Lot 5, S 11° 54' 29\" E, a distance of 158.37 feet to a point 10.00 feet north of the northerly right of way line of Trabue Road which has a 60.00 feet wide right of way;\nL)                     Thence parallel with and 10.00 feet north of the northerly right of way line of Trabue Road, S 78° 07' 18\" W, a distance of 0.31 feet to a point;\nM)                     Thence continuing on and along the platted easement line within Lot 4, N 13° 42' 30\" W, a distance of 149.15 feet to a point;\nN)                     Thence continuing on and along the platted easement line within Lot 4 and Lot 3, S 87° 47' 46\" W, a distance of 91.32 feet to a point;\nO)                     Thence continuing on and along the platted easement line within Lot 3, S 11° 54' 36\" E, a distance of 164.42 feet to a point 10.00 feet north of the northerly right of way line of Trabue Road;\nP)                     Thence parallel with and 10.00 feet north of the northerly right of way line of Trabue Road, S 78° 07' 18\" W, a distance of 10.00 feet to a point on the platted easement line within said Lot 2;\nQ)                     Thence on and along the platted easement line within Lot 2, N 11° 54' 36\" W, a distance of 225.62 feet to a point;\nR)                     Thence on and along the platted easement line within Lot 2, N 78° 47' 13\" E, a distance of 5.00 feet returning to the TRUE POINT OF BEGINNING;\nContaining in all 0.1117 acres (4865.5 square feet), of which 0.0000 acres is road right of way and further described as follows: 0.0772 acres (3362.7 square feet) are within Franklin County Auditor’s Parcel 560-172398-00 (Lots 2, 3, ad 4), 0.0345 acres (1502.8 square feet) are within Franklin County Auditor’s Parcel 560-172413-00 (Lot 16).\nBearings are based on the Ohio State Plane Coordinate System, South Zone 3402, NAD 83, 2011 adjustment, and derived from GPS and the O.D.O.T. V.R.S. network. \nThis description is based on an actual field survey performed in April of 2022 by Kleinfelder Inc.\nDESCRIPTION OF EASEMENT TO BE VACATED\nWITHIN LOT 16 OF TRABUE SUBDIVISION\n \nBeing a platted 20.00 feet wide strip of land situated in the City of Columbus, in Franklin County, Ohio and being part of Lot 16 of Trabue Subdivision as recorded in Plat Book 51, Page 23 and land conveyed to Sagal Hussein Mahmoud by Instrument No. 201511230165456 and described further as follows: COMMENCING at an iron pipe found on the southerly right of way line of Renner Road (width varies) marking the northeasterly corner of land conveyed to Columbia Gas Transmission Corporation by Deed Book 3176, Page 194 and the northwesterly corner of said Lot 16 of Trabue Subdivision; thence on and along Line “S” and the southerly right of way line of Renner Road and the northerly line of Lot 16, N 77° 58' 22\" E, a distance of 31.08 feet to the TRUE POINT OF BEGINNING;\n“T”                     Thence continuing on and along the southerly right of way line of Renner Road and the northerly line of Lot 16, N 77° 58' 22\" E, a distance of 47.70 feet to an iron pin set (prior survey) at the northeasterly corner of Lot 16 and said land conveyed to Sagal Hussein Mahmoud and the northwesterly corner of Lot 15 of Trabue Subdivision and land conveyed to Renner Road 10 LLC by Instrument No. 202112100224558;\n“U”                     Thence on and along the line between said Lot 15 and Lot 16 and the westerly line of said land conveyed to Renner Road 10 LLC, S 3° 10' 32\" E, a distance of 20.73 feet to a point;\n“V”                     Thence on and along a line parallel with the southerly right of way line of Renner Road and the northerly line of said Lot 16, S 77° 58' 22\" W, a distance of 47.68 feet to a point;\n“W”                     Thence parallel with the west line of Lot 16, N 3° 06' 30\" E, a distance of 20.72 feet returning to the TRUE POINT OF BEGINNING;\nContaining in all 0.0219 acres (753.8 square feet), of which 0.000 acres is road right of way.\nThe above described easement area to be vacated is currently part of Franklin County Auditor’s Parcel 560-172413-00. Bearings are based on the Ohio State Plane Coordinate System, South Zone 3402, NAD 83, 2011 adjustment, and derived from GPS and the O.D.O.T. V.R.S. network. \nThis description is based on an actual field survey performed in April of 2022 by Kleinfelder Inc.\nSECTION 2.                     That the City Attorney is required to approve all instrument(s) associated with this ordinance prior to the director of the Department of Public Service executing and acknowledging any of those instrument(s) and that this ordinance shall take effect and be in force from and after the earliest period allowed by law.\n \nSECTION 3. That the City will receive a total of $500.00 as cost to clear title to the site, to be deposited in Fund 7748, Project P537650.\n \nSECTION 4.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 142,
    "meeting_date": "2025-04-07",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Planning & Development",
      "Property & Real Estate",
      "Public Works"
    ]
  }
}