{
  "success": true,
  "vote": {
    "id": 11957,
    "item_number": "SR-15",
    "title": "This ordinance authorizes the appropriation and expenditure of up to $1,250,000.00 of HOME Investment Partnerships Program (HOME-ARP) funds from the U.S. Department of Housing and Urban Development; authorizes the Director of the Department of Development to enter into a commitment letter, loan agreement, promissory note, mortgage, and restrictive covenant with Knoll View Place, LLC in an amount up to $1,250,000.00 for the Knoll View Place project. ($1,250,000.00).",
    "description": "Explanation\n \nBACKGROUND:  This ordinance authorizes the appropriation and expenditure of up to $1,250,000.00 of grant funding from the U.S. Department of Housing and Urban Development (HUD), through the HOME Investment Partnerships Program American Rescue Plan (HOME-ARP) and authorizes the Director of Development to execute a commitment letter, loan agreement, promissory note, mortgage, and restrictive covenant with Knoll View Place , LLC for the Knoll View Place project.\n \nTotal City funding for the project is $1,749,043.00.  Of this amount $1,250,000.00 is found within this ordinance and establishes HOME -ARP funding for the Knoll View Place project. A subsequent ordinance will be put forth to City Council in an amount up to $499,043.00 for the remaining HOME-ARP funding of this project to provide supportive services for residents at this location over the course of four years. \n \nKnoll View Place will provide fifty (50), one-bedroom units of permanent supportive housing prioritized for individuals who meet the State of Ohio’s Permanent Supportive Housing Policy Framework. Specifically, forty-six (46) units will prioritize individuals who meet the HUD definition of chronic homelessness of those fifty, four (4) units will serve individuals who meet the Ohio Department of Mental Health and Addiction Service’s definition of severe mental health illness or co-occurring mental illness and substance abuse, homeless, at-risk of homeless or institutionalization.  The property will be located at 897 E Mound St., on the near east side of Columbus.  The proposed three-story elevator-served building will be L shaped with a secure main entrance from the off-street parking area. Front desk staff will monitor the single-point entry 24 hours a day 7 days a week.  Outdoor cameras will assist with security, the common area spaces in the building will include a community room with a full kitchen, TV lounge, computer room, and an informal meeting area.  The first floor will also house office spaces for property management, front desk security, and service engagement staff.  Other useful amenities will include a bike room, laundry rooms, and fitness room.  All of the Knoll View Place units are one-bedroom/one-bath garden-style apartments.  \n \nPermanent supportive housing is housing with linkages to services that help residents successfully maintain housing and rebuild their lives.  The target population for Knoll View Place will be men and women who are homeless or at risk of homelessness and are disabled by mental illness, substance addition, dual diagnosis, and or a physical disability.  \n \nThe supportive services that will be legislated separately will be managed by Community Housing Network (CHN), the developer of Knoll View Place. CHN has been providing affordable housing to individuals experiencing homelessness, mental illness, addiction, and trauma related issues since 1987.  CHN will provide overall program management, tenant-centered property management and housing services (including program operations, administration of subsidies, community relations, maintenance, and security) they will also facilitate partner meetings, take the lead in admissions, eviction prevention and training, as well as assist with outreach.  CHN’s on-site staff will orient tenants to living in a supportive housing program; assist them with housing-related issues; and provide crisis intervention, conflict resolution, and daily assistance. In addition, residents will also be referred to other agencies for medical and dental needs, material needs, and legal assistance.  CHN will utilize Housing Choice Vouchers (including Mainstream Vouchers) for all fifty (50) units in the property, allowing residents with incomes between 0% and 30% AMI to afford this housing.  \n \nCHN will also subcontract with Aryes Staffing to provide 24/7 front desk coverage. Front desk staff will orient tenants to life in a supportive housing program, by assisting tenants with housing-related issues and providing crisis intervention and conflict resolution as needed. Residents will also be referred to other agencies for medical/dental health needs, material needs, legal assistance and other needs. \n \nOn-site services will be provided by Concord Counseling, a community based provider of mental health and behavioral health services.\n \n \nThis legislation represents appropriation for a part of the HOME-ARP Allocation Plan portion of the City’s 2021 HUD Annual Action Plan which was amended, per Ordinance 0459-2023.\n \nContract Compliance:  the vendor number is 051536 and expires on 03/04/2027\n \nFiscal Impact: $1,250,000.00 is available from and within the HOME-ARP grant (G442101).  The commitment of funds through this legislation is conditioned on compliance with HUD’s environmental review requirements. The funding from HOME-ARP Fund (2201) is only authorized if all HOME review and comment requirements have been met prior to any commitment of funds, as approved by the Responsible Entity Agency Official. An Authorization to Utilize Grant Funds will be received by the City from HUD in advance of the execution of documents for this project.\n \n \n \nTitle\n \nThis ordinance authorizes the appropriation and expenditure of up to $1,250,000.00 of HOME Investment Partnerships Program (HOME-ARP) funds from the U.S. Department of Housing and Urban Development; authorizes the Director of the Department of Development to enter into a commitment letter, loan agreement, promissory note, mortgage, and restrictive covenant with Knoll View Place, LLC in an amount up to $1,250,000.00 for the Knoll View Place project. ($1,250,000.00).\n \n \n \nBody\n \nWHEREAS, the City of Columbus is a participating jurisdiction of the U.S. Department of Housing and Urban Development; and\n \nWHEREAS, the City of Columbus is the recipient of a one-time grant of $16,433,138.00 from the U.S. Department of Housing Urban Development (HUD) through the American Rescue Plan Act and the HOME Investment Partnerships Program (HOME-ARP) ; and\n \nWHEREAS, the Columbus City Council has approved the amendment to the 2021 Action Plan, per Ordinance 0459-2023, as required by HUD for the authorization of the HOME-ARP Allocation Plan; and\n \nWHEREAS, the Director of the Department desires to support the Knoll View Place project with HOME-ARP funds; and NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ending December 31, 2025, in an amount up to $1,250,000.00 is appropriated within Fund 2201 (HOME-ARP), from Dept-Div 44-10 (Housing), G442101 (HOME-ARP), object class 05 (Other Expenses) per the account codes in the attachment to this ordinance.\n \nSECTION 2.  That the expenditure in an amount up to $1,250,000.00, or so much thereof as may be needed, is hereby authorized in Fund 2201 (HOME-ARP), Dept-Div 4410 (Housing), G442101 (HOME-ARP), object class 05 (Other Expenses) per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That the Director of Development is hereby authorized to enter into a commitment letter, loan agreement, promissory note, mortgage, and restrictive covenant with Knoll View Place LLC., for the Knoll View Place project in an amount up to $1,250,000.00.\n                     \nSECTION 4.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n                                          \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.                       At the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements.\n \nSECTION 7.  The commitment of funds through this legislation is conditioned on compliance with HUD’s environmental review requirements. The funding from HOME Fund (2201) is only authorized if all HOME review and comment requirements have been met prior to any commitment of funds, as approved by the Responsible Entity Agency Official. An Authorization to Utilize Grant Funds will be received by the City from HUD in advance of the execution of documents for this project.\n \nSECTION 8.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 142,
    "meeting_date": "2025-04-07",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Housing"
    ]
  }
}