{
  "success": true,
  "vote": {
    "id": 11984,
    "item_number": "CA-17",
    "title": "To authorize the Director of the Department of Finance and Management, on behalf of the Department of Technology, to modify a contract with Accela, Inc. for the migration of the existing Accela on-premise Land Management instance to the Accela Cloud (SaaS) platform; to authorize the expenditure from the Department of Technology, Information Services Operating Fund and Health Departments Grants Fund; and to declare an emergency. ($595,000.00)",
    "description": "Explanation\n1.  BACKGROUND:\nThis ordinance authorizes the Director of Finance and Management, on behalf of the Department of Technology, to modify a contract with Accela, Inc. utilizing a State of Ohio Master Cloud Service Agreement - MCSA0123, for the addition of professional services to migrate the existing Accela on-premise Land Management instance to the Accela Cloud (SaaS) and the addition of licensing for the Department of Health.\n \nOrdinance 0402-2025 authorized the Director of Finance and Management, on behalf of the Department of Technology to enter into enter into contract with Accela, Inc. for the support and licensing of the migration of the on-premise instances and migrating to the Accela Subscription Services product.  This is necessary due to Accela ending support of on-premise instances December 31, 2025. Services provided through this contract include technical assistance, support, upgrades and telephone support services for the Accela Automation (AA) System application, used to issue building permits, track code enforcement activities and monitor the performance of the One Stop Shop.  \n \nThis ordinance authorizes professional services needed to for the migration of Accela on-premise Land Management instance to the Accela Cloud (SaaS) in the amount of $379,000.00 and licensing for the Department of Health that was not included in the original contract for $216,000.00 for a total contract modification of $595,000.00.  \n \n1.1  Amount of additional funds to be expended: $595,000.00\nThe original contract amount:                                                        $1,033,000.00                     (Ord. 0402-2025)                          \nThe total of Modification No. 1:                                                 $   595,000.00                     (This Ordinance)\n \nThe contract amount including all modifications:        $1,628,000.00\n \n1.2  Reasons additional goods/services could not be foreseen:  \nThe original ordinance was for licensing and technical support only.  This modification adds the professional services needed to implement the migrations and additional licensing for the Department of Health.\n \n1.3  Reason other procurement processes are not used:\nThe project is just starting and it was decided that it is in the best interest of the City to modify the existing contract instead of bidding this part of the work.\n \n1.4  How cost of modification was determined:\nThe cost of this contract modification is consistent with the costs established within the original proposal. \n \n2.  CONTRACT COMPLIANCE\nVendor: Accela\nDAX/CC# 010838\nExpiration Date: 4-21-2025\n \nContract compliance information is in the process of being renewed and shall be updated before a purchase order is issued.\n \n3.  FISCAL IMPACT\nFunds in the amount of $554,000.00 are budgeted and available in the 2025 Information Services operating budget. The remaining funds of $41,000.00 are available in the Strengthening U.S. Public Health Infrastructure Grant within the Health Departments Grants Fund, Fund No. 2251.\n \n4.  EMERGENCY DESIGNATION\nEmergency designation is requested as it is critical to undertake the above-described migration prior to the expiration of support so that departments can continue to access the application without interruption.\n \nTitle\nTo authorize the Director of the Department of Finance and Management, on behalf of the Department of Technology, to modify a contract with Accela, Inc. for the migration of the existing Accela on-premise Land Management instance to the Accela Cloud (SaaS) platform; to authorize the expenditure from the Department of Technology, Information Services Operating Fund and Health Departments Grants Fund; and to declare an emergency. ($595,000.00)\n \nBody\nWHEREAS, Ordinance 0402-2025 authorized the Director of Finance and Management, on behalf of the Department of Technology to enter into enter into contract with Accela, Inc. utilizing a State of Ohio Master Cloud Service Agreement - MCSA0123, for the support and licensing of the migration of the on-premise instances and moving to the Accela Subscription Services product for the amount of $1,033,000.00; and\n \nWHEREAS, it is now necessary to modify the contract to add the professional services needed for the migration of Accela on-premise Land Management instance to the Accela Cloud (SaaS) in the amount of $379,000.00 and licensing for the Department of Health that was not included in the original contract for $216,000 for a total contract modification of $595,000; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Technology in that it is immediately necessary to authorize the Director of Finance and Management, on behalf of the Department of Technology, to modify a contract with Accela, Inc. utilizing a State of Ohio Master Cloud Service Agreement - MCSA0123 for the above-described service as it is critical to undertake the above-described migration prior to the expiration of support so that departments can continue to access the application without interruption, all for the immediate preservation of the public health, peace, property, safety and welfare; now, therefore \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Finance and Management Department, on behalf of the Department of Technology, to modify a contract with Accela, Inc. utilizing a State of Ohio Master Cloud Service Agreement - MCSA0123 to include professional services needed for the migration of the existing Accela on-premise Land Management instance to the Accela Cloud (SaaS) and licensing for the Department of Health for a total cost of $595,000.00.\n \nSECTION 2. That the expenditure of $554,000.00, or so much thereof as may be necessary, is hereby authorized to be expended as follows in the attachment to this ordinance. (See attachment 0868-2025EXP).\n \nSECTION 3.  That the expenditure of $41,000.00 is hereby authorized from the Health Departments Grants Fund, Fund No. 2251, Department 50, Division No. 5001, in object class 03 - Services, per the accounting codes in the attachment to this ordinance.\n \nSECTION 4. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 143,
    "meeting_date": "2025-04-21",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}