{
  "success": true,
  "vote": {
    "id": 12,
    "item_number": "CA-7",
    "title": "To authorize the Director of Recreation and Parks, with the approval of the Director of Finance and Management and the Director of the Department of Public Utilities, to sign an amendment to lease agreements with the Columbus Aqua Ski Club, East Shore Yacht Club, Scioto Boat Club, Buckeye Boat Club, Leather Lips Yacht Club, Hoover Sailing Club, Columbus Sailing Club, the Quarry Homeowner's Association, Hoovergate Homeowner’s Association, Jewish Community Center, Hilliard Rowing Association, Dublin Crew, Upper Arlington Crew, Westerville Rowing, and the Ohio State Crew (Hereinafter \"Boat Clubs\"); and to declare an emergency. ($0.00)",
    "description": "Explanation \n \nBackground: This legislation will authorize the Director of Recreation and Parks with the approval of the Director of Finance and Management and the Director of the Department of Public Utilities to sign an amendment to lease agreements with the Columbus Aqua Ski Club, East Shore Yacht Club, Scioto Boat Club, Buckeye Boat Club, Leather Lips Yacht Club, Hoover Sailing Club, Columbus Sailing Club, the Quarry Homeowner's Association, Hoovergate Homeowner’s Association, Jewish Community Center, Hilliard Rowing Association, Dublin Crew, Upper Arlington Crew, Westerville Rowing, and the Ohio State Crew (Hereinafter \"Boat Clubs\").  These leases were previously authorized by ordinances 1946-2018 and 0979-2019.  This amendment with replace section 7.1 Stewardship Agreement with a new section 7.1 Maintenance Agreement.  The purpose of this amendment is to provide clarity in the roles of Recreation and Parks and Public Utilities and to avoid confusion between Lease Maintenance Agreements and Public Utilities Stewardship Program.  Best practice principles of land management around a drinking water supply will be applied and agreements will balance needs for water quality, recreational access, and wildlife habitat.  All other aspects of original leases will remain unchanged.\n \nEmergency Justification: Emergency legislation is requested to authorize this amendment as the current language is creating conflict and confusion with the ongoing Stewardship 2.0 project that is approaching conclusion.\n \nBenefits to the Public:  This amendment creates clarity in City of Columbus roles and transparency in responsibilities between departments and lessees.    \n \nCommunity Input/Issues: The majority of these clubs have been in place for decades and are responsible stewards of the land.  This change will ensure maintenance agreements are in place that both protect and activate the waterways.  \n \nArea(s) Affected: Hoover, Griggs, and O’Shaughnessy Reservoirs\n \nFiscal Impact: No cost to the City.  \n \nMaster Plan Relation: Promoting blueways, permitting passive uses of natural areas. \n \nTitle\n \nTo authorize the Director of Recreation and Parks, with the approval of the Director of Finance and Management and the Director of the Department of Public Utilities, to sign an amendment to lease agreements with the Columbus Aqua Ski Club, East Shore Yacht Club, Scioto Boat Club, Buckeye Boat Club, Leather Lips Yacht Club, Hoover Sailing Club, Columbus Sailing Club, the Quarry Homeowner's Association, Hoovergate Homeowner’s Association, Jewish Community Center, Hilliard Rowing Association, Dublin Crew, Upper Arlington Crew, Westerville Rowing, and the Ohio State Crew (Hereinafter \"Boat Clubs\"); and to declare an emergency. ($0.00)\n \nBody\n \nWHEREAS, it is necessary to authorize the Director of the Recreation and Parks, with the approval of the Director of Finance and Management and the Director of the Department of Public Utilities, to sign an amendment to lease agreements with the Columbus Aqua Ski Club, East Shore Yacht Club, Scioto Boat Club, Buckeye Boat Club, Leather Lips Yacht Club, Hoover Sailing Club, Columbus Sailing Club, the Quarry Homeowner's Association, Hoovergate Homeowner’s Association, Jewish Community Center, Hilliard Rowing Association, Dublin Crew, Upper Arlington Crew, Westerville Rowing, and the Ohio State Crew (Hereinafter \"Boat Clubs\"); and\n \nWHEREAS, this amendment with replace section 7.1 Stewardship Agreement with a new section 7.1 Maintenance Agreement; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Recreation and Parks Department in that it is immediately necessary to authorize the Director to make this amendment in the Lease because the current language is creating conflict and confusion with the ongoing Stewardship 2.0 project that is approaching conclusion; NOW, THEREFORE \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Recreation and Parks, with the approval of the Director of Finance and Management and the Director of the Department of Public Utilities, is hereby authorized to sign an amendment to lease agreements with the Columbus Aqua Ski Club, East Shore Yacht Club, Scioto Boat Club, Buckeye Boat Club, Leather Lips Yacht Club, Hoover Sailing Club, Columbus Sailing Club, the Quarry Homeowner's Association, Hoovergate Homeowner’s Association, Jewish Community Center, Hilliard Rowing Association, Dublin Crew, Upper Arlington Crew, Westerville Rowing, and the Ohio State Crew (Hereinafter \"Boat Clubs\").\n \nSECTION 2.  That the terms and conditions of the lease shall be approved in form by the City Attorney's office and shall include the following:\n \n1.                     The language in Article 7.1. Stewardship Agreement shall be deleted in its entirety and replaced with the following:  \n \n7.1 Maintenance Agreement. -Lessee is required to enter into a Maintenance Agreement with the Lessor’s Recreation and Parks Department.  Lessee shall remain a party to, and abide by the terms of, the Maintenance Agreement throughout the term of this Agreement.  Lessor’s Recreation and Parks Department will work with Lessee to develop a Maintenance Agreement by December 31, 2021 with the Lessee beginning implementation on January 1, 2022.  Maintenance Agreement shall outline grounds maintenance responsibilities and provide a site management plan that has been reviewed by the Department of Public Utilities and that balances water quality, recreational access, and wildlife habitat.  The site management plan shall incorporate reservoir land stewardship principles, as stated in the Department of Public Utilities Land Stewardship Program, to protect long-term shoreline health.  All actions undertaken under the Maintenance Agreement are at the sole cost and expense of Lessee. The lessor reserves the right to declare a default by the Lessee and automatically terminate this Agreement upon Lessee’s breach of this section, regardless of any provisions of this Agreement.\n \n2.                     Except as modified in this First Amendment, all other terms, conditions, and provisions of the Lease remain unchanged and in full force and effect. \n \nSECTION 3.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 1,
    "meeting_date": "2021-01-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Community Services",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}