{
  "success": true,
  "vote": {
    "id": 12024,
    "item_number": "CA-57",
    "title": "To authorize the Director of Public Utilities to enter into license agreements as necessary related to The Ohio State University, Aquatic Ecology Lab, Fish Monitoring License Agreement - Greenlawn Dam project; and to declare an emergency.  ($0.00)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Utilities (DPU) to enter into license agreements as necessary related to the Ohio State University, Aquatic Ecology Lab, Fish Monitoring License Agreement - Greenlawn Dam project. \n \nThe license agreements allow The Ohio State University to install a small (3ft x 3ft) fish monitoring device within a fenced area managed by DPU at the Greenlawn Dam location. Representatives from The Ohio State University must prearrange site visits and be supervised by DPU personnel for the entire duration of their visit.  This project will provide data and documentation for the Department of Public Utilities Clean Water initiatives including environmental impact those initiatives provide.\n \nThe agreement is valid for 2 years from the date of the execution of the Notice To Proceed and may be extended with the agreement of both parties. \n \n2.  CONTRACT COMPLIANCE NUMBER  \nA contract compliance number is not applicable to no cost license agreements.\n \n3.  FISCAL IMPACT \nThere is no fiscal impact to the City of Columbus related to entering into license agreements with The Ohio State University (OSU) for this project.  OSU is not charging to perform this work and DPU is not charging OSU for access to the property.    \n \n4.  EMERGENCY DESIGNATION\nThis ordinance is requested to be an emergency measure to allow OSU to begin collecting data as soon as possible to determine the environmental impact of DPU clean water initiatives on the water and if adjustments need to be made to the clean water initiatives.  \n \nTitle\nTo authorize the Director of Public Utilities to enter into license agreements as necessary related to The Ohio State University, Aquatic Ecology Lab, Fish Monitoring License Agreement - Greenlawn Dam project; and to declare an emergency.  ($0.00) \n \nBody\nWHEREAS, the City of Columbus, Department of Public Utilities (DPU) is committed to Clean Water Initiatives and the positive environmental impact the Department of Public Utilities provides to the community; and\n \nWHEREAS, the Department of Public Utilities (DPU) is currently engaged in clean water initiatives related to water at the Greenlawn Dam; and \n \nWHEREAS, it is necessary to measure the impact of these clean water initiatives upon water cleanliness; and \n \nWHEREAS, The Ohio State University (OSU) can perform the needed measurements; and\n \nWHEREAS, a license agreement(s) must be executed with OSU to perform these measurements; and \n \nWHEREAS, the data from this project could provide additional support and documentation for DPU Clean Water Initiatives and the positive environmental impact our Utility provides, or provide data showing adjustments that need to be made; and\n    \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Utilities in that it is immediately necessary to authorize the Director of Public Utilities to enter into license agreements to allow OSU to begin collecting data as soon as possible to determine the environmental impact of DPU clean water initiatives on the water and if adjustments need to be made to the clean water initiatives, thereby preserving the public health, peace, property, welfare, and safety, now, therefore: \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Public Utilities is hereby authorized to enter into license agreements as necessary related to The Ohio State University, Aquatic Ecology Lab, Fish Monitoring License Agreement - Greenlawn Dam project for Department of Public Utilities clean water initiatives. \n \nSECTION 2.  That the license agreements permit The Ohio State University, with the consent of the Department of Public Utilities, to install equipment within the Greenlawn Dam public right-of-way or on City owned property at Greenlawn Dam for the purpose of determining the environmental impact of clean water initiatives.  \n \nSECTION 3.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after the passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 143,
    "meeting_date": "2025-04-21",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Emergency Services",
      "Infrastructure"
    ]
  }
}