{
  "success": true,
  "vote": {
    "id": 12020,
    "item_number": "CA-53",
    "title": "To authorize the Director of the Department of Public Utilities to modify the power supply agreement with AEP Energy Partners, Inc. (AEPEP) to change the definition of Forecasted Remaining Quantities to provide more specificity in the event of an early termination. ($0.00)",
    "description": "Explanation\n \nThis ordinance authorizes the Director of Public Utilities to modify the power supply agreement with AEP Energy Partners, Inc. (AEPEP). The modification changes the definition of Forecasted Remaining Quantities to clarify, in the event an Early Termination Date is declared, that they are to be based on the amount of Customer’s Retail Load during each hour of the twelve (12) months preceding the Early Termination Date escalated annually for the remainder of the Delivery Period at the average annual rate of growth of Customer’s Retail Load over the three (3) full calendar years preceding the Early Termination Date.\n \nOrdinance 1108-2023 authorized the Director of Public Utilities to conduct a modified request for proposal (RFP) process to negotiate with multiple suppliers and to select a supplier to fulfill the Division of Power’s electric power supply requirements for a one-year term beginning January 1, 2026 and extending for up to three year one-year renewal periods. That ordinance also authorized the awarding of and entering into of such a power supply agreement. AEPEP was awarded the bid.\n \nThis Ordinance is being submitted in accordance with the relevant provisions of Chapter 329 of City Code pertaining to contract modifications.\n \n1.   Amount of additional funds: No funds are needed for this modification.\n2.   Reason additional funds were not foreseen: N/A \n3.   Reason other procurement processes were not used: N/A - this vendor was selected through the RFP process. \n4.   How was cost determined: N/A\n \nSUPPLIER:  \n \nAEP Energy Partners, Inc. (AEPE) | D365 Vendor #010283 | Federal EIN on file | Expires 11/7/2025 \nAEPEP does not hold MBE/FBE status.\n \nThe company is not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.\n \nFISCAL IMPACT: \n \nThis modification has no fiscal effects.\n \n$0.00 was spent in 2024\n$0.00 was spent in 2023\n \n \nTitle\n \nTo authorize the Director of the Department of Public Utilities to modify the power supply agreement with AEP Energy Partners, Inc. (AEPEP) to change the definition of Forecasted Remaining Quantities to provide more specificity in the event of an early termination. ($0.00)\n \n \nBody\n \nWHEREAS, Ordinance 1108-2023 authorized the Director of Public Utilities to conduct a modified request for proposal (RFP) process to negotiate with multiple suppliers and to select a supplier to fulfill the Division of Power’s electric power supply requirements for a one-year term beginning January 1, 2026 and extending for up to three year one-year renewal periods; and\n \nWHEREAS, that ordinance also authorized the awarding of and entering into of such a power supply agreement, and AEP Energy Partners, Inc. (AEPEP) was awarded the bid; and \n \nWHEREAS, this ordinance authorizes the Director of Public Utilities to modify the power supply agreement with American Electric Power Energy Partners (AEPEP); and\n \nWHEREAS, the modification changes the definition of Forecasted Remaining Quantities to clarify, in the event an Early Termination Date is declared, that they are to be based on the amount of Customer’s Retail Load during each hour of the twelve (12) months preceding the Early Termination Date escalated annually for the remainder of the Delivery Period at the average annual rate of growth of Customer’s Retail Load over the three (3) full calendar years preceding the Early Termination Date; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities to authorize the Director of Public Utilities to modify the power supply agreement with American Electric Power Energy Partners (AEPEP) to change the definition of Forecasted Remaining Quantities to provide more specificity in the event of an early termination; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Department of Public Utilities is authorized to modify the power supply agreement with AEP Energy Partners, Inc. (AEPEP) to change the definition of Forecasted Remaining Quantities to provide more specificity in the event of an early termination.\n \nSECTION 2. That this modification is in accordance with the relevant provisions of Chapter 329 of City Code.\nSECTION 3. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 143,
    "meeting_date": "2025-04-21",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}