{
  "success": true,
  "vote": {
    "id": 12049,
    "item_number": "SR-12",
    "title": "To authorize the Director of Recreation and Parks, on behalf of the Central Ohio Area Agency on Aging, to enter into an agreement with the Mid-Ohio Regional Planning Commission to explore the strategies outlined in the COAAA Strategic Plan for Success; to authorize the expenditure of $150,370.00 from the Recreation and Parks Grant Funds; to waive the competitive bidding provisions of the Columbus City Code; and to declare an emergency ($150,370.00).",
    "description": "Explanation\n \nThis legislation authorizes the Director of the Recreation and Parks Department, on behalf of the Central Ohio Area Agency on Aging, to enter into an agreement with the Mid-Ohio Regional Planning Commission (MORPC) to explore the strategies outlined in COAAA’s Strategic Plan for Success (SPS) as it pertains to the development of a stand-alone Regional Council of Governments by 2026. \nCOAAA was founded in 1974 within the Department of Recreation and Parks with 10 employees. Today, more than 400 COAAA case managers, healthcare providers, and staff serve more than 14,000 older adults annually in Delaware, Fairfield, Fayette, Franklin, Licking, Madison, Pickaway, and Union counties. A strategic plan developed in 2024 found that the agency could best manage its migration to the MyCare Next Generation service model mandated by the Ohio Department of Medicaid by transitioning to a regional government entity governance model. By aligning agency operations with peer Area Agencies on Aging in Ohio, the agency would adopt best practices, meet new state and federal requirements, and ensure operational sustainability. In turn, COAAA would increase services, improve partnerships with regional stakeholders, and better prepare the region for the future needs of older adults and people with disabilities, all while maintaining public accountability and transparency.\nIn order to explore this transition, COAAA must enter into a partnership with MORPC to develop a new entity with the capacity to maintain COAAA operations without interruption, provide competitive benefits to staff, and position the organization for the future. MORPC’s experience and expertise in developing regional partnerships and executing strategies to improve access to services for residents across the Central Ohio Region make them uniquely qualified to assist the City of Columbus and the Central Ohio Area Agency on Aging with this project.  \nEMERGENCY DESIGNATION: The Department of Recreation and Parks, Central Ohio Area Agency on Aging respectfully requests this legislation be considered as an emergency in order to begin the process of establishing a Regional Council of Governments as soon as possible in order for the transition of COAAA to be able to occur by January 1, 2026. Quick action is required to prevent disruption in services to older adults and individuals with disabilities in Central Ohio. \nBID WAIVER JUSTIFICATION: A waiver of the competitive bidding provisions of Columbus City Code is being requested due to the specialized nature of the consulting services. MORPC’s experience and expertise in developing regional partnerships and executing strategies to improve access to services for residents across the Central Ohio Region make them uniquely qualified to assist the City of Columbus and the Central Ohio Area Agency on Aging with this project.  \nFISCAL IMPACT: The Mid-Ohio Regional Planning Commission (MORPC) and the Central Ohio Area Agency on Aging (COAAA) agreement will extend to December 31, 2025. \n$150,370.00 is required and budgeted from the Recreation and Parks Grant Fund to meet the financial obligation of this contract.\nTitle\nTo authorize the Director of Recreation and Parks, on behalf of the Central Ohio Area Agency on Aging, to enter into an agreement with the Mid-Ohio Regional Planning Commission to explore the strategies outlined in the COAAA Strategic Plan for Success; to authorize the expenditure of $150,370.00 from the Recreation and Parks Grant Funds; to waive the competitive bidding provisions of the Columbus City Code; and to declare an emergency ($150,370.00).\nBody\n \nWHEREAS, the Director of the Recreation and Parks Department, on behalf of the Central Ohio Area Agency on Aging, desires                      to enter into an agreement with the Mid-Ohio Regional Planning Commission (MORPC) to explore the strategies outlined in COAAA’s Strategic Plan for Success for the period of April 1, 2025 through December 1, 2025; and\nWHEREAS, A waiver of the competitive bidding provisions of Columbus City Code is being requested due to the specialized nature of the consulting services. MORPC’s experience and expertise in developing regional partnerships and executing strategies to improve access to services for residents across the Central Ohio Region make them uniquely qualified to assist the City of Columbus and the Central Ohio Area Agency on Aging with this project, and\nWHEREAS, it is necessary to authorize an expenditure in the amount of $150,370.00 from the Recreation and Parks Grant Fund No. 2286; and\nWHEREAS, an emergency exists in the usual daily operation of the Department of Recreation and Parks that it is immediately necessary to authorize the Director of the Department of Recreation and Parks, on behalf of the Central Ohio Area Agency on Aging, to authorize an agreement with the Mid-Ohio Regional Planning Commission (MORPC) to begin the process of establishing the Regional Council of Governments as soon as possible to prevent disruption of services to older adults and individuals with disabilities in Central Ohio and the transition of COAAA is to be able to occur by January 1, 2026, all for the immediate preservation of the public health, peace, property, safety and welfare; and NOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1. That the Director of Recreation and Parks is be and hereby is authorized to enter into an agreement with the Mid-Ohio Regional Planning Commission to explore the strategies outlined in COAAA’s Strategic Plan for Success (SPS) as it pertains to the development of a stand-alone Regional Council of Governments by 2026. \nSECTION 2. That the expenditure of $150,370.00 or so much thereof as may be needed, is hereby authorized in Recreation and Parks Grant Fund No. 2286 in Object Class 03 Services per the accounting codes in the attachment to this ordinance.\nSECTION 3. That this Council finds it to be in the best interests of the City to waive the relevant provisions of Chapter 329 of City Code relating to competitive bid requirements for professional services.\nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\nSECTION 6. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure, and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 143,
    "meeting_date": "2025-04-21",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}