{
  "success": true,
  "vote": {
    "id": 12069,
    "item_number": "CA-6",
    "title": "To authorize the Director of the Department of Technology to renew a contract with Brown Enterprise Solutions, LLC for licenses, maintenance, and support for Tableau software; and to authorize the expenditure of $226,387.27 from the Information Services Operating Fund and the Division of Fire's 2025 general fund budget. ($226,387.27)",
    "description": "Explanation\n \nThis ordinance authorizes the Director of the Department of Technology to renew a contract with Brown Enterprise Solutions, LLC for licenses, maintenance, and support for Tableau software.\nTableau is a data visualization and business intelligence software that provides instantaneous insight by transforming data into visually appealing and interactive visualizations. It helps the user to see and understand the data quickly and find patterns that otherwise may be very difficult to detect and understand. Tableau connects to almost every database and its resulting visualizations can be easily shared with others both on and off the city’s web pages. \nOn June 23, 2022, RFQ022015, a solicitation for Tableau maintenance and support, was opened. There were three (3) bids submitted. Brown Enterprise Solutions, LLC submitted the lowest, responsive bid. \nOrdinance 1937-2022 authorized the original contract with Brown Enterprise Solutions, LLC, and such contract included a provision to renew for three (3) additional one-year terms. \nThis ordinance authorizes the third of three (3) allowable renewals. The term of the renewed contract will be one (1) year, beginning on July 25, 2025, and ending on July 24, 2026. This ordinance also authorizes the expenditure of $226,387.27 for the above-described purpose.\n1.1 Amount of additional funds to be expended\nThe original contract amount:                            $149,876.13   (PO335613, Ord. 1937-2022)\nOptional renewal #1:                                                                      $151,355.00   (PO394072, Ord. 1356-2023)\nOptional renewal #2:                                                                      $211,994.50   (PO455944, Ord. 1311-2024)\nOptional renewal #3:                                                               $226,387.27   (This ordinance)\nTOTAL RENEWALS: $739,612.90\nCONTRACT COMPLIANCE\nBrown Enterprise Solutions, LLC\nVendor/CC#: 010668 \nExpiration date: 2/2/2026\nFISCAL IMPACT\nFunds for the above-described services are available and budgeted in the 2025 Information Services Operating Fund and in the Fire Division's 2025 general fund operating budget.\nTitle\n \nTo authorize the Director of the Department of Technology to renew a contract with Brown Enterprise Solutions, LLC for licenses, maintenance, and support for Tableau software; and to authorize the expenditure of $226,387.27 from the Information Services Operating Fund and the Division of Fire's 2025 general fund budget. ($226,387.27)\nBody\n \nWHEREAS, the Department of Technology has a continued need for licenses and maintenance and support for its Tableau software; and\nWHEREAS, Ord. No. 1937-2022, which passed on July 11, 2022, authorized the original contract with Brown Enterprise Solutions, LLC, which contract included three (3) one-year options to renew; and\nWHEREAS, this ordinance authorizes the third of three (3) allowable renewals for a term of one (1) year, beginning on July 25, 2025, and ending on July 24, 2026, at a total cost of $226,387.27; and\nWHEREAS, it has become necessary in the usual daily operation of the Department of Technology to authorize the Director of the Department of Technology to renew a contract with Brown Enterprise Solutions, LLC for the Tableau software license maintenance and support services, and for the preservation of the public health, peace, property, safety and welfare; NOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1. That the Director of the Department of Technology is hereby authorized to renew a contract with Brown Enterprise Solutions, LLC for licenses, maintenance, and support for Tableau software at a cost of $226,387.27 for a term of one (1) year, beginning on July 25, 2025, and ending on July 24, 2026.\nSECTION 2. That the expenditure of $226,387.27, so much thereof as may be necessary, is hereby authorized to be expended from the Department of Technology, Information Services Division, Information Services Operating fund and the Division of Fire's 2025 general fund budget, as follows in the attachment to this ordinance. (Please see attachment 0842-2025EXP)\nSECTION 3. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\nSECTION 4. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\nSECTION 5. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 144,
    "meeting_date": "2025-04-28",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}