{
  "success": true,
  "vote": {
    "id": 12076,
    "item_number": "CA-13",
    "title": "To authorize the City Auditor to transfer funds from the Northland and Other Acquisitions Fund to the General Government Grants Fund in connection with the Miscellaneous Economic Development - West Franklinton - Cover My Meds project. ($18,928.43)",
    "description": "Explanation\n \nBACKGROUND\nThis ordinance authorizes the City Auditor to transfer funding from the Northland and Other Acquisitions Fund to the General Government Grants Fund.\n \nOrdinance No. 0152-2021 authorized the Director of Public Service to enter into a construction services contract with Complete General Construction Company for the Miscellaneous Economic Development - West Franklinton - Cover My Meds project in an amount up to $1,618,642.37 and to pay for necessary construction administration and inspection costs associated with the project up to a maximum of $161,864.24. Pursuant to Ordinance No. 3263-2018 as amended by Ordinance No. 3006-2019, the City accepted a $1,000,000.00 grant from the Roadwork Development (629) account of the Ohio Department of Development (formerly Ohio Development Services Agency) for costs associated with the construction, administration, and inspection of the project.  \n \nThe project has been completed.  Final accounting reconciliation determined the need to transfer funding from the Northland and Other Acquisitions Fund to the General Government Grants Fund to account for city match above the original grant amount.\n \nFISCAL IMPACT\nFunds in the amount of $18,928.43 are available for transfer from Fund 7735, the Northland and Other Acquisitions Fund in P540007-100066 (Signal Installation - Gravity Project) to Fund 2220, the General Government Grants Fund, G442002 (CoverMyMeds OSDA 629).  Funds are appropriated.\n \n \nTitle\n \nTo authorize the City Auditor to transfer funds from the Northland and Other Acquisitions Fund to the General Government Grants Fund in connection with the Miscellaneous Economic Development - West Franklinton - Cover My Meds project. ($18,928.43)\n \n \n \nBody\n \nWHEREAS, the City of Columbus Department of Public Service has completed the Miscellaneous Economic Development - West Franklinton - Cover My Meds project; and\n \nWHEREAS, General Government Grants Funds were used to pay for a portion of this project; and\n \nWHEREAS, there is a remaining cash deficit in the General Government Grants Fund; and\n \nWHEREAS, a reconciliation determined funds in the amount of $18,928.43 must be transferred from the Northland and Other Acquisitions Fund, Fund 7735 to the General Government Grants Fund, Fund 2220; NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the transfer of $18,928.43 or so much thereof as may be needed, is hereby authorized from Fund 7735 (Northland and Other Acquisitions Fund), from Dept-Div 4402 (Economic Development), Project P540007-100066 (Signal Installation - Gravity Project), Object Class 06 (Capital Outlay) to Dept-Div 4402 (Economic Development), Project P540007-100066 (Signal Installation - Gravity Project), Object Class 10 (Transfer Out), per the account codes in the attachment to this ordinance.\n \nSECTION 2. That the transfer of $18,928.43 or so much thereof as may be needed, is hereby authorized from Fund 7735 (Northland and Other Acquisitions Fund), from Dept-Div 4402 (Economic Development), Project P540007-100066 (Signal Installation - Gravity Project), Object Class 10 (Transfer Out) to Fund 2220 (General Government Grants Fund), Dept-Div 4402 (Economic Development), Project G442002 (CoverMyMeds OSDA 629), Object Class 80 (Transfer In) per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within a different fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 6.  That this ordinance shall take effect and be in force from and after the earliest period by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 144,
    "meeting_date": "2025-04-28",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Economic Development",
      "Grants"
    ]
  }
}