{
  "success": true,
  "vote": {
    "id": 12070,
    "item_number": "CA-7",
    "title": "To authorize the Director of the Department of Technology to renew a contract with Brown Enterprise Solutions, LLC for the purchase of Talend software licensing, maintenance, and support services; and to authorize the expenditure of $407,468.88 from the Department of Technology, Information Services Operating fund. ($407,468.88)",
    "description": "Explanation\n \nBACKGROUND\n \nThis ordinance authorizes the Director of the Department of Technology (DoT) to renew a contract with Brown Enterprise Solutions, LLC for the purchase of Talend software licensing, maintenance, and support services for a total cost of $407,468.88.\n \nThe Department of Technology uses Talend as a key component of the city's Data Management Platform (DMP). It is used to collect, organize, manage, and integrate data of different types from different origins and sources. Talend provides the city with a unique opportunity to correlate data, and “measure, monitor, and manage” data from different sources and departments to create a comprehensive profile of data, while protecting the privacy and the security of the data. Talend will provide the necessary technology to treat data as an asset which will contribute to data-driven decision making.\n \nOrdinance 1652-2024 authorized the Director of the Department of Technology to enter into a contract with Brown Enterprise Solutions, LLC for Talend software licensing, maintenance, and support services. The contract was advertised through Vendor Services as RFQ027218, and awarded to Brown Enterprise Solutions, LLC, who was the lowest bidder. This original contract established and authorized contract language allowing for three (3) mutually agreed upon one-year renewals with the approval of City Council. This ordinance represents the first renewal option authorizing contracting with Brown Enterprise Solutions, LLC, for Talend software licensing, maintenance, and support services.\n \nThis ordinance authorizes the first renewal at a total cost $407,468.88 for a period of twelve (12) months, starting on August 30, 2025, and ending on August 29, 2026.\n \n1.1 Amount of additional funds to be expended\nThe original contract amount:                            $385,694.15   (PO454469, Ord. 1652-2024)\nOptional renewal #1:                                                                      $407,468.88   (This ordinance)\n \nTOTAL: $793,163.03\n \nFISCAL IMPACT: \n \nThe funds for this expenditure have been identified and are available within the Department of Technology, Information Services Division, Information Services Operating Fund for a total cost of $407,468.88.\n \nCONTRACT COMPLIANCE:\nVendor Name: Brown Enterprise Solutions, LLC \nVendor Acct. #: 010668 (MBE)\nCC-010668; Expiration Date: 2/2/2026\nMBE-010668; Expiration Date: 12/7/2025 \n \nTitle\n \nTo authorize the Director of the Department of Technology to renew a contract with Brown Enterprise Solutions, LLC for the purchase of Talend software licensing, maintenance, and support services; and to authorize the expenditure of $407,468.88 from the Department of Technology, Information Services Operating fund. ($407,468.88)\n \nBody\n \nWHEREAS, Ordinance No. 1652-2024 authorized the Director of the Department of Technology to enter into a contract with Brown Enterprise Solutions, LLC for the purchase of Talend software licensing, maintenance, and support services; and\n \nWHEREAS, the Department of Technology desires to renew the contract with Brown Enterprise Solutions, LLC for software licensing, maintenance, and support services to collect, organize, manage, and integrate data of different types from different origins creating a comprehensive profile of data while protecting the privacy and the security of the data; and\n \nWHEREAS, the term of the original agreement was from August 30, 2024, to August 29, 2025. The contract established and authorized contract language allowing for three (3) mutually agreed upon one-year renewals with the approval of City Council. This ordinance authorizes the first of the three (3) annual renewals; and\n \nWHEREAS, the above-described renewal will be for one (1) year, starting on August 30, 2025, and ending on August 29, 2026, at a cost of $407,468.88; and\n \nWHEREAS, it has become necessary in the usual daily operation of the city for the Department of Technology to authorize the Director of the Department of Technology to renew a contract with Brown Enterprise Solutions, LLC for the purchase of Talend software licensing, maintenance, and support services, thereby preserving the public health, peace, property, safety, and welfare; NOW, THEREFORE:\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1. That the Director of the Department of Technology is hereby authorized to renew a contract with Brown Enterprise Solutions, LLC for licenses, maintenance, and support for Talend software at a cost of $407,468.88 for a one-year term, beginning on August 30, 2025, and ending on August 29, 2026.\nSECTION 2. That the expenditure of $407,468.88 or so much thereof as may be necessary is hereby authorized as shown in the attachment to this ordinance. (See attachment: 0855-2025EXP)\nSECTION 3: That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\nSECTION 4: That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\nSECTION 5: That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 144,
    "meeting_date": "2025-04-28",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements"
    ]
  }
}