{
  "success": true,
  "vote": {
    "id": 12106,
    "item_number": "CA-43",
    "title": "To authorize the City Attorney to enter into retainer agreements with Baker & Hostetler, LLP; Bricker Graydon, LLP; Frost Brown Todd, LLC; David A. Goldstein Co., LPA; McNees Wallace & Nurick, LLC; Perez & Morris, LLC; Porter Wright Morris & Arthur, LLP; and Steptoe & Johnson, PLLC for the provision of special legal counsel services, to authorize the expenditure of up to $70,000.00 from the from the previously established General Budget Reservation; and to declare an emergency. ($70,000.00)",
    "description": "Explanation\n \nBackground:  This legislation will authorize the City Attorney to enter into retainer agreements with Baker & Hostetler, LLP; Bricker Graydon, LLP; Frost Brown Todd, LLC; David A. Goldstein Co., LPA; McNees Wallace & Nurick, LLC; Perez & Morris, LLC; Porter Wright Morris & Arthur, LLP; and Steptoe & Johnson, PLLC for the provision of special legal counsel services, each with a contract term to expire December 31, 2026.  \n \nPursuant to the Columbus City Charter, the City Attorney “shall be the legal adviser of and attorney and counsel for the city, and for all officers and departments thereof in matters relating to their official duties. The city attorney shall prosecute or defend all suits for and in behalf of the city, and shall prepare all contracts, bonds and other instruments in writing in which the city is concerned.” Sec. 67.  From time to time, the City Attorney requires assistance from outside counsel in the performance of these duties whether due to a conflict of interest that prohibits the office from providing representation or the need for attorneys who have a particular expertise in an area of law or simply due to lack of capacity due to the voluminous or complex nature of a pending matter.  Additionally, while the City Attorney retains the ability to appoint special counsel on a case-by-case basis depending upon the specific needs presented by the case or issue, the City Attorney made the decision to embark upon a more formalized process for identifying law firms that could provide such representation so as to allow for additional firms to be identified and to increase efficiencies in the appointment process.\n \nOn May 28, 2024, the City of Columbus Purchasing Office on behalf of the City Attorney, issued a Request for Qualifications (RFQ 027871) for outside legal counsel services and received a total of nine (9) responses.  A Selection Committee reviewed the proposals, and of the nine (9) responses, the eight (8) firms referenced above were recommended to the City Attorney to enter into retainer agreements for the provision of special counsel services.  \n \nThe City Attorney’s Office has set the rates for the provision of legal services at the following for this contract term:\n \nContractor shall receive a blended rate of $275.00 per hour for representation associated with:\nA.  42 USC §1983 actions in federal court defending City employees including police officers\nB.  Representation of the City in labor matters including arbitrations\nC.  Representation of the City in employment law matters and litigation\nD.  Ohio municipal law\nE.  Bankruptcy counsel\nF.  Construction law matters and litigation\n \nContractor shall receive a blended rate of $350.00 per hour for representation associated with:\nF.  Tax law compliance matters\nG.  Real estate and eminent domain matters \nH.  Economic development\nI.   Copyright and intellectual property matters\nJ.   Environmental compliance\nK.  Energy purchase agreements\n \nIn consideration for the one-dollar ($1) retainer fee, the firms selected have agreed to make themselves available to represent the City following a check for conflicts and as capacity allows.  Additionally, each retainer agreement affords the firm the ability to seek additional funds up to $8,749.00 to cover costs attendant to the representation such as expert witness fees.\n \nUpon being assigned to a representation, a scope of services which incorporates the terms of the retainer agreement and which is specific to that representation will be agreed upon in accordance with the relevant procurement provisions of Chapter 329 of the Columbus City Codes.\n \nEmergency:  Emergency declaration is requested so the law firms can be available to provide legal services to the City in the event a newly filed complaint is served upon the City which requires immediate representation that cannot be provided by the City Attorney’s Office.\n \n \nContract Compliance Numbers:\n1.            V# 006399, FID 34-0082025, Baker & Hostetler LLP, CC-006399 expires 7/18/2026\n2.            V# 006047, FID 31-4359739, Bricker Graydon LLP, CC-006047 expires 2/12/2026\n3.            V# 025266, FID 61-0722001, Frost Brown Todd LLC, CC-025266 expires 4/21/2027\n4.            V# 005953, FID 31-1778972, David A. Goldstein Co., LPA, CC-005953, expires 3/25/2027\n5.            V# 001743, FID 23-1256003, McNees Wallace & Nurick, LLC, CC-001743 expires 4/16/2027\n6.            V# 052154, FID 31-1658788, Perez & Morris, LLC, CC-052154 expires 3/28/2027\n7.            V# 006060, FID 31-4373657, Porter Wright Morris & Arthur, LLP, CC-006060 expires 4/3/2027\n8.            V# 047676, FID 55-0286140, Steptoe & Johnson, PLLC, CC-047676 expires 12/24/2025\n \nThese companies are neither debarred according to the Excluded Party Listing System of the Federal Government nor prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.\n \nFiscal Impact:  Funding is available within the General Fund from previously established General Budget Reservation BRPO002970.  \n \n \nTitle\n \nTo authorize the City Attorney to enter into retainer agreements with Baker & Hostetler, LLP; Bricker Graydon, LLP; Frost Brown Todd, LLC; David A. Goldstein Co., LPA; McNees Wallace & Nurick, LLC; Perez & Morris, LLC; Porter Wright Morris & Arthur, LLP; and Steptoe & Johnson, PLLC for the provision of special legal counsel services, to authorize the expenditure of up to $70,000.00 from the from the previously established General Budget Reservation; and to declare an emergency. ($70,000.00)\n \n \nBody\n \nWHEREAS, an RFQ for outside legal counsel services was published on May 28, 2024, and received a total of nine (9) responses; and\n \nWHEREAS, a Selection Committee carefully reviewed and considered the qualifications and expertise of each proposal submitted; and\n \nWHEREAS, eight of the nine firms were selected for further consideration by the Selection Committee; and\n \nWHEREAS, after careful consideration the Selection Committee recommended that the City Attorney enter into retainer agreements with Baker & Hostetler, LLP; Bricker Graydon, LLP; Frost Brown Todd, LLC; David A. Goldstein Co., LPA; McNees Wallace & Nurick, LLC; Perez & Morris, LLC; Porter Wright Morris & Arthur, LLP; and Steptoe & Johnson, PLLC for the provision of special legal counsel services due to their demonstrated legal experience, their familiarity with the field of law for which they were selected, and their past experience dealing with issues pertaining to local government; and\n \nWHEREAS, it is further necessary to authorize the expenditure of funds to pay for services attendant to such representations; and\n \nWHEREAS, an emergency exists in the usual daily operations of the City Attorney's Office in that it is immediately necessary to authorize the foregoing contracts and expenditure of funds so the law firms can be available to provide legal services to the City in the event a newly filed complaint is served upon the City which requires immediate representation that cannot be provided by the City Attorney’s Office, for the immediate preservation of the public health, peace, property, safety and welfare; NOW THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the City Attorney is authorized to enter into retainer agreements with a termination date of December 31, 2026 with Baker & Hostetler, LLP; Bricker Graydon, LLP; Frost Brown Todd, LLC; David A. Goldstein Co., LPA; McNees Wallace & Nurick, LLC; Perez & Morris, LLC; Porter Wright Morris & Arthur, LLP; and Steptoe & Johnson, PLLC for the provision of special legal counsel services each valued at $8,750.00 in total. \n \nSECTION 2. That the expenditure of $70,000.00, or so much thereof as may be needed, is authorized from previously established General Budget Reservation BRPO002970.\n \nSECTION 3. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this legislation.\n \nSECTION 5. That due to the time sensitivity inherent to requirements for legal representation, it is in the best interest of the City to authorize the City Attorney, and the City Attorney is hereby so authorized, to assign representations to the selected firms as the need arises without seeking additional Council approval; any provisions of Chapter 329 contrary to the process used to retain and assign representations are hereby waived pursuant to CCC 329.15. Any modifications or extensions to the assignments once made shall comply with Chapter 329 absent a specific waiver by Council. \n \nSECTION 6.  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 144,
    "meeting_date": "2025-04-28",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}