{
  "success": true,
  "vote": {
    "id": 12116,
    "item_number": "CA-53",
    "title": "To authorize the Director of the Department of Development to enter into not-for-profit service contracts with Homes on the Hill CDC in an amount up to $97,150.00 and The Columbus Urban League in an amount up to $47,850.00 for the purpose of assisting the Department of Development to provide housing counseling services; to authorize the appropriation and expenditure of up to $125,000.00 from the from the General Fund, Income Tax Set-Aside Subfund; to authorize the expenditure of $20,000.00 from the General Fund; and to authorize payment of expenses starting January 1, 2025. ($145,000.00)",
    "description": "Explanation\nBACKGROUND: This legislation authorizes the Director of the Department of Development to enter into two housing counseling not-for-profit service contracts with Homes on the Hill Community Development Corporation (Homes on the Hill CDC) and The Columbus Urban League for a combined total of $145,000.00 and to authorize payment of expenses starting January 1, 2025. \n \nHomes on the Hill CDC and The Columbus Urban League are non-profit organizations that provides U.S. Department of Housing and Urban Development (HUD) certified housing counseling services, including but is not limited to, pre-purchase/post-purchase home buyer education, tenant counseling, troubled homeowner counseling, financial literacy, and foreclosure counseling. \n \nHomes on the Hill CDC and Columbus Urban League provide HUD certified services to Columbus area individuals, families, or groups who are tenants, homeowners, homeless, or homebuyers in need of such services.   \n \nHomes on the Hill and Columbus Urban League have a long and successful track record of providing comprehensive housing counseling services to the community. For the City’s Down Payment Assistance Program and Homeownership Development Programs, pre-purchase education is required. Housing Counseling also assists financially distressed household which reduces the number of foreclosures and evictions.\n \nThese services included in this not-for-profit service contract cannot be provided by existing city employees as they are beyond the City’s current staffing capacity to provide.\n \nThe Department of Development advertised a Notice of Funding Availability (NOFA)/Request for Proposal (RFP) from October 18, 2024, through November 27, 2024, on the City’s Vendor Services and Bonfire websites.  The City received two (2) proposals.  The proposals were evaluated and scored in accordance with the relevant provisions of Chapter 329 of the Columbus City Codes.  The Director of Development desires to enter into two (2) not-for-profit service contracts. Not For Profit Service Contract for Homes on the Hill CDC will serve Columbus families in the amount of $97,150.00 and Columbus Urban League Not For Profit Service Contract in the amount of $47,850.00. \n \n \nFISCAL IMPACT: $125,000.000 is available in the General Fund, Income Tax Set Aside Subfund (100099) and $20,000.00 is available in the 2025 Housing Division’s General Fund budget. \n \nCONTRACT COMPLIANCE:  \nHomes on the Hill Community Development Corporation (Homes on the Hill CDC) contract compliance 005144 expires 8/1/2026. \nThe Columbus Urban League contract compliance 006073 expires 6/9/2025.\n \n \nTitle\nTo authorize the Director of the Department of Development to enter into not-for-profit service contracts with Homes on the Hill CDC in an amount up to $97,150.00 and The Columbus Urban League in an amount up to $47,850.00 for the purpose of assisting the Department of Development to provide housing counseling services; to authorize the appropriation and expenditure of up to $125,000.00 from the from the General Fund, Income Tax Set-Aside Subfund; to authorize the expenditure of $20,000.00 from the General Fund; and to authorize payment of expenses starting January 1, 2025. ($145,000.00)\n \n \nBody\n \nWHEREAS, the City of Columbus is a participating jurisdiction of the U.S. Department of Housing and Urban Development; and \n \nWHEREAS, the City of Columbus requires pre-purchase counseling for homebuyers; and \n \nWHEREAS, the department advertised a request for proposal/notice for financial award for the for the Housing Counseling Services program.  Two proposals were received and the evaluation committee found Homes on the Hill CDC and The Columbus Urban League are able to perform the work; and  \n \nWHEREAS, the services included in this not-for-profit service contract cannot be provided by existing city employees as they are beyond the City’s current staffing capacity to provide; and\n \nWHEREAS, that the appropriation and expenditure of up to $125,000.00 from the General Fund, Income Tax Set-Aside Subfund is authorized; and\n \nWHEREAS, that the expenditure of up to $20,000.00 from the Housing Division’s General Fund budget is authorized; and\n \nWHEREAS, to authorize payments for services starting January 1, 2025; and\nWHEREAS, it is necessary to authorize the Director to enter into a Not-For Profit Contract with Homes on the Hill CDC and The Columbus Urban League to provide housing counseling services appropriate and to expend said funds to allow the grant funds use by year end, in the amount up to $145,000.00; and NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     That the Director of the Department of Development is authorized to enter into a not-for-profit service contract with Homes on the Hill CDC, a not-for-profit corporation, in an amount up to $97,150.00 for the purpose of assisting the Department of Development to administer housing counseling services and authorizing expenses incurred prior to the execution of a purchase order, starting January 1, 2025.\n \nSECTION 2.  That the Director of the Department of Development is authorized to enter into a not-for-profit service contract with The Columbus Urban League, a not-for-profit corporation, in an amount up to $47,850.00 for the purpose of assisting the Department of Development to administer housing counseling services and authorizing expenses incurred prior to the execution of a purchase order, starting January 1, 2025.\n \nSECTION 3. That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2025, the sum of 125,000.00 is hereby appropriated in Fund 1000 (General Fund), Subfund 100099 (Income Tax Set Aside), Dept-Div 44-10 (Housing), in object class 03 (Services) per the account codes in the attachment to this ordinance.\n \nSECTION 4.  That for the purpose as stated in Sections 1 and 2, the expenditure of $125,000.00 or so much thereof as may be needed, is hereby authorized in Fund 1000 (General Fund), Subfund 100099 (Income Tax Set Aside), Dept-Div 44-10 (Housing), object class 03 (Services) per the account codes in the attachment to this ordinance.\n \nSECTION 5.  That for the purpose as stated in Sections 1 and 2, the expenditure of $20,000.00 or so much thereof as may be needed, is hereby authorized in Fund 1000 (General Fund), Dept-Div 44-10 (Housing), object class 03 (Services) per the account codes in the attachment to this ordinance.\n \nSECTION 6.  That these contracts are awarded pursuant to the relevant provisions of Chapter 329 of City Code relating to not-for-profit service contracts.\n \nSECTION 7.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\n                                          \nSECTION 8.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 9.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 144,
    "meeting_date": "2025-04-28",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Housing"
    ]
  }
}