{
  "success": true,
  "vote": {
    "id": 12120,
    "item_number": "CA-57",
    "title": "To authorize appropriation in an amount up to $81,187.73, the transfer between object classes in an amount up to $652.69, and the expenditure in an amount up to $170,595.96 of 2018 HOME Investment Partnerships Program (HOME) entitlement grants funds from the U.S. Department of Housing and Urban Development; and to authorize the Director of the Department of Development enter into a commitment letter, loan agreement, promissory note, mortgage, and restrictive covenant with Habitat for Humanity-MidOhio to construct four single family homes with each address having its own set of loan documents in a total cost for both homes in an amount up to $220,420.00 of which partial funding was authorized within ordinance numbers 1084-2024 and 1361-2024; and to declare an emergency ($170,595.96).",
    "description": "Explanation\n \nBACKGROUND:  This legislation authorizes the appropriation in an amount up to $81,187.73 and expenditure in an amount up to $170,595.96 of 2018 HOME Investment Partnerships Program (HOME) entitlement grants from the U.S. Department of Housing and Urban Development and authorizes the Director of the Department of Development to enter into a commitment letter, loan agreement, promissory note, mortgage, and restrictive covenant with Habitat for Humanity-MidOhio to construct two single family homes.  These two single family homes will each have their own set of loan documents.  The funding of these two homes will be in an amount up to $220,420.00 which will be comprised of the $170,595.96 of 2018 HOME Investment Partnerships Program funds listed above as well as $20,446.02 2024 HOME Investment Partnerships Program funds from Ordinance 1084-2024 and $29,378.02 from Ordinance 1361-2024.  \n \nHabitat for Humanity is a global nonprofit housing organization working in local communities across all 50 states in the U.S. and in approximately 70 countries. Habitat’s vision is of a world where everyone has a decent place to live. Habitat works toward the City’s vision by building strength, stability, and self-reliance in partnership with families in need of decent and affordable housing. Habitat homeowners help build their own homes alongside volunteers and pay an affordable mortgage.\n \nHabitat has a well-planned construction schedule that must take into account timing of public and private funding availability, volunteer labor, and subcontractor schedules.  Habitat for Humanity is the only developer building homeownership units with HOME funds for qualified homebuyers who earn between 30-60 % AMI and every home on the list is one purchased or optioned from/with the Land Bank. \n \nHabitat offers a zero percent interest mortgage and also brings up to 58% of the funding to each deal with the use of donor dollars, the mortgage payments of other Habitat homeowners, and in-kind donations for materials.  These two units Habitat plans to build in the 2025-2026 construction season and are funded, in part, with City of Columbus HOME funds:  \n \n1156 Minnesota Avenue (010-076118) (HOME 2024) Habitat will partner with a family from their pool of vetted applicants to build their single-family, two-story, four-bedroom house on this lot.   \n \n2015 Minnesota Avenue (010-069625) (HOME 2024) Habitat will partner with a family from their pool of vetted applicants to build their single-family, two-story, 3-bedroom house on this lot.\n \nThis legislation represents appropriation for a part of the HOME portion of the 2018 Action Plan per ordinance 2589-2017 and the 2024 Action Plan per ordinance 2993-2023.\n \n \nContract Compliance:  the vendor number is 004859 and expires 3/20/2025.\n \nEmergency Designation:  An emergency exists as the developer is looking to begin construction in May to assure the cost of the development of the homes do not increase due to unforeseen circumstances and to have the prospective buyers in their new homes in a timely manner. Delays in construction can cause the future homebuyer to face further financial hardships if the cost of development significantly increases.  \n \nFiscal Impact: $170,595.96 is available from the 2018 HOME grant (G4451801) and $49,824.04 is available within the 2024 HOME grant (G442302).  The commitment of funds through this legislation is conditioned on compliance with HUD’s environmental review requirements. The funding from HOME Fund (2201) is only authorized if all HOME review and comment requirements have been met prior to any commitment of funds, as approved by the Responsible Entity Agency Official. An Authorization to Utilize Grant Funds will be received by the City from HUD in advance of the execution of documents for this project.\n \nTitle\n \nTo authorize appropriation in an amount up to $81,187.73, the transfer between object classes in an amount up to $652.69, and the expenditure in an amount up to $170,595.96 of 2018 HOME Investment Partnerships Program (HOME) entitlement grants funds from the U.S. Department of Housing and Urban Development; and to authorize the Director of the Department of Development enter into a commitment letter, loan agreement, promissory note, mortgage, and restrictive covenant with Habitat for Humanity-MidOhio to construct four single family homes with each address having its own set of loan documents in a total cost for both homes in an amount up to $220,420.00 of which partial funding was authorized within ordinance numbers 1084-2024 and 1361-2024; and to declare an emergency ($170,595.96).\n \n \n \nBody\n \nWHEREAS, the City of Columbus is a participating jurisdiction of the U.S. Department of Housing and Urban Development; and\n \nWHEREAS, the City of Columbus is the recipient of HOME Investment Partnerships funds from the U.S. Department of Housing and Urban Development; and\n \nWHEREAS, the Columbus City Council has approved the 2018 Action Plan per ordinance 2589-2017 and the 2024 Action Plan per ordinance 2993-2023; and\n \nWHEREAS, funds were previously legislated via ordinance 1361-2024 and 1084-2024 for a portion of the costs associated with the development of these two affordable housing projects and this legislation authorizes the remaining dollars needed to enter into agreement and construct to begin; and  \n \nWHEREAS, this legislation authorizes the appropriation in an amount up to $81,187.73, the transfer between object classes in an amount up to $652.69, and the expenditure in an amount up to $170,595.96 of the 2018 HOME Investment Partnership Program funds; and\n \nWHEREAS, the Department of Development desires to support Habitat for Humanity-MidOhio with financial support for six single family homes; and\n \nWHEREAS, an emergency exists in the usual and daily operation of the Department of Development in that the developer is looking to begin construction to mitigate any possible increases to the development of these properties.  The additional costs of waiting to begin construction will only cause the overall cost of development to increase and will create an additional affordability gap which will cause a financial hardship on the prospective buyers.  Thereby allowing this as an emergency will help to further maintain the overall costs of the development and not negatively impact the projects buy having to request additional funding on the City but the homebuyers as well and will prevent an undue hardship thereby preserving the public, health, peace, property, safety, and welfare; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2025, the sum of $81,187.73 is appropriated in Fund 2201 (HOME), from Dept-Div 44-10 (Housing), G451801 (2018 HOME grant), object class 05 (Other Expenses) per the account codes in the attachment to this ordinance.\n \nSECTION 2.  That the transfer between object classes in an amount up to $652.69 or so much thereof as may be needed, is hereby authorized in Fund 2201 (HOME), from Dept-Div 44-10 (Housing), G451801 (2018 HOME grant), per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That the expenditure in an amount up to $170,595,96 or so much thereof as may be needed, is hereby authorized in Fund 2201 (HOME), from Dept-Div 44-10 (Housing), G451801 (2018 HOME grant), object class 05 (Other Expenses) per the account codes in the attachment to this ordinance.\n \nSECTION 4. That funding from ordinance 1084-2024 ($20,446.02) and 1361-2024 (29,378.02) will be utilized to complete the funding of these two affordable housing projects \n \nSECTION 5.  That the total expenditure for these two affordable housing projects is authorized fin an amount up to $220,420.00 is authorized per Section 3 and 4 of this legislation.\n \nSECTION 6.  That the commitment of funds through this legislation is conditioned on compliance with HUD’s environmental review requirements. The funding from HOME Fund (2201) is only authorized if all HOME review and comment requirements have been met prior to any commitment of funds, as approved by the Responsible Entity Agency Official. An Authorization to Utilize Grant Funds will be received by the City from HUD in advance of the execution of documents for this project.\n \nSECTION 7.  That the Director of Development is hereby authorized to enter into a commitment letter, loan agreement, promissory note, mortgage, and restrictive covenant with Habitat for Humanity-MidOhio to construct six single family homes with each address having its own set of loan documents.                       \n \nSECTION 8.  That funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n                                          \nSECTION 9.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 10.  That at the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements.\n \nSECTION 11.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 144,
    "meeting_date": "2025-04-28",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}