{
  "success": true,
  "vote": {
    "id": 12157,
    "item_number": "CA-1",
    "title": "To Honor And Recognize The Members Of The Zeta Alumni Association, Inc., On The Occasion Of Its Reunion And Celebration Of The 110th Anniversary Of The Zeta Chapter Of Kappa Alpha Psi Fraternity, Inc.",
    "description": "Title\n \nTo Honor And Recognize The Members Of The Zeta Alumni Association, Inc., On The Occasion Of Its Reunion And Celebration Of The 110th Anniversary Of The Zeta Chapter Of Kappa Alpha Psi Fraternity, Inc.\n \nBody\n \nWHEREAS, the Zeta Chapter of Kappa Alpha Psi Fraternity, Inc., chartered December 8, 1915, has provided 110 years of leadership, mentorship, academic encouragement, professional development and civic engagement, shaping leaders and positively impacting communities within and around Columbus, Ohio and nationally; and\n \nWHEREAS, the Zeta Alumni Association, Inc., incorporated December 8, 2022, represents a distinguished body of Zeta Chapter initiates; a collective of men dedicated to achievement in every field of human endeavor, rooted in the enduring legacy of the Kappa Alpha Psi Fraternity, Inc; and\n \nWHEREAS, the Zeta Alumni Association is a global community of accomplished Zeta Chapter initiates of Kappa Alpha Psi Fraternity, Inc., devoted to promoting the good and welfare of its members, their families & communities, Zeta Undergraduate Members, proximate Alumni Chapters and preserving the legacy of Zeta Chapter as part of Fraternity history; and\n \nWHEREAS, four key result areas shape the Zeta Alumni Association strategy, namely Member Privileges, Legacy Preservation, Economic Impact, and Social Impact; designed to promote excellence, well-being and unity among its members while supporting educational opportunities, undergraduate youth development, and social progress through service-oriented initiatives; and\n \nWHEREAS, the City of Columbus proudly welcomes the Zeta Alumni Association and its members back to the community for the 110th Anniversary and Reunion of the Zeta Chapter, to be celebrated May 14th through May 18th, 2025; and\n \nWHEREAS, this milestone occasion not only honors a rich history but also reaffirms the Zeta Alumni Association’s continued dedication to building a better future; now, therefore,\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: That this Council hereby recognizes and commends the Zeta Alumni Association for its historical significance, present contributions and future aspirations, and extends a sincere welcome to the City of Columbus on the occasion of this historic 110th anniversary and reunion of the Zeta Chapter of Kappa Alpha Psi Fraternity Inc.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 145,
    "meeting_date": "2025-05-12",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}