{
  "success": true,
  "vote": {
    "id": 1217,
    "item_number": "SR-20",
    "title": "To waive the competitive bidding requirements of Columbus City Code Chapter 329; to authorize the Director of the Department of Development to enter into a contract with EcoMap Technologies, Inc. in an amount up to $77,500.00 to design, create and maintain and comprehensive web-based platform; to authorize the expenditure of up to $77,500.00 from the 2021 General Fund Operating Budget; and to declare an emergency. ($77,500.00)",
    "description": "Explanation\nBACKGROUND: This legislation authorizes the Director of the Department of Development to waive the request for proposal requirements of Columbus City Code Chapter 329 and to enter into a contract with EcoMap Technologies, Inc. in an amount up to $77,500.00 for the purpose of designing, creating, and maintaining a comprehensive web-based, single-stop internet platform (portal) that aggregates information assets from websites relevant to Columbus’ small business ecosystems and to market the portal to the public.  \n \nIn 2018, the department facilitated the Columbus Small Business Ecosystem Assessment that was commissioned by Mayor Ginther and Columbus City Council.  The assessment identified the following gaps/opportunities: ​\n1.                     ​Limited awareness in the small business community of available resources.\n2.                     Need for support for businesses in the post-launch phase.\n3.                     Limited coordination across entrepreneur support organizations.\n4.                     No center of gravity for Main Street businesses.\n5.                     Limited peer networking opportunities.\n6.                     Need for an advocate for immigrant business owners.\nVia a contract for services with EcoMap, the City of Columbus is proposing to develop a small business portal that will serve to meet all needs except need number 6 as identified in the assessment and subsequently detailed in the Columbus Small Business Agenda that was released to the public in December 2019.  By streamlining access to resources, small businesses will benefit from this services in a number of ways including: 1) access to relevant resources across the entire business lifecycle, 2) having real-time access to stakeholders and service providers, and 3) have the ability to provide the public with up-to-date self-sourced and self-maintained profiles of local businesses at no cost the small businesses.  These all major shortfalls of the current ecosystem, pre and post pandemic.  \n​\nIn short, the portal will serve as another key component along with the Architect/Builder Framework to operationalize and democratize the Columbus Small Business Agenda resulting in truly collaborative and inclusive entrepreneurship-based economic development for the City of Columbus and its partners.  \n \nEcoMap Technologies, Inc., founded in 2018, is a software company that uses Artificial Intelligence (AI) to build custom platforms that help support communities such as local resource databases and small business navigators.  The database helps entrepreneurs find resources for their startups, small businesses, and nonprofits within their local community.   \n \nEmergency action is requested to allow the project schedule to be maintained.\n \nCONTRACT COMPLIANCE:  The vendor’s contract compliance number is CC035642 and expires on 5/3/23.\n \nWAIVER OF REQUEST FOR PROPOSAL REQUIREMENTS:  A waiver of the request for proposal requirements outlined in Columbus City Code Chapter 329 is being requested because EcoMap Technologies is one of only a very limited number (two) of vendors nationwide with custom subscription services that meets or exceeds the needs of our small business ecosystem as detailed under the Columbus Small Business Agenda - the strategic document and strategy for inclusive small business growth and development.  EcoMap Technologies provides small business resource identification, curation, aggregation, and navigation services at a significantly reduce cost with more features than all potential competitors surveyed.\n \nFISCAL IMPACT: The funding of $77,500.00 has been allocated from the Economic Development Division’s 2021 General Fund Budget.\n \nTitle\nTo waive the competitive bidding requirements of Columbus City Code Chapter 329; to authorize the Director of the Department of Development to enter into a contract with EcoMap Technologies, Inc. in an amount up to $77,500.00 to design, create and maintain and comprehensive web-based platform; to authorize the expenditure of up to $77,500.00 from the 2021 General Fund Operating Budget; and to declare an emergency. ($77,500.00)\n \nBody\nWHEREAS, EcoMap Technologies, Inc. founded in 2018, is a software company that uses Artificial Intelligence (AI) to build custom platforms that help support communities such as local resource databases and small business navigators.  The database helps entrepreneurs find resources for their startups, small businesses and nonprofits within their local community; and   \n \nWHEREAS, EcoMap Technologies, Inc. will design, create and maintain a comprehensive web-based, single-stop internet platform that aggregates information assets from websites relevant to Columbus small business ecosystems; and  \n \nWHEREAS, the web-based services provided by EcoMap Technologies, Inc. will be very helpful to the small business community in accessing available services in the Columbus community; and  \n \nWHEREAS, the City of Columbus desires to partner with EcoMap Technologies, Inc. to provide the needed web-based services to the small business community; and\n \nWHEREAS, it is in the City's best interest to waive the competitive bidding requirements to enter into this contract because EcoMap Technologies is one of only a very limited number (two) of vendors nationwide with custom subscription services that meets or exceeds the needs of our small business ecosystem by providing small business resource identification, curation, aggregation, and navigation services at a significantly reduce cost with more features than all potential competitors surveyed; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to authorize the Director to enter into contract with the EcoMap Technologies, Inc. to maintain the project schedule, all for the immediate preservation of the public health, property, safety and welfare; NOW, THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.    That City Council finds it in the best interest of the City to waive the competitive bidding provision of Chapter 329 of Columbus City Code to enter into this contract.\n \nSECTION 2.   That the Director of the Department of Development is hereby authorized to enter into contract with EcoMap Technologies, Inc. in an amount up to $77,500.00 to create, design and maintain a database service.\n \nSECTION 3.   That for the purpose stated in Section 2, the expenditure of $77,500.00 or so much thereof as may be needed, is hereby authorized in Fund 1000 (General Fund), Dept. 44-02 (Economic Development),  in Object Class 03 (Contractual Services) per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.   That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.    That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.   That for the reasons stated in the Preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 18,
    "meeting_date": "2021-06-21",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}