{
  "success": true,
  "vote": {
    "id": 12186,
    "item_number": "CA-30",
    "title": "To authorize the City Clerk to enter into a grant agreement with EPIC Youth and to authorize an expenditure within the Neighborhood Initiatives subfund. ($40,000.00)",
    "description": "Explanation\nThis ordinance authorizes the City Clerk to enter into a grant agreement with EPIC Youth, a non-profit entity, for the support of the International Day of the Girl \"Girls Will!\" Summit event. Funding support from Council will be provided upfront to defray the cost of pre-event planning and contract procurement, including for the following services:\n1. Venue deposits and vendor payments (including workshop facilitators, audio/visual support, and security);\n2. Transportation and supplies for over 400 student participants;\n3. Marketing, printing, and event materials that must be procured in advance; and\n4. Honoraria for speakers and partners.\n \nInternational Day of the Girl was created to increase attention on issues that matter to girls amongst governments, policymakers and the general public, and more opportunities for girls to have their voices heard on the global stage.\n \nThe mission of EPIC Youth is to empower youth to live purposeful lives fueled by personal skills and talents, positive character, self-improvement, personal leadership skills, and career readiness. EPIC Youth is a mentoring and empowerment organization dedicated to equipping young people with the leadership, academic, and professional skills they need to succeed. Through mentorship, hands-on learning experiences, and dynamic programs, they empower students to build confidence, develop strong character, and prepare for their future careers. EPIC Youth came to be through the combination of Eryn PiNK Girl Empowerment and Men of ICE, two organizations that provided tailored leadership and personal development programs designed specifically for girls and boys. Now, the two have combined and expanded to leadership academies, in-school programs, and mentorship initiatives with structured pathways for self-discovery, teamwork, and critical thinking. EPIC Youth stands for empowerment, purpose, innovation, and community.\n \nThe Girls Will! Summit is an annual, city-supported event designed to empower and inspire over 450 middle and high school girls to become builders - not just consumers - of innovation, policy, and leadership. The event includes hands-on STEM workshops, creative labs, keynote panels, and real-world career exposure to prepare attendees to thrive in the workforce. The event will:\n1. Increase attendees' exposure to high-growth careers in STEM, business, and the arts;\n2. Equip participants with tangible skills in leadership, critical thinking, and public speaking;\n3. Connect youth to professionals and mentors who reflect their identity and aspirations;\n4. Provide each attendee with summit kit including journals, swag, resources, and take-home tools; and\n5. Capture student participation through pre/post-assessments and workshop evaluations Measurements of Success.\n \nFiscal Impact: Funding is available within the Neighborhood Initiatives subfund.\n \nTitle\nTo authorize the City Clerk to enter into a grant agreement with EPIC Youth and to authorize an expenditure within the Neighborhood Initiatives subfund. ($40,000.00)\n \nBody\nWHEREAS, International Day of the Girl is an international observance day declared by the United Nations; that first took place on October 11, 2012; and\n \nWHEREAS, International Day of the Girl was created to increase attention on issues that matter to girls amongst governments, policymakers and the general public, and more opportunities for girls to have their voices heard on the global stage; and\n \nWHEREAS, EPIC Youth is a nonprofit organization dedicated to empowering youth to live purposeful lives fueled by personal skills and talents, positive character, self-improvement, personal leadership skills, and career readiness; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the City Clerk is authorized to enter into a grant agreement with EPIC Youth to provide funding in support of the International Day of The Girl Summit event.\n \nSECTION 2. That the expenditure of $40,000.00, or so much thereof as may be needed pursuant to the action authorized in SECTION 1, is authorized in the Neighborhood Initiatives subfund, fund 1000, subfund 100018, per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 145,
    "meeting_date": "2025-05-12",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Grants"
    ]
  }
}