{
  "success": true,
  "vote": {
    "id": 1218,
    "item_number": "SR-21",
    "title": "To supplement the Columbus Zoning Code, Title 33, with a new Section 3312.053, in order to create the East Franklinton Special Parking Area; to amend various sections in Chapter 3323, to add a new section in order to clarify the limits on the ability of the East Franklinton Review Board to grant parking variances in the newly created special parking area, and to provide relief for historic properties.",
    "description": "Explanation \n \nBACKGROUND:\nThe City of Columbus recognizes that public on-street parking as well as off-street parking for individual businesses and residential land uses may be limited in some areas. In an effort to achieve specific development or traffic initiatives in these areas, Section 3312.05 of the Columbus City Code allows for the creation of a Special Parking Area (SPA).\n \nSpecial parking areas can be established with different parking requirements that aid in balancing the needs of both residents and businesses in the defined area. Special parking areas benefit the community by enhancing efforts to review and manage parking impacts and demands.\n \nThe City of Columbus, in partnership with Kimley-Horn & Associates, developed a city-wide Strategic Parking Plan (SPP) that governs parking management decisions to support the growth and development of our urban core neighborhoods. The SPP analyzed existing conditions and recommends parking management strategies and parking demand management tools for the Downtown, University District, Franklinton and South of Downtown Neighborhoods. \nThe creation of an SPA to “right-size” parking requirements and a fee in-lieu process are just two recommendations from the SPP for Franklinton. The in-lieu fee establishes a process to effectively manage parking when residential and non-residential developments do not satisfy the required parking within the boundaries of the SPA. This process requires developers to pay a fee instead of providing all or a portion of the parking spaces required by the SPA. The revenue generated from the fees may only be spent on parking and mobility initiatives to balance the parking needs within the designated SPA.\nThe East Franklinton Review Board and the Franklinton Area Commission both support the creation of the SPA. The Columbus Development Commission reviewed and voted 5-0 on the ordinance at the monthly public meeting held on May 13, 2021.\n \nFISCAL IMPACT: The potential revenue generated from the prescribed fees will be dedicated to enhancing parking and mobility initiatives to balance the parking needs within the special parking area\n \nTitle\nTo supplement the Columbus Zoning Code, Title 33, with a new Section 3312.053, in order to create the East Franklinton Special Parking Area; to amend various sections in Chapter 3323, to add a new section in order to clarify the limits on the ability of the East Franklinton Review Board to grant parking variances in the newly created special parking area, and to provide relief for historic properties.\n \nBody\n \nWHEREAS, the City of Columbus recognizes that public on-street parking as well as off-street parking for individual businesses and residential land uses may be limited in some areas; and\n \nWHEREAS, in an effort to achieve specific development or traffic initiatives in these areas, Section 3312.05 of the Columbus City Code allows for the creation of a Special Parking Area (SPA); and\n \nWHEREAS, SPAs can be established to set different parking requirements that aid in balancing the needs of both residents and businesses in the defined area; and\n \nWHEREAS, SPAs benefit the community by enhancing efforts to review and manage parking impacts and demands; and\n \nWHEREAS, creating a SPA and fee in-lieu of parking process was key to developing alternative options to handle parking issues, encourage alternate modes of transportation, and create a process to manage parking variances while promoting economic development; and\n \nWHEREAS, the East Franklinton Review Board and the Franklinton Area Commission both support the creation of the SPA in this area; and\nWHEREAS, the Columbus Development Commission reviewed and voted 5-0 on the ordinance at the monthly public meeting held on May 13, 2021; and\nWHEREAS, it has become necessary in the usual daily operation of the City to amend the Zoning Code; now, therefore,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSection 1. That Columbus City Code Chapter 3312 is hereby supplemented with the creation of a new section, numbered 3312.053, reading as follows:\n \n3312.053 - East Franklinton Special Parking Area\nA. The East Franklinton Special Parking Area is that area indicated on the official city zoning map and bounded as follows:\nBeginning at the point where the eastern right-of-way boundary of State Route 315 intersects with the northern right-of-way boundary of I-70;\nThence easterly to the intersection of the northern right-of-way boundary of I-70 and the northern bank of the Scioto River;\nThence easterly along the northern bank of the Scioto River to its intersection with the western boundary of the Downtown District;\nThence northerly along the western boundary of the Downtown District;\nThence westerly along the southern boundary of the Downtown District until it intersects with the eastern boundary of State Route 315;\nThence southerly until the place of the beginning.\nB. Non-residential, off-street vehicle parking requirements in the East Franklinton Special Parking Area shall be One-Half (1/2) of the off-street parking as required in this chapter, except as follows:\nArt Gallery - No off-street parking shall be required;\nEating and Drinking Establishment without a pickup unit, 1,500 square feet or less - No off-street parking shall be required;\nRetail, Office, and Medical Office, 2,500 square feet or less - No off-street parking shall be required                                          \nExtended Stay Hotel - 1 space per unit;\nSingle-Unit Dwellings - No off-street parking shall be required for single-unit dwellings when located as a single unit on its own parcel that was subdivided prior to the effective date of this ordinance. For single-unit dwellings that do not meet the requirements in the preceding sentence, 1 space per unit shall be required;\nTwo-Unit Dwelling - 1 Space\nThree-Unit Dwelling - 2 Spaces.\nFour-Unit Dwelling - 3 Spaces\nMulti-Unit Dwellings above Four-Units - 1 space per dwelling unit.\nNo other off-street parking reductions, including any provided by any commercial overlay, shall apply.  \nC. Loading spaces and any required bicycle parking shall be as required in this chapter. Where there is no feasible means to locate bicycle parking spaces in a usable location on the subject parcel, the bicycle parking requirement may be satisfied by payment of a fee in lieu of providing the required bicycle parking spaces, as determined by the Director of Public Service, or designee.\nD. In the East Franklinton Special Parking Area, no further reduction or variance to the number of required off-street parking spaces shall be granted by the East Franklinton Review Board, the Board of Zoning Adjustment or City Council.\nE. The Director of the Department of Public Service shall promulgate rules and regulations for the administration of the East Franklinton Special Parking Area and shall have the authority to collect a fee in lieu of providing the required number of off-street vehicle and bicycle parking spaces as set out in these rules and regulations.\nF. Upon the submission of an application for zoning clearance, the Director of the Department of Public Service, or his or her designee, shall determine the cost of the fee in lieu of providing the required number of off-street vehicle and bicycle parking spaces in the East Franklinton Special Parking Area.\nG. Fees in lieu shall be dedicated for the establishment, operation, and maintenance of facilities and programs to address and/or mitigate parking demands and deficiencies within the boundaries of the East Franklinton Special Parking Area.\n \nSECTION 2. That existing Section 3323.09 of the Columbus City Codes is hereby amended to read as follows: \n \n3323.09                                          East Franklinton review board.\nA. Creation, Terms, Membership and Officers. \n1. Creation. The Review Board shall consist of seven (7) members appointed by the Mayor and approved by City Council. \n2. Organization. Unless otherwise specified, as soon as convenient after the members of the Review Board are appointed by the Mayor and approved by City Council, the Review Board shall meet and organize by the election of a chairman and secretary. \n3. Initial Terms. When the Review Board is first constituted, one (1) member shall be appointed for an initial term of one (1) year; three (3) members shall be appointed for an initial term of two (2) years; and three (3) members shall be appointed for an initial term of three (3) years. All subsequent terms shall be for a period of four (4) years.\n4. Membership. At least four (4) members of the Review Board shall reside or own a business or property in Franklinton. Among the professions that shall be represented on the Board, one (1) member shall be engaged as a developer or realtor with experience in the sale or management of urban properties; one (1) member shall be an architect, landscape architect or urban planner; one (1) member shall be a design professional or contractor with historic rehabilitation experience; and one (1) member shall be a lawyer with land use experience. One (1) member of the board shall be recommended by the Franklinton Area Commission as its representative and one (1) member shall be recommended by the Franklinton Board of Trade as its representative. A member may represent more than one required role.\n5. Nomination Process. Candidates for seats on the Review Board shall be recommended by the Development Department to the Mayor’s Office for review and approval before submittal to City Council for final action. The Franklinton Area Commission and Franklinton Board of Trade shall each submit two (2) candidates for consideration by the city in fulfilling each organization’s seat on the Board. The Development Department will review and select one of the nominees for submittal to the Mayor’s Office.\n6. Term. A member whose term has concluded may continue to temporarily serve on the Review Board until his/her appointment is renewed or is officially concluded through the appointment of a replacement member for that seat, provided that such temporary service shall not extend for more than one-hundred-twenty (120) days after the conclusion of a member’s term.\n7. Removal. By a majority vote of the Review Board, a member of the board may be removed from service for missing four (4) consecutive meetings or a total of five (5) meetings in one (1) calendar year. \n8. Pay. Members shall serve without compensation.\n9. Officers. The Review Board shall elect a chair and vice-chair each year at an organizational meeting each January. At that same meeting, the board shall review the list of Staff Approvable Items and vote to ratify, expand or modify the list (see Section 3323.13, Certificate of Approval- Staff Review).\n10. Bylaws. The Review Board shall establish a set of bylaws for the conduct of its business.\nB. Proceedings. The Review Board shall adopt rules of procedure providing for regular and special meetings, provided that those rules do not conflict with this Chapter. Such rules shall not be deemed operative until reviewed and approved by the City Attorney or his/her designee. The Board members shall take official action only by a vote of a majority of the Board members voting on the question on the table during a public meeting at which there is a quorum. A quorum exists when a majority of the Board members appointed to and serving on the Review Board are physically present at the meeting.  All board meetings shall take place in a publicly accessible building and shall be open to the public. A record of proceedings shall be maintained and available for public inspection. Notices of all regular board meetings shall be published no less than twenty (20) days prior to the meeting in the City Bulletin. Notice of special meetings shall be published no less than five (5) days prior to the meeting in the City Bulletin or a newspaper of general circulation.\nC. Duties. The Review Board shall have the following duties:\n1. Design Review. The Review Board shall hear and decide applications for Certificates of Approval. A Certificate of Approval is issued by the board in accordance with the standards of this Chapter, East Franklinton Plan and guidelines as approved by City Council. The board shall conduct such review for any projects requiring a Certificate of Approval as outlined in section 3323.11, Certificate of Approval - Required. Project review may include preliminary consideration of conceptual or interim proposals.\nDesign review shall be based upon the following considerations:\na. Compliance with the provisions and standards of this Chapter.\nb. Consistency with adopted development standards and design guidelines that are part of the East Franklinton Plan.\nc. Consistency with other adopted plans, guidelines and policies.\nd. Other code and regulatory requirements as may be applicable.\nIn granting a Certificate of Approval, the Review Board may impose reasonable requirements and conditions regarding the location, dimensions, character, access, building materials, and other features of the proposed uses or structures to carry out the intent and purpose of Chapter 3323, East Franklinton District, and to otherwise safeguard the public health, safety and welfare.\nThe Review Board may modify applicable development and performance standards of this district as necessary in reviewing and approving a site plan, building, structure, parking, graphic or other related improvement under its jurisdiction. Parking standards regulated by Chapter 3312 shall not be modified by the Review Board.\nThe Review Board may delegate final review of minor items to a subcommittee of the Board or to the city staff. In so doing, the board should provide clear direction regarding its expectations for final resolution of such design issues. Subcommittee meetings shall be subject to public notice provisions and a written record of the deliberations shall be provided to the board.\n2. Public Plan Review. Within its jurisdiction, the Review Board shall review and provide a recommendation to City Council regarding adoption for any public plan, including but not limited to neighborhood plans, streetscape plans, park plans, bicycle and pedestrian plans, and major street, parking and circulation plans.\n3. Design Guidelines. The Review Board may recommend approval or disapproval to City Council of design guidelines or amendments thereto for use in reviewing applications that come before the board, including staff approvals.\n4. Zoning Change, Variance, Special Permit or Temporary Use. The Director of the Department of Building and Zoning Services shall promptly transmit a copy of agendas or notices as issued for public hearing related to rezoning, special permits, variances, and zoning appeals, regarding property located wholly or partially within the East Franklinton District to the chairperson of the East Franklinton Review Board as a matter of information and for comments and advice. In addition, the city clerk shall include such chairperson on the council's mailing list for agendas. However, the Review Board shall be responsible for confirming that the mailing lists contain the currently appropriate name and address for proper notification. Failure of notification shall not constitute grounds for denial of a requested action or reversal of a prior decision; however, such failure may be a cause for postponement if appropriate.\n5. Amendments. Amendments to CC 3323, East Franklinton District, may be prepared by the city or initiated by the Review Board.\n6. Review of Public Art. The Review Board shall consider proposals for the placement of public art, as defined in Chapter 3114, Columbus Art Commission, and provide a non-binding recommendation to the art commission as provided for herein.\nD. Appeals of Staff Decisions. Within thirty (30) days of a decision by the city staff regarding a Certificate of Approval, any person directly affected by said decision may file an appeal to the Review Board. \nE. Appeals of Review Board Decisions. Within thirty (30) days of a decision by the Review Board regarding a Certificate of Approval, any person directly affected by said decision may file an appeal to the Board of Commission Appeals, as provided for in Chapter 3118.\n \nSECTION 3. That existing Section 3323.13 of the Columbus City Code is hereby amended to read as follows: \n \n3323.13 Certificate of approval - Staff reviews.\nA. Authorization. As provided for herein, certain specified development projects may be reviewed and approved by city staff for issuance of a Certificate of Approval in place of the Review Board. In undertaking these responsibilities, the staff shall use the same principles, standards and guidelines as provided for herein and consistent with the Review Board's record in applying these principles, standards and guidelines.\nB. Projects Subject to Staff Approval. The following projects are subject to staff review in place of the Review Board. If in the staff's professional opinion applications submitted for these types of projects are sufficiently complex or raise issues of concern, the staff shall forward said applications to the board for their consideration; nothing in this chapter shall preclude the city staff from seeking advice from the board chair in making this determination.\n1. Replacement of existing graphics, such as sign faces, without enlarging or changing the graphic.\n2. The replacement of exterior elements to existing non-residential structures, including, but not limited to, siding and windows, provided that the building elevations are not altered to accommodate the replacement elements nor that the gross floor area of the structure is not increased.\n3. Changes of use that do not alter existing buildings or structures, or require changes to parking or other site components. All other changes of use are to be considered by the Review Board.\n4. Parking reductions for historic preservation as determined by the standards set forth in section 3323.25.\nThe Review Board at its discretion may establish on an annual basis a list of additional development or project types that may be submitted to the staff for their approval.\nC. Certificate Issuance, Reporting and Appeals. Upon approving the above noted development projects, the staff shall immediately issue a Certificate of Approval to the applicant and report such issuance to the Review Board at its next regular meeting. Staff denials are appealable to the board, as provided for herein. Such appeals shall be filed within 30 days of receipt of a notification regarding the denial.\n \nSECTION 4. That existing Section 3323.21 of the Columbus City Codes is hereby amended to read as follows: \n \n3323.21 Development standards.\nA. Dimensional Standards. The following table summarizes applicable dimensional standards.\n \nTable 2. Dimensional Standards\n(See ORD998-2021 Attachment1 3323.21 Table 2)\n \nB. Development Standards. By reference herein, the Development Standards of the East Franklinton Plan shall be applied by the Review Board and staff in consideration of applications for Certificates of Approval. The following standards shall also apply:\n1. All buildings shall front on a public street unless otherwise approved by the Review Board.\n2. The provisions of Chapter 3321 General Site Development Standards shall apply as appropriate, but in cases of conflict the standards of this chapter shall govern.\nC. Lighting Standards. The height of a light fixture when located within twenty-five (25) feet of a residential use shall not exceed eighteen (18) feet above grade. In all other locations the height of a light fixture shall not exceed twenty-eight (28) feet.\nD. Graphics. Graphics standards are as follows:\n1. Within the District graphics that require a permit as determined by Chapter 3375, require the issuance of a Certificate of Approval from the Review Board prior to issuance of a graphics permit by the Department of Building and Zoning Services.\n2. Graphics are subject to the provisions of Chapter 3375 and Chapter 3381. Whenever there is a conflict between the graphics code and this Chapter, this Chapter shall govern.\n3. Nonconforming graphics are defined and regulated by the provisions of Section 3381.08, Nonconforming Graphics.\n4. In addition to signs prohibited in Chapter 3375, the following types of signs shall not be permitted: off-premise signs, billboards, signs with flashing lights or bare bulbs, rotating signs, pole signs, automatic changeable copy signs, and roof signs.\nE. Parking Lot Circulation Parking and Circulation. Parking standards in the Plan and Chapter 3312, Off-Street Parking and Loading, and the applicable standards of Chapter 3323 as provided for herein, shall apply in the District. In addition, the following standard shall apply. In cases of conflict, the standard provided below shall govern.\n1. Parking, stacking and circulation aisles are not permitted between the principal building and a street right-of-way line. This standard does not apply to existing buildings unless they are expanded by fifty (50) percent or more in gross floor area.\n2. In recognition of the development pattern associated with this overlay, the required number of off-street parking spaces for non-residential uses shall be reduced in the following manner:\na. All uses, other than an eating or drinking establishment smaller than five thousand (5,000) square feet with a pickup unit, are permitted a twenty-five (25) percent reduction of the required parking in Chapter 3312.\nb. Retail uses (not including eating and drinking establishments, private clubs, places of assembly, and medical offices) that are ten thousand (10,000) square feet or less, are permitted an additional twenty-five (25) percent reduction (for a total reduction of fifty (50) percent) of the required parking in Chapter 3312.\nF. Encroachment. Portions of a building or structure may extend under, over or into the public right-of-way, pursuant to the approval of the Director of the Public Service Department. Such encroachments are subject to the provisions of 3323.11 Certificate of Approval - Required, and require a Certificate of Approval. Approval by the Department of Public Service is required for encroachments and access points into the public right-of-way. A Certificate of Approval for these actions does not constitute City approval.\nF. Landscaping and Screening. Parking standards in the Plan and Chapter 3312, Off-Street Parking and Loading, and the applicable standards of Chapter 3323 as provided for herein, shall apply in the District. In addition, the following standards shall apply. In cases of conflict, the standards provided for below shall govern. \n1. Interior landscaping. The interior of any parking lot containing ten parking spaces or more shall be landscaped with shade trees.     \n2.  Parking setback and perimeter landscaping. Landscaping and/or screening in the parking setback area shall be required to buffer automobile and pedestrian areas and uses; to provide headlight screen; to provide adequate visibility and safety; and to avoid the illegal use of said area for parking. \na. The lot area between the right-of-way and the parking setback line shall be screened with landscaped plant material and/or a wall or fence and shall not be paved except for approved walkways, bikeways, driveways, graphics, and other approved amenities and site elements. Note: Vision clearance will be reviewed per Chapter  3312. \nb. In addition, any portion of a parking lot abutting any public street shall be screened for headlights on the perimeter adjacent to the public street. \n3. Parking lot screening shall conform to the following standards: \nFor any buffering or headlight screening, screening shall be provided in a landscaped area at least four feet in width and shall be a total height of no less than three feet above the parking lot grade and to an opacity of not less than 75 percent. For screening with plantings, the opacity shall be determined when plants are in leaf.\n \nSection 5. That Columbus City Code Chapter 3323 is hereby supplemented with the creation of a new section, numbered 3323.25, reading as follows:\n \n3323.25 Historic Preservation - Parking Reduction \nIn recognition of the development pattern associated with this zoning district, and in an effort to preserve the character of the neighborhood while supporting a walkable, mixed use urban environment, the required number of off-street parking spaces shall be reduced in the following manner:\n1. A fifty (50) percent reduction will be applied to the required parking in Chapter 3312.053 for: \na. Any use within a historic building or structure that qualifies for a fifty percent reduction;\nb. Any use within a non-contributing addition or expansion to a historic building or structure, where the historic building or structure qualifies for a fifty percent reduction and where the non-contributing addition or expansion is less than twenty percent (20%) of the overall gross floor area of a qualifying structure, and/or \nc. An outdoor patio or dining area not in excess of 250 square feet that is accessory to a primary use within a historic building or structure that qualifies for a fifty percent reduction.\n2. To qualify for a fifty (50) percent parking reduction, a historic building or structure shall meet the following criteria:\na. The building or structure shall be forty (40) years old or greater; and\nb. For building elevations that are visible from the public right-of-way or a private street the following shall be true: no wall or portion of a wall shall be removed, the building footprint shall not be altered, and the window and door openings shall not be altered; and\nc. At least seventy-five (75) percent of the overall building footprint shall not altered.\n3. A one-hundred (100) percent reduction will be applied to the required parking in Chapter 3312.053 for: \na. Any use within a historic building or structure that qualifies for a one-hundred percent reduction;\nb. Any use within a non-contributing addition or expansion to a historic building or structure, where the historic building or structure qualifies for a one-hundred percent reduction and where the addition or expansion is less than twenty percent (20%) of the overall gross floor area of a qualifying structure, and/or \nc. An outdoor patio or dining area not in excess of 250 square feet that is accessory to a primary use within a historic building or structure that qualifies for a one-hundred percent reduction.\n4. To qualify for a one-hundred (100) percent parking reduction, a historic building or structure will meet the following criteria:\nThe building or structure shall be listed on the Columbus Register of Historic Properties.\n \n \nSECTION 6. That prior existing sections 3323.09, 3323.13, and 3323.21 of the Columbus City Codes are hereby repealed.\n \nSECTION 7. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 18,
    "meeting_date": "2021-06-21",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Grants",
      "Parks & Recreation",
      "Planning & Development"
    ]
  }
}