{
  "success": true,
  "vote": {
    "id": 12206,
    "item_number": "CA-50",
    "title": "To authorize the Director of Development to execute a partial release of the mortgage and restrictive covenant of Bretton Woods Senior Housing Limited Partnership and execute any other documents necessary to accomplish this task.",
    "description": "Explanation\n \nBACKGROUND: This legislation authorizes the Director of the Department of Development to execute a partial release of the mortgage and restrictive covenant from Bretton Woods Senior Housing Limited Partnership.  These documents were executed on August 12, 2021 pursuant to Ordinance numbers 0800-2021 and 1348-2021 which passed on April 26, 2021 and June 7, 2021 respectively.  The City made a loan of $600,000.00 in HOME funds from the Department of Housing and Urban Development for the partial financing of a 62-unit senior affordable housing development located at 2511 Bretton Woods Drive in the Northland community.  This community is complete and is serving the senior population.  In early 2024, National Church Residences which developed and is partial owner of Bretton Woods Senior Housing Limited Partnership obtained financing from the Ohio Housing Finance Agency along with a commitment of City Affordable Housing Bond Funds to construct a second phase of 60 senior units on the same parcel.  Because the second phase will be owned by a separate entity, the City has been requested to do a partial release of that portion of the site that the second phase will be located on.  The City will continue to hold a subordinate mortgage on the site of the first phase and remain compliant with the requirements of the HOME Investment Partnerships Program.  Columbus City Council has approved up to $1,700,000.00 in Affordable Housing Bond Funds for the second phase of the development pursuant to Ord. 1959-2024 passed on July 15, 2024.\nEmergency action is requested to allow the execution of the partial release as part of the closing of the financing for the second phase which is imminent.\nFiscal Impact: None\n \n \nTitle\n \nTo authorize the Director of Development to execute a partial release of the mortgage and restrictive covenant of Bretton Woods Senior Housing Limited Partnership and execute any other documents necessary to accomplish this task; and to declare an emergency. ($0.00) \n \n \n \nBody\n \nWHEREAS, the Department of Development made a loan to Bretton Woods Senior Housing Limited Partnership on August 12, 2021 pursuant to Ord. 0800-2021 and 1348-2021; and\nWHEREAS, this loan was made through the Rental Housing Production and Preservation Program with HOME Investment Partnership Program Funds received from the U. S. Department of Housing and Urban Development; and\nWHEREAS, the loan documents included a mortgage and restrictive covenant on the site of the development; and\nWHEREAS, National Church Residences, which is the developer and partial owner of Bretton Woods Senior Housing Limited Partnership, has been successful in obtaining financing from the Ohio Housing Finance Agency to construct a second phase of the development on the site; and\nWHEREAS, because the second phase will be owned by a separate entity, the developer has requested that the City execute a partial release of its mortgage and restrictive covenant for that portion of the site that the second phase will be located on; and \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to execute a partial release of the existing mortgage so that closing on the second phase of the development may occur allowing construction of the additional housing units to begin, all for the immediate preservation of the public health, peace, property safety and welfare; NOW THEREFORE, \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSection 1. That the Director of Development be and hereby is authorized to execute a partial release of the mortgage and restrictive covenant of Bretton Woods Senior Housing Limited Partnership and execute any other documents necessary to accomplish this task.\nSection 2. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 145,
    "meeting_date": "2025-05-12",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Community Services",
      "Housing",
      "Property & Real Estate"
    ]
  }
}