{
  "success": true,
  "vote": {
    "id": 1221,
    "item_number": "0",
    "title": "To amend the 2020 Capital Improvement Budget; to authorize the transfer of cash and appropriation between projects within the Streets and Highways Bond Fund; to authorize the Director of Public Service Finance and Management to enter into a professional services contract with CHA Consulting, Inc. for the Signals - Downtown Signals Retiming project; to authorize the expenditure of up to $700,000.00 from the Streets and Highways Bond Fund and the Street Construction Maintenance and Repair Fund; and to declare an emergency. ($700,000.00)",
    "description": "Explanation\n \n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Service Finance and Management to enter into professional services contract in the amount of up to $700,000.00 with CHA Consulting, Inc. (“CHA”) for the provision of design and engineering services relative to the Signals - Downtown Signals Retiming project. \nThe intent of the aforementioned project is to provide the Department of Public Service with transportation analysis and traffic modeling for the Downtown area to perform traffic signal retiming tasks.  \nThe Department of Public Service issued a Request for Proposals for the Signals - Downtown Signals Retiming project, which was formally advertised on Vendor Services and Bonfire from March 30, 2021, to April 27, 2021.  The City received five (5) responses, all of which were deemed responsive and were fully evaluated when the Evaluation Committee met on May 6, 2021.\nThe responding firms were:  \nCompany Name                                                               City/State                                          MAJ/MBE/MBR/WBE/F1/AS1/PHC\nCHA Consulting, Inc.                                                               Columbus, Ohio                                                                                    MAJ                     \nAECOM Technical Services, Inc.                     Columbus, Ohio                                                                                    MAJ\nHNTB Ohio, Inc.                                                                Columbus, Ohio                                                                                    MAJ\nGPD Group                                                                                    Columbus, Ohio                                                                                    MAJ\nTEC Engineering, Inc.                                                               Columbus, Ohio                                                                                    WBE\n \nCHA received the highest score conferred by the Evaluation Committee during its deliberation and will be awarded the Signals - Downtown Signals Retiming contract. \nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against CHA. \n2.  CONTRACT COMPLIANCE\nThe contract compliance number for CHA is CC000802, which expires March 26, 2023. \n3.  FISCAL IMPACT\nFunding in the amount of $700,000.00 is available within the Department of Public Service as follows: $350,000.00 in the Streets and Highways Bond Fund and $350,000.00 in the Street Construction Maintenance and Repair Fund.  An amendment to the 2020 Capital Improvement Budget is necessary to provide sufficient budget authority for the appropriate project.  A transfer of cash and appropriation between projects is also needed to align cash and appropriation within the correct project \n4.  EMERGENCY DESIGNATION\nEmergency action is requested to facilitate the execution of the requisite professional services contract as soon as reasonably practicable so as to implement public safety improvements.  \n \n \nTitle\n \nTo amend the 2020 Capital Improvement Budget; to authorize the transfer of cash and appropriation between projects within the Streets and Highways Bond Fund; to authorize the Director of Public Service Finance and Management to enter into a professional services contract with CHA Consulting, Inc. for the Signals - Downtown Signals Retiming project; to authorize the expenditure of up to $700,000.00 from the Streets and Highways Bond Fund and the Street Construction Maintenance and Repair Fund; and to declare an emergency. ($700,000.00)\n \n \n \nBody\n \nWHEREAS, the Department of Public Service is administering the Signals - Downtown Signals Retiming project, which will culminate in the completion of transportation analysis and traffic modeling for the Downtown area necessary to the performance of traffic signal retiming tasks; and \nWHEREAS, the Department of Public Service issued a Request for Proposals for the aforementioned project, which was formally advertised on Vendor Services and Bonfire from March 30, 2021, to April 27, 2021; and \nWHEREAS, CHA Consulting submitted the best overall proposal for the Signals - Downtown Signals Retiming project; and \nWHEREAS, this ordinance authorizes the Director of Public Service Finance and Management to enter into contract with CHA for the provision of design and engineering services necessary to the successful completion of the Signals - Downtown Signals Retiming project; and \nWHEREAS, this ordinance also authorizes the expenditure of up to $700,000.00 to support said contract; and \nWHEREAS, it is necessary to authorize an amendment to the 2020 Capital Improvement Budget for the purpose of providing sufficient spending authority for the aforementioned project expenditure; and\nWHEREAS, it also is necessary to authorize the transfer of cash and appropriation between projects to align cash and appropriation within the correct project; and \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to authorize the Director of Finance and Management to enter into contract with CHA Consulting, Inc. to implement public safety improvements as soon as possible, thereby preserving the public health, peace, property, safety and welfare; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2020 Capital Improvement Budget authorized by Ordinance 2521-2020 be amended as follows to establish sufficient authority for this project:\nFund / Project / Project Name / C.I.B. / Change / C.I.B. as Amended\n7704 / P531053-100000 / Roadway - Dublin Road (US33) Erosion Emergency Repair (Voted Carryover) / $90,000.00 / $13,458.00 / $103,458.00 (to match cash)\n7704 / P540006-100000 / Traffic Maintenance - Commodities (Voted Carryover) / $333,694.00 / ($90,000.00) / $243,694.00 (to match cash)\n \n7704 / P530086-100005 / Intersection Improvements - Livingston Ave. (59-12) (Voted Carryover) / $818.00 / (818.00) / $0.00\n7704 / P530086-100021 / Intersection Improvements - Roberts Road - Frazell Rd and Spindler Rd (Voted Carryover) / $500.00 / ($500.00) / $0.00\n7704 / P530086-100029 / Intersection Improvements - Main Street at McNaughten Road (Voted Carryover) / $7,433.00 / ($7,433.00) / $0.00\n7704 / P530086-100031 / Intersection Improvements - Livingston Avenue at Barnett Road (Voted Carryover) / $12,855.00 / ($12,855.00) / $0.00 \n7704 / P530086-100040 / Intersection Improvements - SR161 North Service Road at Cleveland Avenue (Voted Carryover) / $115,000.00 / ($17,778.00) / $97,222.00\n \n7704 / P540007-100006 / Traffic Signal Installation - Columbus Traffic Signal System Phase D (Voted Carryover) / $69,416.00 / ($69,416.00) / $0.00\n7704 / P540007-100052 / Signal Installation - Antares Avenue at Gemini Place (Voted Carryover) / $31,407.00 / ($31,407.00) / $0.00\n7704 / P540007-100056 / Signal Installation - Westerville Road at Thornapple Dr/Wallingford Avenue (Voted Carryover) / $38,811.00 / ($38,811.00) / $0.00\n \n7704 / P590127-100000 / SSI-OTMP - Group 1A (Voted Carryover) / $2,192.00 / ($2,192.00) / $0.00\n7704 / P771001-100000 / Dominion Homes-NW Corridor (Voted Carryover) / $24,218.00 / ($24,218.00) / $0.00\n7704 / P531053-100000 / Roadway - Dublin Road (US33) Erosion Emergency Repair (Voted Carryover) / $103,458.00 / ($13,458.00) / $90,000.00\n7704 / P530161-100000 / Roadway Improvements (Voted Carryover) / $6,339.00 / ($6,339.00) / $0.00\n7704 / P531005-100000 / Roadway - Nationwide Blvd and Hocking Street (Voted Carryover) / $105,802.00 / ($105,802.00) / $0.00\n7704 / P540003-100003 / Computerized Signals - Traffic Management Center (TMC) Relocation (Voted Carryover) / $10,056.00 / ($10,056.00) / $0.00\n7704 / P530085-100000 / Intersection Improvements - Stelzer Road - Easton Way (Voted Carryover) / $5,773.00 / ($5,773.00) / $0.00\n7704 / P540006-100000 / Traffic Maintenance - Commodities (Voted Carryover) / $243,694.00 / ($3,144.00) / $240,550.00\n \n7704 / P545020-100000 / Signals - Downtown Signals Retiming (Voted Carryover) / $0.00 / $350,000.00 / $350,000.00\nSECTION 2.  That the transfer of $39,384.59, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5913 (Traffic Management), Projects P530086-100005 (Intersection Improvements - Livingston Ave. (59-12)), P530086-100021 (Intersection Improvements - Roberts Road - Frazell Rd and Spindler Rd), P530086-100029 (Intersection Improvements - Main Street at McNaughten Road), P530086-100031 (Intersection Improvements - Livingston Avenue at Barnett Road), and P530086-100040 (Intersection Improvements - SR161 North Service Road at Cleveland Avenue), all in Object Class 06 (Capital Outlay) to Dept-Div 5913 (Traffic Management), P545020-100000 (Signals - Downtown Signals Retiming), Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance. \nSECTION 3.  That the transfer of $139,634.00, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5912 (Design and Construction), Projects P540007-100006 (Traffic Signal Installation - Columbus Traffic Signal System Phase D), P540007-100052 (Signal Installation - Antares Avenue at Gemini Place) and P540007-100056 (Signal Installation - Westerville Road at Thornapple Dr/Wallingford Avenue), all in Object Class 06 (Capital Outlay) to Dept-Div 5913 (Traffic Management), P545020-100000 (Signals - Downtown Signals Retiming), Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\nSECTION 4.  That the transfer of $2,191.04, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5912 (Design and Construction), Project P590127-100000 (SSI-OTMP - Group 1A), Object Class 06 (Capital Outlay) to Dept-Div 5913 (Traffic Management), P545020-100000 (Signals - Downtown Signals Retiming), Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\nSECTION 5.  That the transfer of $24,217.32, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5912 (Design and Construction), Project P771001-100000 (Dominion Homes-NW Corridor), Object Class 06 (Capital Outlay) to Dept-Div 5913 (Traffic Management), P545020-100000 (Signals - Downtown Signals Retiming), Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\nSECTION 6.  That the transfer of $13,458.00, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5913 (Traffic Management), Project P531053-100000 (Roadway - Dublin Road (US33) Erosion Emergency Repair), Object Class 06 (Capital Outlay) to Dept-Div 5913 (Traffic Management), P545020-100000 (Signals - Downtown Signals Retiming), Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\nSECTION 7.  That the transfer of $6,339.00, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5913 (Traffic Management), Project P530161-100000 (Roadway Improvements), Object Class 06 (Capital Outlay) to Dept-Div 5913 (Traffic Management), P545020-100000 (Signals - Downtown Signals Retiming), Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\nSECTION 8.  That the transfer of $105,801.46, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5912 (Design and Construction), Project P531005-100000 (Roadway - Nationwide Blvd and Hocking Street), Object Class 06 (Capital Outlay) to Dept-Div 5913 (Traffic Management), P545020-100000 (Signals - Downtown Signals Retiming), Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\nSECTION 9.  That the transfer of $10,055.43, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5911 (Infrastructure Management), Project P540003-100003 (Computerized Signals - Traffic Management Center (TMC) Relocation), Object Class 06 (Capital Outlay) to Dept-Div 5913 (Traffic Management), P545020-100000 (Signals - Downtown Signals Retiming), Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\nSECTION 10.  That the transfer of $5,772.89, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5912 (Design and Construction), Project P530085-100000 (Intersection Improvements - Stelzer Road - Easton Way), Object Class 06 (Capital Outlay) to Dept-Div 5913 (Traffic Management), P545020-100000 (Signals - Downtown Signals Retiming), Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\nSECTION 11.  That the transfer of $3,146.27, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5913 (Traffic Management), Project P540006-100000 (Traffic Maintenance - Commodities), Object Class 06 (Capital Outlay) to Dept-Div 5913 (Traffic Management), P545020-100000 (Signals - Downtown Signals Retiming), Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\nSECTION 12.  That the Director of Public Service Finance and Management be and is hereby authorized to enter into a professional services contract with CHA Consulting Inc., located at 471 E. Broad Street, Suite 2010, Columbus, Ohio, 43215, relative to the Signals - Downtown Signals Retiming. \nSECTION 13.  That the expenditure of $350,000.00, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5913 Traffic Management), P545020-100000 (Signals - Downtown Signals Retiming), Object Class 06 (Capital Outlay per the accounting codes in the attachment to this ordinance.\nSECTION 14.  That the expenditure of $350,000.00, or so much thereof as may be needed, is hereby authorized in Fund 2265 (Street Construction Maintenance and Repair Fund), Dept-Div 5913 (Traffic Management), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\nSECTION 15.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 16.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\nSECTION 17.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\nSECTION 18.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 19,
    "meeting_date": "2021-06-28",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}