{
  "success": true,
  "vote": {
    "id": 12210,
    "item_number": "SR-2",
    "title": "To authorize the Director of Public Service to enter into a professional services contract with Data Ticket, Inc. relative to the Citation Processing Management System and Permit Management System; to authorize the expenditure of up to $1,500,000.00 from the Mobility Enterprise Operating Fund to pay for this contract; to act in accordance with the provisions of the sole source procurement of Columbus City Code, Chapter 329, for the citation processing management system and permit management system; and to declare an emergency. ($1,500,000.00)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Service to enter into a professional services contract with Data Ticket, Inc. relative to the Citation Processing Management System and Permit Management System.\n \nPursuant to Ordinance 3182-2022, the Department of Public Service, Division of Mobility & Parking Services, formerly known as the Division of Parking Services, engaged Data Ticket to facilitate the development and implementation of the Citation Processing Management System and Permit Management System. The term of that agreement expired in 2024, so Ordinance 1746-2024 was passed to execute a new service contract between the parties. The term of that agreement has recently expired, necessitating the execution of a new service contract between the parties. The intent of this legislation is to provide the Division of Mobility & Parking Services with additional resources necessary to the continued operation of the Citation Processing Management System and Permit Management System.  This legislation seeks to authorize the execution of a one-year service contract between the parties terminating no earlier than March 31, 2026, with annual contract modifications anticipated through 2028.  Data Ticket, Inc. is the sole proprietor and manufacturer of the equipment, expertise, and software needed to manage the citation processing and permit management system, and because support can only be provided by Data Ticket, Inc., this ordinance is submitted in accordance with the provisions of the sole source procurement of Columbus City Codes, Chapter 329, for its parking enforcement operations. \n \n2.  REQUEST FOR SOLE SOURCE PROCUREMENT\nThe Department of Public Service requests that proposed contract be awarded to Data Ticket, Inc. through the sole source provision of Columbus City Codes Chapter 329 as the equipment and support services for the City's citation processing management and permit management systems are proprietary to Data Ticket, Inc. \n \n3.  CONTRACT COMPLIANCE\nData Ticket, Inc.’s contract compliance number is CC042414, which expired July 20, 2024.  The vendor will need to become compliant prior to contract execution.\n \n4.  FISCAL IMPACT\nFunding for this contract is available within Fund 6500, the Mobility Enterprise Operating Fund.  \n \n5. EMERGENCY DESIGNATION\nEmergency action is requested to prevent an interruption in parking enforcement services to ensure the safety of the traveling public.\n \nTitle\nTo authorize the Director of Public Service to enter into a professional services contract with Data Ticket, Inc. relative to the Citation Processing Management System and Permit Management System; to authorize the expenditure of up to $1,500,000.00 from the Mobility Enterprise Operating Fund to pay for this contract; to act in accordance with the provisions of the sole source procurement of Columbus City Code, Chapter 329, for the citation processing management system and permit management system; and to declare an emergency. ($1,500,000.00)\nBody\nWHEREAS, pursuant to Ordinance 1746-2024, the Department of Public Service, Division of Mobility & Parking Services, formerly known as the Division of Parking Services, engaged Data Ticket, Inc. to facilitate the development and implementation of the Citation Processing Management System and Permit Management System; and \n \nWHEREAS, there is a need for the aforementioned parties to enter into a professional services contract to provide for the continuation of Citation Processing Management System and Permit Management System; and\n \nWHEREAS, this agreement is being established in accordance with the sole source provisions of the Columbus City Codes, Chapter 329; and\n \nWHEREAS, because Data Ticket, Inc. is the sole proprietor and manufacturer of the equipment, expertise, and software needed to manage the citation processing and permit management system, and because support can only be provided by Data Ticket, Inc., this ordinance is submitted in accordance with the provisions of the sole source procurement of Columbus City Codes, Chapter 329; and\n \nWHEREAS, it also is necessary to authorize the expenditure of up to $1,500,000.00 from the Mobility Enterprise Operating Fund to pay for the contract; and \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to authorize the Director of Public Service to enter into contract with Data Ticket, Inc. in order to provide continued funding for the Citation Processing Management System and Permit Management System to prevent an interruption in parking enforcement services to ensure the safety of the traveling public, all for the immediate preservation of the public health, peace, property, safety and welfare; and now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Public Service be, and hereby is, authorized to enter into a professional services contract in an amount up to $1,500,000.00 with Data Ticket, Inc., 2603 Main Street, Suite 300, Irvine, California 92614, relative to the Citation Processing Management System and Permit Management System.\n \nSECTION 2.  That the expenditure of $1,500,000.00, or so much thereof as may be needed, is hereby authorized in Fund 6500 (Mobility Enterprise Operating Fund), Subfund 650001 (Mobility Enterprise), Section 3 590603 (Downtown Subfund), Dept-Div 5906 (Public Service - Parking Services), in Object Class 03 (Services) per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That City Council finds that it is in the best interest of the City of Columbus to enter into this multi-year contract based on the sole source provisions of City Code Chapter 329.\n \nSECTION 4.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 145,
    "meeting_date": "2025-05-12",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}