{
  "success": true,
  "vote": {
    "id": 12219,
    "item_number": "SR-11",
    "title": "To authorize the Director of the Department of Development to enter into two separate grant agreement with Legal Aid of Southeast and Central Ohio in a total amount up to $1,475,000.00 to enable the Legal Aid of Southeast and Central Ohio to be the Designated Organization as defined in the Columbus City Codes and to make available free full legal representation to unrepresented tenants facing eviction from their homes at Franklin County Municipal Court with an option to modify and renew for one additional year; to authorize the advancement of funds on a predetermined schedule; to authorize reimbursement of expenses incurred prior to execution of the purchase order; and to authorize a transfer and expenditure of $975,000.00 from the general fund; and to authorize the expenditure of $500,000.00 from within the ERA2 funds. ($1,475,000.00)",
    "description": "Explanation\n \nBACKGROUND:   This legislation authorizes the Director of the Department of Development to enter two separate grant agreement with the Legal Aid of Southeast and Central Ohio, LASCO, in a total amount up to $1,475,000.00, of that amount $975,000.00 will be from the general fund and the remaining $500,000.00 will be from the U.S. Department of Treasury Emergency Rental Assistance 2 (ERA2) funds, to enable the Legal Aid of Southeast and Central Ohio to be the Designated Organization as defined in the Columbus City Codes and to make available free full legal representation to unrepresented tenants facing eviction from their homes at Franklin County Municipal Court.  This agreement includes an option to modify and renew for one additional year, and authorizes expenditures beginning March 1, 2025, and incurred prior to the execution of the purchase order.  Funding will be advanced to the organization on a predetermined schedule.  The Emergency Rental Assistance funding will be expended prior to September 30, 2025.\n \nOrdinance No. 2275-2021 authorized the City of Columbus to accept and appropriate up to $90,537,806.23 of Federal Emergency Rental Assistance 2 (ERA2) program funds, as passed by the Consolidated Appropriations Act of 2021. Columbus received additional Rental Assistance funding from the U.S. Department of Treasury and continues to have a need to provide services and support at eviction court.\n \nEviction filings in Columbus and Franklin County are at an historic high, as the region faces an affordable housing crisis. Evictions have negative effects on both families and the Columbus community. Statistics show overwhelmingly that tenants who have representation have a better chance at remaining in their home. However, the vast majority of low-income households facing an eviction cannot afford an attorney to represent them while property owners are almost always represented. This dynamic makes it difficult for tenants to defend themselves and negotiate an outcome that reduces the impact of the eviction filing on their family. \n \nIn December 2024 the City of Columbus enacted legislation (Ordinance 3510-2024) amending Columbus City Codes (sections 4551.08 and 4551.081) in order to provide access to legal services for low income residents as defined in the Code. The purpose of this grant funding is to enable the Legal Aid of Southeast and Central Ohio to be the Designated Organization as defined in the Columbus City Codes and to make available free full legal representation to unrepresented tenants facing eviction from their homes at Franklin County Municipal Court.\n \nThe Legal Aid of Southeast and Central Ohio (LASCO) offers free noncriminal legal help for people with low incomes, veterans, and seniors in 36 counties. Their mission is to provide civil legal aid and advocacy to overcome unfairness and injustice to reduce poverty and increase opportunity. \n \nLASCO is the primary law firm in central Ohio that provides free legal services to low-income residents facing eviction. These services are primarily provided through the Tenant Advocacy Project (TAP). TAP provides free services from lawyers that are onsite at Eviction Court five days a week to meet with Columbus residents and provide them immediate representation in eviction proceedings. TAP attorneys are available to represent tenants at any stage of the eviction process, including appellate representation. \n \nFISCAL IMPACT:  Funding of $975,000.00 is available within the General Fund, citywide account and $500,000.00 is available within the Emergency Rental Assistance 2 (ERA2) funds.\n \nCONTRACT COMPLIANCE:  The vendor number is 004239 and expires on 01/17/2026.  \n \n \nTitle\n \nTo authorize the Director of the Department of Development to enter into two separate grant agreement with Legal Aid of Southeast and Central Ohio in a total amount up to $1,475,000.00 to enable the Legal Aid of Southeast and Central Ohio to be the Designated Organization as defined in the Columbus City Codes and to make available free full legal representation to unrepresented tenants facing eviction from their homes at Franklin County Municipal Court with an option to modify and renew for one additional year; to authorize the advancement of funds on a predetermined schedule; to authorize reimbursement of expenses incurred prior to execution of the purchase order; and to authorize a transfer and expenditure of $975,000.00 from the general fund; and to authorize the expenditure of $500,000.00 from within the ERA2 funds. ($1,475,000.00)\n \n \nBody\n \nWHEREAS, the Director of the Department of Development is authorized to enter into two separate grant agreement with Legal Aid of Southeast and Central Ohio in a total amount up to $1,475,000.00 to enable the Legal Aid of Southeast and Central Ohio to be the Designated Organization as defined in the Columbus City Codes and to make available free full legal representation to unrepresented tenants facing eviction from their homes at Franklin County Municipal Court with an option to modify and renew for one additional year; and\n \nWHEREAS, to authorize the advancement of funds on a predetermined schedule; to authorize reimbursement of expenses incurred prior to execution of the purchase order; and to authorize a transfer and expenditure in a total amount up to $1,475,000.00, of that $975,000.00 is from the General Fund, citywide account and $500,000.00 is from the Emergency Rental Assistance 2 funds; and\n \nWHEREAS, in December 2024 the City of Columbus enacted legislation (Ordinance 3510-2024) amending Columbus City Codes (sections 4551.08 and 4551.081) in order to provide access to legal services for low-income residents as defined in the Code.; and\n \nWHEREAS, the Legal Aid of Southeast and Central Ohio (LASCO) offers free noncriminal legal help for people with low incomes, veterans, and seniors in 36 counties. Their mission is to provide civil legal aid and advocacy to overcome unfairness and injustice to reduce poverty and increase opportunity; and NOW THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Development is hereby authorized to enter into two separate grant agreement with the Legal Aid of Southeast and Central Ohio in a total amount up to $1,475,000.00 to enable the Legal Aid of Southeast and Central Ohio to be the Designated Organization as defined in the Columbus City Codes and to make available free full legal representation to unrepresented tenants facing eviction from their homes at Franklin County Municipal Court with an option to modify and renew for one additional year.\n \nSECTION 2.                     That expenditures incurred prior to the purchase order, beginning March 1, 2025 and the advancement of funds per a schedule to be included in the agreement is hereby authorized.  The Emergency Rental Assistance 2 Funds will be expended prior to September 30, 2025 period of performance.  \n \nSECTION 3.  That the Auditor is hereby authorized and directed to transfer the sum of $975,000.00 within Fund 1000 (General Fund) from Dept-Div 45-01 (Financial Management), Object Class 10 (Transfer Out Operating), to Dept-Div 44-01 (Administration), in object class 05 (Other) per the account codes in the attachment to this ordinance.\nSECTION 4. That for the purpose as stated in Section 1, the expenditure of $975,000.00, or so much thereof as may be necessary, is hereby authorized within Fund 1000 (General Fund), Dept-Div 44-01 (Administration), in object class 05 (Other) per the accounting codes in the attachment to this ordinance.\nSECTION 5. That for the purpose as stated in Section 1, the expenditure of $500,000.00, or so much thereof as may be necessary, is hereby authorized within Fund 2208 (Emergency Rental Assistance Fund), Dept-Div 44-10 (Housing), in object class 05 (Other) per the accounting codes in the attachment to this ordinance.\n \nSECTION 6.  That the funds necessary to carry out the purpose of this Ordinance are deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 7.  That the City Auditor is authorized to make any necessary accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 8.  That this agreement is awarded pursuant to the relevant provisions of Columbus City Code related to awarding grant agreements.\n \nSECTION 9.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 145,
    "meeting_date": "2025-05-12",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Appointments",
      "Budget & Finance",
      "Contracts & Agreements"
    ]
  }
}