{
  "success": true,
  "vote": {
    "id": 12218,
    "item_number": "SR-10",
    "title": "To authorize the Director of Public Utilities to enter into contract with Utility Service Partners Private Label dba Homeserve to allow Homeserve to market water and sewer line protection plans to customers served by the City of Columbus Department of Public Utilities; and to declare an emergency.  ($0.00)",
    "description": "Explanation\n1.  BACKGROUND\nThe purpose of this ordinance is to authorize the Director of the Department of Public Utilities (DPU) to enter into a contract through the City’s Request for Proposal process with Utility Service Partners Private Label dba Homeserve (hereafter referred to as Homeserve) to allow Homeserve to market water and sewer line protection plans to customers served by the City of Columbus Department of Public Utilities.  This contract is at no cost to the City. \n \nThis contract will allow Homeserve to market water and sewer line protection products to the customers of the Department of Public Utilities.  Customers may voluntarily enroll with Homeserve to acquire insurance for their water and/or sewer line at a low monthly cost. This helps protect the customer from unexpected construction costs related to the repair or replacement of a private side water or sewer line. All administrative and marketing tasks will be handled exclusively by Homeserve.  In addition, Homeserve will establish a program to assist low-income customers with the replacement of galvanized water service lines, which will help offset costs to DPU’s Lead Service Line Replacement Program.  \n \nTIMELINE & FUTURE MODIFICATION(S):  \nThis contract will begin in late spring 2025 with an initial term of five years.  The contract has seven optional annual renewals after the initial five-year term.   The contract, if all renewal options are exercised, will expire in 2037.\n \nESTIMATED COST OF PROJECT:  \nThere is no cost to the City related to this contract.  The City is not paying Homeserve to perform these services.\n \n2.  ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT  \nThis contract will protect DPU customers from unexpected construction costs related to the repair or replacement of a private side water or sewer line.  \n \n3.  BID INFORMATION \nThis project was formally advertised on the Vendor Services and Bonfire websites and opened 10/1/24.   Five proposals were received:\n \nName                                                       C.C. No.                             Exp. Date                     City/State                              Status  \nHomeserve                                               CC-046662        09/18/25             Norwalk, CT              MAJ\nAmerican Water Resources                     CC-025195        Expired              Mount Laurel, NJ       MAJ\n \nHomeserve’s certification was in good standing at the time of the contract award.\n \n4.  CONTRACT COMPLIANCE INFORMATION\nHomeserve’s contract compliance number is CC046662 and expires 9/18/25.  \n \n5.  MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract opportunity was not submitted to the City’s Office of Diversity and Inclusion (ODI) for review and assignment of an MBE/WBE goal prior to bidding.  This contract will be a no cost contract to the City and is not subject to the requirements of the City’s diversity program.\n \n6.  FISCAL IMPACT  \nThere is no fiscal impact as this is a no cost contract.\n \n7.  EMERGENCY DESIGNATION\nEmergency action is requested.  This contract will provide coverage to customers with galvanized and lead water lines.  The City is under a Federal mandate to replace these types of water lines at City cost by 2037.  Lines covered by this contract will be replaced by Homeserve at Homeserve’s cost if they break instead of the City having to pay to replace them.  The sooner the contract is implemented, the sooner DPU customers and the City can save money on repairing/replacing lines when they break. \n \nTitle\nTo authorize the Director of Public Utilities to enter into contract with Utility Service Partners Private Label dba Homeserve to allow Homeserve to market water and sewer line protection plans to customers served by the City of Columbus Department of Public Utilities; and to declare an emergency.  ($0.00)\n \nBody\nWHEREAS, the Department of Public Utilities is under a Federal mandate to replace galvanized and lead water lines by 2037 at City expense; and \n \nWHEREAS, a water and sewer line protection program will save Department of Public Utilities (DPU) customers substantial construction costs if they have a break in a line; and\n \nWHEREAS, DPU is currently unaware of which customers have galvanized and lead water lines as DPU has never been involved in the installation and repair of water lines on private property; and \n \nWHEREAS, DPU customers are also mostly unaware of the type of water line that services their property; and \n \nWHEREAS, galvanized and lead water lines covered by the Homeserve program that break before the City replaces them will be replaced at by Homeserve at no cost to the City; and\n \nWHEREAS; Homeserve will establish a program to help pay for coverage of low-income households that have galvanized and lead water line breaks; and\n \nWHEREAS, it necessary to authorize the Director of the Department of Public Utilities to enter into contract for Water and Sewer Line Protection Program Services with Homeserve to be able to offer water and sewer line protection to DPU customers; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Utilities in that it is immediately necessary to authorize the Director of Public Utilities to enter into contract with Homeserve to market water and sewer line protection services to DPU customers, reducing the cost to replace/repair broken lines to DPU customers and the City, all for the immediate preservation of the public health, peace, property, welfare, and safety, and now, therefore: \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Utilities be and is hereby authorized to enter into a contract with Utility Service Partners Private Label, Inc. dba Homeserve, 45 Glover Ave., 6th Floor\nNorwalk, CT 06850, for Water and Sewer Line Protection Program Services for the Division of Water.\n \nSECTION 2.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after the passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 145,
    "meeting_date": "2025-05-12",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Emergency Services",
      "Infrastructure"
    ]
  }
}