{
  "success": true,
  "vote": {
    "id": 12233,
    "item_number": "CA-2",
    "title": "To authorize the Director of the Department of Technology to renew a contract with 3SG Plus, LLC, a dealer of Hyland OnBase Software, on behalf of various city departments, for maintenance and support of the OnBase Software; to authorize the total expenditure of $233,597.25 from the Department of Technology, Information Services Operating Fund; and to declare an emergency. ($233,597.25)",
    "description": "Explanation\n \nThis ordinance authorizes the Director of the Department of Technology to renew a contract with 3SG Plus, LLC, a dealer of Hyland OnBase Software, for licensing, training and professional services for OnBase Enterprise Information Software.\n \nOnBase is a document and data management tool, used by multiple city agencies for a variety of purposes. User departments include Building and Zoning Services, Public Health, Public Utilities, Development, Public Service, Recreation and Parks, Technology, and Human Resources.  This contract will provide software support and licensing renewal, train city personnel for best use cases and provide change management consultation and other services as outlined in the statement of work.\n \nOrdinance 2335-2024 authorized the Director of the Department of Technology to enter into contract with 3SG Plus LLC. The Department of Technology solicited Requests for Proposals for the OnBase Enterprise Information Software as RFQ026756.  This initial contract included four renewal options, pending authorization by City Council. The initial contract included professional, consulting, and training services. Subsequent renewals also include licensing. \n \nThis ordinance authorizes the first renewal option for training and professional services.  It also authorizes the initial licensing option of five (5) licensing options. The term of the contract will be one year, beginning on July 1, 2025 and ending on June 30, 2026 for the contract amount of $233,597.25, which includes $174,597.25 for maintenance, $9,000.00 for training, and $50,000.00 for professional services.  \n \nThis ordinance also includes an extension of PO468783 which currently expires on September 26, 2025, for an additional 12 months until September 26, 2026.  Work that was planned for the end of 2024 was delayed and will delay the payment of funds set aside for this project.\n \n1.1 Amount of additional funds to be expended\nThe original contract amount:                            $165,593.00   (PO468783, Ord. 2335-2024)\nOptional renewal #1:                                                                      $233,597.25   (This ordinance)\nTOTAL RENEWALS: $399,190.25\nCONTRACT COMPLIANCE\nVendor: 3SG Plus, LLC\nDAX Vendor Acct. #: 019867\nExpiration Date: 10/31/2025\nFISCAL IMPACT\nFunds for this contract renewal are budgeted and available in the Information Services Operating Fund.\nEMERGENCY\nEmergency designation is sought to ensure that the noted contract is in place by the expiration date. Expiration of the contract would cause various departments to lose access to the OnBase application, critical for daily operations.\n \nTitle\n \nTo authorize the Director of the Department of Technology to renew a contract with 3SG Plus, LLC, a dealer of Hyland OnBase Software, on behalf of various city departments, for maintenance and support of the OnBase Software; to authorize the total expenditure of $233,597.25 from the Department of Technology, Information Services Operating Fund; and to declare an emergency. ($233,597.25)\nBody\n \nWHEREAS, the Department of Technology seeks to continue to receive OnBase Enterprise Information Software, for licensing, training and professional services on behalf of the Departments of Building and Zoning Services, Public Health, Public Utilities, Public Service, and Human Resources; and\nWHEREAS, the Department of the Technology solicited Requests for Proposals for the OnBase Enterprise Information Software as RFQ026756 for professional, consulting, licensing, and training services; and\nWHEREAS, Ordinance 2335-2024 authorized the Director of the Department of Technology to enter into contract with 3SG Plus LLC who scored the highest by the evaluation committee; and \nWHEREAS, the above-mentioned contract authorized four one-year renewals; and\nWHEREAS, this ordinance authorizes the Department of Technology the first renewal option for training and professional services.  It also authorizes the initial licensing option.  \nWHEREAS, the term of the contract will be one year, beginning on July 1, 2025, and ending on June 30, 2026, for the contract amount of $233,597.25; and\nWHEREAS, this ordinance also includes an extension of PO468783 which currently expires on September 26, 2025, for an additional 12 months until September 26, 2026; and \nWHEREAS, an emergency exists in the Department of Technology in that it is immediately necessary to authorize the Director of the Department of Technology to renew a contract with 3SG Plus, LLC for maintenance and support of OnBase Software as the expiration of the contract would cause various departments to lose access to the OnBase application, critical for daily operations, all for the immediate preservation of the public health, peace, property, safety and welfare; and NOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1. That the Director of the Department of Technology be and is hereby authorized to renew a contract with 3SG Plus, LLC for licensing, training, and professional services for OnBase Enterprise Information Software, for a period of one year, beginning on July 1, 2025 and ending on June 30, 2026 for the contract amount of $233,597.25.\nSECTION 2. That the total expenditure $233,597.25, or so much thereof as may be necessary, is authorized to be expended as follows in the attachment to this ordinance. (See 0880-2025EXP)\nSECTION 3.  That the Director of the Department of Technology be and is hereby authorized to extend the existing agreement with 3SG Plus, LLC through the extension of PO468783 for an additional 12 months to September 26, 2026.\nSECTION 4. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \nSECTION 5. That the funds necessary to carry out the purpose of this ordinance are deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\nSECTION 6. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 146,
    "meeting_date": "2025-05-19",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}