{
  "success": true,
  "vote": {
    "id": 12261,
    "item_number": "CA-30",
    "title": "To authorize the Director of Finance and Management to associate all General Budget reservations resulting from this ordinance with the appropriate Universal Term Contract Purchase Agreement for the purchase of Bill Presentment Services with Level One, LLC for the Division of Power, the Division of Water, and the Division of Sewerage and Drainage; and to authorize the expenditure of $800,000.00 from the Power Operating Fund, Water Operating Fund, Sewer Operating Fund, and Stormwater Operating Fund. ($800,000.00)",
    "description": "Explanation\n \nBACKGROUND: This legislation authorizes the Finance and Management Director to associate all General Budget reservations resulting from this ordinance with the following Universal Term Contract Purchase Agreement listed below for Bill Presentment Services for the Department of Public Utilities Call Center.\n \nUNIVERSAL TERM CONTRACT PURCHASE AGREEMENT:\n \nPA007021 - Bill Presentment Services UTC - expires 1/31/2026\n \nSupplier:  Level One, LLC Vendor# 001000, (MAJ) expiration, pending.\n \nThe company is not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.\n \nFiscal Impact:  $800,000.00 is budgeted in object class 03 Services and needed for this purchase.  \n \n$1,170,000.00 was spent in 2024\n$1,292,511.65 was spent in 2023\n \nTitle\n \nTo authorize the Director of Finance and Management to associate all General Budget reservations resulting from this ordinance with the appropriate Universal Term Contract Purchase Agreement for the purchase of Bill Presentment Services with Level One, LLC for the Division of Power, the Division of Water, and the Division of Sewerage and Drainage; and to authorize the expenditure of $800,000.00 from the Power Operating Fund, Water Operating Fund, Sewer Operating Fund, and Stormwater Operating Fund. ($800,000.00)\n \nBody\n \nWHEREAS, the Purchasing Office established a Universal Term Contract for the purchase of Bill Payment Services; and\n \nWHEREAS, the expenditure of $800,000.00 or so much thereof is needed for the purchase of the Bill Presentment Services; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities to authorize funding and to authorize the Director of Finance and Management to associate all general budget reservations resulting from this ordinance with the appropriate current Universal Term Contract Purchase Agreement for the Bill Presentment Services; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Finance and Management be and is hereby authorized to associate all General Budget Reservations resulting from this ordinance with the appropriate Universal Term Contract Purchase Agreement for the purchase of Bill Presentment Services for the Division of Power, the Division of Water, and the Division of Sewerage and Drainage. The current vendor is as follows:\n \nLevel One, LLC, Vendor #001000\nPA007021 - Bill Presentment Services UTC - expires 1/31/2026\n \nSECTION 2.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 3.  That the expenditure of $800,000.00, or so much thereof as may be needed, is hereby authorized in Fund 6300 (Power Operating), Fund 6000 (Water Operating), Fund 6100 (Sewerage Operating), and Fund 6200 (Stormwater Operating) in object class 03 Services per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 146,
    "meeting_date": "2025-05-19",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}