{
  "success": true,
  "vote": {
    "id": 12297,
    "item_number": "CA-10",
    "title": "To authorize the Director of the Department of Technology to renew a contract with Blue Apple Technologies, LLC for the purchase of Splunk software maintenance and support services; to authorize the expenditure of $106,014.91 from the Department of Technology, Information Services Operating fund; and to declare an emergency. ($106,014.91)",
    "description": "Explanation\n \nBACKGROUND\n \nThis ordinance authorizes the Director of the Department of Technology (DoT) to renew the contract with Blue Apple Technologies, LLC for the purchase of Splunk software maintenance and support services for a total cost of $106,014.91.\n \nThe Department of Technology uses Splunk software for continuous monitoring of computer systems for security and operational information and events, for after-the-fact investigation of computer system events and to meet compliance requirements for system auditing. \nOrdinance 1324-2024 authorized the Director of the Department of Technology to enter into a contract with Blue Apple Technologies, LLC for the purchase of Splunk software maintenance and support services. The contract was advertised through Vendor Services as RFQ027063, and awarded to Blue Apple Technologies, LLC, who was the lowest bidder. This original contract established and authorized contract language allowing for four (4) mutually agreed upon one (1) year renewal options with the approval of City Council. This ordinance represents the first renewal option authorizing contracting with Blue Apple Technologies, LLC, for Splunk software maintenance and support services.\n \nThis ordinance authorizes the first renewal at a total cost $106,014.91 for a period of twelve (12) months, starting on July 21, 2025, and ending on July 20, 2026.\n \n1.1 Amount of additional funds to be expended\nThe original contract amount:                            $111,133.66     (PO453726, Ord. 1324-2024)\nOptional renewal #1:                                                                      $106,014.91   (This ordinance)\n \nTOTAL RENEWALS: $217,148.57\n \nFISCAL IMPACT: \n \nThe funds for this expenditure have been identified and are available within the Department of Technology, Information Services Division, Information Services Operating Fund for a total cost of $106,014.91.\n \nEMERGENCY DESIGNATION\nEmergency designation is being requested for these services that are necessary to support daily operation activities, to ensure no service interruption, and to establish a purchase order at the earliest possible date.\n \nCONTRACT COMPLIANCE:\nVendor Name: Blue Apple Technologies, LLC\nVendor Acct. #: 001102 (MBE)\nCC-001102; Expiration Date 7/16/2025\nMBE-001102; Expiration Date 6/10/2026\n \nTitle\n \nTo authorize the Director of the Department of Technology to renew a contract with Blue Apple Technologies, LLC for the purchase of Splunk software maintenance and support services; to authorize the expenditure of $106,014.91 from the Department of Technology, Information Services Operating fund; and to declare an emergency. ($106,014.91)\nBody\n \nWHEREAS, the Department of Technology has a need for Splunk software maintenance and support services; and  \n \nWHEREAS, the Department of Technology uses Splunk software for centralized collection and monitoring of computer system audit logs supporting the detection and after-the-fact investigation of security events and to meet related compliance requirements; and\nWHEREAS, DoT solicited bids via RFQ027063 for the purchase of the above-described software support. and award is to be made to Blue Apple Technologies, LLC as the lowest, most responsive bidder; and\nWHEREAS, the contract established and authorized contract language allowed for four (4) mutually agreed upon one (1) year renewals with the approval of City Council. This ordinance authorizes the first of the four annual renewal options; and\n \nWHEREAS, this ordinance authorizes the Director of the Department of Technology (DoT) to renew a contract with Blue Apple Technologies, LLC for the purchase of Splunk software maintenance and support services at a cost of $106,014.91; and\nWHEREAS, the term of this agreement shall be from July 21, 2025, to July 20, 2026.  This agreement is not subject to automatic renewal.  However, upon mutual agreement, to include same pricing and terms and conditions as those set forth, the services may be continued for four additional one-year terms; and\nWHEREAS, an emergency exists in the usual daily operation of the Department of Technology in that it is immediately necessary to authorize the Director of the Department of Technology to renew a contract with Blue Apple Technologies, LLC in order to provide funding for Splunk software maintenance and support services to ensure no service interruption, all for the immediate preservation of the public health, peace, property, safety, and welfare; and NOW, THEREFORE:\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1. To authorize the Director of the Department of Technology to renew a contract with Blue Apple Technologies, LLC for the purchase of Splunk software maintenance and support at a cost of $106,014.91, for a one (1) year term, starting on July 21, 2025, and ending July 20, 2026.\nSECTION 2. That the expenditure of $106,014.91, or so much thereof as may be necessary, is hereby authorized to be expended as shown in the attachment to this ordinance. (Please see 1254-2025 EXP)\nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\nSECTION 5.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 147,
    "meeting_date": "2025-06-02",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}