{
  "success": true,
  "vote": {
    "id": 12295,
    "item_number": "CA-8",
    "title": "To authorize the Director of the Department of Finance and Management to execute those documents necessary to enter into a Lease Agreement for a 10-year term between the City of Columbus and the Columbus Ohio Fire Fighters Museum, Inc. for city-owned property located at 260 North Fourth Street, Columbus, Ohio.",
    "description": "Explanation\n \nBackground: This legislation authorizes the Director of the Department of Finance and Management, to execute those documents necessary to enter into a lease agreement by and between the City of Columbus and the Columbus Ohio Fire Fighters Museum, Inc. (“Fire Museum”) for the city-owned property located at 260 North Fourth Street, Columbus, Ohio for a term of 10 years with an option to renew the lease for an additional 10 years. \n \nPursuant to previous ordinances, numbers 304-83, 142-88, and 316-95, the City and Columbus Ohio Fire Fighters Museum, Inc. entered into lease agreements for the property at 260 North Fourth Street, Columbus, Ohio, which was to be developed into an operating and functioning museum open for public use.  These previous lease agreements automatically terminated when the museum failed to open in the time frame dictated by the lease.  At this time the City of Columbus and Columbus Ohio Fire Fighters Museum, Inc. desire to enter into a new lease agreement for the property, which as of October 2002 has been operating and functioning as a museum open to the public. \n \nFiscal Impact: The City will receive annual lease income of $1.00 that will be deposited in the General Fund.\n \nTitle\n \nTo authorize the Director of the Department of Finance and Management to execute those documents necessary to enter into a Lease Agreement for a 10-year term between the City of Columbus and the Columbus Ohio Fire Fighters Museum, Inc. for city-owned property located at 260 North Fourth Street, Columbus, Ohio.\n \nBody\n \nWHEREAS, the City is the owner of certain real property located on at 260 North Fourth Street, Columbus, Ohio; and\n \nWHEREAS, pursuant to previous ordinances, numbers 304-83, 142-88, and 316-95, the City agreed to lease the property for a term of 99 years to Columbus Ohio Fire Fighter’s Museum, Inc. for the purpose of operating and maintaining a museum; and\n \nWHEREAS, each lease, including the most recent, between the City and Columbus Ohio Fire Fighter’s Museum, Inc. had automatically terminated for failure by the Fire Museum to be timely opened and operating thus necessitating the need for a new lease; and\n \nWHEREAS, the conditions and terms of the leases authorized by ordinances numbers 304-83, 142-88, and 316-95 were not met and it is now necessary to authorize the City and the Columbus Ohio Fire Fighters Museum, Inc.  to enter into a new lease agreement for the property located at 260 North Fourth Street, for a term of 10 years with an option to renew the lease for an additional 10 years; and\n \nWHEREAS, after investigation by the City, it has been determined that the lease shall not adversely affect City operations of the Department of Public Safety and with its concurrence; and\n \nWHEREAS, it is necessary in the usual daily operation of the Department of Finance and Management to authorize the Director to execute, on behalf of the City, those documents necessary to enter into a lease agreement with the Columbus Ohio Fire Fighters Museum, Inc. for city-owned property located at 260 North Fourth Street, Columbus, Ohio; now, therefore;\n \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSection 1. That the Director of the Department of Finance and Management be, and hereby is, authorized to execute those documents, as approved by the Department of Law, Division of Real Estate, necessary to enter into a lease agreement by and between the City of Columbus and the Columbus Ohio Fire Fighters Museum, Inc. for the lease of city-owned property located at 260 North Fourth Street, Columbus, Ohio for a term of 10 years with an option to renew the lease for an additional 10 years.\n \nSection 2. That the terms and conditions of the Lease Agreement shall be in a form approved by the Department of Law, Division of Real Estate. \n \nSection 3.                      That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 147,
    "meeting_date": "2025-06-02",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Emergency Services",
      "Property & Real Estate"
    ]
  }
}