{
  "success": true,
  "vote": {
    "id": 12308,
    "item_number": "CA-21",
    "title": "To appoint a Board of Revision to hear the objections to the proposed assessments as part of the reauthorization of the 5th Avenue and 4th Street Special Improvement District, the University District Special Improvement District, and/or Franklinton Special Improvement District; and to declare an emergency.",
    "description": "Explanation\n \nThe purpose of this ordinance is to establish a Board of Revision to hear any objections to assessments associated with the 5th Avenue and 4th Street Special Improvement District, the University District Special Improvement District, and/or Franklinton Special Improvement District reauthorization process. \nAs part of the Special Improvement District (SID) reauthorization process, four pieces of legislation are passed upon Council’s receipt of a valid petition for reauthorization. The third of the four pieces of legislation declares the necessity of the SID’s proposed plan of services and instructs the petitioner to submit to the City Clerk a list of proposed assessments for properties included in the proposed SID. Properties included in the proposed SID are given a two-week window to object to the calculation of the proposed assessment. The objections are heard by a Board of Revision which submits its findings to City Council for approval in the fourth and final piece of legislation.\nThis legislation establishes the Board of Revision for the reauthorization process for the three SIDs listed in the first paragraph.\nEmergency action is requested so that the reauthorization process can be completed on time and in compliance with Ohio Revised Code and the Franklin County Auditor’s processes.\n \nTitle\n \nTo appoint a Board of Revision to hear the objections to the proposed assessments as part of the reauthorization of the 5th Avenue and 4th Street Special Improvement District, the University District Special Improvement District, and/or Franklinton Special Improvement District; and to declare an emergency.\n \nBody\n \nWHEREAS, Council has approved two of four pieces of legislation associated with the reauthorization processes for the 5th Avenue and 4th Street Special Improvement District, the University District Special Improvement District, and Franklinton Special Improvement District;\nWHEREAS, Council is considering the passage of the third piece of legislation in this process on the June 2, 2025, agenda;\nWHEREAS, should a property owner object to a proposed assessment, Columbus City Charter section 172 calls for a Board of Revision, appointed by Council to hear such objections; \nWHEREAS, an emergency exists in the usual daily operation of the City in that it is immediately necessary for Council to establish a Board of Revision to hear objections to assessments associated with the 5th Avenue and 4th Street Special Improvement District and the University District Special Improvement District and/or Franklinton Special Improvement District reauthorization process in accordance with Columbus City Charter Section 172, the Ohio Revised Code and Franklin County Auditor's Office process, all for the immediate preservation of the public heal, peace, property, safety and welfare; NOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1. That Kathy Green, Beth Menduni, and Ellen Harvey, disinterested freeholders of the City of Columbus, Ohio be and hereby are appointed to a Board of Revision to hear all objections to the proposed assessments for the 5th Avenue and 4th Street Special Improvement District, the University District Special Improvement District, and/or Franklinton Special Improvement District reauthorization process.\nSECTION 2. That Kim Knights, disinterested freeholder of the City of Columbus, Ohio be and hereby is appointed to a Board of Revision as an alternate to hear all objections to the proposed assessments for the 5th Avenue and 4th Street Special Improvement District, the University District Special Improvement District, and/or Franklinton Special Improvement District reauthorization process.\nSECTION 3. That said hearings for this Board of Revision shall be held at 4 PM on Thursday, July 10th, at 111 North Front St., Room 823, Columbus, Ohio 43215.\nSECTION 4.  That said Board shall report to Council its findings, if any, of the proposed assessments.\nSECTION 5.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this resolution is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 147,
    "meeting_date": "2025-06-02",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Appointments",
      "Emergency Services"
    ]
  }
}