{
  "success": true,
  "vote": {
    "id": 12341,
    "item_number": "CA-54",
    "title": "To authorize the Director of Development to modify a contract with Blind Eye Restoration LLC to increase funding and to expand the scope services to provide maintenance and repair for 48 additional art pieces; to authorize the expenditure of $95,400.00 from the 2025 General Fund Budget; and to declare an emergency. ($95,400.00)",
    "description": "Explanation\n \nThis legislation authorizes the Director of the Department of Development to modify a contract with Blind Eye Restoration LLC and change the scope to provide maintenance and repair for new art pieces, and to increase the amount by $95,400.00 for the additional art maintenance and repair services.  \n \nOriginal contract amount                     $      6,750.00                     PO458486\nMOD No. 1 amount                             $    95,400.00                     \nTotal contract amount                          $  102,150.00                     \n \nIn accordance with C.C. 329.09(a): \n1.                     The amount of additional funds being requested under this modification is $95,400.00.\n2.                     The need for additional services was unforeseen at the time the initial contract was awarded, but a legislative modification is required by operation of C.C. 329.09(b).\n3.                     It is in the City’s best interest to continue with the Blind Eye Restoration LLC current contract as they are a local, female owned restoration company who has conducted restoration work on the City's art pieces since 2019.The Department of Development advertised RFQ027610 on Vendor Services in April and May of 2024 for these services.  Five bids were received, and the Director of Development entered into contract with the lowest bidder under the authority of Columbus City Code Section 329.19.  For the original contract, the contract period is from the date of approval of the purchase order to February 28th, 2026, with an option to renew for one (1) additional year, starting March 1, 2026.  \n4.                     The price for the additional services in this modification was determined be a review of the additional art pieces by the vendor, with guidance from the Division of Planning staff.  \n \nBlind Eye Restoration LLC is a local, female owned restoration company who has conducted restoration work on the City's art pieces since 2019. They most recently executed a contract for restoration on 5 pieces, due to the high quality of work they have conducted, Planning is looking to extend their current contract to add 48 additional art pieces for restoration.\n \nEmergency action is requested in order to add additional funding and services now, during the early Spring season when repairs and maintenance on these pieces are best suited.\n \nFISCAL IMPACT:  Funding is available within the Department of Development Planning Division’s 2025 general fund budget. \n \nCONTRACT COMPLIANCE:  the vendor number is 027939 and expires 6/28/2026.\n \nTitle\n \nTo authorize the Director of Development to modify a contract with Blind Eye Restoration LLC to increase funding and to expand the scope services to provide maintenance and repair for 48 additional art pieces; to authorize the expenditure of $95,400.00 from the 2025 General Fund Budget; and to declare an emergency. ($95,400.00)\n \nBody\n \nWHEREAS, this legislation authorizes the Director of the Department of Development to modify a contract with Blind Eye Restoration LLC to expand the scope of services to include 48 additional art pieces to be repaired and maintained per the contract, and to add additional funding in the amount by $95,400.00 and authorize the expenditure in this amount, for the additional art maintenance and repair services.  \n \nWHEREAS, the Department of Development advertised RFQ027610 on Vendor Services in April and May of 2024 for these services.  Five bids were received, and the Director of Development entered into contract with the lowest bidder under the authority of Columbus City Code Section 329.19; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to authorize the Director to enter into a contract modification with Blind Eye Restoration, LLC to increase funding and to expand the scope of services to include maintenance and repair for 48 additional art pieces during the early Spring season when repairs and maintenance on the art pieces is best suited; and to continue program services without interruption, all for the immediate preservation of the public health, peace, property, safety and welfare; and now, therefore\n  \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Development be and is hereby authorized to modify a contract with Blind Eye Restoration LLC to increase funding in the amount by $95,400.00 for art maintenance and repair services and to expand the scope of services to provide maintenance and repair for 48 additional art pieces.\n \nSECTION 2.  That for the purpose as stated in Section 1, the expenditure of $95,400.00 or so much thereof as may be needed, is hereby authorized in Fund 1000 (General Fund), Dept-Div 4406 (Planning Division), object class 03 (Services) per the account codes in the attachment to this ordinance.\nSECTION 3.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this Ordinance and the City Auditor shall establish such accounting codes as necessary.\nSECTION 4.  That the City Auditor is authorized to establish such accounting codes as necessary, to make any accounting changes to revise the funding source for all agreements, contracts, or modifications associated with this Ordinance. \n \nSECTION 5.  That this modification is made in accordance with the relevant provisions of the City Code Charter 329 relating to contract modifications. \n \nSECTION 6.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 147,
    "meeting_date": "2025-06-02",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}