{
  "success": true,
  "vote": {
    "id": 12340,
    "item_number": "CA-53",
    "title": "To authorize the Director of the Department of Public Utilities to pay the State of Ohio Treasurer, Department of Natural Resources, for operation and maintenance services and water entitlement costs for withdrawing water from the Alum Creek Reservoir for the Division of Water; to authorize the expenditure of $982,089.48 from the Water Operating Fund; and to declare an emergency. ($982,089.48)",
    "description": "Explanation\n \nBACKGROUND:  The City of Columbus has an agreement with the State of Ohio, Department of Natural Resources allowing the Division of Water to withdraw water from Alum Creek Reservoir, Storage Space #1 and #2 and to pay the State of Ohio, Department of Natural Resources a prorated share of the operation and maintenance costs.  This agreement was entered into by the authority of Ordinance 1663-71, passed on November 15, 1971.  An annual payment is needed to keep the agreement in effect.  \n \nSUPPLIER:\nTreasurer, State of Ohio V#006219 (Ohio Department of Natural Resources Division of Water Resources section)\nFISCAL IMPACT: This is an annual expenditure and the Division of Water has allocated funds for this purpose in the 2025 Water Operating Fund Budget.\n \n$2,329,360.07 was expended for this purpose during 2024\n$1,387,361.59 was expended for this purpose during 2023\n \n \nEMERGENCY DESIGNATION:  This ordinance is being submitted as an emergency measure in order to meet the payment deadline of May 31, 2025.\n \nTitle\n \nTo authorize the Director of the Department of Public Utilities to pay the State of Ohio Treasurer, Department of Natural Resources, for operation and maintenance services and water entitlement costs for withdrawing water from the Alum Creek Reservoir for the Division of Water; to authorize the expenditure of $982,089.48 from the Water Operating Fund; and to declare an emergency. ($982,089.48)\n \nBody\n \nWHEREAS, Ordinance Number 1663-71, which passed November 15, 1971, authorized the City of Columbus and the State of Ohio, Department of Natural Resources, to enter into an agreement permitting the City of Columbus to withdraw raw water from Alum Creek Reservoir and to pay the State a prorated share of the operation and maintenance costs, and\n \nWHEREAS, this Ordinance authorizes the expenditure of $982,089.48, or so much thereof as may be needed, from the Water Operating Fund, and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Utilities in that it is immediately necessary to authorize the Director of Public Utilities to pay the State of Ohio Treasurer, Department of Natural Resources for operation and maintenance services and water entitlement costs for withdrawing water from the Alum Creek Reservoir, for the immediate preservation of the public health, peace, property, and safety; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Public Utilities be and is hereby authorized to pay the State of Ohio Treasurer, Department of Natural Resources, for operation and maintenance costs for water entitlement from storage spaces #1 and #2 at Alum Creek Reservoir as authorized by an agreement between the City and the State of Ohio.\n \nSECTION 2.  That the expenditure of $982,089.48 or as much thereof as may be needed is hereby authorized in Fund 6000 Water Operating Fund object class 03 Services per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4. That for reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 147,
    "meeting_date": "2025-06-02",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services",
      "Infrastructure"
    ]
  }
}