{
  "success": true,
  "vote": {
    "id": 1237,
    "item_number": "CA-12",
    "title": "To authorize the Director of Public Utilities to enter into a construction contract with Quality Lines, Inc. for the 2021 Division of Power General Construction Project in the amount up to  $491,607.50; to authorize an expenditure of up to $2,000.00 from the Electricity G.O. (General Obligation) Bonds Fund 6303 for prevailing wage services to the Department of Public Service, to authorize a transfer of up to $493,607.50 and an expenditure of up to  $493,607.50 from the 2020 Electricity G.O. (General Obligation) Bonds Fund, and to authorize an amendment to the 2020 Capital Improvements Budget. ($493,607.50)",
    "description": "Explanation\n \nBACKGROUND:  This legislation authorizes the Director of Public Utilities to enter into a construction contract agreement with Quality Lines, Inc. for the 2021 Division of Power General Construction Project, CIP No. 670903-100000, in an amount up to $491,607.50 for the Division of Power.\n \nThis project consists of providing the necessary labor and equipment to complete repairs to the electrical system at various locations within the Division of Power service area on an as needed basis, and other such work as may be necessary to complete the contract. \n \nThe planning area for this project is “Citywide” (Planning Area 99).\n \nECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT: \nThis contract will provide much needed assistance to the Division in providing repairs to old and outdated materials and equipment in our system.  These repairs will further advance the Division goals of improving our reliability to our customers.\nCONSTRUCTION CONTRACT AWARD:  The Director of Public Utilities publicly opened two (2) bids on April 28, 2021: Quality Lines, Inc. - $491,607.50; and U.S. Utility Contractor - $669,275.75.  \nPRE-QUALIFICATION STATUS: Quality Lines, Inc. has met code requirements with respect to pre-qualification, pursuant to relevant sections of Columbus City Code Chapter 329.  \n \nQuality Lines, Inc.’s bid was deemed the lowest, best, most responsive and responsible bid in the amount of $491,607.50.  Quality Lines, Inc.’s Contract Compliance Number is 31-529667 (expires 9/11/21, MAJ); DAX Vendor Account No. is 23933.  Additional information regarding all bidders, description of work, contract time frame and detailed amounts can be found on the attached Information form.\n \nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against Quality Lines, Inc.\n \nFISCAL IMPACT:  This legislation authorizes an expenditure of up to $491,607.50 from the Electricity Bond Fund 6303, a transfer within the Electricity G.O. Bond Fund 6303 of up to $491,607.50, and an amendment to the 2020 Capital Improvement Budget is necessary.\nTIMELINE: It is anticipated that the work will be completed within 6 months from the NTP.\nEMERGENCY DESIGNATION: Emergency action is not requested at this time. \n \n \nTitle\n \nTo authorize the Director of Public Utilities to enter into a construction contract with Quality Lines, Inc. for the 2021 Division of Power General Construction Project in the amount up to  $491,607.50; to authorize an expenditure of up to $2,000.00 from the Electricity G.O. (General Obligation) Bonds Fund 6303 for prevailing wage services to the Department of Public Service, to authorize a transfer of up to $493,607.50 and an expenditure of up to  $493,607.50 from the 2020 Electricity G.O. (General Obligation) Bonds Fund, and to authorize an amendment to the 2020 Capital Improvements Budget. ($493,607.50)\n \nBody\n \nWHEREAS, two bids (2) for the 2021 Division of Power General Construction Project, were received and publicly opened in the offices of the Director of Public Utilities on April 28, 2021; and\n \nWHEREAS, the lowest, best, most responsive and responsible bid was from Quality Lines, Inc. in the amount of $491,607.50 per the Bid Tabulation and Quality Factor Form processes; and\n \nWHEREAS, it is necessary to authorize the Director of the Department of Public Utilities to award and execute a construction contract with Quality Lines, Inc. and to encumber and expend funds to provide for payment of construction inspection and prevailing wage charges for the Division of Power’s 2021 Division of Power General Construction Project; and \n \nWHEREAS, it is necessary to authorize the expenditure of up to $491,607.50 from the Electricity G.O. (General Obligation) Bonds Fund 6303; and\n \nWHEREAS, it is necessary to authorize a transfer within and an expenditure of up to $491,607.50 from the Electricity G.O. Bond Fund 6303, for the Division of Power; and  \n \nWHEREAS, it is necessary to authorize an amendment to the 2020 Capital Improvements Budget for purposes of providing sufficient authority for the aforementioned project expenditures; and  \n \nWHEREAS, it is necessary to authorize the transfer within and expenditure of up to $2,000.00 for Prevailing Wage Services to the Department of Public Service; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Division of Power, Department of Public Utilities, to authorize the Director of Public Utilities to enter into an agreement for construction services for the 2021 Division of Power General Construction Project, for the preservation of the public health, peace, property, and safety; and\n \n BE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Utilities is authorized to execute a contract for the 2021 Division of Power General Construction Project with Quality Lines, Inc., 2440 Bright Road, Findlay, Ohio 45840; in an amount up to $491,607.50; in accordance with the terms and conditions of the contract on file in the Office of the Division of Power.\n \nSECTION 2.  That the expenditure of up to $493,607.50, inclusive of $2,000.00 for prevailing wage services to the Department of Public Service, or so much thereof as may be needed, is hereby authorized per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That the Director of Public Utilities is hereby authorized to transfer within up to $493,607.50 and expend up to $493,607.50 from the Electricity G.O. Bond Fund 6303 per the accounting codes in the attachment to this ordinance.\n \nSECTION 4. That the 2020 Capital Improvement Budget is hereby amended, as authorized per the accounting codes in the attachment to this ordinance. \n \nSECTION 5.  That the said contractor shall conduct the work to the satisfaction of the Director of Public Utilities and the Administrator of the Division of Power. \n \nSECTION 6. That the funds necessary to carry out the purpose of this Ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 7.  That the City Auditor is hereby authorized and directed to transfer any unencumbered balance in the project account to the unallocated balance within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies no longer required for said project; except that no transfer shall be made from a project account by monies from more than one source.\n \nSECTION 8. That the City Auditor is authorized to establish proper project accounting numbers as appropriate.\n \nSECTION 9.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this Ordinance.\n \nSECTION 10.  That this ordinance shall take effect and be in force from and after the earliest date allowed by law.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 19,
    "meeting_date": "2021-06-28",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}