{
  "success": true,
  "vote": {
    "id": 12370,
    "item_number": "SR-14",
    "title": "To authorize the Director of the Department of Public Utilities to enter into a professional engineering services contract with AECOM Technical Services, Inc. for the Three Creeks Relief Tunnel project; to authorize an amendment to the 2024 Capital Improvement Budget; to authorize the appropriation of funds within the Sanitary Revolving Loan Fund; to make this ordinance contingent upon the Ohio Water Development Authority approving a loan for this project; and to authorize the expenditure of up to $5,569,669.75 from the Sanitary Revolving Loan Fund for the contract.  ($5,569,669.75)",
    "description": "Explanation    \n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Utilities to enter into a contract with AECOM Technical Services, Inc. for professional engineering services for the Three Creeks Relief Tunnel project, CIP #650493-100000, in an amount up to $5,569,669.75. \n \nThis project is necessary to relieve a hydraulic bottleneck in this section of sewer caused by upstream development.  It will reduce sewer overflows and water in basement occurrences in the upstream sewersheds.  The initial funding for preliminary engineering will provide for the production of a Preliminary Engineering Report (PER) summarizing key design considerations factoring into the selection and recommendation of a horizontal and vertical sewer alignment for a new sewer relief tunnel ranging in size from 10 feet to 12 feet.  Preliminary engineering services will include field investigations, surveying, easement research, subsurface geotechnical investigations, hydro-geologic investigations, hydraulic analysis, environmental investigations, and report production.  A future contract modification will provide for detailed design services including production of construction drawings, specifications, easements necessary to complete the work, preparation of all permits, preparation of bidding documents, engineering services during construction, and production of record plans.\n  \nCommunity Planning Area:  64 - Far South\nTIMELINE:  It is expected to take approximately two years for the planning and design phases.  Once the project is bid for construction an additional two years will be needed for construction, warranty and record planning to complete the project.  \n \nESTIMATED COST OF PROJECT:  The proposed award amount is $5,569,669.75, including a 10% contingency amount that will be utilized to fund needed and approved changes in the work.  \n                     \n                     Original Contract                                         $5,569,669.75\n                     Future Anticipated Needs                            $7,000,000.00\n        CONTRACT TOTAL                                            $12,569,669.75\n \n2.  ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT\nThis project will relieve hydraulic overload in this section of sewer caused by upstream development, thereby reducing sewer overflows and water in basement occurrences in the upstream sewer-sheds.\n3.  BID INFORMATION\nThis project was formally advertised on the Vendor Services and Bonfire websites from 11/15/2024 through 12/20/2024.   Three proposals were received:\n \nName                                                  C.C. No.            Exp. Date               City/State                Status                     \nAECOM Technical Services, Inc.        CC-010897      05/28/2026                    Columbus, OH            MAJ\nBlack & Veatch Corporation                                   CC-008038      08/25/2025                    Columbus, OH            MAJ                     \nStantec Consulting Services, Inc.        CC-000462       07/26/2025                    Columbus, OH            MAJ\n \nAll proposals were deemed responsive.  The evaluation committee reviewed the proposals and recommended the contract for the Three Creeks Relief Tunnel project be awarded to AECOM Technical Services, Inc.\n \nAECOM Technical Services, Inc.’s certification was in good standing at the time of the contract award.\n \n4.  CONTRACT COMPLIANCE INFORMATION\nAECOM Technical Services, Inc.’s contract compliance number is CC-010897 and expires 5/28/26.  Searches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against AECOM Technical Services, Inc.\n \n5.  MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract is awarded with a 10.0% diversity goal that was approved by the City’s Office of Diversity and Inclusion (ODI).  Failure by the contractor to meet this goal subjects the contractor to the Penalties for Non-Compliance as described in the “City’s Minority and Women-Owned Business Enterprise & Small Local Business Enterprise Program Manual” and bid documents for this contract.\n \nAs part of their proposal, AECOM Technical Services, Inc. has proposed using the following sub-consultants to perform contract work:\n \nCompany Name                                                     City/State                                     ODI Cert. Status\nGPD Group.                                                      Columbus, Ohio                                          MAJ\nAldea Services                                                  Columbus, Ohio                                          MAJ\nMarshWagner                                                   Columbus, Ohio                                          WBE\n7NT Enterprises, LLC                                       Columbus, Ohio                                          MBE\nColdwater Consulting, LLC                                Columbus, Ohio                                          WBE\nEagon & Associates, Inc.                                   Columbus, Ohio                                          MAJ\nT&M Associates                                                           Columbus, Ohio                                          MAJ\nBlack & Veatch                                                 Columbus, Ohio                                          MAJ\n \nThe certification of AECOM Technical Services, Inc. and the above companies was in good standing at the time of the contract modification. \n \n6.  FISCAL IMPACT\nThis project is anticipated to be financed with a Water Pollution Control Loan Fund (WPCLF).  The WPCLF program is jointly administered by the Ohio EPA's Division of Environmental and Financial Assistance and the Ohio Water Development Authority (OWDA). City Council authorized this loan application and acceptance of funding via Ordinance 2720-2024 passed by Council on 10/28/2024.  This loan is expected to be approved in May of 2025.  This ordinance is contingent upon the loan being approved by OWDA.  An amendment to the 2024 Capital Improvement Budget is needed to show the actual loan amount.  Funds will need to be appropriated and expended in the Sanitary Revolving Loan Fund, Fund 6111.\n \nTitle\nTo authorize the Director of the Department of Public Utilities to enter into a professional engineering services contract with AECOM Technical Services, Inc. for the Three Creeks Relief Tunnel project; to authorize an amendment to the 2024 Capital Improvement Budget; to authorize the appropriation of funds within the Sanitary Revolving Loan Fund; to make this ordinance contingent upon the Ohio Water Development Authority approving a loan for this project; and to authorize the expenditure of up to $5,569,669.75 from the Sanitary Revolving Loan Fund for the contract.  ($5,569,669.75) \n \nBody\nWHEREAS, the Department of Public Utilities is engaged in the Three Creeks Relief Tunnel project; and\n \nWHEREAS, three proposals for the Three Creeks Relief Tunnel project were received and evaluated by the evaluation committee; and\n \nWHEREAS, the evaluation committee recommended AECOM Technical Services, Inc. be awarded the contract for this project; and \n \nWHEREAS, it is necessary to authorize the Director of the Department of Public Utilities to enter into a professional engineering services contract with AECOM Technical Services, Inc. for the Three Creeks Relief Tunnel project; and \n \nWHEREAS, the 2024 Capital Improvements Budget must be modified to align budget authority with the proper project; and\n \nWHEREAS, Ordinance 2720-2024 authorized this project to be funded by a loan to be obtained through the Water Pollution Control Loan Fund (WPCLF); and\n \nWHEREAS, this ordinance is contingent upon that loan being approved; and\n \nWHEREAS, funds must be appropriated within the Sanitary Revolving Loan Fund, Fund 6111; and \n \nWHEREAS, it is necessary to authorize an expenditure of funds from the Sanitary Revolving Loan Fund, Fund 6111, to pay for the contracted services for the project; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2024 Capital Improvements Budget authorized by Ordinance 1907-2024 be amended as follows to establish sufficient budget authority for this project:\n \nFund / Project Number / Project Name (Funding Source) / Current Authority / Revised Authority / Change \n6111 / 650493-100000 / Three Creeks Relief Tunnel (WPCLF) / $0.00 / $5,569,670.00 / $5,569,670.00 (To match loan amount)\n \nSECTION 2.  That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2025, the sum of $5,569,669.75 is appropriated in Fund 6111 (Sanitary Revolving Loan Fund), per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That the Director of the Department of Public Utilities is hereby authorized to enter into a professional services and construction services contract for the Three Creeks Relief Tunnel project with AECOM Technical Services, Inc., 277 W. Nationwide Blvd, Columbus, OH 43215, in an amount up to $5,569,669.75, in accordance with the terms and conditions of the contract on file in the Department of Public Utilities.\n \nSECTION 4.  That Ordinance 2720-2024 authorized this project to be funded by a loan to be obtained through the Water Pollution Control Loan Fund (WPCLF) Loan Account and this ordinance is contingent upon that loan being approved.\n \nSECTION 5.  That the expenditure of $5,569,669.75, or so much thereof as may be needed, is hereby authorized to pay for this contract per the accounting codes in the attachment to this ordinance.\n \nSECTION 6.  That funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 7.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 8.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 9.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 147,
    "meeting_date": "2025-06-02",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}