{
  "success": true,
  "vote": {
    "id": 12371,
    "item_number": "SR-15",
    "title": "To authorize the Director of the Department of Public Utilities to enter into a construction contract with BLD Services, LLC, for the Blueprint Hilltop1-Eureka Fremont Lateral Lining Project 6; to authorize an amendment to the 2024 Capital Improvement Budget; to appropriate funds within the Water Pollution Control Loan Fund; to make this ordinance contingent upon the Ohio Water Development Authority approving a loan for this project; and to authorize the expenditure of up to $8,335,316.21 from the Water Pollution Control Loan Fund and the Sanitary Bond Fund to pay for the project.  ($8,335,316.21)",
    "description": "Explanation    \n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Utilities to enter into a construction contract with BLD Services, LLC, for public sanitary sewers for the Blueprint Hilltop1-Eureka Fremont Lateral Lining Project 6 project, CIP #650872-153006, in an amount up to $8,333,316.21; and to encumber funds with the Department of Public Service for construction administration and inspection services in an amount up to $2,000.00 for a total expenditure of $8,335,316.21. \n \nThe work for this project consists of the lining of approximately 932 sanitary sewer laterals in the Hilltop - Eureka/Fremont area to prevent excess stormwater from entering the City's sanitary sewer system.  A sanitary sewer lateral is the pipe that carries wastewater from the property owner’s building to the City’s public sanitary main that is typically located below the street.  Lining of a lateral sanitary sewer line is a trenchless repair method that involves inserting a liner into a damaged or deteriorated lateral pipe, then inflating and curing the liner, which creates a new seamless pipe within the old one.  It effectively seals leaks and cracks, preventing rainwater infiltration of the lateral sanitary sewer line that could result in basement flooding and sanitary sewer overflows.\n \nThis project is a Consent Order project. A Consent order is a negotiated agreement entered as a court order that is enforceable by the court.  In 2005, the City of Columbus entered its Wet Weather Management Plan to the Ohio EPA to bring the City in compliance with its consent orders regarding the City’s sewer overflows. This project is an improvement identified in the Integrated Plan and the 2015 Wet Weather Management Plan Update Report.  The project is needed to mitigate water in basement events and sanitary sewer overflows to the goal of a 10 year Level of Service (LOS).\n  \nThe Community Area for this ordinance will be 53, Hilltop.  \n \nTIMELINE:  Contract work is required to be completed in a manner acceptable to the City within 540 days from the date that a Notice to Proceed (NTP) is given by the City.\n \nESTIMATED COST OF PROJECT:  The bid amount and proposed award amount is $8,333,316.21, including a 15% construction contingency amount that will be utilized to fund needed and approved changes in the work.  No contract modifications are anticipated at this time; however, construction exigency might later compel modification of this contract if unforeseen difficulties are encountered.\n \nCost summary: \n \nOriginal Contract                                      $ 8,333,316.21\nFuture Anticipated Needs                                      $0.00 \nPrevailing Wage Services                         $       2,000.00\nCONTRACT TOTAL                              $ 8,335,316.21\n \n2.  ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT\nThe project is needed to mitigate water in basement events and sanitary sewer overflows to the goal of a 10 year Level of Service (LOS).  Public meetings were conducted to solicit public input regarding the project, and descriptions of the work associated with this project were included on the City of Columbus website.\n \n3.  CONSTRUCTION CONTRACT AWARD\nAn Invitation for Bids for the Public Sanitary Sewers for Blueprint Hilltop1-Eureka Fremont Lateral Lining Project 6 was advertised on the Vendor Services and Bid Express websites from 2/27/25 through 3/21/25.  Two bids were received for the project and were opened on 3/21/25.  The following companies submitted a bid:\n  \nCompany                                           Bid Amount                        Compliance Number       ODI Status \nPerformance Pipelining, Inc.             $8,485,304.03                             CC045105                             MAJ\nBLD Services, LLC                           $8,333,316.21                            CC019505                             MAJ\n \n \nBLD Services, LLC.’s bid was deemed the lowest, best, most responsive and responsible bid in the amount of $8,333,316.21.\n \nThe certification of BLD Services, LLC was in good standing at the time the bid was awarded.\n \n4.  CONTRACT COMPLIANCE INFORMATION\nBLD Services, LLC’s contract compliance number is CC019505 and expires 11/3/25.   \n \nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against BLD Services, LLC. \n \n5.  MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract was bid with an anticipated City of Columbus MBE/WBE Program goal of 17% as assigned by the City’s Office of Diversity and Inclusion (ODI).  After ODI’s review of the Utilization Plan and other related information the contractor submitted with their bid response, ODI has approved an MBE/WBE Program goal of 17% for this contract.  Failure by the contractor to meet this goal subjects the contractor to the Penalties for Non-Compliance as described in the “City’s Minority and Women-Owned Business Enterprise & Small Local Business Enterprise Program Manual” and in the bid documents for this contract.\nBLD Services, LLC listed the following companies as subcontractors for this project:\n \nCompany Name                                            City/State                                     ODI Certification Status\nUnderground Eyes II LLC                           Columbus, Ohio                                         WBE\nJLD Construction Services, LLC.                 Columbus, Ohio                                          MBE\n \nThe certification of BLD Services, LLC. and of the above companies was in good standing at the time the bid was awarded.\n \n6.  PRE-QUALIFICATION STATUS\nBLD Services, LLC and all subcontractors have met code requirements with respect to pre-qualification, pursuant to relevant sections of Columbus City Code Chapter 329.  \n \n7.  FISCAL IMPACT\nThe construction portion of this project is anticipated to be financed with a loan from the Water Pollution Control Loan Fund (WPCLF), a program jointly administered by the Ohio EPA's Division of Environmental and Financial Assistance and the Ohio Water Development Authority (OWDA).  City Council authorized this loan application and acceptance of funding via Ordinance 2720-2024, passed by Council on 10/28/24.  This loan is expected to be approved at the OWDA June Board meeting.  This ordinance is contingent upon the loan being approved by OWDA.  The Department of Public Utilities will inform the Auditor's Office when this loan has been approved.  The 2024 Capital Improvement Budget must be modified to align budget authority with the proper project.  Funds must be appropriated in the Water Pollution Control Loan Fund, Fund 6111.\nFunding in the amount of $2,000.00 is appropriated and available within the Sanitary Bond Fund, Fund 6109, to pay the Department of Public Service to provide prevailing wage services for this project.  An amendment to the 2024 Capital Improvement Budget is necessary to align budget authority with the proper project.\n \nTitle\nTo authorize the Director of the Department of Public Utilities to enter into a construction contract with BLD Services, LLC, for the Blueprint Hilltop1-Eureka Fremont Lateral Lining Project 6; to authorize an amendment to the 2024 Capital Improvement Budget; to appropriate funds within the Water Pollution Control Loan Fund; to make this ordinance contingent upon the Ohio Water Development Authority approving a loan for this project; and to authorize the expenditure of up to $8,335,316.21 from the Water Pollution Control Loan Fund and the Sanitary Bond Fund to pay for the project.  ($8,335,316.21)\n \nBody\nWHEREAS, the Department of Public Utilities is engaged in the Blueprint Hilltop1-Eureka Fremont Lateral Lining Project 6; and\n \nWHEREAS, two bids for the Blueprint Hilltop1-Eureka Fremont Lateral Lining Project 6 were received and opened on 3/21/25; and\n \nWHEREAS, the lowest, best, most responsive and responsible bid was from BLD Services, LLC; and\n \nWHEREAS, Ordinance 2720-2024 authorized this project to be funded by a loan to be obtained through the Water Pollution Control Loan Fund (WPCLF); and\n \nWHEREAS, this ordinance is contingent upon that loan being approved; and\n \nWHEREAS, the 2024 Capital Improvement Budget must be modified to align budget authority with the proper project; and\n \nWHEREAS, funds must be appropriated within the Water Pollution Control Loan Fund, Fund 6111; and\n \nWHEREAS, it is necessary to authorize the Director of the Department of Public Utilities to enter into a construction contract with BLD Services, LLC for the Blueprint Hilltop1-Eureka Fremont Lateral Lining Project 6; and \n \nWHEREAS, it is necessary to authorize an expenditure of funds from the Water Pollution Control Loan Fund to pay for the project; and\n \nWHEREAS, it is necessary to expend funds from the Sanitary Bond Fund to provide for payment of prevailing wage services associated with said project; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2024 Capital Improvement Budget authorized by Ordinance 1907-2024 be amended as follows to establish sufficient budget authority for this project:\n \nFund / Project Number / Project Name (Funding Source) / Current Authority / Revised Authority / Change \n6111 / 650872-153006 / Blueprint Hilltop1-Eureka Fremont Lateral Lining Project 6 (WPCLF Loan) / $1,427,800.00 / $9,761,116.00 / $8,333,316.00 (To match the loan amount)\n \n6109 / 650872-153001 / Blueprint Hilltop 1 Palmetto / Westgate Lateral Lining Project 1 (Voted Sanitary Carryover) / $20,678.00 / $18,678.00 / ($2,000.00) \n6109 / 650872-153006 / Blueprint Hilltop1-Eureka Fremont Lateral Lining Project 6 (Voted Sanitary Carryover) / $0.00 / $2,000.00 / $2,000.00\n \nSECTION 2.  That the appropriation of $8,333,316.21, or so much thereof as may be needed, is hereby authorized in the Water Pollution Control Loan Fund, Fund 6111, per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That the Director of the Department of Public Utilities is hereby authorized to enter into a construction contract for the Blueprint Hilltop1-Eureka Fremont Lateral Lining Project 6 with BLD Services, LLC, 2424 Tyler Street, Kenner, LA 70062, in an amount up to $8,333,316.21, in accordance with the terms and conditions of the contract on file in the Department of Public Utilities; and to obtain the necessary construction administration and inspection services for this project from the Department of Public Services in an amount up to $2,000.00.\n \nSECTION 4.  That the expenditure of $8,335,316.21, or so much thereof as may be needed, is hereby authorized to pay for this contract per the accounting codes in the attachment to this ordinance. \n \nSECTION 5.  This ordinance is contingent upon the Ohio Water Development Authority's Board approving the loan for this project. \n \nSECTION 6.  That funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 7.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 8.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 9.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 147,
    "meeting_date": "2025-06-02",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}