{
  "success": true,
  "vote": {
    "id": 12390,
    "item_number": "CA-5",
    "title": "To authorize the Director of the Department of Finance and Management, on behalf of the City’s Purchasing Office, to enter into a contract with TradeCentric, LLC for a term of one (1) year, expiring approximately June 20, 2026, with the option to renew for five (5) additional one (1) year terms for use of the TradeCentric Gateway Connector platform to establish a connection between Microsoft’s D365 ERP software and the Coupa Business Spend Management Platform, intended to be used by the City as its purchasing catalog software; to authorize the appropriation of funds within the General Fund Income Tax Set Aside Subfund and the Information Services G.O. Debt Fund; to authorize the transfer of $25,000.00 between the General Fund Income Tax Set Aside Subfund and the Information Services G.O. Debt Fund; to authorize the amendment of the 2024 Capital Improvements Budget; to authorize the expenditure of $25,000.00 from the Information Services G.O. Debt Fund; and to declare an emergency. ($25,000.00)",
    "description": "Explanation\nBACKGROUND\nThis ordinance authorizes the Director of the Department of Finance and Management, on behalf of the City’s Purchasing Office, to enter into a contract with TradeCentric, LLC, who has developed and hosts, operates and supports, an online platform that enables a company to deploy punchout catalog, purchase order exchange, invoice exchange, and other solutions, and use these solutions with its existing e-commerce, procurement, and business applications, handling the translations and routing between buyer procurement and supplier e-commerce sites.  This software is necessary to establish a connection between Microsoft’s D365 ERP software and the Coupa Business Spend Management Platform, to which the Purchasing Office intends to subscribe via entering into a contract with Coupa Software Inc. via separate legislation (Ord. No. 1514-2025).  This contract and the contract with Coupa Software Inc. provide the software necessary to run the City of Columbus catalog system for all Universal Term Contracts (UTCs).  The current catalog system is used citywide to order goods and services from the City’s UTCs.\nA formal request for proposals (RFP) solicitation was published via RFQ026748 for the purchase of Procurment Catalog Software. Three proposals were received, which were opened on March 14, 2024. The proposals were evaluated by a five-member evaluation committee, based upon various criteria including competence, quality and feasibility, ability, past performance, and price, which evaluation resulted in a recommendation to the Director of the Department of Finance and Management to award a contract for such services to Coupa Sofware Inc. and TradeCentric, LLC (as Coupa Software Inc.’s proposed provider for the required connection between the Coupa Business Spend Management Platform and Microsoft D365). The Director approved the award to Coupa Software Inc. and TradeCentric, LLC.\nThe term of the proposed contract with TradeCentric, LLC is one (1) year, expiring approximately June 20, 2026, with the option to renew for five (5) additional one (1) year terms. This ordinance authorizes funding for the first year of the contract term. The Finance and Management Department will plan for future costs of this contract within its budget and will seek Council approval for such funding, if required by City Code.\nEMERGENCY DESIGNATION:  The Finance and Management Department respectfully requests this legislation to be considered an emergency ordinance because the software is used daily citywide to procure supplies, equipment, and services to maintain City facilities and operations, and the current catalog software contract expires June 20, 2025.\nFISCAL IMPACT: An expenditure of $25,000.00 for the contract’s one-year term ($17,500.00) plus a one-time implementation fee ($7,500.00) is authorized by this ordinance. The annual subscription fee is $17,500.00, which will be planned and budgeted for by the Department of Finance and Management if renewals of this contract are pursued. Funds for this expenditure will not be available to the Department of Finance and Management until the proceeds of the 2025 bond sale are available at a future date. Therefore, it is necessary to certify the required funds against the General Fund 1000, Income Tax Set Aside Subfund 100099. Upon the sale of bonds, this will be reimbursed.\nContract Compliance: \nTradeCentric, LLC, CC#052298, expires 4/16/2027\nPrincipal place of business:  3317 Berkmar Drive, Charlottesville, VA 22901\nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against TradeCentric, LLC.\nTitle\nTo authorize the Director of the Department of Finance and Management, on behalf of the City’s Purchasing Office, to enter into a contract with TradeCentric, LLC for a term of one (1) year, expiring approximately June 20, 2026, with the option to renew for five (5) additional one (1) year terms for use of the TradeCentric Gateway Connector platform to establish a connection between Microsoft’s D365 ERP software and the Coupa Business Spend Management Platform, intended to be used by the City as its purchasing catalog software; to authorize the appropriation of funds within the General Fund Income Tax Set Aside Subfund and the Information Services G.O. Debt Fund; to authorize the transfer of $25,000.00 between the General Fund Income Tax Set Aside Subfund and the Information Services G.O. Debt Fund; to authorize the amendment of the 2024 Capital Improvements Budget; to authorize the expenditure of $25,000.00 from the Information Services G.O. Debt Fund; and to declare an emergency. ($25,000.00)\nBody\nWHEREAS, there is a need to subscribe to TradeCentric LLC’s Gateway Connector platform software, which will allow for a connection between the City’s intended new purchasing catalog software (Coupa Software Inc.’s Business Spend Management Platform) and Microsoft D365; and\nWHEREAS, a formal Request for Proposals (RFP) process was held in accordance with Columbus City Codes, Chapter 329 to procure Procurement Catalog Software; and\nWHEREAS, proposals were received by the Purchasing Office and were evaluated by a five-member evaluation committee, which recommended award be made to Coupa Sofware Inc. and TradeCentric, LLC for these services, and the Director of the Department of Finance and Management approved such award; and\nWHEREAS, this ordinance authorizes the Director of the Department of Finance and Management, on behalf of the Purchasing Office, to enter into a contract with TradeCentric, LLC for a subscription to the TradeCentric Gateway Connector software; and\nWHEREAS, the City anticipates incurring certain Original Expenditures (as defined in Section 1.150-2(c) of the Treasury Regulations (the \"Treasury Regulations\") promulgated pursuant to the Internal Revenue Code of 1986, as amended) with respect to the construction of the project described in this ordinance (the \"Project\"); and\n \nWHEREAS, it is necessary to authorize the transfer of $25,000.00 between the General Fund 1000, Income Tax Set Aside Subfund 100099, and the Information Services G.O. Debt Fund, Fund 5105; and\n \nWHEREAS, funds will need to be appropriated within the General Fund 1000, Income Tax Set Aside Subfund 100099 and within the Information Services G.O. Debt Fund, Fund 5105; and\n \nWHEREAS, the City will reimburse the General Fund 1000, Income Tax Set Aside Subfund 100099; and\n \nWHEREAS, this transfer should be considered as a temporary funding method; and\n \nWHEREAS, the aggregated principal amount of obligations which the City will issue to finance this project is presently expected not to exceed $25,000.00; and\n \nWHEREAS, it is necessary to authorize the amendment of the 2024 Capital Improvements Budget Ordinance 1907-2024 in order to provide sufficient budget authority for this and future projects; and\n \nWHEREAS, is it necessary to authorize an expenditure of $25,000.00 from the Information Services G.O. Debt Fund, Fund 5105, in connection with this contract; and\nWHEREAS, an emergency exists in the usual daily operation of the Department of Finance and Management Purchasing Office in that it is immediately necessary to authorize the Director to enter into contract for procurement catalog software as the City’s procurement catalog software is used daily citywide to procure supplies, equipment, and services to maintain City facilities and operations, and the current catalog software contract expires June 20, 2025, all for the immediate preservation of the public health, peace, property, safety and welfare; and NOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1. That the Director of Finance and Management, on behalf of the Purchasing Office, hereby is authorized to enter into a contract for a term of one (1) year, expiring approximately June 20, 2026, with the option to renew for five (5) additional one (1) year terms, subject to any applicable annual appropriation and approval, with TradeCentric, LLC for a subscription to the TradeCentric Gateway Connector.\nSECTION 2. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 4. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 5. That the 2024 Capital Improvements Budget Ordinance 1907-2024 is hereby amended as follows in order to provide sufficient budget authority for this ordinance and future projects:\n \nFund / Project / Project Name (Funding Source) / Revised Authority / Change / Amended Revised Authority\n \nFund 7733 / P450700-100000 / Facilities Management - Facility Renovations (Councilmanic ITSA Supported) / $3,605,869 / ($25,000) / $3,580,869\nFund 5105 / P470085-100000 / Purchasing Catalog Software (Councilmanic ITSA Supported) / $343,631 / $25,000 / $368,631\n \nSECTION 6. That the appropriation of funds in the General Fund 1000, Income Tax Set Aside Subfund 100099 and the Information Services G.O. Debt Fund, Fund 5105, is hereby authorized, per the attachment hereto.\n \nSECTION 7. That the transfer of $25,000.00, or so much thereof as may be needed, is hereby authorized between the General Fund 1000, Income Tax Set Aside Subfund 100099, and the Information Services G.O. Debt Fund, Fund 5105, per the account codes in the attachment to this ordinance.\n \nSECTION 8. That the City Auditor is hereby authorized to transfer said funds to the Information Services G.O. Debt Fund, Fund 5105, at such time as is deemed necessary by the City Auditor, and to expend said funds, or so much thereof as may be necessary.\n \nSECTION 9. That upon obtaining other funds from the 2025 Bond Sale for the City of Columbus, the City Auditor is hereby authorized and directed to repay the General Fund 1000, Income Tax Set Aside Subfund 100099 the amount transferred under Section 7.\n \nSECTION 10. That the expenditure of $25,000.00, or so much thereof as may be needed, is hereby authorized to be expended from the Information Services G.O. Debt Fund, Fund 5105, per the attachment hereto.\nSECTION 11.  That the City intends that this ordinance constitute an \"official intent\" for purposes of Section 1.150 2(e) of the Treasury Regulations, and that the City reasonably expects to reimburse itself for certain Original Expenditures incurred with respect to the Project from the proceeds of obligations to be issued by the City in a principal amount currently estimated to be $25,000.00 (the \"Obligations\"). \n \nThe City intends to make a reimbursement allocation on its books for the Original Expenditures not later than eighteen months following the later to occur of the date of the Original Expenditure to be reimbursed or the date the Project for which such Original Expenditures were made is \"placed in service\" within the meaning of Treasury Regulations Section 1.150 2(c). Upon the issuance of the of such Obligations shall be used to reimburse the fund from which the advance for costs of the ProjectObligations, the proceeds will be made.\n \nSECTION 12.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 148,
    "meeting_date": "2025-06-09",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}