{
  "success": true,
  "vote": {
    "id": 12399,
    "item_number": "CA-14",
    "title": "To authorize the Director of the Department of Public Service, acting on behalf of the City of Columbus, to enter into an event agreement with Red, White & BOOM, Inc., to accept a deposit for City services rendered for the Red, White & BOOM! 2025 event; to refund the balance of deposited funds after final accounting has occurred, if applicable; and to declare an emergency. ($0.00)",
    "description": "Explanation\n \n1.  BACKGROUND\nCredited as the largest single-day event in the City of Columbus, Red, White & BOOM! has become a highly anticipated signature event throughout its existence, drawing more than 400,000 people each year it has been held. This year the event will take place on July 3, 2025, from 11 am to 11:00 pm, in downtown Columbus.\n \nThis ordinance authorizes the Director of Public Service to execute an event agreement with Red, White & BOOM, Inc., the non-profit organization that coordinates the annual event; to accept monies for necessary permit fees and parking and traffic maintenance services; and to, as necessary, provide a refund to the organization after the event has concluded and final accounting is complete. \n \n2.  FISCAL IMPACT\nRed, White & BOOM, Inc. will deposit funds representing the estimated cost of requisite services with the City, with the understanding that it may be necessary to remit additional funds to the City if the initial deposit is insufficient to cover the final cost of those services. \n \n3.  CONTRACT COMPLIANCE\nThe contract compliance number for Red, White & BOOM, Inc. is CC004781 and will need to be renewed prior to execution of event agreement.\n \n4.  EMERGENCY DESIGNATION\nEmergency action is requested to allow sufficient time for the execution of said agreement so as to prevent unnecessary delays in planning and organizing activities for the July celebration. \n \nTitle\n \nTo authorize the Director of the Department of Public Service, acting on behalf of the City of Columbus, to enter into an event agreement with Red, White & BOOM, Inc., to accept a deposit for City services rendered for the Red, White & BOOM! 2025 event; to refund the balance of deposited funds after final accounting has occurred, if applicable; and to declare an emergency. ($0.00) \n \nBody\n \nWHEREAS, Red, White & BOOM! is an annual event occurring in downtown Columbus to celebrate Independence Day; and\n \nWHEREAS, Red, White & BOOM, Inc. is responsible for organizing and operating this event; and \n \nWHEREAS, it is necessary to authorize the Director of Public Service to execute an event agreement with Red, White & BOOM, Inc. relative to Red, White & BOOM! 2025 and to accept a deposit for necessary permit fees and parking and traffic maintenance services; and\n \nWHEREAS, it may be necessary to refund a portion of the deposit tendered by Red, White & BOOM, Inc. if an unexpended balance remains after final accounting is complete; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service, in that it is immediately necessary to execute said agreement so as to facilitate the timely completion of planning and organizing activities prior to the July event, for the immediate preservation of the public health, peace, property, safety and welfare; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Public Service be and hereby is authorized to execute an event agreement with Red, White & BOOM, Inc., 774 S. Roosevelt Avenue, Bexley, Ohio, 43209, relative to Red, White, and BOOM! 2025; to accept a deposit for City services; and to, as necessary, refund the unexpended balance of deposited funds after final accounting has occurred.\n \nSECTION 2.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 148,
    "meeting_date": "2025-06-09",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}