{
  "success": true,
  "vote": {
    "id": 12400,
    "item_number": "CA-15",
    "title": "To amend the 2024 Capital Improvement Budget; to authorize the Director of Public Service to enter into a contract modification with EMH&T in connection with the Intersection Improvements - Refugee Road at Hines Road project; to authorize the expenditure of up to $200,000.00 from the Streets and Highways Bond Fund to pay for the project; and to declare an emergency. ($200,000.00)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Service to modify a professional services contract with Evans, Mechwart, Hambleton & Tilton, Inc. (EMH&T) to add additional funds for the Intersection Improvements - Refugee Road at Hines Road project.  \nOrdinance No. 0998-2024 authorized the Director of Public Service to enter into a $600,000.00 professional services contract with EMH&T for the Intersection Improvements - Refugee Road at Hines Road project.   The intent of this project is to install a new railroad coordinated traffic signal and make improvements to the north and west approaches of the intersection of Refugee Road and Hines Road to add left turn lanes. Curb, walk and a shared use path will be added on Refugee Road west of the intersection. Curb and walk will be added on the west side of Hines Road north of the intersection. The project will also install curb ramps, lighting, a stormwater basin, and storm sewer as needed. \n \nThis ordinance authorizes the Director of Public Service to modify the contract in the amount of $200,000.00 for additional professional services to complete the detailed design of the project.\n \nOrd. 2394-2023 authorized the Director of Public Service to submit ODOT Highway Safety Improvement Program project applications and to execute project agreements for awarded projects for the Department of Public Service for the Intersection Improvements - Refugee Road at Hines Road project.  \n \n1.1  Amount of additional funds to be expended: $200,000.00\nThe original contract amount:                                                                             $600,000.00     (PO447014, Ord. 0998-2024)                          \nThe total of Modification No. 1:                                                                      $200,000.00     (This Ordinance)\nThe contract amount including all modifications:                          $800,000.00  \n \n1.2  Reasons additional goods/services could not be foreseen:  \nThis modification is needed to fully fund the detailed design for base services and if-authorized work to keep the project on schedule and meet ODOT Safety Funds funding dates. \n \n1.3  Reason other procurement processes are not used:\nThis work is within the project limits of the original contract. It would be redundant to have a separate contract to perform this work. This work is an accelerated design to meet ODOT Safety Funds funding deadlines, therefore, it was decided that it is in the best interest of the City to modify the existing contract instead of bidding this part of the work.\n \n1.4  How cost of modification was determined:\nThe cost of this contract modification is consistent with the direct labor, overhead, and profit rates established within the original proposal/contract. \n \nSearches in the System for Award Management (Federal) and the Findings for Recovery list (State) produced no findings against EMH&T.\n \n2.  CONTRACT COMPLIANCE\nThe contract compliance number for EMH&T is CC004214 and expires 11/08/2025.  \n \n3.  FISCAL IMPACT\nFunding in the amount of $200,000.00 is budgeted, available and appropriated within the Streets and Highways Bond Fund, Fund 7704 within the Department of Public Service.  An amendment to the 2024 Capital Improvement Budget is required to establish sufficient budget authority for the project. \n \n4.  EMERGENCY DESIGNATION\nEmergency action is requested to continue construction plan design. Construction plan design will affect the Right of Way design, that needs to stay on schedule and allow Acquisition to begin in February 2026 and meet the ODOT Safety Funds funding dates to preserve the safety of the traveling public.                     \n \nTitle\nTo amend the 2024 Capital Improvement Budget; to authorize the Director of Public Service to enter into a contract modification with EMH&T in connection with the Intersection Improvements - Refugee Road at Hines Road project; to authorize the expenditure of up to $200,000.00 from the Streets and Highways Bond Fund to pay for the project; and to declare an emergency. ($200,000.00) \n \nBody\nWHEREAS, the City of Columbus is engaged in the Intersection Improvements - Refugee Road at Hines Road project; and\n \nWHEREAS, PO447014 with EMH&T, in the amount of $600,000.00, was authorized by ordinance no. 0998-2024; and \n \nWHEREAS, it has become necessary to modify the contract in an amount up to $200,000.00 and provide additional funds for the Intersection Improvements - Refugee Road at Hines Road project; and\n \nWHEREAS, it is necessary to authorize expenditures from the Streets and Highways Bond Fund for this contract; and\n \nWHEREAS, it is necessary to amend the 2024 Capital Improvement Budget to provide funding for project expenditures in fund 7704, the Streets and Highways Bond Fund; and\n \nWHEREAS, this contract opportunity was submitted to the City’s Office of Diversity and Inclusion (ODI) for review and assignment of an MBE/WBE goal prior to bidding; and\n \nWHEREAS, this contract was bid with a City of Columbus MBE/WBE Program goal of 15% as assigned by the City’s Office of Diversity and Inclusion (ODI); and\n \nWHEREAS, failure by the contractor to meet this goal subjects the contractor to the Penalties for Non-Compliance; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to enter into a contract modification with EMH&T to prevent delays in the project schedule, to preserve the safety of the traveling public,  thereby preserving the public health, peace, property, safety, and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n                     \nSECTION 1.  That the 2024 Capital Improvements Budget authorized by ordinance 1907-2024 be amended to establish sufficient authority for this project:\n \nFund / Project / Project Name / Current C.I.B. / Amendment Amount / C.I.B. as Amended\n7704 / P530086-100000 / Misc. Intersection Improvements (Voted Carryover) / $674,992.00 / ($200,000.00) / $474,992.00\n \n7704 / P530086-100037 / Intersection Improvements -  Refugee Road at Hines Road (Voted Carryover) / $700,000.00 / $200,000.00 / $900,000.00\n \nSECTION 2.  That the expenditure of $200,000.00, or so much thereof as may be needed, is hereby authorized in Fund 7704 (Streets and Highways Bond Fund), Dept-Div 5912 (Design and Construction), Project P530086-100037 (Intersection Improvements - Refugee Road at Hines Road), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 6.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 148,
    "meeting_date": "2025-06-09",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}