{
  "success": true,
  "vote": {
    "id": 12414,
    "item_number": "CA-29",
    "title": "To authorize the Director of the Department of Public Utilities to enter into contract, in accordance with sole-source provisions of City Code, with GE Digital LLC for the maintenance of GE Advantage (aka Global Care) software licenses and maintenance support for the Division of Sewerage and Drainage; and to authorize the expenditure of $200,208.25 from the Sewer Operating Sanitary Fund. ($200,208.25) (Amended by Ord. 1906-2025 passed on 7/28/2025 -LG)",
    "description": "Explanation\n \nThis legislation authorizes the Director of the Department of Public Utilities to enter into an agreement with GE Digital LLC for the maintenance and renewal of software licenses and support for the GE Advantage (aka Global Care). \n \nThe Sewer Maintenance Operation Center (SMOC) and the Jackson Pike (JPWWTP) and Southerly (SWWTP) Wastewater Treatment Plants utilize the GE Advantage (aka Global Care) software to monitor their plant-wide control systems and operations. At SMOC, the software monitors remote pump and lift stations, as well as level sensors and flow meters throughout the City. There are two (2) products covered by the support agreement: iFix is the control software for supervisors and operators, which controls all plant processes and systems, and iHistorian, which records a historical database of approximately 64,624 data points monitored daily at Division of Sewerage and Drainage (DOSD) facilities. This agreement includes updates to each product to its most up-to-date 2024 version.\n \nThe license renewals and support agreement for the existing software and licenses will go into effect on the date of execution and expire on September 12, 2026.\n \nGE Digital LLC is the developer of the software and has a partnership with Gray Matter Systems as the sole provider of all software support and maintenance. This agreement will be established in accordance with the relevant provisions of Chapter 329 of City Code relating to sole-source procurement.\n \nSUPPLIER:  \n \nGE Digital LLC | D365 Vendor #017326 | Expires 12/16/2026. \nGE Digital LLC does not hold MBE/WBE status.\n \nThe company is not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.\n \nFISCAL IMPACT:  \n \n$200,208.25 is needed for this expense. $230,000.00 was budgeted for this expense. \n$194,554.61 was spent in 2024. \n$185,867.27 was spent in 2023. \n \n \nTitle\n \nTo authorize the Director of the Department of Public Utilities to enter into contract, in accordance with sole-source provisions of City Code, with GE Digital LLC for the maintenance of GE Advantage (aka Global Care) software licenses and maintenance support for the Division of Sewerage and Drainage; and to authorize the expenditure of $200,208.25 from the Sewer Operating Sanitary Fund. ($200,208.25)\n \n \nBody\n \nWHEREAS, the Sewer Maintenance Operation Center and the Jackson Pike and Southerly Wastewater Treatment Plants have various operating and process systems that are monitored and controlled by GE Advantage (aka Global Care) software; and\n \nWHEREAS, GE Digital LLC is the developer of the software and has partnered with Gray Matter Systems as the sole provider of support and maintenance for the software; and\n \nWHEREAS, this legislation is being submitted in accordance with the relevant provisions of Chapter 329 of City Code relating to sole-source procurement; and\n \nWHEREAS, the existing software licenses and corresponding support agreement expire September 12, 2025, so there is a need for the Division of Sewerage and Drainage to enter into a renewal; and\n \nWHEREAS, the proposed license renewals and support agreement are for one (1) year and will expire on September 12, 2026; and\n \nWHEREAS, there are two (2) software products covered by this support agreement: iFix for supervisors and operators, which controls all plant processes and systems, and iHistorian, which records a historical database of approximately 64,000 points monitored daily at Division of Sewerage and Drainage facilities; and\n \nWHEREAS, this agreement includes updates to each product to its most up-to-date 2024 version; and\n \nWHEREAS, the expenditure of $200,208.25, or so much thereof as may be needed, is hereby authorized in Fund 6100, Sewer Operating Sanitary Fund, in object class 03, Services, per the accounting codes in the attachment to this ordinance; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities, Division of Sewerage and Drainage, to authorize the Director of Public Utilities to enter into a contract for the maintenance of licenses and support for the GE Advantage (aka Global Care) software; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Public Utilities is hereby authorized to enter into contract with GE Digital LLC, for the GE Advantage (aka Global Care) software licenses, maintenance, and support for the Division of Sewerage and Drainage, with an expiration date of September 12, 2026.\n \nSECTION 2.  That this contract is in accordance with the relevant provisions of Chapter 329 of City Code relating to sole-source procurement.\n \nSECTION 3. That the expenditure of $200,208.25, or so much thereof as may be needed, is hereby authorized in Fund 6100, Sewer Operating Sanitary Fund, in object class 03, Services, per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 148,
    "meeting_date": "2025-06-09",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}