{
  "success": true,
  "vote": {
    "id": 12455,
    "item_number": "SR-21",
    "title": "To authorize the Director of the Department of Development to enter into contract with Sky Nile Consulting to provide communications support for the Housing For All initiative; to authorize an appropriation and expenditure within the Neighborhood Initiatives subfund; to waive the competitive bidding provisions of Columbus City Codes; and to declare an emergency. ($75,000.00) (Amended by Ord. 2085-2025 passed on 7/28/2025 -LG)",
    "description": "Explanation\nThis ordinance authorizes the Director of the Department of Development to enter into contract with Sky Nile Consulting to provide communications support for the Housing For All initiative.\n \nSky Nile Consulting will support the City of Columbus Housing For All initiative through integrated marketing, event execution, and strategic communications. Sky Nile’s focus will be on storytelling, engagement, and positioning the city’s housing response as a coordinated, community-centered effort.\n \nSky Nile Consulting will lead the planning, delivery, and promotion of the 2025 Housing For All Forum scheduled for September 11-12. This convening will serve as a flagship public engagement event to spotlight the city’s housing strategies and progress. Additionally, Sky Nile will deliver an integrated digital marketing strategy that builds awareness of Housing For All goals and engages the public. Deliverables will include website updates and maintenance for the Housing For All website, graphic design for digital assets, and web banners. Lastly, Sky Nile will coordinate and manage contracted service providers for specialized support for Housing For All messaging.\n \nA bid waiver is requested for this contract, as Sky Nile Consulting has been integrally involved with communications regarding Housing For All since its inception and is best suited to provide cost-effective services.\n \nFiscal Impact: Funding to support this contract is available within the Neighborhood Initiatives subfund.\n \nEmergency action is requested in order to initiate planning services for the anticipated forum scheduled for September.\n \nTitle\nTo authorize the Director of the Department of Development to enter into contract with Sky Nile Consulting to provide communications support for the Housing For All initiative; to authorize an appropriation and expenditure within the Neighborhood Initiatives subfund; to waive the competitive bidding provisions of Columbus City Codes; and to declare an emergency. ($75,000.00)\n \nBody\nWHEREAS, Sky Nile Consulting will support the City of Columbus Housing For All initiative through integrated marketing, event execution, and strategic communications; and\n \nWHEREAS, Sky Nile’s focus will be on storytelling, engagement, and positioning the city’s housing response as a coordinated, community-centered effort; and\n \nWHEREAS, an emergency exists in the usual daily business of the city in that it is immediately necessary to authorize a contract with Sky Nile Consulting in order to initiate planning services for the anticipated forum scheduled for September; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Department of Development is hereby authorized to enter into a professional service contract with Sky Nile Consulting LLC to provide communications support for the Housing For All initiative.\n \nSECTION 2.  That the Auditor is hereby authorized and directed to appropriate $75,000.00 to the Department of Development within fund 1000 (General Fund), subfund 100018 (Neighborhood Initiatives), Dept. 44 01 (Administration), in Object Class 03 (Services) per the accounting codes in the attachment to this ordinance. \n \nSECTION 3.  That for the purpose as stated in Section 2, the expenditure of $75,000.00, or so much thereof as may be necessary, is hereby authorized in fund 1000 (General Fund), subfund 100018 (Neighborhood Initiatives), Dept. 44 01 (Administration), in Object Class 03 (Services) per the accounting codes in the attachment to this ordinance. \n \nSECTION 4. That this Council finds it is in the best interests of the City to waive the competitive bidding provisions of Chapter 329 of Columbus City Codes, and such provisions are hereby waived for this contract.\n                     \nSECTION 5.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 7.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 148,
    "meeting_date": "2025-06-09",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}