{
  "success": true,
  "vote": {
    "id": 12488,
    "item_number": "CA-20",
    "title": "To authorize the Director of the Department of Development to amend the City of Columbus Jobs Growth Incentive for the first time with CoverMyMeds LLC, to add McKesson Corporation, and all affiliates and subsidiaries related to the McKesson Corporation as listed in Exhibit A, and any other affiliates or subsidiaries owned or controlled by McKesson Corporation and which are reported to the Department of Development through McKesson Corporation’s annual report to the Department as additional GRANTEEs to the AGREEMENT.",
    "description": "Explanation\n \nBACKGROUND:  The need exists to amend the City of Columbus dual-rate Jobs Growth Incentive Agreement (“AGREEMENT”) between the City of Columbus (“CITY”) and CoverMyMeds LLC (“GRANTEE”). Columbus City Council (“COUNCIL”), per Ordinance No. 1949-2018, passed on July 23, 2018, authorized the Director of the Department of Development to enter into an AGREEMENT with the GRANTEE for an annual cash payment equal to (i) thirty percent (30%) of the City of Columbus income tax withheld on the Columbus payroll of new employees and (ii) thirty-five percent (35%) of the City of Columbus income tax withheld on the Columbus payroll of those employees who are also City of Columbus residents at the end of each calendar year, for a term up to eight (8) consecutive years. The GRANTEE committed, in collaboration with real estate development partners, OBM HQ, LLC, FDP Investments I, LLC and FDP Investments II, LLC (collectively, and hereinafter referred to as “OWNER”), or related entity thereof, to construct (i) a new approximately 200,000-square-foot Class A office building, ancillary campus amenities, and surface parking (“PHASE 1”), and may, at a later date, construct or cause to be constructed a second one (ii) consisting of approximately 200,000-square-foot Class A office building (total of approximately 400,000 square feet), and one or more associated parking structures containing up to approximately 1,150 parking spaces (“PHASE 2”) (hereinafter the building or buildings, related amenities and parking structures that are actually constructed shall be collectively referred to as the “PROJECT”). The GRANTEE committed to invest, or cause to be invested approximately $100,000,000.00 during PHASE I and combined total of up to approximately $240,000,000.00 for both PHASES 1 and 2, of which up to approximately $225,000,000.00 was anticipated to be related to real property improvements. This new campus will be located along McKinley Ave. west of North Hartford Ave. on what is currently multiple parcels (collectively hereinafter the \"PROJECT SITE\"). \n \nThe GRANTEE committed to retain and relocate approximately 592 existing full-time permanent employment positions with an associated annual payroll of approximately $43,162,000.00 from their previous offices located at 2 Miranova Place, Columbus, Ohio 43215 and 41 South High Street, Columbus, Ohio 43215 to this new headquarters campus. Additionally, CoverMyMeds committed to create approximately 1,032 net new full-time permanent employment positions with an associated annual payroll of approximately $75,000,000.00 at the PROJECT SITE within the next five (5) years (by December 31, 2022). The AGREEMENT was made and entered into effective February 6, 2019.\n \nIn a letter received by the CITY on behalf of the GRANTEE, dated February 20, 2025 and through ensuing correspondence, it was confirmed that McKesson Corporation, and all affiliates and subsidiaries related to the McKesson Corporation, as listed in Exhibit A, would be additional entities and parties to the AGREEMENT. These new entities, along with CoverMyMeds LLC, will contribute to the new job creation and payroll, and the retained jobs and payroll commitments as set forth in the AGREEMENT. As a result, the GRANTEE is requesting the AGREEMENT be amended for the first time to add McKesson Corporation, and all affiliates and subsidiaries related to the McKesson Corporation as listed in Exhibit A as additional GRANTEEs and henceforth contribute to the new job creation and payroll, and the retained jobs and payroll commitments as set forth in the AGREEMENT. \n \nThe legislation is to authorize the Director of the Department of Development to amend the AGREEMENT for the first time to add McKesson Corporation, and all affiliates and subsidiaries related to the McKesson Corporation as listed in Exhibit A, and any other affiliates or subsidiaries owned or controlled by McKesson Corporation and which are reported to the Department of Development through McKesson Corporation’s annual report to the Department as additional entities and party to the AGREEMENT, whereby, all entities will collectively assume the terms and commitments of the AGREEMENT. \n \nThis legislation is presented as 30-day legislation. \n \nFISCAL IMPACT:  \n \nNo funding is required for this legislation.\n \n \nTitle\n \nTo authorize the Director of the Department of Development to amend the City of Columbus Jobs Growth Incentive for the first time with CoverMyMeds LLC, to add McKesson Corporation, and all affiliates and subsidiaries related to the McKesson Corporation as listed in Exhibit A, and any other affiliates or subsidiaries owned or controlled by McKesson Corporation and which are reported to the Department of Development through McKesson Corporation’s annual report to the Department as additional GRANTEEs to the AGREEMENT. \n \n \n \nBody\n \nWHEREAS,                     the City of Columbus (“CITY”) entered into a dual-rate Jobs Growth Incentive Agreement (“AGREEMENT”) with CoverMyMeds LLC (“GRANTEE”), approved by Columbus City Council (“COUNCIL”) on July 23, 2018, per Ordinance Number 1949-2018 with this AGREEMENT having been made and entered into effective February 6, 2019; and\n \nWHEREAS, the AGREEMENT granted a financial incentive of an annual cash payment equal to (i) thirty percent (30%) of the City of Columbus income tax withheld on the Columbus payroll of new employees and (ii) thirty-five percent (35%) of the City of Columbus income tax withheld on the Columbus payroll of those employees who are also City of Columbus residents at the end of each calendar year, for a term up to eight (8) consecutive years; and \n \nWHEREAS, the GRANTEE committed, in collaboration with OBM HQ, LLC, FDP Investments I, LLC and FDP Investments II, LLC (collectively, and hereinafter referred to as “OWNER”), or related entity thereof, to construct (i) a new approximately 200,000-square-foot Class A office building, ancillary campus amenities and surface parking (“PHASE 1”), and may, at a later date, construct or cause to be constructed a second one (ii) consisting of approximately 200,000-square-foot Class A office building (total of approximately 400,000 square feet), and one or more associated parking structures containing up to approximately 1,150 parking spaces (“PHASE 2”) (hereinafter the building or buildings, related amenities and parking structures that are actually constructed shall be collectively referred to as the “PROJECT”). The GRANTEE committed to invest, or cause to be invested approximately $100,000,000.00 during PHASE I and combined total of up to approximately $240,000,000.00 for both PHASES 1 and 2, of which up to approximately $225,000,000.00 was anticipated to be related to real property improvements. This new campus will be located along McKinley Avenue west of North Hartford Avenue on multiple parcels (collectively, hereinafter the \"PROJECT SITE\"); and\n \nWHEREAS, the GRANTEE committed to retain and relocate approximately 592 existing full-time permanent positions with an associated annual payroll of approximately $43,162,000.00 from their previous offices located at 2 Miranova Place, Columbus, Ohio 43215 and 41 South High Street, Columbus, Ohio 43215 to the PROJECT SITE.  Additionally, CoverMyMeds committed to create approximately 1,032 net new full-time permanent employment positions with an associated annual payroll of approximately $75,000,000.00 at the PROJECT SITE within the next five (5) years (by December 31, 2022); and \n \nWHEREAS, paragraph four within Section 13 (Miscellaneous) of the AGREEMENT states that “no amendment or modification shall be effective unless in writing and signed by both parties to this AGREEMENT”; and\n \nWHEREAS, in a letter received by the CITY on behalf of the GRANTEE dated February 20, 2025 and through ensuing correspondence, the GRANTEE confirmed that McKesson Corporation, and all affiliates and subsidiaries related to the McKesson Corporation as listed in Exhibit A would be additional entities and parties to the AGREEMENT. These new entities, along with CoverMyMeds LLC, will contribute to the new job creation and payroll, and the retained jobs and payroll commitments as set forth in the AGREEMENT. As a result, the GRANTEE is requesting the AGREEMENT be amended for the first time to add McKesson Corporation, and all affiliates and subsidiaries related to the McKesson Corporation as additional GRANTEEs and henceforth contribute to the new job creation and payroll, and the retained jobs and payroll commitments as set forth in the AGREEMENT; and\n \nWHEREAS, as a result of the employees being employed by the proposed entities, the GRANTEE is requesting the AGREEMENT be amended to add McKesson Corporation, and all affiliates and subsidiaries related to the McKesson Corporation, and any other affiliates or subsidiaries owned or controlled by McKesson Corporation and which are reported to the Department of Development through McKesson Corporation’s annual report to the Department as additional GRANTEEs and hence forth contribute to the new job and payroll, and retained jobs and payroll commitments as set forth in the AGREEMENT, and\n \nWHEREAS, a First Amendment to the AGREEMENT is now needed for the purposes of adding McKesson Corporation, and all affiliates and subsidiaries related to the McKesson Corporation as additional GRANTEEs and parties to the AGREEMENT; and\n \nWHEREAS, the CITY desires to facilitate the future growth of the GRANTEE at the Project Site and capture all net new employees as required by the incentive and annual reporting; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                      That the Director of the Department of Development is hereby authorized to amend the dual-rate City of Columbus Jobs Growth Incentive Agreement with CoverMyMeds LLC to add McKesson Corporation, and all affiliates and subsidiaries related to the McKesson Corporation as listed in Exhibit A, and any other affiliates or subsidiaries owned or controlled by McKesson Corporation and which are reported to the Department of Development through McKesson Corporation’s annual report to the Department as additional GRANTEEs to the AGREEMENT and hence forth contribute to the job and payroll of the new and retained commitments as set forth in the AGREEMENT.\n \nSECTION 2.                     That the remaining terms of the dual-rate Jobs Growth Incentive Agreement remain in full effect relative to the Ordinance.\n \nSECTION 3.                     That the First Amendment to the City of Columbus Jobs Growth Incentive Agreement be signed by CoverMyMeds LLC and McKesson Corporation on behalf of itself and all affiliates and subsidiaries related to the McKesson Corporation within 90 days of passage of this ordinance, or this ordinance and the credit herein shall be null and void.\n \nSECTION 4.                     That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 149,
    "meeting_date": "2025-06-23",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Economic Development",
      "Grants"
    ]
  }
}