{
  "success": true,
  "vote": {
    "id": 12507,
    "item_number": "CA-39",
    "title": "To authorize the Board of Health to enter into contracts with (4) qualified vendors: AIDS Healthcare Foundation, Equitas Health, Columbus Neighborhood Health Center, Inc., dba Primary One Health and Lutheran Social Services of Central Ohio for EHE services for the period June 1, 2025 through May 31, 2026; to authorize the Board of Health to modify those contracts if portions of previously appropriated and encumbered funds are unused, and reallocate unused funds amongst the initial vendors without the need for additional legislation for Implementing Enhanced HIV Prevention and Surveillance for Health Departments to End the HIV Epidemic in Ohio grant program for the provision of services allowable under the grant; to authorize the expenditure of $492,272.00 from the Health Department Grants Fund to pay the costs thereof; and to declare an emergency. ($492,272.00)",
    "description": "...Explanation\n \nBACKGROUND:  Columbus Public Health (CPH) has been awarded grant funding for the Implementing Enhanced HIV Prevention and Surveillance for Health Departments to End the HIV Epidemic in Ohio grant program (EHE), from pass through agency, The Ohio Department of Health via Ordinance 1386-2025. This ordinance is needed to authorize four (4) contracts under the Implementing Enhanced HIV Prevention and Surveillance for Health Departments to End the HIV Epidemic in Ohio grant program. All contract terms included in this ordinance are from June 1, 2025 through May 31, 2026, with the following qualified vendors: AIDS Healthcare Foundation, Equitas Health, Columbus Neighborhood Health Center, Inc., dba Primary One Health and Lutheran Social Services of Central Ohio. \n \nThe vendors included in this ordinance are not for profit agencies and are exempt from bidding according to bidding requirements of the City Code 329.30. The EHE services incorporated in the contracts include, but not limited to, housing services, emergency financial assistance, resource navigation, and Counseling, Testing & Referral services. Contract price points are based on agency staffing projections and individual client counts for services based on enrolled clients in the program, and other estimated direct costs ancillary to EHE program initiatives. \n \nUnder the terms of the grant, this grant period is a twelve-month grant cycle, and funds must be used during the grant period or they are forfeited. Previously, CPH has reallocated unused funds from vendors through appropriate contract modifications. These modifications oftentimes required additional legislation. The listed vendors operate based on program staffing, varying client counts, and thus often leaving unspent funds. The Implementing Enhanced HIV Prevention and Surveillance for Health Departments to End the HIV Epidemic in Ohio grant program is an ancillary grant with five specific pillars: Diagnose, Treat, Prevent, Outbreak Response, and Community Engagement, to the Ending the HIV Epidemic grant program federally funded with HRSA. These pillars, specifically the prevention pillar can supplement HIV services for individuals within the priority population and allow needed services to be delivered to individuals at an elevated risk of acquiring HIV. As a result, this ordinance authorizes the Board of Health to enter into initial contracts with qualified vendors, modify those contracts if portions of previously appropriated and encumbered funds are unused and reallocate unused funds amongst the initial vendors without the need for additional legislation. \n \nAIDS Healthcare Foundation (EBO_CC-CC-010938): $58,650.00\nEquitas Health (EBO_CC-CC043135): $225,132.00\nColumbus Neighborhood Health Center, Inc., dba Primary One Health (EBO_CC-CC-005542): $60,000.00\nLutheran Social Services of Central Ohio (CC-006115): $148,490.00\nTotal Amount: $492,272.00\nEmergency action is required to ensure the continued operation of Implementing Enhanced HIV Prevention and Surveillance for Health Departments to End the HIV Epidemic in Ohio grant program from the Ohio Department of Health and to meet grant deliverables required by the grantor to avoid forfeiture of future funds.\n \nFISCAL IMPACT: This ordinance will authorize one ACPO in the amount of $492,272.00 to encumber funds using available grant appropriations for contracts with vendors. These contracts are funded entirely by a grant award from the Implementing Enhanced HIV Prevention and Surveillance for Health Departments to End the HIV Epidemic in Ohio grant program. \n \nTitle\nTo authorize the Board of Health to enter into contracts with (4) qualified vendors: AIDS Healthcare Foundation, Equitas Health, Columbus Neighborhood Health Center, Inc., dba Primary One Health and Lutheran Social Services of Central Ohio for EHE services for the period June 1, 2025 through May 31, 2026; to authorize the Board of Health to modify those contracts if portions of previously appropriated and encumbered funds are unused, and reallocate unused funds amongst the initial vendors without the need for additional legislation for Implementing Enhanced HIV Prevention and Surveillance for Health Departments to End the HIV Epidemic in Ohio grant program for the provision of services allowable under the grant; to authorize the expenditure of $492,272.00 from the Health Department Grants Fund to pay the costs thereof; and to declare an emergency. ($492,272.00)\n \nBody\n \nWHEREAS, Columbus Public Health has received funding from The Ohio Department of Health.\nWHEREAS, in order to ensure continued services provisions under the program, it is necessary to enter into a contract with (4) qualified vendors: AIDS Healthcare Foundation, Equitas Health, Columbus Neighborhood Health Center, Inc., dba Primary One Health and Lutheran Social Services of Central Ohio for EHE services; and\n \nWHEREAS, the contract period is June 1, 2025 through May 31, 2026; and\n \nWHEREAS, it is necessary to allow the Board of Health to enter into and modify contracts with vendors that are identified by CPH as qualified to provide the required services and meet requirements for the Grant; and\n \nWHEREAS, it is necessary for the Board of Health to reallocate appropriated and encumbered unused funds by modifying existing contracts amongst the initial vendors identified in this ordinance to provide the required services that meet federal requirements for this grant funding without the need for additional legislation; and\n \nWHEREAS, an emergency exists in the usual daily operation of Columbus Public Health in that it is immediately necessary to authorize the Board to enter into a contract with (4) qualified vendors: AIDS Healthcare Foundation, Equitas Health, Columbus Neighborhood Health Center, Inc., dba Primary One Health and Lutheran Social Services of Central Ohio to ensure the continued operation of the Ending the HIV Epidemic services (EHE) for the immediate preservation of the public health, peace, property, safety and welfare; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Board of Health is hereby authorized to enter into contracts for a total amount not to exceed $492,272.00 for Ending the Epidemic, for the period of June 1, 2025 through May 31, 2026, AIDS Healthcare Foundation, Equitas Health, Columbus Neighborhood Health Center, Inc., dba Primary One Health and Lutheran Social Services of Central Ohio.\n \nSECTION 2. That the Board of Health is hereby authorized to modify those contracts if portions of previously appropriated and encumbered funds are unused, and reallocate unused funds by modifying existing contracts amongst the initial vendors that are identified in this ordinance; to provide Ending the HIV Epidemic services without the need for additional legislation, for services allowable under Implementing Enhanced HIV Prevention and Surveillance for Health Departments to End the HIV Epidemic in Ohio grant program, from The Ohio Department of Health.\n \nSECTION 3.                     That to pay the cost of said contracts, the expenditure of $492,272.00, or so much thereof as may be needed, is hereby authorized from the Health Department Grants Fund, Fund No. 2251, object class 03 per the attached accounting document. \n \nSECTION 4.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \n SECTION 6.  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 149,
    "meeting_date": "2025-06-23",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Community Services",
      "Contracts & Agreements"
    ]
  }
}