{
  "success": true,
  "vote": {
    "id": 1252,
    "item_number": "CA-27",
    "title": "To authorize the reduction of appropriations in the Preserve, Dublin-Granville North and the NE PAWG Fund; to appropriate and/or authorize the transfer of monies from the Preserve, Dublin-Granville North, Dublin-Granville South and Dublin-Granville East TIF Funds and the NE PAWG Fund to either the Business Tax Incentive Fund or to a new project account within each of the TIF and PAWG Funds described herein; to appropriate and authorize the expenditure of 1) TIF revenues to be deposited into the Preserve, Dublin-Granville North, Dublin-Granville South, and Dublin-Granville East TIFs municipal public improvement tax increment equivalent funds and 2) per unit payments to be received by the City pursuant to the Amended EDA and to be deposited into the NE PAWG Fund (7772); to authorize the Director of Development to enter into the Amended and Restated Tax Increment Financing & Reimbursement Agreement with Hamilton Crossing, LLC to provide for the reimbursement to the City and Hamilton Crossing, LLC for design and construction costs of eligible public infrastructure improvements benefiting or serving the proposed development of the ±108.62 acres of real property currently owned or controlled by Hamilton Crossing, LLC located to the south of the N. Hamilton Road and State Route 161 interchange; and to declare an emergency.",
    "description": "Explanation\nBackground: The City and Hamilton Crossing, LLC (the “Company” or the “Developer”), entered into a First Partial Amended to Economic Development Agreement dated January 29, 2021 (the “Amended EDA”) with Casto AP Residential, LLC, The New Albany Company, LLC, and Center State Enterprises, LLC to modify the plans and commitments of the parties in the original Economic Development Agreement dated September 24, 2015 (the “Original EDA”) for the development of ±108.02 acres of real property owned or controlled by the Developer located adjacent to the N. Hamilton Road and State Route 161 interchange (the “Site”). The Developer is proposing to construct approximately $75,000,000 to $85,000,000 of Class A office, retail, and mixed use development (the “Project”). The Project is anticipated to include the design and construction of public infrastructure improvements on or adjacent to the Site in order to support the Project described herein. These public infrastructure improvements are expected to be constructed in a phased manner and these costs will be reimbursed through per unit payments and TIF revenue as well as new community authority (the “NCA”) charges, upon the submission of a petition for City Council consideration to create an NCA. \n \nPursuant to the Original EDA, the City and the Developer previously entered into a Tax Increment Financing Agreement dated March 20, 2017 (the “Original .40 TIF Agreement”) that provided for the reimbursement to the Developer for public infrastructure improvements from monies in the Preserve, Dublin-Granville North, and Dublin-Granville South TIF funds (the “Original TIF Funds”) among other financing. Pursuant to the Amended EDA and Ordinance 2791-2020, the City expanded the eligible public infrastructure improvements and created the Dublin-Granville East TIF and its TIF fund (collectively with the Original TIF Funds, the “TIF Funds”). The Developer and its partners, pursuant to the Amended EDA, reaffirmed their commitment to per unit payments and new NCA charges. These aforesaid monies herein will be used to reimburse the City and the Developer for public infrastructure improvements benefiting or serving the Site. This legislation approves and authorizes the Director of the Department of Development to enter into the Amended and Restated Tax Increment Financing & Reimbursement Agreement (the “Amended .40 TIF Agreement”) between the City and the Developer to provide for the terms of reimbursing the City and the Developer from the TIF Funds and the per unit payment funds for eligible public infrastructure improvements pursuant to the Amended .40 TIF Agreement; to appropriate and authorize the expenditure of the TIF Funds and the per unit payment funds per the terms of the Amended .40 TIF Agreement including the transfer of monies between and within funds in accordance with the Amended .40 TIF Agreement to account for the City’s future use of monies; to reduce appropriations in funds in order to free cash for the transfers within those funds in accordance with the amounts in the Amended .40 TIF Agreement. The Department of Development at a later date will submit for City Council consideration additional legislation to create the NCA and to enter into an intergovernmental cooperative agreement with the NCA (and Developer, if applicable) for the use of the NCA charges in accordance with the Amended EDA.\n \nFiscal Impact: No funding is required for this legislation. The City is reducing appropriations in funds and then appropriating and/or authorizing the transfer of monies between and within funds and appropriating and authorizing the expenditure of, in accordance with the Amended .40 TIF Agreement, 1) TIF revenues to be deposited into the Preserve, Dublin-Granville North, Dublin-Granville South, and Dublin-Granville East TIFs municipal public improvement tax increment equivalent funds and 2) per unit payments to be received by the City pursuant to the Amended EDA and to be deposited into the NE PAWG Fund (7772).\n \nEmergency Justification: Emergency legislation is necessary to authorize the Director of Development to enter into the Amended .40 TIF Agreement with the Developer concerning the development of the Project and Site in order to allow the Developer to maintain its project schedule by beginning the immediate development of the first phase of the Class A Office and public infrastructure improvements and to allow for continued reimbursement to the City and Developer. \n \nTitle\nTo authorize the reduction of appropriations in the Preserve, Dublin-Granville North and the NE PAWG Fund; to appropriate and/or authorize the transfer of monies from the Preserve, Dublin-Granville North, Dublin-Granville South and Dublin-Granville East TIF Funds and the NE PAWG Fund to either the Business Tax Incentive Fund or to a new project account within each of the TIF and PAWG Funds described herein; to appropriate and authorize the expenditure of 1) TIF revenues to be deposited into the Preserve, Dublin-Granville North, Dublin-Granville South, and Dublin-Granville East TIFs municipal public improvement tax increment equivalent funds and 2) per unit payments to be received by the City pursuant to the Amended EDA and to be deposited into the NE PAWG Fund (7772); to authorize the Director of Development to enter into the Amended and Restated Tax Increment Financing & Reimbursement Agreement with Hamilton Crossing, LLC to provide for the reimbursement to the City and Hamilton Crossing, LLC for design and construction costs of eligible public infrastructure improvements benefiting or serving the proposed development of the ±108.62 acres of real property currently owned or controlled by Hamilton Crossing, LLC located to the south of the N. Hamilton Road and State Route 161 interchange; and to declare an emergency.\n \nBody\nWHEREAS, the City pursuant to Section 5709.40(C) of the Ohio Revised Code, by its Ordinance No. 2117-2005 passed December 12, 2005, as amended by Ordinance 0715-2009 passed June 8, 2009, Ordinance 2258-2014 passed October 20, 2014, and Ordinance 3123-2016 passed December 12, 2016 (collectively, the \"Original TIFs Ordinance\"), established the Preserve, Dublin-Granville North, and Dublin-Granville South TIFs (the “Originals TIFs”) among other TIFs and their respective municipal public improvement tax increment equivalent funds as well as designated certain eligible public infrastructure improvements; and\n \nWHEREAS, the City and Hamilton Crossing, LLC (the “Company” or “Developer”) are parties to an Economic Development Agreement dated September 24, 2015 (the “Original EDA”) with Casto AP Residential, LLC, The New Albany Company, LLC, and Center State Enterprises, LLC (collectively, the “Development Team”) that concerned the public and private development of 330 acres of real property in northeast Columbus; and\n \nWHEREAS, pursuant to Ordinance 2842-2016 passed November 21, 2016, the City and the Developer entered into the Tax Increment Financing Agreement dated March 20, 2017 (the “Original .40 TIF Agreement”) in order to implement the Original EDA to use the TIF revenues from the Original TIFs among other financing to reimburse the Developer for certain public infrastructure improvements contemplated in the Original TIFs Ordinance and the Original EDA; and\n \nWHEREAS, the Developer is further proposing a mixed-use development consisting of Class A office and retail development, with the potential for hospitality and limited residential development on ±108.02 acres of real property owned or controlled by the Developer and its wholly owned subsidiaries generally located to the south of the intersection of Hamilton Road and State Route 161 (the “Site”); and\n \nWHEREAS, in order to develop the Site, the Developer agrees to provide initial financing for the design and construction costs required to complete the public infrastructure improvements, which are anticipated to include, but not be limited to: a new roadway called Central Boulevard, reconstruction of Old Dublin-Granville Road west of Hamilton Road, improvements of ramps at the Hamilton Road and State Route 161 interchange, widening of Hamilton Road from State Route 161 to Heathland Lane, parkland, structured parking, bike/pedestrian trails, and storm water mitigation (the “Public Infrastructure Improvements”); and\n \nWHEREAS, City Council by its Ordinance 2189-2020 passed October 5, 2020 authorized the Director of Development (the “Director”) to enter into an amendment to the Original EDA (the “Amended EDA”) with the Developer and the Development Team establishing the desire of the parties to affirm these above Developer commitments on condition of certain commitments from the City; and \n \nWHEREAS, as part of the Amended EDA and the City’s Public-Private Partnership (P3), the City committed to create the new “Dublin-Granville East TIF” area under Section 5709.40(B) of the Ohio Revised Code, to create a new community authority under Section 349.01 of the Ohio Revised Code (the “NCA”), to continue the Pay As We Grow (the “PAWG”) program per unit payments all in order to provide continuing and additional financing assistance for the Public Infrastructure Improvements; and\n \nWHEREAS, the City by its Ordinance 2791-2020 (the \"Dublin-Granville East TIF Ordinance\" and together with the Original TIFs Ordinance, the “TIF Ordinance”) amended the Original TIFs Ordinance to supplement the list of eligible public infrastructure improvements and to remove parcels from the Dublin-Granville North and South TIFs to then establish, from the removed parcels and additional non-exempted parcels, the Dublin-Granville East TIF and its respective municipal public improvement tax increment equivalent fund; and\n \nWHEREAS, the City’s commitment pursuant to the Amended EDA to provide additional financial assistance to for the Public Infrastructure Improvements is also contingent upon authorization of subsequent passage by City Council of appropriate legislation for the NCA upon submission of the Developer’s petition and authorization to enter into an intergovernmental cooperative agreement between the NCA and the City (and the Developer, if applicable); and\nWHEREAS, as contemplated in the Amended EDA, it is necessary and appropriate to authorize the Director to amend and restate the Original .40 TIF Agreement and enter into the Amended and Restated Tax Increment Financing & Reimbursement Agreement (the “Amended .40 TIF Agreement”) with the Developer to provide for the reimbursement for the Public Infrastructure Improvements to the City and the Developer; and\nWHEREAS, it is now necessary and appropriate to reduce certain appropriations in the Preserve TIF Fund (7438), Dublin-Granville North TIF Fund (7440), and the NE PAWG Fund (7772) in order to free up enough cash to transfer $3,529,350 within these funds to a new project account for future City use; and\nWHEREAS, it is now necessary to appropriate and authorize the transfer and/or expenditure of 1) TIF revenues to be deposited into the Preserve, Dublin-Granville North, Dublin-Granville South, and Dublin-Granville East TIFs municipal public improvement tax increment equivalent funds and 2) per unit payments to be received by the City pursuant to the Amended EDA and to be deposited into the NE PAWG Fund (7772) to either the City and/or the Developer for the Public Infrastructure Improvements in accordance with this Ordinance and the Amended .40 TIF Agreement; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Department of Development in that it is necessary to proceed as quickly as possible with the execution of said Amended .40 TIF Agreement described herein to allow the Developer to maintain its project schedule by beginning the immediate development of the first phase of the Class A Office on the Site and the Public Infrastructure Improvements all for the preservation of the public health, peace, safety and welfare without delay; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSection 1.                     That the Director of Development (the “Director”), for and in the name of the City, is hereby authorized to execute and deliver the Amended and Restated Tax Increment Financing & Reimbursement Agreement (the “Amended .40 TIF Agreement”) presently on file with the Director along with any changes or amendments thereto not inconsistent with this Ordinance and not substantially adverse to the City and which shall be approved by the Director and the City Attorney, provided that the approval of such changes and amendments thereto, and the character of those changes and amendments as not being substantially adverse to the City, shall be evidenced conclusively by the execution and delivery hereof.\n \nSection 2.                     That the Director or other appropriate officers of the City are authorized to execute such other agreements, modifications, and instruments, subject to approval by the City Attorney’s Office, and to take all actions as may be necessary to implement this Ordinance and the transactions contemplated by the Amended .40 TIF Agreement and the Amended EDA.\n \nSection 3.                     That the service payments in lieu of taxes and property tax rollback payments deposited into the Preserve, Dublin-Granville North, Dublin-Granville South, and Dublin-Granville East TIFs municipal public improvement tax increment equivalent funds (the “TIF Funds”) created by the TIF Ordinance and 2) the per unit payments to be received by the City pursuant to the Amended EDA and to be deposited into Fund 7772 (the “NE PAWG HQ Project Fund”) shall be deemed appropriated for the purposes set forth in this Ordinance and the Amended .40 TIF Agreement and authorized to be expended therefrom in accordance with the Amended .40 TIF Agreement, and the City Auditor is authorized to make payments to the Developer or its designee from the TIF Fund and the NE PAWG HQ Project Fund in accordance with the Amended .40 TIF Agreement upon order of the Director or his or her designee and that no order shall be drawn or money paid except by voucher, the form of which shall be approved by the City Auditor.\nSection 4.                     That the City Auditor is authorized to make annual transfers from each of the TIF Funds to BTI Fund 2229, subject to the authorization of the Director, for the City TIF Administrative Fee, as that term is described in the Amended .40 TIF Agreement and is currently $5,000 per each outstanding TIF included in the Amended .40 TIF Agreement pursuant to this Ordinance and Ordinance 3221-2018.\n \nSection 5.                     That appropriations currently authorized in the Preserve TIF Fund, Fund 7438, P438001, are hereby decreased by $145,670.35 according to the account codes in the attachment to this ordinance in order to free cash for transfer within the TIF Funds per this ordinance and the attachment to this ordinance.\n \nSection 6.                     That appropriations currently authorized in the Preserve TIF Fund, Fund 7438, P530103, are hereby decreased by $28,995.72 according to the account codes in the attachment to this ordinance in order to free cash for transfer within the TIF Funds per this ordinance and the attachment to this ordinance.\n \nSection 7.                     That appropriations currently authorized in the Dublin-Granville North TIF Fund, Fund 7440, P530103, are hereby decreased by $130,016.51 according to the account codes in the attachment to this ordinance in order to free cash for transfer within the TIF Funds per this ordinance and the attachment to this ordinance.\n \nSection 8.                     That appropriations currently authorized in the Northeast Corridor Pay As We Grow Fund, Fund 7772, P530103, are hereby decreased by $68,302.08 according to the account codes in the attachment to this ordinance.\nSection 9.                     That the City Auditor is authorized to transfer monies between projects within the TIF Funds and the NE PAWG HQ Project Fund per the attachment to this ordinance.\n \nSection 10.                     That the City Auditor is authorized to transfer monies between projects within the TIF Funds and the NE PAWG HQ Project Fund as cash is received in the TIF Funds and the NE PAWG HQ Project Fund up to a maximum of $3,529,350, subject to the authorization of the Director.\n \nSection 11.                     That the City Auditor is authorized to establish such accounting codes as necessary, to make any accounting changes to revise the funding source for all agreements, contracts, or modifications associated with this Ordinance and the transactions contemplated by the Amended .40 TIF Agreement and the Amended EDA.\n \nSection 12.                     That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account or subfund to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSection 13.                       That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 19,
    "meeting_date": "2021-06-28",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Economic Development"
    ]
  }
}