{
  "success": true,
  "vote": {
    "id": 12530,
    "item_number": "SR-7",
    "title": "To authorize the City Clerk to enter into a grant agreement with A Step in the Right Direction in support of its Hygiene Program; to authorize an appropriation of $33,980.00 within the Neighborhood Initiatives subfund; to authorize the expenditure of $51,480.00 within the Neighborhood Initiatives subfund; and to declare an emergency ($51,480.00)",
    "description": "Explanation\n \nThe purpose of this ordinance is to authorize the City Clerk to enter into a grant agreement with A Step in the Right Direction (SRD) in support of its Hygiene Program.  This ordinance authorizes an upfront payment to SRD to support these efforts. SRD does not currently have sufficient funds on-hand to await reimbursement for expenses incurred.\n \nA Step in the Right Direction is a nonprofit organization that helps individuals with re-entry into their community through different programs and resources.  It assists individuals through its three pillars:  Health Inequalities, Family Engagement, and Workforce Development.  \n \nThe Hygiene Program is designed to support low-income individuals and households by providing essential hygiene/cleaning products that promote health, dignity, and well-being. In 2025, the program aims to serve 8,000+ households and individuals, ensuring they have access to necessary items such as soap, shampoo, toothpaste, deodorant, cleaning supplies, and other personal care products. This year, SRD looks to expand the hygiene program to serve individuals of all zip codes in Central Columbus.\n \n \nFISCAL IMPACT:  $51,480.00 is available within the Neighborhood Initiatives subfund for this purpose.\n \nEMERGENCY DESIGNATION:  An emergency designation is requested in order for SRD to immediately provide these services without interruption to programming.  \n \n \nTitle\n \nTo authorize the City Clerk to enter into a grant agreement with A Step in the Right Direction in support of its Hygiene Program; to authorize an appropriation of $33,980.00 within the Neighborhood Initiatives subfund; to authorize the expenditure of $51,480.00 within the Neighborhood Initiatives subfund; and to declare an emergency ($51,480.00)  \n \n \nBody\n \nWHEREAS, there is need to help individuals with re-entry into their community through different programs and resources; and\n \nWHEREAS, the Hygiene Program is designed to support low-income individuals and households by providing essential hygiene/cleaning products that promote health, dignity, and well-being; and\n \nWHEREAS, Council is proposing support of $51,480.00 to A Step in the Right Direction in support of these needs; and \n \nWHEREAS, $51,480.00 is available within the Neighborhood Initiatives subfund for this purpose; and\n \nWHEREAS, an emergency exists in the usual daily operation of the City Clerk's Office in that it is necessary for the Clerk to enter into a contract immediately with A Step in the Right Direction to sustain the current operations in effect; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the City Clerk is hereby authorized to enter into a grant agreement with A Step in the Right Direction in support of its Hygiene Program.\n \nSECTION 2. That the City Auditor is hereby authorized and directed to appropriate $33,980.00 in the Neighborhood Initiatives subfund, fund 1000, subfund 100018, to Columbus City Council per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That the expenditure of $51,480.00 or so much thereof as may be needed pursuant to the action authorized in SECTION 1, is hereby authorized in the Neighborhood Initiatives subfund, fund 1000, subfund 100018, per the accounting codes in the attachment to this ordinance.\n \nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 149,
    "meeting_date": "2025-06-23",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}