{
  "success": true,
  "vote": {
    "id": 12535,
    "item_number": "SR-12",
    "title": "To authorize the Director of the Department of Building and Zoning Services to enter into a contract with LTR Intermediate Holdings Inc. DBA Liberty Tire Services of Ohio for services already rendered under the bid waiver provisions of Columbus City Code, Chapter 329; and to authorize an expenditure from the General Fund. ($2,507.75)",
    "description": "Explanation\nThis legislation authorizes the Director of the Department of Building and Zoning Services to enter into a contract with LTR Intermediate Holdings Inc. DBA Liberty Tire Services of Ohio in an amount up to $2,507.75.\n \nThe Weed and Solid Waste Abatement Program needs tire disposal services to allow vendors contracted under this program to properly dispose of scrap tires collected as they abate properties under Title 7 of the Columbus City Code. This program removes weeds, rank growth, and solid waste from properties when the owner has failed to comply with notices issued by Code Enforcement Officers and the city determines the best option is to abate the issue through this program.                     \n \nIn 2024, a Request for Quotations (RFQ027264) was published, and LTR Intermediate Holdings Inc. was awarded PO440944 as the only qualified bidder. The Director of Building and Zoning Services entered into contract with LTR Intermediate Holdings Inc. under the authority of Columbus City Code Section 329.19. The contract period for PO440944 was from May 1, 2024 to April 30, 2025 in the amount of $4,000.00.\n \nDue to a clerical error at LTR Intermediate Holdings Inc., the account for City of Columbus Weed & Solid Waste Abatement program’s Tire Disposal contract was credited in excess of the encumbered funds.  Due to this mistaken credit on the city’s account, invoices were not issued. When LTR Intermediate Holdings Inc. discovered the error, they contacted the program manager and explained the clerical error. However, by this time, the amount due exceeded the contract’s value and the contract was expired. These circumstances necessitate the use of a bid waiver to authorize this contract per the provisions of Columbus City Code, Chapter 329.\n \nThe Department of Building and Zoning Services incurred these additional costs according to the agreed-upon price schedule of the original contract, and this contract will allow it to compensate LTR Intermediate Holdings Inc. for services already rendered.\n \nFISCAL IMPACT: This ordinance authorizes the expenditure of $2,507.75 for this contract, which is available in Fund 1000, the General Fund. \n \nCONTRACT COMPLIANCE: \nVendor: LTR Intermediate Holdings Inc. (D365 Vendor Acct: 025457); Certification #: CC-025457 - Exp. 5/1/2027.\n \n \nTitle\nTo authorize the Director of the Department of Building and Zoning Services to enter into a contract with LTR Intermediate Holdings Inc. DBA Liberty Tire Services of Ohio for services already rendered under the bid waiver provisions of Columbus City Code, Chapter 329; and to authorize an expenditure from the General Fund. ($2,507.75)\n \n \nBody\nWHEREAS, it is the responsibility of the Weed and Solid Waste Abatement Program to abate properties deemed to be in violation of Columbus City Code, and the vendors contracted for this program need a facility to dispose of scrap tires; and\n \nWHEREAS, the Director of Building and Zoning Services has identified the need to enter into a contract with LTR Intermediate Holdings Inc. in an amount up to $2,507.75 for services provided to the Weed and Solid Waste Abatement Program; and\n \nWHEREAS, the work performed by LTR Intermediate Holdings Inc exceeded the value of PO440944, and their accounting error was not discovered until it was too late for a contract modification requiring that a new contract be entered into in accordance with the bid waiver provisions of Columbus City Code, Chapter 329; and\n \nWHEREAS, this contract will provide the funding to allow the Department of Building and Zoning Services to reimburse LTR Intermediate Holding Inc. for services already rendered; and\n \nWHEREAS, funds for this contract are budgeted in the 2025 Building and Zoning Services general fund budget; Now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                      That the Director of Building and Zoning Services be and is authorized to enter into a contract with LTR Intermediate Holdings Inc. in an amount up to $2,507.75 for services already provided to the Weed and Solid Waste Abatement Program.\n \nSECTION 2.                      That the expenditure of $2,507.75, or so much thereof as may be necessary, is hereby authorized in Fund 1000 (General Fund), Dept-Div 4302 (Code Enforcement), Object Class 03 (Purchased Services) per the accounting codes in the attachment to this ordinance. (See Ord. 1442-2025 Attachment)\n \nSECTION 3.   That this contract is made in accordance with the relevant provisions of Columbus City Code, Chapter 329 relating to bid waivers. (See Ord. 1442-2025 Waiver Form)\n \nSECTION 4.                     That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n                     \nSECTION 5.                      That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 149,
    "meeting_date": "2025-06-23",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Planning & Development"
    ]
  }
}