{
  "success": true,
  "vote": {
    "id": 1254,
    "item_number": "CA-29",
    "title": "To authorize the Human Resources Director to modify and increase the existing contract with Aon Consulting Inc., to provide additional employee benefit consulting services, specifically to allow Aon to assist with a vision care RFP; and to authorize the appropriation and expenditure of an additional $42,000.00 from the Employee Benefits Fund, medical subfund, or so much thereof as may be necessary to pay the costs of said contract; and to declare an emergency.\r\n($42,000.00)",
    "description": "Explanation\nThe Human Resources Department requests to modify and increase the existing contract with Aon Consulting Inc., the employee benefits consulting services vendor. The existing contract with Aon Consulting, Inc. was legislated via Ord. 0091-2021.  This modification provides funding to assist in generating and reviewing the vision care request for proposal (RFP) scheduled late this summer.\n \nThe current contract with Aon Consulting, Inc. includes in its scope of services assistance with two currently scheduled RFPs.  This third RFP for vision care was not included in the original scope as it was not anticipated when the original contract was signed earlier this year.\n \nThe total obligation under the original contract and all modifications is $518,000.00\n \nFISCAL IMPACT: Sufficient funding is available within the Employee Benefits Fund, medical subfund,for this contract modification.\n \nEmergency Action: Emergency action is being requested to allow the employee benefits consultant to assist staff in generating and reviewing the vision care RFP.\n \nTitle\nTo authorize the Human Resources Director to modify and increase the existing contract with Aon Consulting Inc., to provide additional employee benefit consulting services, specifically to allow Aon to assist with a vision care RFP; and to authorize the appropriation and expenditure of an additional $42,000.00 from the Employee Benefits Fund, medical subfund, or so much thereof as may be necessary to pay the costs of said contract; and to declare an emergency.\n($42,000.00)\n \nBody\nWHEREAS, it is in the best interest of the City of Columbus to modify and increase the existing contract with Aon Consulting Inc. to provide funding for additional contract costs associated with a generating and reviewing the vision care RFP; and\n \nWHEREAS, the scope of services in the original contract included assistance in generating and reviewing two RFPs for the department in 2021; and\n \nWHEREAS, it was not anticipated at the time the original contract was signed and legislated that a third RFP would need to be done in 2021; and\n \nWHEREAS, no other changes are being made to the contract; and\n \nWHEREAS, it is necessary to authorize the additional appropriation and expenditure of up to $42,000.00 for this project; and\n \nWHEREAS, an emergency exists in the usual daily operation of the city in that it is immediately necessary to modify and increase the existing contract with Aon Consulting Inc. and authorize additional appropriation and expenditure authority to pay the additional contract costs associated with a vision care RFP, thereby preserving the public health, peace, property, safety and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Human Resources Director is hereby authorized to modify and increase the existing contract with Aon Consulting Inc., to provide additional employee benefit consulting services for the vision care RFP.\n \nSECTION 2. That from the unappropriated monies in and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the 12 months ending February 28, 2022, the sum of $42,000.00 is appropriated from and within the Employee Benefits Fund 5502, Department of Human Resources, in object class 03 purchased services, per the account codes in the attachment to this ordinance.\n \nSECTION 3. That the expenditure of $42,000.00, or so much thereof as may be necessary, is hereby authorized from and within the Employee Benefits Fund 5502, in object class 03 purchased services per the accounting codes in the attachment of this ordinance.\n \nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves or vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 19,
    "meeting_date": "2021-06-28",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}