{
  "success": true,
  "vote": {
    "id": 12567,
    "item_number": "CA-18",
    "title": "To accept various deeds for parcels of real property to be used as road right-of-way; to dedicate these parcels as public rights-of-way; and to name said rights-of-way as public roadways as described within this Ordinance.  ($0.00)",
    "description": "Explanation\n1.  BACKGROUND\nFrom time to time, various parcels of land are deeded to the City of Columbus for public street and/or alley purposes.  One such example when this occurs is streets included in the Columbus Thoroughfare Plan.  Streets listed within the Plan have a pre-defined amount of required right-of-way.  If that right-of-way width is lacking for a particular property, then the additional right-of-way must be deeded to the City when that property is sold or is being redeveloped.  Another example is when developers install sidewalks, turn lanes, etc., on a property within the public right-of-way.  The City requires such improvements to be located entirely within the public right-of-way.  If any part of such improvements are outside of the public right-of-way, the developer must deed that part of the land to the City.  Many of the deeded amounts are for very small pieces of land.  All of the deeded land transactions go through the City Attorney's Office.       \n \nThe Department of Public Service maintains a list of the deeded land and periodically submits the list to City Council for acceptance of the deeded land.  Ohio Revised Code Chapter 723.03 requires that property proposed for use as a public street or alley must be accepted and dedicated as public right-of-way by an ordinance specifically passed for such purpose.  This Ordinance provides for the City to accept deeds for various parcels of real property, to dedicate the parcels as road right-of-way and to name the parcels as public roadways to comply with provisions of the City Charter and Ohio Revised Code Chapter 723.03.  Passage of this Ordinance also exempts the property deeded to the City from property taxes.\n \n2.  FISCAL IMPACT\nThere is no expenditure associated with this Ordinance.\n \nTitle\nTo accept various deeds for parcels of real property to be used as road right-of-way; to dedicate these parcels as public rights-of-way; and to name said rights-of-way as public roadways as described within this Ordinance.  ($0.00)\n                     \nBody\nWHEREAS, provisions of the City Charter and Ohio Revised Code Chapter 723.03 requires property to be used as a public street or alley be accepted and dedicated as public right-of-way by an ordinance specially passed for such purpose; and\n \nWHEREAS, the City of Columbus has been asked to accept various deeds for real property, to dedicate those parcels of real property for the purpose of road right-of-way, and to name said property as public roadways; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on October 23, 2024 as Instrument Number 202410230111351, Arnold Estate Investments II LLC has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on October 23, 2024 as Instrument Number 202410230111350, Christopher Jacobs has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on October 23, 2024 as Instrument Number 202410230111339, Avis Budget Car Rental, LLC has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a LIMITED WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on October 23, 2024 as Instrument Number 202410230111338, LJ Remainder LLC has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a LIMITED WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on October 23, 2024 as Instrument Number 202410230111336, CP Sawmill, LLC has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on November 26, 2024 as Instrument Number 202411260124637, Hudson Crossing LLC has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on December 11, 2024 as Instrument Number 202412110129841, Knot Yours Bus, LLC has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on December 20, 2024 as Instrument Number 202412200134262, Suliman Alomari and Mohammede E. Deek has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on December 31, 2024 as Instrument Number 202412310137448, Driven Brands, Inc. has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on December 31, 2024 as Instrument Number 202412310137450, 919 Old Henderson Road, LLC has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on December 6, 2024 as Instrument Number 202412060128217, D.R. Horton-Indiana, LLC has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on December 16, 2024 as Instrument Number 202412160132384, Thomas R. Lamp and Barbara A. Lamp has deeded property to the City of Columbus, to be used as road right-of-way; and  \n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on December 16, 2024 as Instrument Number 202412160132385, Thomas R. Lamp and Barbara A. Lamp has deeded property to the City of Columbus, to be used as road right-of-way; and  \n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on March 5, 2025 as Instrument Number 202503050021409, MJK Ventures Trabue LLC, Cliff Speck Trabue LLC, MJK Dynasty Trabue LLC, and NIK Dynasty LLC has deeded property to the City of Columbus, to be used as road right-of-way; and \n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on March 5, 2025 as Instrument Number 202503050021408, MJK Ventures Trabue LLC, Cliff Speck Trabue LLC, MJK Dynasty Trabue LLC, and NIK Dynasty LLC has deeded property to the City of Columbus, to be used as road right-of-way; and\n \n WHEREAS, by virtue of a GENERALWARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on March 14, 2025 as Instrument Number 202503140025112, Poppy Time LLC has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on March 14, 2025 as Instrument Number 202503140025111, 200 E Fifth LLC has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on March 14, 2025 as Instrument Number 202503140025107, 919 Old Henderson Road, LLC has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on March 14, 2025 as Instrument Number 202503140025106, Saver Motel, Inc. has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a LIMITED WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on October 13, 2023 as Instrument Number 202310130107588, Astor Park Office Owner LLC and Astor Park Residential I Owner LLC has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a LIMITED WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on October 13, 2023 as Instrument Number 202310130107590, Confluence Development, LLC has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on March 20, 2025 as Instrument Number 202503200026865, Board of Trustees of the Columbus Metropolitan Library has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a LIMITED WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on March 28, 2025 as Instrument Number 202503280031149 , Rumpke of Ohio, Inc. has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on April 10, 2025 as Instrument Number 202504100036009, Central Columbus Commerce 71 Development, LLC has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on September 29, 2023 as Instrument Number 202309290101922, Wirthman Realty Co., Ltd.  has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on April 14, 2025 as Instrument Number 202504140037432, Erie Land Co., LLC has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a QUITCLAIM DEED recorded in the Franklin County, Ohio, Recorder’s Office, on February 14, 2025 as Instrument Number 202502140015080, Anthony M. Roseboro, Trustee has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on April 28, 2025 as Instrument Number 202504280042681, The Clarkson at Holt LLC has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on April 29, 2025 as Instrument Number 202504290043321, Wirthman Realty Co., Ltd.  has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on April 29, 2025 as Instrument Number 202504290043320, Linda L. Scott has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on May 9, 2025 as Instrument Number 202505090047734, Suburban Centers, Inc.  has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on May 14, 2025 as Instrument Number 202505140049436, Man Land CW, LLC   has deeded property to the City of Columbus, to be used as road right-of-way; and\n \nWHEREAS, the City desires to accept these deeds for properties that will be used for road rights-of-way; NOW, THEREFORE;\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from ARNOLD ESTATE INVESTMENTS II LLC, and dedicates said property as road right-of-way and names such property as Winchester Pike. \n \nSECTION 2. That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from CHRISTOPHER JACOBS, and dedicates said property as road right-of-way and names such property as Park Road.\n \nSECTION 3. That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from AVIS BUDGET CAR RENTAL, LLC, and dedicates said property as road right-of-way and names such property as Drake Road and Sterling Avenue.\n \nSECTION 4. That the City of Columbus hereby accepts the property more fully described in the previously referenced LIMITED WARRANTY DEED from LJ REMAINDER LLC, and dedicates said property as road right-of-way and names such property as Thurman Avenue.\n \nSECTION 5. That the City of Columbus hereby accepts the property more fully described in the previously referenced LIMITED WARRANTY DEED from CP SAWMILL, LLC, and dedicates said property as road right-of-way and names such property as Sawmill Road.\n \nSECTION 6. That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from HUDSON CROSSING LLC, and dedicates said property as road right-of-way and names such property as Demorest Road.\n \nSECTION 7. That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from KNOT YOURS BUS, LLC, and dedicates said property as road right-of-way and names such property as Leonard Avenue and Brentnell Avenue.\n \nSECTION 8. That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from SULIMAN ALOMARI AND MOHAMMEDE E. DEEK, and dedicates said property as road right-of-way and names such property as Old Courtright Road.\n \nSECTION 9. That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from DRIVEN BRANDS, INC., and dedicates said property as road right-of-way and names such property as State Route 161 (Dublin-Granville Road).\n \nSECTION 10. That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from 919 OLD HENDERSON ROAD, LLC, and dedicates said property as road right-of-way and names such property as Midwest Drive and Old Henderson Road. \n \nSECTION 11. That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from D.R. HORTON-INDIANA, LLC, and dedicates said property as road right-of-way and names such property as Brice Road.\n \nSECTION 12. That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from THOMAS R. LAMP AND BARBARA A. LAMP, and dedicates said property as road right-of-way and names such property as Brice Road.\n \nSECTION 13. That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from THOMAS R. LAMP AND BARBARA A. LAMP, and dedicates said property as road right-of-way and names such property as Brice Road.\n \nSECTION 14. That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from MJK VENTURES TRABUE LLC, CLIFF SPECK TRABUE LLC, MJK DYNASTY TRABUE LLC, AND NIK DYNASTY LLC, and dedicates said property as road right-of-way and names such property as Trabue Road.\n \nSECTION 15. That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from MJK VENTURES TRABUE LLC, CLIFF SPECK TRABUE LLC, MJK DYNASTY TRABUE LLC, AND NIK DYNASTY LLC, and dedicates said property as road right-of-way and names such property as Trabue Road.\n \n SECTION 16. That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERALWARRANTY DEED from POPPY TIME LLC, and dedicates said property as road right-of-way and names such property as Fifth Avenue.\n \nSECTION 17. That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from 200 E FIFTH LLC, and dedicates said property as road right-of-way and names such property as North Fourth Street and a north/south unnamed alley.\n \nSECTION 18.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from 919 OLD HENDERSON ROAD, LLC and dedicates said property as road right-of-way and names such property as Midwest Drive and Old Henderson Road.\n \nSECTION 19. That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from SAVER MOTEL, INC., and dedicates said property as road right-of-way and names such property as Hamilton Road.\n \nSECTION 20. That the City of Columbus hereby accepts the property more fully described in the previously referenced LIMITED WARRANTY DEED from ASTOR PARK OFFICE OWNER LLC AND ASTOR PARK RESIDENTIAL I OWNER LLC, and dedicates said property as road right-of-way and names such property as Neiland Drive.\n \nSECTION 21. That the City of Columbus hereby accepts the property more fully described in the previously referenced LIMITED WARRANTY DEED from CONFLUENCE DEVELOPMENT, LLC, and dedicates said property as road right-of-way and names such property as Neiland Drive and Nordecke Drive.\n \nSECTION 22.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from BOARD OF TRUSTEES OF THE COLUMBUS METROPOLITAN LIBRARY, and dedicates said property as road right-of-way and names such property as Livingston Avenue.\n \nSECTION 23. That the City of Columbus hereby accepts the property more fully described in the previously referenced LIMITED WARRANTY DEED from RUMPKE OF OHIO, INC., and dedicates said property as road right-of-way and names such property as Parsons Avenue.\n \nSECTION 24. That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from CENTRAL COLUMBUS COMMERCE 71 DEVELOPMENT, LLC, and dedicates said property as road right-of-way and names such property as Joyce Avenue.\n \nSECTION 25. That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from WIRTHMAN REALTY CO., LTD., and dedicates said property as road right-of-way and names such property as Barnett Road.\n \nSECTION 26.  That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from ERIE LAND CO., LLC, and dedicates said property as road right-of-way and names such property as Brentnell Avenue.\n \nSECTION 27. That the City of Columbus hereby accepts the property more fully described in the previously referenced QUITCLAIM WARRANTY DEED from ANTHONY M. ROSEBORO, TRUSTEE, and dedicates said property as road right-of-way and names such property as London-Groveport Road.\n \nSECTION 28. That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from THE CLARKSON AT HOLT LLC, and dedicates said property as road right-of-way and names such property as Holt Road.\n \nSECTION 29. That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from WIRTHMAN REALTY CO., LTD., and dedicates said property as road right-of-way and names such property as Barnett Road and East Main Street.\n \nSECTION 30. That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from LINDA L. SCOTT, and dedicates said property as road right-of-way and names such property as Tussing Road.\n \nSECTION 31. That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from SUBURBAN CENTERS, INC., and dedicates said property as road right-of-way and names such property as Indianola Avenue.\n \nSECTION 32. That the City of Columbus hereby accepts the property more fully described in the previously referenced GENERAL WARRANTY DEED from MAN LAND CW, LLC,   and dedicates said property as road right-of-way and names such property as Town Hill Drive and Shannon Road.\n \nSECTION 33.  That all of the property identified in Sections 1 through 32 shall be used for road rights-of-way purposes.\n \nSECTION 34. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 150,
    "meeting_date": "2025-06-30",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Property & Real Estate",
      "Transportation"
    ]
  }
}