{
  "success": true,
  "vote": {
    "id": 12597,
    "item_number": "CA-48",
    "title": "To authorize the Director of the Department of Finance and Management to associate all General Budget Reservations resulting from this ordinance with the appropriate Universal Term Contract Purchase Agreements for the purchase of Light Duty Vehicles for the Division of Electricity from Ricart Properties, Inc.; and to authorize the expenditure of $169,552.82 from the Electricity Operating Fund. ($169,552.82)",
    "description": "Explanation\n \nThe Director of Finance and Management is hereby authorized to associate all General Budget Reservations resulting from this ordinance with the appropriate Universal Term Contract Purchase Agreement for Light Duty Vehicles for the Division of Power. This purchase has been approved by the Division of Fleet Management and will replace the following brass tag items: 18011, 25856 and 25360.\n \nThe company is not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.\n \nThe following Purchase Agreement association requires approval by City Council in order for the Division to expend more than $100,000.00, per 329.19(g): \nPA007217, Light Duty Vehicles, expires 6/30/27\n \nSUPPLIERS: \nRicart Properties, Inc., vendor #004963, expires 1/9/26, majority vendor\n \nFISCAL IMPACT: $169,552.82 is budgeted and needed for this purchase. \n$444,635.00 was spent in 2024\n$120,179.00 was spent in 2023\n \n \nTitle\n \nTo authorize the Director of the Department of Finance and Management to associate all General Budget Reservations resulting from this ordinance with the appropriate Universal Term Contract Purchase Agreements for the purchase of Light Duty Vehicles for the Division of Electricity from Ricart Properties, Inc.; and to authorize the expenditure of $169,552.82 from the Electricity Operating Fund. ($169,552.82)\n \n \nBody\n \nWHEREAS, the Purchasing Office established a purchase agreement for the purchase of Light Duty Vehicles; and\n \nWHEREAS, it is necessary to authorize the expenditure of up to $169,552.82 Electricity Operating Fund; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities to authorize the Finance and Management Director to associate all General Budget Reservations resulting from this ordinance with the Universal Term Contract Purchase Agreement for the purchase of Light Duty Vehicles; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Department of Finance and Management be and is hereby authorized to associate all General Budget Reservations resulting from this ordinance with the appropriate Universal Term Contract Purchase Agreement for the purchase of Light Duty Vehicles from Ricart Properties, Inc.\n \nSECTION 2. That this contract is in accordance with the relevant provisions of Chapter 329 of City Code.\n \nSECTION 3.  That the expenditure of $169,552.82 or so much thereof as may be needed, be and is hereby authorized in Fund 6300 Electricity Operating Fund in object class 06 Capital Outlay per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 150,
    "meeting_date": "2025-06-30",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements"
    ]
  }
}