{
  "success": true,
  "vote": {
    "id": 12601,
    "item_number": "CA-52",
    "title": "To authorize the Director of the Department of Public Service to file a Type 1 petition with Franklin County for the annexation of 0.098± acres within Blendon Township as provided in sections 709.021 and 709.022 of the Ohio Revised Code and to pay the associated filing fee; and to authorize the expenditure of up to $250.00 from the Street Construction Maintenance and Repair Fund. ($250.00)",
    "description": "Explanation\n \nBACKGROUND:  This ordinance is being submitted to authorize the Director of Public Service to file a Type 1 annexation petition of a 0.098 acre site in Blendon Township, Franklin County. The annexation involves right of way owned by the City on the north side of Central College Rd. A Type1 annexation petition is sought in this instance due to the existence of an annexation agreement between the City of Columbus and Blendon Township, which requires the filing of a Type1 annexation petition for annexations within Blendon Township. Additionally, this ordinance provides for the associated filing fee for the petition with Franklin County to be authorized and appropriated. This ordinance is required by the Ohio Revised Code as enacted by the General Assembly of the State of Ohio.  Upon approval by City Council, an annexation petition will be filed to the Franklin County Commissioners.\n \nFISCAL IMPACT:  This ordinance authorizes the Director of Public Service to appropriate and expend funds for the associated annexation petition filing fee. Provision of municipal services does represent cost to the City; however, the annexation of land also has the potential to create revenue for the City.\n \n \nTitle\n \nTo authorize the Director of the Department of Public Service to file a Type 1 petition with Franklin County for the annexation of 0.098± acres within Blendon Township as provided in sections 709.021 and 709.022 of the Ohio Revised Code and to pay the associated filing fee; and to authorize the expenditure of up to $250.00 from the Street Construction Maintenance and Repair Fund. ($250.00)\n \nBody\n \nWHEREAS, the City of Columbus owns 0.098± acres of right of way in Blendon Township on the north side of Central College Rd; and \n \nWHEREAS, the site is not currently within the City of Columbus; and\n \nWHEREAS, pursuant to an annexation agreement, the City of Columbus is seeking to file this annexation petition as an expedited Type-1 annexation petition under Ohio Revised Code Sections 709.021 and 709.022; and\n \nWHEREAS, the City is able to provide municipal services to this site; and\n \nWHEREAS, authorization by City Council is necessary for submission of a Type 1 annexation petition to the Board of Franklin County Commissioners; and\n \nWHEREAS, upon receipt of the petition by the City to annex the site, the Board of Franklin County Commissioners must take action by the next regular session of the Board of Commissioners; and\n \nWHEREAS, an associated filing fee for the Type 1 annexation petition with the Franklin County Economic Development & Planning Department must be authorized and appropriated; and\n \nWHEREAS,  the City of Columbus desires to add the referenced territory described in detail in section 1 below to its boundaries if the petition is approved by the Board of Franklin County Commissioners; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSection 1.  That the Director of Public Service is hereby authorized to file a Type 1 petition for annexation as outlined in sections 709.021 and 709.022 of the Ohio Revised Code for 0.098+/- acres in Blendon Township, Franklin County, located on the north side of Central College Rd, and described more specifically as follows and on the attached map:\nSituated in the State of Ohio, County of Franklin, Township of Blendon, lying in Quarter Township 1, Township 2 North, Range 17 West, United States Military District, being part of that 0.464 acre tract conveyed as Parcel Number 17-WD to City of Columbus, Ohio by deed of record in Instrument Number 202408280087560 (all references are to the records of the Recorder's Office, Franklin County, Ohio) and being more particularly described as follows: \n \nBeginning, for reference, at a southwesterly comer of said 0.464 acre tract, the southeasterly corner of that 0.072 acre tract conveyed as Parcel Number 34-WD to Franklin County Commissioners by deed of record in Official Record 31241 I06 in the centerline of Central College Road (width varies); \nThence, northeasterly, crossing said Central College Road, with the line common to said 0.464 and 0.072 acre tracts, a distance of approximately 30 feet to an angle point in the existing corporation line of City of Columbus as established in Ordinance Number 433-05 and Instrument Number 200506220121135, the TRUE POINT OF BEGINNING; \n \nThence northeasterly, continuing with said common line and said existing corporation line, a distance of approximately 5 feet to an angle point in the northerly right-of-way line of Central College Road, at a common comer of said 0.464 acre tract and the remainder of that 4.086 acre tract conveyed to William C. Snedegar, Trustee of the William C. Snedegar Revocable Trust by deed of record in Instrument Number 202408080080111; \n \nThence with said northerly right-of-way line, the line common to said 0.464 acre tract and the remainder of said 4.086 acre tract, with the proposed corporation line, the following courses and distances: \nSoutheasterly, a distance of approximately 290 feet to a point of curvature; and \nWith the arc of a curve to the left, having a length of approximately 197 feet to a point of compound curvature; \n \nWith the arc of a curve to the left, having a length of approximately 18 feet to a point of tangency; and \nEasterly, a distance of approximately 11 feet to an angle point in said existing corporation line, at a common comer of said 0.464 acre tract, the remainder of said 4.086 acre tract and Lot 2 of that plat titled \"Lee Acres No. 4\" of record in Plat Book 59, Page 34 as conveyed to Jamar G. Williams by deed of record in Instrument Number 200503140045541; \n \nThence southerly, with said existing corporation line, the line common to said 0.464 acre tract and said \"Lee Acres No. 4\" subdivision, a distance of approximately 10 feet to an angle point in said existing corporation line; \n \nThence continuing with said existing corporation line, across said 0.464 acre tract, the following courses and distances:\n \nWesterly, a distance of approximately 101 feet to a point; and\n \nNorthwesterly, a distance of approximately 423 feet to the TRUE POINT OF BEGINNING containing 0.098 acre more or less. \n \nThis description was prepared from record information only, should be used for annexation purposes only and should not be used for transfer.\n \nTotal perimeter of annexation area is 1055+/- feet, of which 539+/- is contiguous with the City of Columbus by Ordinance Number 433-05 and Instrument Number 200506220121135, giving 51% +/- perimeter contiguity. \n \nSection 2. That the expenditure of $250.00, or so much thereof as may be needed, is hereby authorized in Fund 2265 (Street Construction Maintenance and Repair Fund), Dept-Div 5912 (Design and Construction), Project P440106-100000 (Northeast MOU - Central College & Ulry/Lee Road Reconstruction), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance to pay the associated annexation petition filing fee to the Franklin County Economic Development & Planning Department.\n \nSection 3.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSection 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSection 5. That the City Clerk is hereby authorized and directed to perform such acts as set forth in O.R.C. 709.06, or as otherwise required by law, in order to ensure the proper recording of the annexation.\n \nSection 6.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 150,
    "meeting_date": "2025-06-30",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Public Works"
    ]
  }
}