{
  "success": true,
  "vote": {
    "id": 12610,
    "item_number": "SR-3",
    "title": "To authorize the Director of the Department of Technology, on behalf of the Office of Diversity and Inclusion, to enter into contract with OnActuate Consulting, Inc. for the for the completion of the B2Gnow Certification Management system; to authorize an amendment to the 2024 Capital Improvement Budget; to waive the competitive bidding provisions of the Columbus City Codes; and to authorize the expenditure of $26,000.00 from the General Permanent Improvement Fund. ($26,000.00)",
    "description": "Explanation\n \nThis ordinance authorizes the Director of the Department of Technology, on behalf of the Office of Diversity and Inclusion (ODI), to enter into contract with OnActuate Consulting, Inc., to complete the B2GNow Certification Management project. \nThe Office of Diversity and Inclusion uses the B2GNow application for provisioning and hosting of a citywide supplier diversity management system. On November 22, 2021, Ordinance 3023-2021 authorized the Director of the Department of Technology (DoT), on behalf of the Office of Diversity and Inclusion (ODI), to enter into contract with OnActuate Consulting, Inc. to finalize Phases I and II of the B2GNow Certification Management project. The original contract, associated with the above-mentioned ordinance, expired on December 31, 2022. On October 24, 2022, Ordinance 2686-2022 modified and extended an existing agreement with OnActuate Consulting, Inc. through extension of purchase order PO303024 through December 31, 2023.\nThis ordinance is to authorize the funds to be re encumbered in the amount of $26,000.00 and to enter into contract with OnActuate Consulting Inc. for the completion of the B2Gnow Certification Management system.\nAdditionally, this ordinance authorizes a waiver of competitive bidding, in accordance with relevant provisions of Chapter 329 of the Columbus City Code. Given the extensive work already performed by OnActuate Consulting Inc., on this project, it is in the city’s best interests to waive competitive bidding requirements.\nFISCAL IMPACT\nUpon cancellation of PO303024, the funds for this expenditure will be available within the Department of Technology, Fund 7748, General Permanent Improvement Fund.  \n \nCONTRACT COMPLIANCE\nOnActuate Consulting, Inc. \nDAX Vendor Account #: 027985\nContract Compliance Expiration Date: 4/5/2025\nOnActuate Consulting, Inc.’s contract compliance number is in the process of being renewed.\nTitle\nTo authorize the Director of the Department of Technology, on behalf of the Office of Diversity and Inclusion, to enter into contract with OnActuate Consulting, Inc. for the for the completion of the B2Gnow Certification Management system; to authorize an amendment to the 2024 Capital Improvement Budget; to waive the competitive bidding provisions of the Columbus City Codes; and to authorize the expenditure of $26,000.00 from the General Permanent Improvement Fund. ($26,000.00)\nBody\nWHEREAS, Ordinance 3023-2021 authorized the Director of the Department of Technology, on behalf of the Office of Diversity and Inclusion, to enter into contract with OnActuate Consulting, Inc., to finalize Phases I and II of the B2GNow Certification Management project; and\nWHEREAS, Ordinance 2686-2022 authorized the contract modification and extension of the contract with OnActuate Consulting, Inc. through extension of purchase order PO303024 through December 31, 2023; and\nWHEREAS, the Office of Diversity and Inclusion has a need to complete the final implementation of the B2GNow Certification Management project; and\nWHEREAS, it is necessary to enter into a contract with OnActuate Consulting, Inc. for the completion of the final implementation of the B2GNow Certification Management project of $26,000.00; and\nWHEREAS, it is necessary to cancel PO303024; and\nWHEREAS, it is necessary to authorize an amendment to the 2024 Capital Improvement Budget for the purpose of providing sufficient spending authority for the aforementioned project expenditure; and\n \nWHEREAS, a waiver of the bidding requirements of Columbus City Code Section 329 is requested to enter into contract with OnActuate Consulting, Inc.; and\n \nWHEREAS, it is necessary to authorize the Director of Technology to enter into contract with OnActuate Consulting, Inc., for the completion of the final implementation of the B2GNow Certification Management project; NOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1.  That the 2024 Capital Improvements Budget authorized by ordinance 1907-2024 be amended as follows to establish sufficient authority for this project:\n \nFund / Project / Project Name / C.I.B. / Change / C.I.B. as Amended\n7748 / P400015-100000 / Diversity Inclusion - Software Update / $0.00 / $26,000.00 / $26,000.00 (from cancellation, to match cash)\n \nSECTION 2.  That in accordance with Section 327.15 of the Columbus City Code, City Council has determined that it is in the best interest of the City of Columbus that Section 329.05 relating to formal competitive bidding requirements be waived and hereby waives said section.\n \nSECTION 3. That the Director of the Department of Technology, on behalf of the Office of Diversity and Inclusion, be and is hereby authorized to enter into contract with OnActuate Consulting, Inc. for the for the completion of the B2Gnow Certification Management system for the amount of $26,000.00.\nSECTION 4.  That the expenditure of $26,000.00, or so much thereof as may be needed, is hereby authorized in Fund 7748 (General Permanent Improvement Fund), Dept-Div 4702 (Department of Technology), Project P400015-100000 (Diversity Inclusion - Software Update), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 5.  That funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\nSECTION 6. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or all contract modifications associated with this ordinance.\nSECTION 7.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\nSECTION 8.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 150,
    "meeting_date": "2025-06-30",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Economic Development"
    ]
  }
}