{
  "success": true,
  "vote": {
    "id": 12634,
    "item_number": "SR-27",
    "title": "To Adopt and Support the Zone In Phase Two Priorities.",
    "description": "Explanation\nZoning is one of the most effective tools cities can use to manage change. In 2021, an assessment of the Columbus zoning code found that the code does not support our community’s aspiration to be an equitable, thriving city. With the anticipated growth of Columbus and central Ohio, the City has embarked on the Zone In initiative - the first comprehensive update of its zoning code in 70 years. The size and complexity of this task requires a phased approach. \n \nIn 2024, Phase One of the Zone In Initiative laid the groundwork for expanding access to housing and removing barriers to new construction by creating Title 34, the 2024 Zoning Code, which includes mixed-use zoning districts along major corridors. While this was a crucial first step in increasing housing opportunities across the city, affordability remains one of our biggest challenges as we continue to grow. To make housing truly accessible and affordable for all, the city must also ensure that residents have access to high-quality jobs with fair and sustainable wages, and expand areas where more housing can be constructed. \n \nIn order to address these issues, Phase Two of the Zone In Initiative will focus on expanding economic and housing opportunities for all Columbus residents by modernizing zoning regulations to support job growth, allow more housing, and foster prosperity citywide.  This will be done by focusing on areas that have been identified as being well-suited for enhanced mixed-used developments, industrial and warehouse operations, and business and institutional campuses, including hospitals, academic institutions, and office parks. New Title 34 zoning code and districts will be created, and the new districts will be mapped in this phase.\n \nIn conjunction with the work being done by the Zone In project team, the Department of Development, Planning Division, will also be building on the land use policies outlined in the Columbus Citywide Planning Policies (C2P2) by developing the Columbus Growth Strategy.\nTitle\nTo Adopt and Support the Zone In Phase Two Priorities.\nBody\nWHEREAS, Columbus is undertaking the Zone In Initiative, the first comprehensive zoning code update in 70 years, the second phase of which will focus on Economic and Housing Opportunity; and\n \nWHEREAS, Zone In is guided by five project goals outlining a modern zoning code that promote responsible development, improves affordability, and supports connected, vibrant communities, as well as the following Phase Two priorities; and\n \nWHEREAS, a priority is to continue to leverage key corridors to create more housing in more places to help address the city and the region’s housing shortages by supporting changes that make it easier and more likely to build more housing; and\n \nWHEREAS, a priority is to grow the local economy and support neighborhood investment by modernizing employment focused sites, supporting small businesses and guiding growth to benefit all neighborhoods; and\n \nWHEREAS, a priority is to connect housing, jobs, and transportation to make it easier for people to live near work, services, and transit; and\n \nWHEREAS, a priority is to promote high quality development with a code that relies on clear, objective standards, and is easier to navigate; and\n \nWHEREAS, the phase two priorities draw on past community engagement, extensive technical analysis, adopted land use and community plans, as well as larger efforts such as the Columbus Housing Strategy, LinkUS, and the Climate Action Plan; and\n \nWHEREAS, in conjunction with the work done by the Zone In project team on community engagement related to Phase Two, the Department of Development’s Planning Division will be amending the land use policies in the Columbus Citywide Planning Policies; NOW, THEREFORE:\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: \nThat this Council adopts and supports the Zone In Phase Two priorities and directs the Zone In project team to apply these priorities in the development of recommendations for updated zoning during Phase Two of the effort and supports the plan to engage the community throughout the upcoming months as it relates to building on the land use policies in the Columbus Citywide Planning Policies and amendments thereto.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 150,
    "meeting_date": "2025-06-30",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "General"
    ]
  }
}