{
  "success": true,
  "vote": {
    "id": 12648,
    "item_number": "CA-3",
    "title": "To authorize the Director of the Department of Finance and Management to enter into a contract with Central Window Cleaning, on behalf of the Facilities Management Division, for window cleaning services; to authorize the expenditure of $119,240.00 from the General Fund. ($119,240.00)",
    "description": "Explanation\nBACKGROUND: This legislation authorizes the Finance and Management Director to enter into a contract on behalf of the Facilities Management Division with Central Window Cleaning for window cleaning services at various locations during the Spring and Fall seasons.\nThe Facilities Management Division solicited via RFQ030333 and received three formal bids for window cleaning services on May 19, 2025. Central Window Cleaning was deemed the lowest, responsive, and responsible bidder and was therefore awarded the contract for window cleaning services for locations under the purview of the Facilities Management Division. \nCentral Window Cleaning                     $119,240.00\nThe Hepburn Group LLC                     $123,980.00\ndba Squeegee Squad\nPrime Maids Cleaning Service                     $161,788.97\n \nCentral Window Cleaning - FIN 30-0703630.\nFiscal Impact: This ordinance authorizes an expenditure of $119,240.00 from the General Fund to enter into a contract with Central Window Cleaning for window cleaning services at various locations during the Spring and Fall seasons. \nTitle\nTo authorize the Director of the Department of Finance and Management to enter into a contract with Central Window Cleaning, on behalf of the Facilities Management Division, for window cleaning services; to authorize the expenditure of $119,240.00 from the General Fund. ($119,240.00)\nBody\nWHEREAS, the Facilities Management Division solicited formal bids for window cleaning services; and \nWHEREAS, the city received three bids; and \nWHEREAS, Central Window Cleaning was deemed the lowest, most responsive and responsible bidder; and \nWHEREAS, it is necessary to authorize a contract and the expenditure of $119,240.00 from the General Fund; NOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1. That the Director of the Department of Finance and Management is hereby authorized to enter into a contract, on behalf of the Facilities Management Division, with Central Window Cleaning for window cleaning services.\nSECTION 2. That the expenditure of $119,240.00, or so much thereof as may be needed, is hereby authorized in the General Fund 1000, in Object Class 03 Contractual Services per the accounting codes in the attachment in this ordinance.\nSECTION 3. That the monies in the foregoing sections shall be paid upon order of the Director of Finance and Management, and that no order shall be drawn or money paid except by voucher, the form of which shall be approved by the City Auditor.\nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\nSECTION 6. That this contract is made and entered into in accordance with Chapter 329 of the Columbus City Code\nSECTION 7. That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 151,
    "meeting_date": "2025-07-14",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Public Works"
    ]
  }
}