{
  "success": true,
  "vote": {
    "id": 12646,
    "item_number": "CA-1",
    "title": "Celebrating the 25th Anniversary of the Southfield Reunion",
    "description": "Title\n \nCelebrating the 25th Anniversary of the Southfield Reunion \n \nBody\n \nWHEREAS, the Southfield Reunion was founded in the year 2000, when friends and family gathered at the home of Barbara Sinkler-Williams in Columbus, Ohio, to celebrate the life of Marcus Sinkler and reflect on their childhoods, community roots, and the powerful bonds that connect them; and \nWHEREAS, from this gathering emerged the vision of hosting a community cookout at Marion-Franklin Park, an idea that blossomed into a transformative event which, on July 15, 2000, drew more than 500 people together to celebrate not merely a reunion but a true homecoming and revival of community spirit; and \n \nWHEREAS, over the past 25 years, the Southfield Reunion has grown from a one-time gathering into a powerful movement dedicated to fostering unity, bridging generational gaps, celebrating shared histories, and empowering youth to embrace leadership roles within the community; and \n \nWHEREAS, overtime, the reunion has established a mission focused on creating spaces for dialogue, mentorship, and leadership development, ensuring that each new generation carries forward the values of connection, love, and service, while honoring the sacrifices and contributions of those who came before; and \n \nWHEREAS, the 2025 theme, “Quarter Century, Our Legacy Continues,” serves as a testament to the Southfield Reunion’s enduring commitment to unity, legacy, and vision for the future, inspiring current and future generations to continue building bridges and preserving community heritage; now, therefore\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: That this Council hereby recognizes and celebrates the Southfield Reunion on the occasion of its 25th anniversary, honoring its remarkable contributions to fostering unity, community engagement, and generational connection “Southfield 4Ever. The Legacy Lives On.”",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 151,
    "meeting_date": "2025-07-14",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}