{
  "success": true,
  "vote": {
    "id": 12664,
    "item_number": "CA-19",
    "title": "To amend the 2024 Capital Improvement Budget; to authorize the City Auditor to transfer cash and appropriation between projects within the Development Taxable Bonds Fund; to authorize the Director of Development to enter into a grant agreement with Columbus Next Generation Corporation to purchase, renovate, or construct real property assets in targeted central city areas to advance economic and community development initiatives; to authorize the expenditure of $550,000.00 from the Development Taxable Bond Fund; to advance funding per a predetermined schedule; and to declare an emergency. ($550,000.00)",
    "description": "Explanation\nBACKGROUND:\nThis ordinance authorizes the Director of Development to enter into a grant agreement with Columbus Next Generation Corporation in an amount up to $550,000.00 for the purpose of purchasing, renovating, and or constructing urban real property assets in targeted central city areas to advance economic and community development initiatives.\n                                          \nOn October 3, 2012, City Council passed Ordinance 1968-2012 which established a nonprofit development corporation, Columbus Next Generation Corporation, for the purpose of advancing, encouraging, and promoting industrial, economic, and commercial development in the City of Columbus and named the City of Columbus as the sole member of the entity. This corporation is charged with eliminating blight and creating job opportunities as well.  \n \nGrant funding will be advanced to Columbus Next Generation Corporation for expenses due at time of closing.\n \nEMERGENCY:  Emergency action is requested to ensure funds are available for purchase of properties prior to the end of the current year to facilitate the redevelopment of key urban areas.\n                                                                                                         \nFISCAL IMPACT: Funding is available with the Development Taxable Bonds Fund, 7739.\n \nCONTRACT COMPLIANCE:  The vendor’s contract compliance number is 008637 and expires on 5/02/27.\n \n \nTitle\nTo amend the 2024 Capital Improvement Budget; to authorize the City Auditor to transfer cash and appropriation between projects within the Development Taxable Bonds Fund; to authorize the Director of Development to enter into a grant agreement with Columbus Next Generation Corporation to purchase, renovate, or construct real property assets in targeted central city areas to advance economic and community development initiatives; to authorize the expenditure of $550,000.00 from the Development Taxable Bond Fund; to advance funding per a predetermined schedule; and to declare an emergency. ($550,000.00)\n \n \nBody\nWHEREAS, Ordinance 1968-2012, passed by City Council on October 10, 2012, authorized the Mayor of the City of Columbus to create and establish a nonprofit corporation (Columbus Next Generation Corporation) to advance, encourage, and promote industrial, economic and commercial development as well as eliminate blight and create jobs; and\n \nWHEREAS, Columbus Next Generation Corporation performs a variety of services to advance economic development, including but not limited to, creation of economic development plans for specific areas of the city, develops and promotes incentives, acquires and develops real estate, and manages various related projects; and\n \nWHEREAS, it is necessary to authorize an amendment to the 2024 Capital Improvement Budget for the purpose of providing sufficient spending authority for the project expenditure; and\n \nWHEREAS, it is necessary for Council to authorize a transfer of funds and appropriation within Fund 7739 (Development Taxable Bonds Fund) to establish sufficient cash to pay for the project; and\n \nWHEREAS, this ordinance authorizes the Director of Development to enter into a grant agreement in the amount of $550,000.00 with Columbus Next Generation Corporation for the purchasing, renovating, and or constructing urban real property assets in targeted central city areas to advance economic and community development initiatives; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to enter into an agreement with Columbus Next Generation Corporation to begin the purchase of properties by year end in order to facilitate the redevelopment of key urban areas, all for the immediate preservation of the public health, peace, property, safety and welfare; and Now, Therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the 2024 Capital Improvements Budget authorized by Ordinance 1907-2024 be amended as follows to establish sufficient authority for this project:\n \nFund / Project / Project Name / Current / Change /Amended\n7739 / P200025-100000 / Accessory Dwelling Units (Unvoted Carryover) /$700,000.00 / ($550,000.00) / $150,000.00\n7739 / P440104-100024 / Strategic Acquisition Fund (Unvoted Carryover) /$0.00 / $550,000.00 / $550,000.00\n \nSECTION 2. That the Director of Development be and is hereby authorized to enter into a Grant Agreement in an amount up to $550,000.00, with Columbus Next Generation Corporation to purchase, renovate, or construct real property assets in targeted central city areas and to advance funding per a predetermined schedule.  \n \nSECTION 3. That the transfer of $550,000.00 or so much thereof as may be needed, is hereby authorized between projects within Fund 7739 Development Taxable Bonds per the account codes in the attachment to this ordinance.\n \nSECTION 4. The expenditure of $550,000.00, or so much thereof as may be needed, is hereby authorized in Fund 7739 (Development Taxable Bonds Fund), in Dept-Div 4402 (Economic Development), Project P440104-100024 (Strategic Acquisition Fund), in Object Class 06 (Capital Outlay) per the account codes attached to this ordinance.\n \nSECTION 5.  That the funds necessary to carry out the purpose of this Ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.  That the City Auditor is hereby authorized and directed to transfer any unencumbered balance in the project account to the unallocated balance within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies no longer required for said project; except that no transfer shall be made from a project account by monies from more than one source.\n \nSECTION 7.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this Ordinance.\n \nSECTION 8.  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 151,
    "meeting_date": "2025-07-14",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}