{
  "success": true,
  "vote": {
    "id": 12717,
    "item_number": "SR-7",
    "title": "To authorize the Director of the Department of Technology, on behalf of the Columbus Department of Public Health to enter into a professional services contract with 3SG Plus, LLC for the migration to the Accela Environmental Health platform; to waive the competitive bidding provisions of the Columbus City Codes; to authorize the expenditure of $258,000.00 from the Information Services Bond Fund. ($258,000.00)",
    "description": "Explanation\n \nThis ordinance authorizes the Director of the Department of Technology, on behalf of the Columbus Department of Public Health, to enter into a professional services contract with 3SG Plus, LLC for the migration from the Decade EnvisionConnect system to the Accela Environmental Health platform for the amount up to $258,000.00.\nThe Decade EnvisionConnect system provided the Columbus Public Health Department the ability to operate the Environmental Health unit by providing an extensive array of services such as tracking and maintaining information associated with inspections, historical data of restaurants and other businesses, tracking sanitation standards data, vector control for mosquitoes, environmental reviews, accounts receivable, payable and billings as well as statistics and analysis regarding the Environmental Health unit. Without this service, the Columbus Public Health Department would lose the ability to operate the Environmental Health unit, which could result in the failure to meet requirements mandated by the State of Ohio. \nThe Decade EnvisionConnect system was acquired by Accela in November 2014. In 2024, Accela announced plans to decommission the Decade EnvisionConnect system and encourage users to migrate to the Accela Environmental Health platform and its enhanced functionality. To continue to meet mandated State of Ohio requirements, Columbus Public Health has made the decision to migrate to the new system.\nAdditionally, this ordinance authorizes a waiver of competitive bidding, in accordance with relevant provisions of Chapter 329 of the Columbus City Code in order to complete the project with the necessary timeline. The term of the contract will be one year, beginning on the date of a confirmed purchase order by the City Auditor’s Office, at a cost of $258,000.00.\nFISCAL IMPACT\nThe funds for this expenditure have been identified and are available within the Department of Technology, Fund 5105, Information Services Bond Fund.  \nCONTRACT COMPLIANCE\nVendor Name: 3SG Plus, LLC\nDAX Vendor Acct. #: 019867\nExpiration Date: 10/31/2025\nTitle\nTo authorize the Director of the Department of Technology, on behalf of the Columbus Department of Public Health to enter into a professional services contract with 3SG Plus, LLC for the migration to the Accela Environmental Health platform; to waive the competitive bidding provisions of the Columbus City Codes; to authorize the expenditure of $258,000.00 from the Information Services Bond Fund. ($258,000.00)\nBody\nWHEREAS, the Department of Public Health has a need to migrate from the Decade EnvisionConnect system to the Accela Environmental Health platform; and\nWHEREAS, it is necessary for the Director of the Department of Technology, on behalf of the Columbus Department of Public Health to enter into a contract with 3SG Plus, LLC for the migration from the Decade EnvisionConnect system to the Accela Environmental Health platform for the amount up to $258,000.00; and\nWHEREAS, a waiver of the bidding requirements of Columbus City Code Section 329 is requested to enter into contract with 3SG Plus, LLC; and\nWHEREAS, the funds are available in the Department of Technology, Fund 5105, Information Services Bond Fund; and\nWHEREAS, it is necessary to authorize the Director of the Department of Technology, on behalf of the Columbus Department of Public Health, to enter into a professional services contract with 3SG Plus, LLC for the migration from the Accela Environmental Health platform for the preservation of the public health, peace, property and safety and welfare, now, therefore\nNOW, THEREFORE, BE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1. That the Director of the Department of Technology, on behalf of the Columbus Department of Public Health, be and is hereby authorized to enter into a professional services contract with 3SG Plus, LLC for the migration of the Decade EnvisionConnect system to the Accela Environmental Health platform for a period of one year from the date of a confirmed purchase order by the City Auditor’s Office at a cost up to the amount up to $258,000.00.\nSECTION 2.  That the expenditure of $258,000.00, or so much thereof as may be needed, is hereby authorized in Fund 5105 (Information Services Bond Fund), Dept-Div 4702 (Department of Technology), Project P470081-100000 (Envision Connect Data Migration), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance. (See 1637-2025EXP)\nSECTION 3. That this Council finds it in the City's best interest to waive the competitive bidding provisions of Chapter 329 of City Code to enter into this contract.\nSECTION 4.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or all contract modifications associated with this ordinance.\nSECTION 6.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\nSECTION 7. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 151,
    "meeting_date": "2025-07-14",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}