{
  "success": true,
  "vote": {
    "id": 12742,
    "item_number": "SR-32",
    "title": "To authorize the Director of the Department of Public Utilities to enter into a construction contract with Travco Construction Inc. and John Eramo & Sons Inc. for the 2025 Water Main Repairs project; to authorize an amendment to the 2024 Capital Improvement Budget; to authorize a transfer of cash and appropriation between projects within the Water Bond Fund; and to authorize the expenditure of up to $2,347,849.86 for the project.  ($2,347,849.86)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Utilities to enter into construction contracts for the 2025 Water Main Repairs project, CIP No. 690521-100013, with the following companies:\n•                     Travco Construction Inc., in an amount up to $1,023,239.36.\n•                     John Eramo & Sons Inc., in an amount up to $1,320,610.50\n \nThis ordinance also encumbers funds with the Department of Public Service for prevailing wage services in an amount of $2,000.00 for each company, for a total of $4,000.00 for the prevailing wage services.\n \nThis contract will provide the necessary labor and equipment to complete repairs to water mains at various locations within the Columbus Water Distribution System on an as needed basis.\n \nThis project was bid with the following language in the bid documents “The City reserves the right to award up to two contracts to the first, and second lowest, responsive and responsible bidders if it is in the best interest of the City to do so. If multiple contracts are awarded, the contracts will run concurrently and will be non-exclusive. The City may utilize any of the contracts at the discretion of the City.”  Upon review of the bids submitted the City has decided to award the two lowest bidders a contract for the project work.\n \nThe Community Planning Area is 99 - Citywide.\n \nTIMELINE:  Contract work is required to be completed in a manner acceptable to the City within 730 days from the date that a Notice to Proceed (NTP) is given by the City.\n \nESTIMATED COST OF PROJECT:  The bid amount and proposed award amount for Travco Construction is $1,023,239.36, including a 10% construction contingency amount that will be utilized to fund needed and approved changes in the work. No contract modifications are anticipated at this time; however, construction exigency might later compel modification of this contract, if unforeseen difficulties are encountered.\n \nThe bid amount and proposed award amount for John Eramo & Sons Inc. is $1,320,610.50, including a 10% construction contingency amount that will be utilized to fund needed and approved changes in the work. No contract modifications are anticipated at this time; however, construction exigency might later compel modification of this contract, if unforeseen difficulties are encountered.\n \nCost summary: Travco Construction\n \nOriginal Contract                                               $1,023,239.36\nFuture Anticipated Needs                          $            0.00\nCONTRACT TOTAL                                               $1,023,239.36\nPrevailing Wage Charge                          $      2,000.00\n                                                                                          $1,025,239.36\n \nCost summary: John Eramo & Sons Inc.\n \nOriginal Contract                                               $1,320,610.50\nFuture Anticipated Needs                          $            0.00\nCONTRACT TOTAL                                               $1,320,610.50\nPrevailing Wage Charge                          $      2,000.00\n                                                                                          $1,322,610.50\n \nTotal project expenditure:                          $2,347,849.86\n \n2.  ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT\nThese contracts will provide assistance to our water line maintenance crews in completing water main break repairs in a timely matter should the number of breaks exceed our normal maintenance capacities.\n \n3.  BID INFORMATION\nThis project was formally advertised on the Vendor Services and Bid Express websites from 2/4/2025 through 3/19/25.   Three bids were received:\n \n     Name                                          Bid Amount_______City/State                     Status                     \nTravco Construction Inc.                         $1,023,239.36                Grove City, OH                             MAJ\nJohn Eramo & Sons Inc.                         $1,320,610.50                             Hilliard, OH                             MAJ\nJLD Construction Services LLC    $1,413,172.00                                     Columbus, OH                             MBE\n \nThe certification of Travco Construction Inc. and John Eramo and Sons Inc. was in good standing at the time of the contract award.\n \n4.  CONTRACT COMPLIANCE INFORMATION\nTravco Construction Inc.’s contract compliance number is CC009944 and expires 9/3/26.  Searches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against Travco Construction Inc. \n \nJohn Eramo & Sons Inc.’s contract compliance number is CC004251 and expires 10/31/25.  Searches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against Travco Construction Inc.\n \nAs part of their proposal, Travco Construction Inc. proposed the following subcontractor to perform contract work:\n \nCompany Name                                            City/State                                     ODI Certification Status \nDecker Construction Company                    Columbus, Ohio                                                        MAJ\nBronze Star                                                Columbus, Ohio                                                        MBE            \n \nThe certification of Travco Construction Inc. the proposed subcontractor was in good standing at the time the bid was awarded.\n \nAs part of their proposal, John Eramo & Sons Inc.  proposed the following subcontractor to perform contract work:\n \nCompany Name                                            City/State                                     ODI Certification Status \nDecker Construction Company                    Columbus, Ohio                                                        MAJ                                 \nNewcomer Concrete                                    Norwalk, Ohio                                                        MAJ\nDonley Concrete and Sawing                  Pickerington, Ohio                                                         MAJ\nBridges Brothers Trucking                          Columbus, Ohio                                                         MBE\nMid-West Landscaping                               Columbus, Ohio                                                         MAJ\n \nThe certification of the above company was in good standing at the time the bid was awarded.\n \n5. PRE-QUALIFICATION STATUS\nTravco Construction Inc. and all subcontractors have met code requirements with respect to pre-qualification, pursuant to relevant sections of Columbus City Codes Chapter 329. \n \nJohn Eramo & Sons Inc. and all subcontractors have met code requirements with respect to pre-qualification, pursuant to relevant sections of Columbus City Codes Chapter 329.\n \n6.  FISCAL IMPACT\nFunding in the amount of $2,347,849.86 is available and appropriated within the Water Bond Fund, Fund 6006.  An amendment to the 2024 Capital Improvement Budget is needed to align budget authority with the proper project.  It is also necessary to transfer cash and appropriation between projects within the Water Bond Fund, Fund 6006, to align cash and appropriation with the proper project.  \n \nTitle\nTo authorize the Director of the Department of Public Utilities to enter into a construction contract with Travco Construction Inc. and John Eramo & Sons Inc. for the 2025 Water Main Repairs project; to authorize an amendment to the 2024 Capital Improvement Budget; to authorize a transfer of cash and appropriation between projects within the Water Bond Fund; and to authorize the expenditure of up to $2,347,849.86 for the project.  ($2,347,849.86)\n \nBody\nWHEREAS, the Department of Public Utilities is engaged in the 2025 Water Main Repairs project; and\n \nWHEREAS, three bids for the 2025 Water Main Repairs project was received and opened on 3/19/25; and\n \nWHEREAS, the bid included a clause allowing up to two companies to be awarded a contract; and \n \nWHEREAS, the Department of Public Utilities, Division of Water, recommended accepting the bids of the two lowest bidders, Travco Construction Inc. and John Eramo & Sons Inc and awarding contracts to them; and\n \nWHEREAS, it is necessary to authorize the Director of the Department of Public Utilities to enter into a construction services contract with Travco Construction Inc. and John Eramo & Sons Inc. for the 2025 Water Main Repairs project; and \n \nWHEREAS, the 2024 Capital Improvements Budget must be modified to align budget authority with the proper project; and\n \nWHEREAS, a transfer of cash and appropriation between projects within the Water bond fund, Fund 6006, is needed to align cash and appropriation with the proper project; and\n \nWHEREAS, it is necessary to expend funds to pay for this project; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2024 Capital Improvements Budget authorized by Ordinance 1907-2024 be amended as follows to establish sufficient budget authority for this project:\n \nFund / Project Number / Project Name (Funding Source) / Current Authority/ Revised Authority / Change \n6006 / 690444-100000 / O'Shaughnessy Hydroelectric Imps. (Voted Water Carryover) / $1,134,700.00 / $3,611,016.00 / $2,476,316.00 (To match cash due to a recently submitted cancellation)\n \n6006 / 690444-100000 / O'Shaughnessy Hydroelectric Imps. (Voted Water Carryover) / $3,611,016.00 / $1,263,166.00 / ($2,347,850.00)  \n \n6006 / 690521-100013 / 2025 Water Main Repairs (Voted Water Carryover) / $0.00 / $2,347,850.00 / $2,347,850.00\n \nSECTION 2.  That the transfer of $2,347,849.86 between projects within the Water Bond Fund, Fund 6006, is authorized per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That the Director of Public Utilities is hereby authorized to enter into a construction services contract for the 2025 Water Main Repairs project with Travco Construction Inc., 5506 Harrisburg Pike, Grove City, Ohio 43123, in an amount up to $1,023,239.36, in accordance with the terms and conditions of the contract on file in the Department of Public Utilities; and to obtain the necessary prevailing wage services from the Department of Public Service and to pay up to a maximum amount of $2,000.00.\n \nSECTION 4.  That the Director of Public Utilities is hereby authorized to enter into a construction services contract for the 2025 Water Main Repairs project with John Eramo & Sons Inc., 3670 Lacon Road, Hilliard, OH 43026, in an amount up to $1,320,610.50, in accordance with the terms and conditions of the contract on file in the Department of Public Utilities; and to obtain the necessary prevailing wage services from the Department of Public Service and to pay up to a maximum amount of $2,000.00.\n \nSECTION 5.  That the expenditure of up to $2,347,849.86, or so much thereof as may be needed, is hereby authorized from the Water Bond Fund, Fund 6006, per the accounting codes in the attachment to this ordinance.\n \nSECTION 6.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 7.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 8.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 9.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 151,
    "meeting_date": "2025-07-14",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}