{
  "success": true,
  "vote": {
    "id": 1275,
    "item_number": "SR-4",
    "title": "To authorize the Director of the Department of Public Service to enter into a grant agreement with Columbus Next Generation Corporation to provide funding for at-risk youth employment; to authorize an appropriation and expenditure within the Job Growth subfund; and to declare an emergency. ($60,000.00)",
    "description": "Explanation\n \nThis ordinance authorizes the Director of the Department of Public Service to enter into a grant agreement with Columbus Next Generation Corporation.\n \nRecognizing the increase in violence in Columbus with almost double the amount of homicides this year as the same time last year, it is of paramount importance to create opportunities for at-risk youth.\n \nThe focus of Columbus Next Generation Corporation is to help young people see that they have options in life and to expand their horizons. The hope is that by doing so, they will choose life-changing options to avoid choosing violence as a way of life. Columbus Next Generation Corporation includes disadvantaged young people from every side of Columbus. The goal is that by interacting and becoming familiar with individuals from outside of their neighborhood they will establish positive relationships and begin to reduce the violence between neighborhoods.\n \nFiscal Impact: Funding is available within the Job Growth subfund.\n \nEmergency action is requested in order to avoid any delay in providing the resources necessary to create job opportunities for at-risk youth. \n \nTitle\n \nTo authorize the Director of the Department of Public Service to enter into a grant agreement with Columbus Next Generation Corporation to provide funding for at-risk youth employment; to authorize an appropriation and expenditure within the Job Growth subfund; and to declare an emergency. ($60,000.00)\n \nBody\n \nWHEREAS, Violence is increasing in Columbus with almost double the amount of homicides this year as the same time last year; and\n \nWHEREAS, It is of paramount importance to create opportunities for at-risk youth; and\n \nWHEREAS, Columbus Next Generation Corporation's mission is to help young people see that they have options in life and to expand their horizons; and\n \nWHEREAS, The goal is to introduce youth to opportunities and people outside of their neighborhood in hopes of establishing positive relationships and creating opportunities that will help them to make better life choices; and\n \nWHEREAS, an emergency exists in that it is immediately necessary to authorize grant agreements with the selected agencies in order to allow for the immediate deployment of resources to create opportunities for at-risk youth and for neighborhood beautification all which serve for the immediate preservation of the public peace, property, health, or safety; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Department of Public Service is hereby authorized to enter into a grant agreement with Columbus Next Generation Corporation.                                          \n \nSECTION 2. That the Auditor is hereby authorized and directed to appropriate $60,000.00 within the Job Growth subfund, fund 1000,subfund 100015, to the Department of Public Service in 03-Services, per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That per the action authorized in Section 1 of this ordinance, the expenditure of $60,000.00 within the Job Growth subfund is hereby authorized per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 19,
    "meeting_date": "2021-06-28",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}