{
  "success": true,
  "vote": {
    "id": 12752,
    "item_number": "SR-42",
    "title": "To authorize the Director of Development to enter into a grant agreement with Reserve at Maryland Avenue LLC for development of 84 housing units in an amount up to $2,020,000.00; to authorize the appropriation of funds within the Income Set Aside Subfund and the Affordable Housing Bond Fund; to authorize the transfer of cash between the Income Tax Set Aside Subfund and the Affordable Housing Bond Fund; to authorize the expenditure of up to $2,020,000.00 within the Affordable Housing Bond Fund; to authorize the reimbursement of expenditures incurred prior to the establishment of a purchase order; and to declare an emergency. ($2,020,000.00) (Repealed by ord. 2327-2025 passed on 9/8/2025 -LG)",
    "description": "Explanation\n \nBACKGROUND\n \nThis ordinance authorizes the Director of the Department of Development to enter into a grant agreement with Reserve at Maryland Avenue LLC for development of 84 housing units in an amount up to $2,020,000.00.  Approval is also requested for reimbursement of construction expenses incurred prior to execution of the purchase order, starting January 1, 2024.\n \nThe Reserve at Maryland Avenue is a proposed 84-unit multifamily development to offer income restricted housing to current and future residents of Columbus’ Near East Side. The project, which is in a Qualified Census Tract and within a specifically designated CRA target area within the City of Columbus, is an important part of the Near East Side Plan for revitalization and is ready for opportunity. \n \nConnect Housing Blocks, an industrialized unit manufacturer in Columbus, will manufacture the individual dwelling units. The concept of modular units has many advantages: it’s more environmentally sustainable and produces 70% less waste than a traditional stick build, is less weather dependent and more time efficient. Due to the nature of building the units off-site in a manufacturing facility, each unit is a separately licensed industrialized unit that is inspected in the factory, which leads to less burden for municipalities for inspections. \n \nThe complex will consist of five buildings: four residential buildings and a clubhouse. The unit mix will be 24 one-bedrooms units, 48 two-bedroom units and 12 three-bedroom units in four residential buildings; all units will be set to 60% AMI. The community will offer competitive unit sizes and amenities including fully equipped kitchens with dishwashers and garbage disposals, washer/dryer hookups and spacious closets. Project amenities include a playground, ample green space, and a separate community center with a kitchenette, exercise room, computer center, sitting area, and covered patio. \n \nThe location is within a half mile of the Amazon Distribution Center, four different transit stops, a daycare and Eastgate Elementary School. Within one mile, residents will find several grocery stores and a public park.\n \nEmergency action is requested in order to maintain the construction schedule and to fulfill financing needs prior to closing deadlines with the developer’s other lenders.  Without emergency action, new affordable housing would be further delayed from a low-income community in urgent need of it.\n \nFISCAL IMPACT:  Funding for this project will not be available to the Department of Development until the bonds are sold related to the 2024 Capital Improvement Budget and are available at a future date, therefore it is necessary to certify the required funds, in the amount up to $2,020,000.00, against the General Fund 1000, Income Tax Set Aside Subfund 100099.  The fund will be reimbursed upon receipt of the bonds.  There is sufficient budgetary authority for this project.\n \n \nCONTRACT COMPLIANCE:  the vendor number is 051131 and expires 11/26/2026.\n \n \nTitle\n \nTo authorize the Director of Development to enter into a grant agreement with Reserve at Maryland Avenue LLC for development of 84 housing units in an amount up to $2,020,000.00; to authorize the appropriation of funds within the Income Set Aside Subfund and the Affordable Housing Bond Fund; to authorize the transfer of cash between the Income Tax Set Aside Subfund and the Affordable Housing Bond Fund; to authorize the expenditure of up to $2,020,000.00 within the Affordable Housing Bond Fund; to authorize the reimbursement of expenditures incurred prior to the establishment of a purchase order; and to declare an emergency. ($2,020,000.00)\n \n \n \nBody\n \nWHEREAS, the Director of the Department of Development seeks to enter into a grant agreement with Reserve at Maryland Avenue LLC for development of 84 housing units in an amount up to $2,020,000.00; and\n \nWHEREAS, the complex will consist of five buildings: four residential buildings and a clubhouse. The unit mix will be 24 one-bedrooms units, 48 two-bedroom units and 12 three-bedroom units in four residential buildings; all units will be set to 60% AMI; and\n \nWHEREAS, the community will offer competitive unit sizes and amenities including fully equipped kitchens with dishwashers and garbage disposals, washer/dryer hookups and spacious closets, playground, ample green space, and a separate community center with a kitchenette, exercise room, computer center, sitting area, and covered patio; and\n \nWHEREAS, the location is near the Amazon Distribution Center, four different transit stops, a daycare and Eastgate Elementary School, several grocery stores and a public park; and\n \nWHEREAS, it is necessary to certify the required funds, in the amount up to $2,020,000.00 dollars against the General Fund 1000, Income Tax Set Aside Subfund 100099 and authorize the appropriation and transfer of the funds in the amount up to $2,020,000.00 from the Income Tax Set Aside Subfund to the Affordable Housing Bond Fund and authorize the appropriation within the Affordable Housing Bond Fund.\n \nWHEREAS, it is necessary to authorize the expenditure within the Affordable Housing Bond Fund in an amount up to $2,020,000.00; and\n \nWHEREAS, the City anticipates incurring certain Original Expenditures (as defined in Section 1.150-2(c) of the Treasury Regulations (the \"Treasury Regulations\") promulgated pursuant to the Internal Revenue Code of 1986, as amended) with respect to the construction of the project described in this ordinance (the \"Project\"); and\n \nWHEREAS, the City will reimburse the General Fund 1000, Income Tax Set Aside Subfund 100099; and\n \nWHEREAS, this transfer should be considered as a temporary funding method; and\n \nWHEREAS, the aggregated principal amount of obligations which the City will issue to finance this project is presently expected not to exceed $2,020,000.00; and\n \nWHEREAS, it is necessary to authorize reimbursement of expenses incurred prior to the execution of a purchase order, starting January 1, 2024; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to authorize the Director to enter into a grant agreement with Reserve at Maryland Avenue LLC in order to maintain the project schedule, all for the immediate preservation of the public health, peace, property, safety and welfare; and now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Development be and is hereby authorized to enter into a grant agreement with Reserve at Maryland Avenue LLC in an amount up to $2,020,000.00 and to allow for the reimbursement of expenses incurred prior to the establishment of a purchase order, beginning January 1, 2024.\n \nSECTION 2. That from the unappropriated monies and from all monies estimated to come into said funds from any and all sources and unappropriated for any other purpose during the fiscal year ending December 31, 2025, the sum of $2,020,000.00 is appropriated within General Fund 1000, Income Tax Set Aside Subfund 100099, in Object Class 10 Transfer Out Operating, and into the Affordable Housing Bond fund No. 7779, in Object Class 06 Capital Outlay per the account codes in the attachment to this ordinance.\n \n \nSECTION 3. That the transfer of $2,020,000.00 or so much thereof as may be needed, is hereby authorized between the General Fund 1000, Income Tax Set Aside Subfund 100099, and the Affordable Housing Bond fund No. 7779, per the account codes in the attachment to this ordinance.\n \nSECTION 4.  That for the purpose as stated in Section 1, the expenditure of $2,020,000.00, or so much thereof as may be necessary, is hereby authorized in fund 7779 (Affordable Housing Bond fund), Project P782050-100015, Dept. 44-10 (Housing), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance. \n \nSECTION 5. That upon obtaining other funds, the City Auditor is hereby authorized and directed to repay the General Fund 1000, Income Tax Set Aside Subfund 100099 the amount transferred under Section 3.\n \nSECTION 6.  That the City intends that this ordinance constitute an \"official intent\" for purposes of Section 1.150 2(e) of the Treasury Regulations, and that the City reasonably expects to reimburse itself for certain Original Expenditures incurred with respect to the Project from the proceeds of obligations to be issued by the City in a principal amount currently estimated to be $2,020,000.00 (the \"Obligations\").\n \nThe City intends to make a reimbursement allocation on its books for the Original Expenditures not later than eighteen months following the later to occur of the date of the Original Expenditure to be reimbursed or the date the Project for which such Original Expenditures were made is \"placed in service\" within the meaning of Treasury Regulations Section 1.150 2(c).  Upon the issuance of the Obligations, the proceeds of such Obligations shall be used to reimburse the fund from which the advance for costs of the Project will be made.\n \n SECTION 7.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 8.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 9. That this contract is awarded pursuant to the relevant provisions of City Code relating to the process for awarding grant agreements.\n \nSECTION 10. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 11. For the reasons stated in the Preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 151,
    "meeting_date": "2025-07-14",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}