{
  "success": true,
  "vote": {
    "id": 12793,
    "item_number": "CA-31",
    "title": "To authorize the Municipal Court Clerk to modify and extend the current agreement with DBAffinity LLC for database services for one year; and to declare an emergency. ($0.00)",
    "description": "Explanation\n \nBackground:\n \nThis legislation authorizes the Franklin County Municipal Court, Clerk of Court (hereinafter \"Municipal Court Clerk\") to modify and extend the current agreement with DBAffinity LLC for one year. \n \nOrdinance 0548-2025 authorized the Municipal Court Clerk to modify the current agreement with DBAffinity LLC by adding additional services to update and upgrade our database.\n \nIn 2024, the Municipal Court Clerk learned that the Oracle database must be updated to the latest version, but before those updates can occur, the database has to be cloned. DBAffinity LLC, who currently contracts with the Municipal Court Clerk (PO500167) for data migration, training production, and server updates, is familiar with the Municipal Court Clerk’s current infrastructure and could perform the necessary services. The current expiration date for PO500167 is 9/8/2025. \n \nAs part of the Oracle database update work, DBAffinity LLC is assisting with the OnBase System Upgrades project by updating and upgrading the OnBase database. Their expertise is necessary to support the ongoing project. This project is still in early development and will require additional time and technical support to complete. The services performed by DBAffinity LLC are essential for the duration of the OnBase System Upgrades project.\n \nContract Modification: \nThis Ordinance is being submitted in accordance with the relevant provisions of Chapter 329 of City Code pertaining to contract modifications.\n1.                     Amount of additional funds: N/A. No additional funds are necessary.\n2.                     Reason additional funds were not foreseen: N/A. Additional funds are not needed, project needs additional time to be completed. \n3.                     Reason other procurement processes were not used: N/A. Ord. 0548-2025 waived the competitive bidding provisions of the City Code. \n4.                     How was cost determined: N/A\n \nContract Compliance: DBAffinity LLC\nContract Compliance # 27-1127033\nExpiration Date: 09/03/26\nVendor Number:  028855\n \nContracts:\nPO466648; $28,800.00\nOrdinance 0548-2025; PO500167; $9,450.00\nOrdinance 2011-2025; $0.00\n \n \nEmergency: There is an immediate need to modify the contract with DBAffinity LLC for the continuity of the Municipal Court Clerk’s database updates, maintenance and support services. \n \nFiscal Impact: No additional funding is required.\n \n \nTitle\n \nTo authorize the Municipal Court Clerk to modify and extend the current agreement with DBAffinity LLC for database services for one year; and to declare an emergency. ($0.00)\n \n \nBody\n \nWHEREAS, it is necessary to modify the current agreement with DBAffinity LLC Inc by extending the contract one year; and, \n \nWHEREAS, an emergency exists in the usual daily operation of the Municipal Court Clerk’s Office in that it is immediately necessary to authorize the Municipal Court Clerk to modify said contracts for database services, for the immediate preservation of the public peace, health, property, safety and welfare; \n \nNOW, THEREFORE:\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Franklin County Municipal Court is hereby authorized to modify and extend the current agreement with DBAffinity LLC Inc for one year.\n \nSECTION 2. That for the reasons stated in the preamble hereto, which are hereby made a part of hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 152,
    "meeting_date": "2025-07-21",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Emergency Services",
      "Housing"
    ]
  }
}