{
  "success": true,
  "vote": {
    "id": 12799,
    "item_number": "CA-37",
    "title": "To authorize the Director of the Department of Finance and Management to establish a contract with Utility Truck & Equipment, Inc. for the purchase and delivery of two 60’ bucket trucks for the Department of Public Utilities; to authorize the expenditure of up to $793,180.00 from the Electricity Operating Fund. ($793,180.00)",
    "description": "Explanation\nBACKGROUND\nTo authorize the Director of Finance and Management to enter into a contract with Utility Truck & Equipment, Inc. for the purchase and delivery of two 60’ bucket trucks in an amount not to exceed $793,180.00.  \n \nThe bucket trucks will be used by employees at the Division of Power when working on various distribution lines, freeway lighting and in electric substations. This purchase has been approved by the Division of Fleet Management and will replace BT’s #23784 and #25569.\n \nPROCUREMENT\nThe Purchasing Office advertised and solicited competitive bids in accordance with the relevant provisions of City Code Chapter 329 relating to competitive bidding (RFQ030412). \n \nThe following bids were received on June 19, 2025:\n \nName / Bid Amount / City and State                                                                                                                               \n1. Utility Truck & Equipment, Inc. / $793,180.00 / Circleville, OH\n2. Environmental Equipment Sales & Services Holdings LLC / $755,500.00 / Columbus, OH\n \nAfter evaluation of the bids, the Division of Power has determined the lowest bidder, Environmental Equipment Sales & Services Holdings LLC, did not meet the following specification: Section 3.3.1.6.1 required the rear axle to be rated at a minimum of 23,000 lbs., the vendor quoted 21,000 lbs., therefore, they have been deemed non-responsive.\n \nThe bid from Utility Truck & Equipment, Inc. meets all the specifications and is recommended for award as the most responsive, responsible and best bidder.\n \nSUPPLIER / CONTRACT COMPLIANCE\nUtility Truck & Equipment, Inc., cc #004562, expires 4/16/27\n \nThe certification of Utility Truck & Equipment, Inc. was in good standing at the time of the contract award. The company is not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search. \n \nFISCAL IMPACT\n$793,180.00 is budgeted and available for this expenditure  \n \nTitle\nTo authorize the Director of the Department of Finance and Management to establish a contract with Utility Truck & Equipment, Inc. for the purchase and delivery of two 60’ bucket trucks for the Department of Public Utilities; to authorize the expenditure of up to $793,180.00 from the Electricity Operating Fund. ($793,180.00) \n \nBody\nWHEREAS, the Division of Power will use the bucket trucks when working on various distribution lines, freeway lighting and in electric substations; and\n \nWHEREAS, the Purchasing Office opened formal bids on June 19, 2025 for the purchase and delivery of two 60’ bucket trucks; and\n \nWHEREAS, the lowest bidder, Environmental Equipment Sales & Services Holdings LLC did not meet the rear axle weight requirement of the bid specifications; and \n \nWHEREAS, the bid from Utility Truck & Equipment, Inc. did meet all requirements of the bid specifications; and\n \nWHEREAS, the Department of Public Utilities, Division of Power recommends an award be made to the only responsive, responsible and best bidder, Utility Truck & Equipment, Inc.; and \n \nWHEREAS, it is necessary to authorize the expenditure of $793,180.00 or so much thereof as is needed for the purchase from and within the Electricity Operating Fund; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities to authorize the Director of Finance and Management to enter into a contract with Utility Truck & Equipment, Inc. for the purchase and delivery of two 60’ bucket trucks in accordance with the terms, conditions and specifications of Solicitation Number RFQ030412 on file in the Purchasing Office; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Finance and Management be and is hereby authorized to establish a contract with Utility Truck & Equipment, Inc. for the purchase and delivery of two 60’ bucket trucks in accordance with the terms, conditions and specifications of Solicitation Number RFQ030412 on file in the Purchasing Office.\n \nSECTION 2. That this contract is in accordance with the relevant provisions of Chapter 329 of City Code.\n \nSECTION 3.  That the expenditure of $793,180.00, or as much thereof as may be needed, is hereby authorized in Fund 6300 (Electricity Operating); in Object Class 06 Capital Outlay per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 152,
    "meeting_date": "2025-07-21",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}