{
  "success": true,
  "vote": {
    "id": 128,
    "item_number": "SR-5",
    "title": "To authorize and direct the City Attorney to settle the lawsuit captioned Mary M. Laile v. Andrew K. Mitchell, et al., United States District Court Case No. 2:19-cv-03689; to authorize the expenditure of the sum of $1,025,000.00 in settlement of the lawsuit; and to declare an emergency.",
    "description": "Explanation\n \nBackground:                     \n \nOn August 23, 2018, Donna Gail Castleberry (“Castleberry”) was shot and killed by then Columbus Police Officer Andrew K. Mitchell (“Mitchell”). The facts and circumstances leading up to, surrounding, and including the shooting, as alleged by Plainitff, (collectively “the Incident”) are more fully described in Plaintiff’s Complaint (“the Complaint”) filed on August 23, 2019 in the lawsuit captioned Mary M. Laile v. Andrew K. Mitchell, et al., United States District Court Case No. 2:19-cv-03689 pending in the Southern District of Ohio (“the Lawsuit”). \n \nPlaintiff Mary M. Laile is the personal representative and Special Administrator of Castleberry’s Estate and is acting for the exclusive benefit of Castleberry’s Estate and for those persons identified in Ohio Revised Code Section 2125.02 and/or Castleberry’s Next of Kin. John W. Waddy Jr. is the Attorney for the Estate.\n \nIn the Complaint, Plaintiff alleges, among other things, that:  (a) Mitchell violated Castleberry’s federal and state rights during the Incident; (b) the customs, policies, and practices of the City of Columbus were the moving force behind the deprivation of Castleberry’s rights; and (c) Castleberry, as well as her family and next of kin, suffered damages. Plaintiff’s various causes of action are specified in the Complaint. Plaintiff named Mitchell, the City of Columbus, and former Columbus Division of Police Chief Kim Jacobs as defendants in the Lawsuit.\n \nFiscal Impact:                     \n \nFunds were not specifically budgeted for this settlement; however, sufficient monies are available on BRDI002433 for this purpose.  \n \n \nTitle\n \nTo authorize and direct the City Attorney to settle the lawsuit captioned Mary M. Laile v. Andrew K. Mitchell, et al., United States District Court Case No. 2:19-cv-03689; to authorize the expenditure of the sum of $1,025,000.00 in settlement of the lawsuit; and to declare an emergency. \n \n \nBody\n \nWHEREAS, Plaintiff alleges that former Columbus Police Officer Andrew K. Mitchell wrongfully shot and killed Donna Gail Castleberry on August 23, 2018; and\n \nWHEREAS, Plaintiff Mary M. Laile has filed a lawsuit against Mitchell, the City, and former Columbus Division of Police Chief Kim Jacobs, alleging that:  (a) Mitchell violated Castleberry’s federal and state rights during the Incident; (b) the customs, policies, and practices of the City of Columbus were the moving force behind the deprivation of Castleberry’s rights; and (c) Castleberry, as well as her family and next of kin, suffered damages; and \n \nWHEREAS, following an evaluation of the Incident, a settlement in the amount of One Million Twenty Five Thousand Dollars ($1,025,000.00), to be paid by the City, was deemed to be acceptable in exchange for the dismissal of the lawsuit and a release from Plaintiff of any claims against the City of Columbus and any of its current or former employees, agents, and officials, including Mitchell and Jacobs; and\n \nWHEREAS, sufficient funds are available on BRDI002433 to pay the amount of this claim; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Department of Public Safety, Division of Police, in that it is necessary for this ordinance to be effective immediately in order for the parties to effectuate the settlement of these claims, which is in the best interest of the City, and to pay the agreed to sum without delay; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     That the City Attorney be and hereby is authorized and directed to settle all claims against the City of Columbus, and its current and former officers, agents, and employees, including former Columbus Police Officer Andrew K. Mitchell and former Columbus Division of Police Chief Kim Jacobs, by payment of the sum of One Million Twenty Five Thousand Dollars ($1,025,000.00), as a reasonable and fair amount and in the best interest of the City of Columbus.\n \nSECTION 2.                     That the expenditure of $1,025,000.00, or so much thereof as may be needed, is hereby authorized to be expended by the Department of Public Safety, Director's Office, from BRDI002433.\n \nSECTION 3.                     That, upon receipt of a voucher and a release approved by the City Attorney, the City Auditor be and is hereby authorized to draw a warrant upon the City Treasurer for the sum of One Million Twenty Five Thousand Dollars ($1,025,000.00) made payable to John W. Waddy, Jr. and Mary M. Laile, Special Administrator of the Estate of Donna G. Castleberry.\n \nSECTION 4.                     That for the reasons stated in the preamble hereto, which is made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force after passage and approval by the Mayor, or 10 days after passage if the Mayor neither vetoes nor approves the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 2,
    "meeting_date": "2021-02-01",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services"
    ]
  }
}