{
  "success": true,
  "vote": {
    "id": 12812,
    "item_number": "CA-50",
    "title": "To authorize the Director of the Department of Development to enter into an amendment of the Annexation Agreement between the City of Columbus, City of New Albany, and Plain Township, Franklin County, Ohio to replace exhibits depicting Water Service and Sewer Service Area Boundary Maps and the Agreement Territory Map. ($0.00)",
    "description": "Explanation\n \nBACKGROUND:\nThe City of Columbus, City of New Albany, and Plain Township, Franklin County, Ohio entered into an Annexation Agreement in 2008, as amended. The City of Columbus and City of New Albany separately entered into Water Service and Sewer Service agreements in 2022, which was amended in 2024. The Annexation Agreement included Exhibits A and B depicting the Water Service and Sewer Service Boundary Maps and the Agreement Territory Map, respectively. \nDue to recent updates to the Service Boundary Maps and proposed updates to the Agreement Territory Map, it is necessary to approve an amendment to the Annexation Agreement to replace current exhibits with new Exhibits A and B, as attached.\nFISCAL IMPACT: None.\n \n \nTitle\n \nTo authorize the Director of the Department of Development to enter into an amendment of the Annexation Agreement between the City of Columbus, City of New Albany, and Plain Township, Franklin County, Ohio to replace exhibits depicting Water Service and Sewer Service Area Boundary Maps and the Agreement Territory Map. ($0.00)\n \n \nBody\n \nWHEREAS, the City of Columbus and the City of New Albany entered into a Water Service Agreement and a Sewer Service Agreement on September 30, 2022 pursuant to Ordinance Number 1985-2022, which was subsequently amended by Ordinance 2885-2024; and\nWHEREAS, these agreements establish the terms of service and the Service Area Boundary Map where such services may be provided; and\nWHEREAS, Ordinance 2262-2006, as amended, authorized an Annexation Agreement between the City of Columbus, City of New Albany, and Plain Township, with a subsequent amendment by Ordinance 0410-2012; and \nWHEREAS, amendments to the Service Area Boundary Map have a direct impact on the Growth Areas that were designated and agreed to in the Annexation Agreement; and \nWHEREAS, the original Service Area Boundary Map was attached to the Annexation Agreement effective in 2008 and identified therein as Exhibit A; and \nWHEREAS, Plain Township, the City of New Albany, and the City of Columbus wish to replace the original Service Area Boundary Map with the current Service Area Boundary Map effective in 2025; and \nWHEREAS, Plain Township, the City of New Albany, and the City of Columbus also desire to replace the Agreement Territory Map identified in the Annexation Agreement, as amended, and designated as Exhibit B; and \nWHEREAS, per Section 1.3 of the Annexation Agreement, alteration of the Agreement Territory Map must be approved by the legislative authorities of all the parties; NOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSection 1. That the Director of the Department of Development is hereby authorized to enter into an amendment to the Annexation Agreement between the City of Columbus, the City of New Albany, and Plain Township, approved by Ordinance 2262-2006, as amended, to replace the Service Area Boundary Map and the Map of the Agreement Territory, identified in those agreements as Exhibits A and B respectively, with maps that are substantially similar to those attached hereto.\nSection 2. That the Director of the Department of Development is hereby authorized to execute any documents and take the necessary actions to replace the previous Exhibits with the new Exhibits A and B attached hereto. \nSection 3. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 152,
    "meeting_date": "2025-07-21",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}