{
  "success": true,
  "vote": {
    "id": 12830,
    "item_number": "SR-10",
    "title": "To authorize an appropriation of $285,000.00 from the unencumbered balance in the Municipal Court Clerk Computer Fund; to authorize the Municipal Court Clerk to enter into a one (1) year contract with Mission Critical Partners, LLC for the provision of a Justice Ecosystem Study; to waive the competitive provisions of Columbus City Code; to authorize an expenditure up to $285,000.00 from the Municipal Court Clerk Computer Fund; and to declare an emergency.($285,000.00)",
    "description": "Explanation\n \nBackground: This legislation authorizes an appropriation of $285,000.00 from the unencumbered balance of the Franklin County Municipal Court Clerk Computer Fund; authorizes the Franklin County Municipal Court Clerk (Municipal Court Clerk)  to enter into a one (1) year contract with Mission Critical Partners, LLC for the provision of a Justice Ecosystem Study for a new Case Management System (Justice Ecosystem Study); authorizes an expenditure up to $285,000.00 from the Municipal Court Clerk Computer Fund.\n \nThe Municipal Court Clerk has a need to obtain a professional services consulting firm to consider strategies to address the functionality and longevity of its current case management system (CMS) and recommend a path forward for a system that would meet the needs of our entire justice system. \nA court clerk’s CMS is a critical operational function, and it is important to have external assessment and analysis done to ensure the new CMS fits the needs of not only the Franklin County Municipal Court and the Municipal Court Clerk, but the justice partners and community members who use the system daily. The Municipal Court Clerk has had its current CMS since 1999. The Clerk has developed a 5-year plan to update the current CMS to a new cutting-edge system. The first phase starts with the Justice Ecosystem Study to ensure those needs of the entire justice system will be met. \nThe Ohio General Assembly has passed several bills attempting to modernize Ohio Courts. Senate Bill 94 requires municipal courts to accept all filings electronically. It is critical to have an updated CMS to ensure compliance with legal mandates. \nThe purchase will be from the Ohio State Term Schedule, Contract Number 534504; Expiration Date 6/30/2026. The Municipal Court Clerk has deemed the State Term Schedule to be the most cost-effective method due its availability for use under ordnance 582-1987 and vetted process used by the State of Ohio to provide contracts. Therefore, the Municipal Court Clerk is requesting this City Council to waive the competitive bidding provisions of Chapter 329 of the Columbus City Code.  \n  \n \nContract Compliance: 26-4026964\nExpiration Date: 09/10/2026\nDAX Vendor Number: 002532\n \nFiscal Impact: Funds totaling $285,000.00 are available within Computer Fund.\n \nEmergency: Emergency action is requested to prevent delays in the current project schedule and ensure compliance with legislative mandates. \n \n \n \nTitle\n \nTo authorize an appropriation of $285,000.00 from the unencumbered balance in the Municipal Court Clerk Computer Fund; to authorize the Municipal Court Clerk to enter into a one (1) year contract with Mission Critical Partners, LLC for the provision of a Justice Ecosystem Study; to waive the competitive provisions of Columbus City Code; to authorize an expenditure up to $285,000.00 from the Municipal Court Clerk Computer Fund; and to declare an emergency.($285,000.00)\n \n \n \nBody\n \nWHEREAS,  it is necessary for the Municipal Clerk to enter into a one (1) year contract with Mission Critical Partners, LLC for the provision of a Justice Ecosystem Study for a new Case Management System for the Municipal Court; and\n \nWHEREAS, the Municipal Court Clerk has a need to obtain a professional services consulting firm to consider strategies to address the functionality and longevity of its current case management system and recommend a forward path for a system that would meet the needs of our entire justice system; and\nWHEREAS, it is in the City's best interest to waive the competitive bidding provisions of Chapter 329 the Columbus City Code; and \n \nWHEREAS, an emergency exists in the usual daily operation of the Municipal Court Clerk’s Office in that it is immediately necessary to authorize the Municipal Court Clerk to enter into the contract with Mission Critical Partners, LLC for the provision of a Justice Ecosystem Study to prevent delays in the current project schedule and ensure compliance with legislative mandates, all for the immediate preservation of the public health, peace, property, safety, and welfare; now, therefore,\n  \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That from the unappropriated monies in the Municipal Court Clerk's Computer Fund, and from all monies estimated to be deposited into said fund, the sum of $285,000.00 be and is hereby appropriated within Computer Fund 2227, subfund 222702, Department-Division 2601 Municipal Court Clerk, Object Class 03 Contractual Services. \n \nSECTION 2.  That the Municipal Court Clerk be and is hereby authorized to enter into a one (1) year contract with Mission Critical Partners, LLC for the provision of a Justice Ecosystem Study for the Municipal Court Clerk’s Office.\n \nSECTION 3.  That this Council finds that it is in the City's best interest to waive the competitive bidding provisions of the City Code to enter into this contract.\n \nSECTION 4.  That the expenditure sum of $285,000.00, or so much thereof as may be needed, is hereby authorized in the Computer Fund 2227, in Object Class 03 - Contractual Services per the accounting codes in the attachment to this ordinance.\nSECTION 5.  That the funds are hereby deemed appropriated and expenditures authorized to carry out the purposes of this legislation and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 7. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 152,
    "meeting_date": "2025-07-21",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}