{
  "success": true,
  "vote": {
    "id": 12839,
    "item_number": "SR-19",
    "title": "To authorize the Director of Development to enter into a grant agreement with Preservation of Affordable Housing Inc. in an amount up to $1,000,000.00 for repairs to the multifamily property, Walnut Grove; to authorize the appropriation of funds within the Income Set Aside Subfund and the Affordable Housing Bond Fund; to authorize the transfer of cash between the Income Tax Set Aside Subfund and the Affordable Housing Bond Fund; and to authorize the expenditure of up to $1,000,000.00 within the Affordable Housing Bond Fund. ($1,000,000.00)",
    "description": "Explanation\n \nBACKGROUND\n \nThis ordinance authorizes the Director of the Department of Development to enter into a grant agreement with Preservation of Affordable Housing Inc. for repairs to the multifamily property, Walnut Grove, in an amount up to $1,000,000.00.  \n \nWalnut Grove is a 176-unit multifamily property in the highly desirable Blacklick area of Columbus. It features a mix of single-family homes, townhouses and traditional apartments and is a true mixed-income community with units set aside for a variety of income levels from extremely low to market rate. Many residents receive rental subsidy via mobile and project-based vouchers and would otherwise be at risk of homelessness. \n \nWalnut Grove was initially constructed in 2003 with builder-grade materials, many of which have surpassed their useful lives. Among the most pressing needs are the replacements of roofs, HVAC units and windows. While Walnut Grove’s Property Management team has worked diligently to address failing components as necessary, the pace of these failures has accelerated in recent years, resulting in a need for emergency repairs. The developer plans to allocate $500,000.00 to full roof replacements, $350,000.00 to HVAC unit replacements and $150,000.00 to window glazing replacements. The Property Management team has engaged Berardi + Partners to complete a comprehensive review of existing conditions and recent repairs in order identify the most egregiously failed units. This will allow them to address approximately:\n•                     25 roof replacements\n•                     28 complete units worth of HVAC units (i.e. Furnaces, condensers and hot water heaters), although these components will likely be spread out among a larger number of units depending on Berardi's findings\n•                     300 window panes\n \n \nFISCAL IMPACT:  Funding for this project will not be available to the Department of Development until the bonds are sold related to the 2024 Capital Improvement Budget and are available at a future date, therefore it is necessary to certify the required funds, in the amount up to $1,000,000.00, against the General Fund 1000, Income Tax Set Aside Subfund 100099.  The fund will be reimbursed upon receipt of the bonds.  There is sufficient budgetary authority for this project.\n \n \nCONTRACT COMPLIANCE:  the vendor number is 052533 and expires 05/13/2027.\n \nTitle\n \nTo authorize the Director of Development to enter into a grant agreement with Preservation of Affordable Housing Inc. in an amount up to $1,000,000.00 for repairs to the multifamily property, Walnut Grove; to authorize the appropriation of funds within the Income Set Aside Subfund and the Affordable Housing Bond Fund; to authorize the transfer of cash between the Income Tax Set Aside Subfund and the Affordable Housing Bond Fund; and to authorize the expenditure of up to $1,000,000.00 within the Affordable Housing Bond Fund. ($1,000,000.00)\n \nBody\n \nWHEREAS, the Director of the Department of Development seeks to enter into a grant agreement with Preservation of Affordable Housing Inc. for repairs to the multifamily property, Walnut Grove, in an amount up to $1,000,000.00; and\n \nWHEREAS, Walnut Grove is a 176-unit multifamily property in the highly desirable Blacklick area of Columbus, featuring a mix of single-family homes, townhouses and traditional apartments and is a true mixed-income community with units set aside for a variety of income levels from extremely low to market rate; and\n \nWHEREAS, many residents receive rental subsidy via mobile and project-based vouchers and would otherwise be at risk of homelessness; and\n \nWHEREAS, Walnut Grove’s Property Management team, with the assistance of Berardi + Partners, have identified pressing needs to replace unit roofs, HVAC units, and windows; and\n \nWHEREAS, it is necessary to certify the required funds, in the amount up to $1,000,000.00 dollars against the General Fund 1000, Income Tax Set Aside Subfund 100099 and authorize the appropriation and transfer of the funds in the amount up to $1,000,000.00 from the Income Tax Set Aside Subfund to the Affordable Housing Bond Fund and authorize the appropriation within the Affordable Housing Bond Fund.\n \nWHEREAS, it is necessary to authorize the expenditure within the Affordable Housing Bond Fund in an amount up to $1,000,000.00; and\n \nWHEREAS, the City anticipates incurring certain Original Expenditures (as defined in Section 1.150-2(c) of the Treasury Regulations (the \"Treasury Regulations\") promulgated pursuant to the Internal Revenue Code of 1986, as amended) with respect to the construction of the project described in this ordinance (the \"Project\"); and\n \nWHEREAS, the City will reimburse the General Fund 1000, Income Tax Set Aside Subfund 100099; and\n \nWHEREAS, this transfer should be considered as a temporary funding method; and\n \nWHEREAS, the aggregated principal amount of obligations which the City will issue to finance this project is presently expected not to exceed $1,000,000.00; and\n \nWHEREAS, in the usual daily operation of the Department of Development it is necessary to authorize the Director enter into a grant agreement with Preservation of Affordable Housing Inc. all for the preservation of the public health, peace, property, safety and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Development be and is hereby authorized to enter into a grant agreement with Preservation of affordable Housing Inc. in an amount up to $1,000,000.00 for repairs to the multifamily property, Walnut Grove.\n \nSECTION 2. That from the unappropriated monies and from all monies estimated to come into said funds from any and all sources and unappropriated for any other purpose during the fiscal year ending December 31, 2025, the sum of $1,000,000.00 is appropriated within General Fund 1000, Income Tax Set Aside Subfund 100099, in Object Class 10 Transfer Out Operating, and into the Affordable Housing Bond fund No. 7779, in Object Class 06 Capital Outlay per the account codes in the attachment to this ordinance.\n \n \nSECTION 3. That the transfer of $1,000,000.00 or so much thereof as may be needed, is hereby authorized between the General Fund 1000, Income Tax Set Aside Subfund 100099, and the Affordable Housing Bond fund No. 7779, per the account codes in the attachment to this ordinance.\n \nSECTION 4.  That for the purpose as stated in Section 1, the expenditure of $1,000,000.00, or so much thereof as may be necessary, is hereby authorized in fund 7779 (Affordable Housing Bond fund), Project P782050-100014, Dept. 44-10 (Housing), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance. \n \nSECTION 5. That upon obtaining other funds, the City Auditor is hereby authorized and directed to repay the General Fund 1000, Income Tax Set Aside Subfund 100099 the amount transferred under Section 3.\n \nSECTION 6.  That the City intends that this ordinance constitute an \"official intent\" for purposes of Section 1.150 2(e) of the Treasury Regulations, and that the City reasonably expects to reimburse itself for certain Original Expenditures incurred with respect to the Project from the proceeds of obligations to be issued by the City in a principal amount currently estimated to be $1,000,000.00 (the \"Obligations\").\n \nThe City intends to make a reimbursement allocation on its books for the Original Expenditures not later than eighteen months following the later to occur of the date of the Original Expenditure to be reimbursed or the date the Project for which such Original Expenditures were made is \"placed in service\" within the meaning of Treasury Regulations Section 1.150 2(c).  Upon the issuance of the Obligations, the proceeds of such Obligations shall be used to reimburse the fund from which the advance for costs of the Project will be made.\n \n SECTION 7.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 8.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 9. That this contract is awarded pursuant to the relevant provisions of Chapter 329 of City Code relating to the process for awarding grant agreements.\n \nSECTION 10. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 11. This ordinance shall take effect and be in force from and after the earliest date permitted by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 152,
    "meeting_date": "2025-07-21",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Economic Development"
    ]
  }
}