{
  "success": true,
  "vote": {
    "id": 12909,
    "item_number": "CA-27",
    "title": "To vacate a 0.045-acre portion of right-of-way known as Belle Street and transfer it to the City’s Department of Development; to authorize the Director of the Department of Development to combine the real property and/or quitclaim it to Scioto Peninsula Holdings, Ltd., an Ohio limited liability company; and to declare an emergency. ($0.00)",
    "description": "Explanation\n1. BACKGROUND\nThe City of Columbus, Department of Public Service, received a request from Columbus Downtown Development Corporation (dba Downtown Columbus, Inc.), an Ohio not-for-profit corporation, (“DCI”) and Scioto Peninsula Holdings Ltd., an Ohio limited liability company, (“SPH”), asking that the City vacate a 0.045 acre portion of right-of-way known as Belle Street, so that it can subsequently be deeded from the City to SPH when the City deeds Lot 1 of the Scioto Peninsula Subdivision, as previously authorized by Ordinance Number 3345-2024.   \n \nThe right-of-way area being extinguished is south of Broad Street and east of Starling Street and runs north/south directionally for approximately 150+/- feet and the width is 14+/- feet, abutted to the east by Franklin County Tax Parcel Number 010-300599, being Lot 1 of the Scioto Peninsula Subdivision as numbered and delineated in Plat Book 127 page 91. \n \nThe following ordinance allows the City to vacate the following rights-of-way: 0.045 acre portion of right-of-way known as Belle Street. Vacating this area of the right-of-way will allow the applicant to incorporate it into the adjoining parcel and develop a grocery store and multifamily residential property.\n \nPer current practice, comments were solicited from interested parties, including City agencies, private utilities and the applicable area commission, before it was determined that, subject to the retention of a general utility easement for those utilities currently located within the right-of-way, the City will not be adversely affected by vacating this portion of right-of-way and transferring the asset among City Departments.  \n \nThe Department of Public Service has agreed to vacate this strip of right-of-way to the City’s Department of Development until it can be subsequently deeded to SPH as described and shown within the attached legal description and extinguish its need for public right-of-way. \n \n2. FISCAL IMPACT \nNo funding is required by this legislation.\n \n3. EMERGENCY DESIGNATION  \nEmergency action is requested by the Department of Public Service to timely vacate the right-of-way, thereby allowing the Department of Development to deed the property as part of the redevelopment of Lot 1 this construction season to allow this project to proceed without unnecessary delay, which will preserve the public peace, health, property, safety and welfare.\n \nTitle\nTo vacate a 0.045-acre portion of right-of-way known as Belle Street and transfer it to the City’s Department of Development; to authorize the Director of the Department of Development to combine the real property and/or quitclaim it to Scioto Peninsula Holdings, Ltd., an Ohio limited liability company; and to declare an emergency. ($0.00)\n \nBody\nWHEREAS, the City of Columbus, Department of Public Service, received a request from Columbus Downtown Development Corporation (dba Downtown Columbus, Inc.), an Ohio not-for-profit corporation, (“DCI”) and Scioto Peninsula Holdings Ltd., an Ohio limited liability company, (“SPH”), asking that the City vacate a 0.045 acre portion of right-of-way known as Belle Street, so that it can subsequently be deeded from the City to SPH when the City partially releases the 99 year lease and deeds Lot 1 of the Scioto Peninsula Subdivision, as previously authorized by Ordinance Number 3345-2024; and\n \nWHEREAS, the following rights-of-way being vacated is:  0.045-acre portion of right-of-way known as Belle Street, being south of Broad Street and east of Starling Street and runs north/south directionally for approximately 150+/- feet and the width is 14+/- feet, abutted to the east by Franklin County Tax Parcel Number 010-300599, being Lot 1 of the Scioto Peninsula Subdivision; and\n \nWHEREAS, vacating this area of the right-of-way will allow the applicant to incorporate it into the adjoining parcel and develop a grocery store and multifamily residential property; and \n \nWHEREAS, per current practice, comments were solicited from interested parties, including City agencies, private utilities and the applicable area commission, before it was determined that, subject to the retention of a general utility easement for those utilities currently located within the right-of-way, the City will not be adversely affected by vacating this portion of right-of-way and transferring the asset among City Departments; and \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to authorize the Director to vacate the referenced right-of-way, and transfer it to the City’s Department of Development until it can be subsequently deeded as part of the redevelopment of Lot 1 of the Scioto Peninsula Subdivision, during this construction season to allow the project to proceed without unnecessary delay, all for the immediate preservation of public health , peace, property, safety and welfare; and now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSection 1.   That by Council passing this ordinance it does hereby vacate all of the 0.045-acre portion of right-of-way known as Belle Street, south of Broad Street and east of Starling St. runs north/south directionally for approximately 150+/- feet and the width is 14+/- feet, abutted to the east by Franklin County Tax Parcel Number 010-300599, being Lot 1 of the Scioto Peninsula Subdivision right-of-way described and depicted in Exhibit A, which is attached hereto and made a part hereof; to-wit:\n \nVACATED RIGHT OF WAY DESCRIPTION\n0.045 ACRE\n \nSituated in the State of Ohio, County of Franklin, City of Columbus, in Virginia Military Survey Number 1393, being comprised of part of that 0.037 acre tract conveyed to City of Columbus, Ohio, as right of way for Belle Street, by deed of record in Instrument Number 199812280333205, and all of the existing right of way of Belle Street dedicated in Plat Book 127, Page 91 (all references refer to the records of the Recorder’s Office, Franklin County, Ohio) and more particularly bounded and described as follows:\n \nBeginning, for reference, at a magnetic nail set at the intersection of the northerly right of way line of Capital Street (Plat Book 127, Page 91, 34’ wide) and the westerly right of way line of said Belle Street (Plat Book 37, Page 412, variable width), the southeasterly corner of Lot 1 of the subdivision entitled “Scioto Peninsula”, of record in Plat Book 127, Page 91;\n \nThence with the boundary of said Lot 1 the following courses and distances:\n \nNorth 08° 09’ 30” West, a distance of 42.94 feet to an iron pin set at the TRUE POINT OF BEGINNING for this description;\n \nSouth 81° 50' 30\" West, a distance of 13.68 feet to an iron pin set;\n \nNorth 08° 09' 30\" West, a distance of 121.82 feet to a magnetic nail set; and\n \nNorth 37° 38' 47\" West, a distance of 28.59 feet to a magnetic nail found in the southerly right-of-way line of West Broad Street (Plat Book 127, Page 91, 95’ wide);\n \nThence South 66° 46' 49\" East, crossing said 0.037 acre tract, a distance of 32.51 feet to a magnetic nail set in the original westerly right of way line of said Belle Street (Plat Book 37, Page 412, variable width);\n \nThence South 08° 09' 30\" East, with said original westerly right of way line, a distance of 129.78 feet to the TRUE POINT OF BEGINNING, containing 0.045 acre of land, more or less.\n \nSubject, however, to all legal rights-of-way and/or easements, if any, of previous record.\n \nIron pins set, where indicated, are iron pipes, thirteen sixteenths (13/16) inch inside diameter, thirty (30) inches long with a plastic plug placed in the top bearing the initials EMHT INC.\n \nThe bearing of North 08° 09’ 30” West, assigned to the westerly right of way line of Belle Street and shown on the recorded plat of \"Scioto Peninsula Subdivision\", a subdivision of record in Plat Book 127, Page 91, Recorder's Office, Franklin County, Ohio, is designated the basis of bearings for this description.\n \nThis survey was prepared using documents of record, prior plats of survey, and observed evidence located by an actual field survey performed in October, 2023.\n \nEVANS, MECHWART, HAMBLETON & TILTON, INC.\n \n \nMatthew A. Kirk                                                                             Professional Surveyor No. 7865\n \nSECTION 2.  That the Director of the Department of Development be, and hereby is, authorized to combine this vacated right-of-way into the underlying fee of the Franklin County 99 year lease interest  Tax Parcel Number 010-300599, being Lot 1 of the Scioto Peninsula Subdivision as numbered and delineated in Plat Book 127 page 91, and/or to execute a quitclaim deed and other incidental instruments prepared by the City Attorney’s Office, necessary to convey the interest of the vacated right-of-way described above and depicted in the attached exhibit, which is incorporated into this ordinance for reference, to Scioto Peninsula Holdings, Ltd., an Ohio limited liability company.\n \nSECTION 3. That a general utility easement in, on, over, across and through the legal description and attached exhibit describing the right-of-way shall be retained unto the City of Columbus for those utilities located within said right-of-way.\n \nSECTION 4.  That upon notification and verification of the relocation of all utilities located within the retained general utility easement area the Director of the Department of Public Service is hereby authorized to execute those documents necessary to release the retained general utility easement with no additional compensation due to the City and with no further legislative action required by the City.\n \nSection 5.   That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 1,
    "absent": 0,
    "meeting_id": 153,
    "meeting_date": "2025-07-28",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "ABSTAIN"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services",
      "Property & Real Estate"
    ]
  }
}