{
  "success": true,
  "vote": {
    "id": 12915,
    "item_number": "CA-33",
    "title": "To authorize the Director of the Recreation and Parks Department to enter into a not-for profit service contract with Greater Columbus Convention & Visitors Bureau Inc DBA Greater Columbus Sports Commission in support of the “women win here” initiative; to authorize the transfer of $250,000.00 from the general fund to Recreation and Parks operating fund; to authorize an interfund transfer of $250,000 within Recreation and Parks operating fund; to authorize the expenditure of $250,000.00 from the Recreation and Parks Operating Fund; and to declare an emergency. ($250,000.00)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Recreation and Parks Director to enter into a not-for-profit service contract with the Greater Columbus Convention & Visitors Bureau Inc DBA Greater Columbus Sports Commission to advance the “Women Win Here” initiative. The Greater Columbus Sports Commission is a nonprofit organization whose mission is to rally Columbus to compete and win sporting events, providing a singular athlete and fan experience and positively impacting image, economy, and lifestyle. The City is partnering with the Greater Columbus Sports Commission to build, launch and create momentum and community engagement for the initiative.  \nThe Greater Columbus Sports Commission will launch the initiative for the city of Columbus to be the premier destination for all women and girls, with sports playing a pivotal role in achieving this vision.  Partnerships will be built so that together our community can craft a viable path to achieve more opportunity and more equity through the power of sport.  Work will include a strategic plan, launching focused initiatives and strategies to create the next generation of leaders, creating workforce opportunities, keeping girls and women in sports and creating community engagement through this work.   \nThis contract is awarded in accordance with the relevant provisions of Columbus City Code Section 329.30 relating to awarding not-for-profit service contracts. The services provided cannot be provided by existing city employees because these services are beyond the City’s current staffing capacity to provide.\nPrincipal Parties:Greater Columbus Convention & Visitors Bureau Inc dba Greater Columbus Sports Commission277 W Nationwide Blvd Ste 125Columbus, OH 43215Linda Logan - llogan@columbussports.orgContract Compliance Number: 006014\nEmergency Designation:  Emergency action is requested so that necessary research, as well as program development and delivery can commence as quickly as possible.\nGreater Columbus Sports Commission, Vendor# 006014, FID# 31-4153118, CC-006014\nFiscal Impact: This ordinance authorizes the expenditure of $250,000.00 from the General Fund to the Greater Columbus Sports Commission for support of the Collective at Wasserman.\n \nTitle\n \nTo authorize the Director of the Recreation and Parks Department to enter into a not-for profit service contract with Greater Columbus Convention & Visitors Bureau Inc DBA Greater Columbus Sports Commission in support of the “women win here” initiative; to authorize the transfer of $250,000.00 from the general fund to Recreation and Parks operating fund; to authorize an interfund transfer of $250,000 within Recreation and Parks operating fund; to authorize the expenditure of $250,000.00 from the Recreation and Parks Operating Fund; and to declare an emergency. ($250,000.00) \nBody\n \nWHEREAS, the City of Columbus understands the positive economic and cultural impact that comes from advancing opportunity and equity for women in our community.; and\nWHEREAS, the Greater Columbus Convention & Visitors Bureau Inc DBA Greater Columbus Sports Commission is a non-profit organization with a mission is to provide singular athlete and fan experiences that positively impact image, economy, and lifestyle; and\nWHEREAS, the Greater Columbus Convention & Visitors Bureau Inc DBA Greater Columbus Sports Commission intends to advance the “Women Win Here” initiative; and\nWHEREAS, Partnerships will be built so that together our community can craft a viable path to achieve more opportunity and more equity through the power of sport; and   \nWHEREAS, this contract is awarded pursuant to provisions relating to non-profit services of City Code Section 329.30; and\n \nWHEREAS, the services provided cannot be provided by existing city employees because these services are beyond the City’s current staffing capacity to provide; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Finance and Management in that it is immediately necessary to authorize the Director to enter into contract with the Greater Columbus Convention & Visitors Bureau Inc DBA Greater Columbus Sports Commission to have funding available for the \"Women Win Here\" Initiative for necessary expenditures due to the time sensitivity of research, program development and delivery, all for the immediate preservation of the public health, peace, property, safety, and welfare; and now therefore,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS, OHIO:\nSECTION 1. That the Director of the Recreation and Parks Department is hereby authorized to enter into a not-for-profit service contract with the Greater Columbus Convention & Visitors Bureau Inc DBA Greater Columbus Sports Commission in support of the “Women Win Here” initiative, which will provide extensive custom research, program development, and program delivery to advance opportunity and equity for women in our community.\nSECTION 2.  That the transfer of $250,000.00, or so much thereof as may be needed in regard to the action authorized in Section 1, is hereby authorized within the General Fund 1000, per the accounting codes in the attachment to this ordinance.\nSECTION 3.  That the interfund transfer of $250,000, or so much thereof as may be needed in regard to the action authorized in Section 1, is hereby authorized within the Recreation and Parks Operating Fund 2285, per the accounting codes in the attachment to this ordinance.\nSECTION 4. That the expenditure of $250,000.00, or so much thereof as may be needed in regard to the action authorized in Section 1, is hereby authorized is hereby authorized per the accounting codes in the attachment to this ordinance.\nSECTION 5. That the monies in the foregoing Sections shall be paid upon order of the Director of Recreation and Parks, and that no order shall be drawn or money paid except by voucher, the form of which shall be approved by the City Auditor.\n \nSECTION 6. That the funds are hereby deemed appropriated, and expenditures and transfers authorized to carry out the purpose of this ordinance, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 7. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 8. That this contract is awarded in accordance with the relevant provisions of Columbus City Code Section 329.30 relating to awarding not-for-profit service contracts.\nSECTION 9. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or 10 days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 153,
    "meeting_date": "2025-07-28",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}