{
  "success": true,
  "vote": {
    "id": 12927,
    "item_number": "CA-45",
    "title": "To approve Memorandum of Understanding #2025-05 executed between representatives of the City of Columbus and the Communications Workers of America, (CWA) Local 4502 to amend Appendix B (classification listing) of the Collective Bargaining Agreement, dated April 24, 2023 through April 23, 2026, by merging the Engineer-In-Training I and Engineer-In-Training II classifications into the Engineer-In-Training classification and assigning pay to the Engineer-In-Training; and to declare an emergency.  ($0.00)",
    "description": "Explanation\n \nSection 20.2 of the Collective Bargaining Agreement with the Communications Workers of America, (CWA) Local 4502 and the City of Columbus, April 24, 2023 through April 23, 2026, requires that any modifications to the Agreement be agreed to by the parties. The parties have executed Memorandum of Understanding #2025-05 to amend Appendix B (classification listing) by merging the Engineer-In-Training I and Engineer-In-Training II classifications into the Engineer-In-Training classification and assigning the Pay Grade as follows:\n \nEngineer-In-Training (Job Code 1029):  Pay Grade 56\n \nThe Engineer-In-Training shall be nonexempt (eligible for overtime) for FLSA purposes (D Class).   \n \nThe passage of this ordinance indicates City Council’s approval of Memorandum of Understanding #2025-05, a copy of which is attached hereto.\n \nFiscal Impact:  None.\n \nEmergency Designation: Emergency action is recommended in order to allow for expedient implementation to immediately merge the Engineer-In-Training I and Engineer-In-Training II classifications into the Engineer-In-Training classification and assign pay to the Engineer-In-Training classification.\n \n \n \n \nTitle\n \nTo approve Memorandum of Understanding #2025-05 executed between representatives of the City of Columbus and the Communications Workers of America, (CWA) Local 4502 to amend Appendix B (classification listing) of the Collective Bargaining Agreement, dated April 24, 2023 through April 23, 2026, by merging the Engineer-In-Training I and Engineer-In-Training II classifications into the Engineer-In-Training classification and assigning pay to the Engineer-In-Training; and to declare an emergency.  ($0.00)\n \n \nBody\n \nWHEREAS, representatives of the City of Columbus and the Communications Workers of America (CWA), Local 4502, entered into Memorandum of Understanding #2025-05, a copy of which is attached hereto, to amend Appendix B of the Collective Bargaining Agreement, dated April 24, 2023 through April 23, 2026; and\n \nWHEREAS, Memorandum of Understanding #2025-05 amends Appendix B of the Collective Bargaining Agreement by merging the Engineer-In-Training I and Engineer-In-Training II classifications into the Engineer-In-Training classification and assigning pay to the classification; and\n \nWHEREAS, emergency action is recommended in order to implement the terms of the Memorandum of Understanding in a timely manner; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Human Resources, Columbus Water & Power, Department of Building and Zoning, Department of Recreation & Parks and the Department of Public Service in that it is immediately necessary to amend the Collective Bargaining Agreement between the City of Columbus and CWA Local 4502, dated April 24, 2023 through April 23, 2026, by approving Memorandum of Understanding #2025-05; in order to allow for expedient implementation of the terms of the Memorandum of Understanding all for the immediate preservation of the public health,  peace, property, safety, and welfare; and NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That Memorandum of Understanding #2025-05 amends Appendix B of the Collective Bargaining Agreement between CWA Local 4502 and the City of Columbus dated April 24, 2023 through April 23, 2026.\n \nSECTION 2.  That City Council, in the best interests of the City, hereby recognizes and accepts Memorandum of Understanding #2025-05, a copy of which is attached hereto, executed between representatives of the City of Columbus and CWA Local 4502. \n \nSECTION 3.   That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure, and shall take effect and be in force from and after its passage and approval by the Mayor, or ten (10) days after passage if the Mayor neither approves nor vetoes the same",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 153,
    "meeting_date": "2025-07-28",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}