{
  "success": true,
  "vote": {
    "id": 12977,
    "item_number": "SR-16",
    "title": "To authorize the Director of the Recreation and Parks Department to execute an intergovernmental agreement with the Regional Council of Governments for the Central Ohio Area Agency on Aging, to authorize a transfer of appropriations between objects within the Recreation and Parks Grant Fund, and to authorize the expenditure of $1,000,000.00 from the Recreation and Parks Grant Fund. ($1,000,000.00)",
    "description": "Explanation\nBackground:\nThis ordinance authorizes the Director of the Recreation and Parks Department to execute an intergovernmental agreement with the Regional Council of Governments for the Central Ohio AreaAgency on Aging for the period of July 1, 2025, through December 31, 2025, in the amount of $1,000,000.00. This intergovernmental agreement shall be paid in advance. This support is in accordance with Ohio Revised Code Section 167.06 relating to intergovernmental transfers. The Regional Council of Governments for the Central Ohio Area Agency on Aging is a Regional Council of Governments, as established by the participating County Commissioners of Delaware, Fairfield, Fayette, Franklin, Licking, Madison, Pickaway, and Union counties. The mission of the Central Ohio\nArea Agency on Aging (COAAA) is to inform and support people as they navigate the experience of aging or disability. This funding will support start-up costs for the newly established Regional Council of Governments for the Central Ohio Area Agency on Aging, including entering into collective bargaining\ndiscussions with representatives of agency employees, identifying and procuring a human resources management system, and securing appropriate insurance and legal coverage to ensure the agency's compliance with state and federal requirements.\n \nFiscal Impact: $1,000,000.00 is budgeted and available from within the Recreation and Parks Grant Fund 2286 to meet the financial obligations of this transfer. A transfer of appropriation between objects within the Recreation and Parks Grant Fund is needed to align appropriation with the proper object\nclasses.\n \nTitle\nTo authorize the Director of the Recreation and Parks Department to execute an intergovernmental agreement with the Regional Council of Governments for the Central Ohio Area Agency on Aging, to authorize a transfer of appropriations between objects within the Recreation and Parks Grant Fund, and to authorize the expenditure of $1,000,000.00 from the Recreation and Parks Grant Fund. ($1,000,000.00)\n \n \nBody\nWHEREAS, it is necessary to authorize the Director of the Recreation and Parks Department to execute an intergovernmental transfer agreement with the Regional Council of Governments for the Central Ohio Area Agency on Aging; and \nWHEREAS, it is necessary to transfer appropriations from Object Class 03 to Object Class 05 within the Recreation and Parks Grant Fund 2286; and\nWHEREAS, it is necessary to authorize the expenditure of $1,000,000.00 from the Recreation and Parks Fund 2286; and\nWHEREAS, this transfer is executed in accordance with Ohio Revised Code Section 167.06 relating to intergovernmental transfers; NOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Recreation and Parks Department is hereby authorized to execute an intergovernmental agreement with the Regional Council of Governments for the Central Ohio Area Agency on Aging.\nSECTION 2. That this authorization to transfer the funds is contingent upon the intergovernmental agreement between the parties specifying that the Regional Council of Governments of the Central Ohio Area Agency on Aging, an employer subject to the provisions of the Ohio Public Employees Retirement System, shall agree to the commitments made in its letter to Columbus City Council dated July 25, 2025 and described as follows: \n- To offer all current City of Columbus employees in COAAA positions the right of first refusal for their same/similar position with the COG based on their current terms of appointment and at their current rate of pay, effective December 31, 2025;\n- Not to interfere in the process of collective bargaining if employees seek to organize a union and to abide by the wishes of the majority of the employees who are in an appropriate bargaining unit to voluntarily recognize one, in accordance with the provisions Chapter 4117 of the Ohio Revised Code;\n- To participate in meetings with the Unions and the City of Columbus to the extent reasonably necessary to help facilitate the transition (excluding involvement and decisions that are properly left for the City and Unions to address);\n- Not to retaliate or discriminate against COAAA employees who are exercising their rights under Chapter 4117.\nSECTION 3. That the City Auditor is authorized to transfer appropriations from Object Class 03 to Object Class 05 within the Recreation and Parks Grant Fund 2286, per the accounting codes in the attachment to this ordinance.\nSECTION 34. That the expenditure of $1,000,000.00, or so much thereof as may be necessary, be and is hereby authorized from the Recreation and Parks Grant Fund 2286 per the accounting codes in the attachment to this ordinance.\nSECTION 45. That the transfer of the funds of $1,000,000.00 is contingent upon the establishment of the Regional Council of Governments for the Central Ohio Area Agency on Aging and vendor registration with the City of Columbus.\nSECTION 56. That this intergovernmental transfer agreement is awarded pursuant to the provision of Ohio Revised Code Section 167.06.\nSECTION 67. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\nSECTION 78. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\nSECTION 89. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 0,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 153,
    "meeting_date": "2025-07-28",
    "meeting_type": "regular",
    "member_votes": [],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Grants"
    ]
  }
}