{
  "success": true,
  "vote": {
    "id": 12978,
    "item_number": "SR-17",
    "title": "To authorize the Director of the Recreation and Parks Department to enter into contract with Builderscape, Inc. for the Playground Renovations 2023-2024 Project; to authorize the transfer of $689,333.19 between the General Fund Income Tax Set Aside Subfund and the Recreation and Parks Bond Fund; to authorize the appropriation of $689,333.19 in the Income Tax Set Aside Subfund and Recreation and Parks Voted Bond Fund; to authorize the appropriation of $1,667,681.11 within the Recreation and Parks Permanent Improvement Fund; to authorize the transfer of $1,667,681.11 within the Recreation and Parks Permanent Improvement Fund; to authorize the expenditure of $2,357,014.30 from the Recreation and Parks Permanent Improvement Fund and Voted Bond Fund; and to declare an emergency. ($2,357,014.30)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Director of the Recreation and Parks Department to enter into contract with Builderscape, Inc. for the Playground Renovations 2023-2024 Project. The contract amount is $2,128,513.00, with an alternate of $11,500.00 and a contingency of $214,001.30, for a total of $2,354,001.30. An additional $3,000.00 is being authorized for interdepartmental inspections and fees for a total of $2,357,014.30 being authorized by this ordinance. \n \nPlayground Renovations 2023-2024 Project is focused on providing safe and accessible play for children throughout the city. It will also provide fitness opportunities for adults. This initial phase includes eight parks, including Albany Crossing, Easthaven, Karns, Mifflin, Nelson, Saunders, Westgate, and Williams Creek.  \n \nThis project is anticipated to issue a notice to proceed in fall 2025 with total completion expected in summer 2026.\nAll playgrounds selected for demolition and replacement are 20 to 25 years old and are beyond their service life. The Easthaven playground has been previously demolished due to extenuating circumstances and is need of replacement. Saunders Park is receiving a new adult fitness equipment area that was requested by the community. Westgate Park is receiving an additional smaller set of play equipment at the opposite end of the very large site as the existing playground in the park. This new smaller playground will accompany the shelterhouse.\n \nAdditional details for each location is below. \n \nAlbany Crossing Park (Rocky Fork-Blacklick): Complete demolition and replacement of play structures, swings, and surfaces\nEasthaven Park (Mid East): Complete demolition and replacement of one play structure and its surfaces, retain other undamaged play structure\nKarns Park (South Side): Complete demolition, re-siting, and replacement of play structures and surfaces, site restoration includes tree planting in former low-lying location\nMifflin Park (Northeast): Complete demolition, re-siting, and replacement of all play structures and surfaces, completion of ADA compliant path to structures, establishment of pollinator habitat included in site restoration\nNelson Park (Near East): Complete demolition, re-siting, and replacement of play structures and surfaces\nSaunders Park (Near East): Construction of new outdoor fitness circuit\nWestgate Park (Hilltop): Complete replacement and re-siting of play structures and surfaces\nWilliams Creek Park (Far South): Complete demolition and re-siting of play structures and surfaces\n \nVendor Bid/Proposal Submissions (Office of Diversity and Inclusion designation status): Bids were advertised through Vendor Services, in accordance with City Code Section 329, on June 5, 2025 and received by the Recreation and Parks Department on June 26, 2025. Bids were received from the following companies:\n \nBuilderscape, Inc.\n \nAfter reviewing the bids that were submitted, it was determined that Builderscape, Inc. was the lowest and most responsive bidder. Builderscape, Inc. and all proposed subcontractors have met code requirements with respect to prequalification, pursuant to relevant sections of Columbus City Code Chapter 329.\n \nAs part of their bid, Builderscape, Inc. has proposed the following vendors as subcontracts for this project:\n \nMidstates Recreation\nSnyder Recreation\nPlayground Equipment Services, LLC\nAmerican Athletix\n \nPrincipal Parties: \nBuilderscape, Inc.\n10496 Parks Court                                                    \nMarysville, Ohio 43040\nChris Matthews, (614) 889-2533                                                \nContract Compliance Number: 000950\nContract Compliance Expiration Date: August 21, 2026\n \nEmergency Justification: Emergency action is requested to allow for the maximum amount of time during the 2025 construction season for weather sensitive items such as paving, trees, and rubberized safety surface installation.\n \nBenefits to the Public: Safe and accessible playgrounds are important to the community and one of the core priorities of Recreation and Parks. \n \nCommunity Input/Issues: There have been community requests from residents involving playground improvements for increased accessibility and socialization. These topics were also discussed at Area Commission meetings. \n \nArea(s) Affected: Citywide (99)\n \nMaster Plan Relation: This project will support the Recreation and Parks Master Plan by updating five neighborhood parks per year and updating one community park per year.\n \nFiscal Impact: $1,667,681.11 is budgeted and available from within the Recreation and Parks Permanent Improvement Fund 7747 to meet the financial obligations of a portion of this expenditure. The remaining funds, in the amount of $689,333.19, will not be available to the Recreation and Parks Department until the proceeds of the 2024-2025 bond sale are available at a future date. Therefore, it is necessary to certify the required funds against the General Fund 1000, Income Tax Set Aside Subfund 100099. Upon the sale of bonds, this will be reimbursed. There is a total of $2,357,014.30 available for this project. \n \nTitle\n \nTo authorize the Director of the Recreation and Parks Department to enter into contract with Builderscape, Inc. for the Playground Renovations 2023-2024 Project; to authorize the transfer of $689,333.19 between the General Fund Income Tax Set Aside Subfund and the Recreation and Parks Bond Fund; to authorize the appropriation of $689,333.19 in the Income Tax Set Aside Subfund and Recreation and Parks Voted Bond Fund; to authorize the appropriation of $1,667,681.11 within the Recreation and Parks Permanent Improvement Fund; to authorize the transfer of $1,667,681.11 within the Recreation and Parks Permanent Improvement Fund; to authorize the expenditure of $2,357,014.30 from the Recreation and Parks Permanent Improvement Fund and Voted Bond Fund; and to declare an emergency. ($2,357,014.30)\n \nBody\n \nWHEREAS, it is necessary to authorize the Director of the Recreation and Parks to enter into contract with Builderscape, Inc. for the Playground Renovations 2023 -2024 - Phase 1 Construction Project; and \nWHEREAS, the City anticipates incurring certain Original Expenditures (as defined in Section 1.150-2(c) of the Treasury Regulations (the \"Treasury Regulations\") promulgated pursuant to the Internal Revenue Code of 1986, as amended, with respect to the construction of the project described in this ordinance (the \"Project\"); and\nWHEREAS, it is necessary to authorize the appropriation of $1,667,681.11 within the Recreation and Parks Permanent Improvement Fund 7747; and\n \nWHEREAS, it is necessary to authorize the transfer of $1,667,681.11 from the Recreation and Parks Permanent Improvement Fund 7747; and, \nWHEREAS, it is necessary to authorize the transfer of $689,333.19 between the General Fund 1000, Income Tax Set Aside Subfund 100099, and the Recreation and Parks Bond Fund, Fund 7702; and \nWHEREAS, funds will need to be appropriated within the General Fund 1000, Income Tax Set Aside Subfund 100099 and within the Recreation and Parks Bond Fund, Fund 7702; and\nWHEREAS, the City will reimburse the General Fund 1000, Income Tax Set Aside Subfund 100099; and\nWHEREAS, this transfer should be considered as a temporary funding method; and\nWHEREAS, the aggregated principal amount of obligations which the City will issue to finance this project is presently expected not to exceed $2,357,014.30; and \nWHEREAS, it is necessary to authorize the expenditure of $2,357,014.30 from the Recreation and Parks Voted Bond Fund 7702 and Permanent Improvement Fund 7747; and \nWHEREAS, an emergency exists in the usual daily operations of the Recreation and Parks Department in that it is immediately necessary to authorize the Director to enter into contract with Builderscape, Inc. in order to allow for the maximum amount of time during the 2025 construction season for weather sensitive items such as paving, trees, and rubberized safety surface installation, all for the immediate preservation of the public health, peace, property, safety, and welfare; and NOW, THEREFORE,  \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS: \n \nSECTION 1. That the Director of the Recreation and Parks Department be and is hereby authorized to enter into contract with Builderscape, Inc. for the Playground Renovations 2023-2024 Project.\n \nSECTION 2. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 4. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 5. That the appropriation of $1,667,681.11 is authorized within the Recreation and Parks Permanent Improvement Fund 7747 per the accounting codes in the attachment to this ordinance. \n \nSECTION 6. That the transfer of $1,667,681.11, or so much thereof as may be needed, is hereby authorized between projects within the Recreation and Parks Permanent Improvement Fund 7747 per the account codes in the attachment to this ordinance.\n \nSECTION 7. That the transfer of $689,333.19 or so much thereof as may be needed, is hereby authorized between the General Fund 1000, Income Tax Set Aside Subfund 100099, and the Recreation and Parks Bond Fund, Fund 7702, per the account codes in the attachment to this ordinance.\n \nSECTION 8. That the City Auditor is hereby authorized to transfer said funds to the Recreation and Parks Voted Bond Fund 7702, at such time as is deemed necessary by the City Auditor, and to expend said funds, or so much thereof as may be necessary.\n \nSECTION 9. That upon obtaining other funds from the 2024-2025 Bond Sale for the City of Columbus, the City Auditor is hereby authorized and directed to repay the General Fund 1000, Income Tax Set Aside Subfund 100099 the amount transferred under Section 7.\n \nSECTION 10. That the City intends that this ordinance constitutes an \"official intent\" for purposes of Section 1.150 2(e) of the Treasury Regulations, and that the City reasonably expects to reimburse itself for certain Original Expenditures incurred with respect to the Project from the proceeds of obligations to be issued by the City in a principal amount currently estimated to be $689,333.19 (the \"Obligations\"). The City intends to make a reimbursement allocation on its books for the Original Expenditures not later than eighteen months following the later to occur of the date of the Original Expenditure to be reimbursed or the date the Project for which such Original Expenditures were made is \"placed in service\" within the meaning of Treasury Regulations Section 1.150 2(c).  Upon the issuance of the Obligations, the proceeds of such Obligations shall be used to reimburse the fund from which the advance for costs of the Project will be made. \n \nSECTION 11. That for the purpose stated in Section 1, the expenditure of $2,357,014.30, or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Recreation and Parks Voted Bond Fund 7702 and Permanent Improvement Fund 7747 in object class 06 Capital Outlay per the accounting codes in the attachments to this ordinance.\n \nSECTION 12. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 153,
    "meeting_date": "2025-07-28",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}