{
  "success": true,
  "vote": {
    "id": 12991,
    "item_number": "SR-29",
    "title": "To authorize the creation of the PFAS Settlement Fund; to accept funds from the City’s settlement of claims in the Multi-District Aqueous Film-Forming Foams Product Liability Litigation; and to declare an emergency. ($0.00)",
    "description": "Explanation\n \nThe purpose of this ordinance is to establish a special purpose fund to allow for the receipt of settlement funds associated with PFAS AFFF litigation.  This ordinance authorizes the City of Columbus to create a special purpose fund and to accept funds from the City’s settlement of claims in the Multi-District Aqueous Film-Forming Foams (“AFFF”) Product Liability Litigation (“the MDL”) - IN RE:  AQUEOUS FILM-FORMING FOAMS PRODUCT LIABILITY LITIGATION in the United States District Court for the District of South Carolina, MDL Case No. 2:18-mn-2873-RMG\n \nIn accordance with Ordinance 2051-2023, passed July 10, 2023, the City of Columbus, through the Office of the City Attorney, obtained outside special counsel to represent the City in the MDL.  Outside special counsel filed a complaint on behalf of the City of Columbus against seventeen AFFF companies on August 18, 2023.  The claims alleged were brought by the City of Columbus on behalf of the Department of Safety and two divisions of the Department of Public Utilities for damages suffered.  \n \nThe City of Columbus became a Settling Class Member in the settlement of public water system claims against Defendants E.I. DuPont de Nemours (n/k/a Eidp, Inc.), DuPont de Nemours, Inc., the Chemours Company, the Chemours Company FC, LLC, and Corteva, Inc. (collectively, “Dupont”) on December 4, 2023 when it did not opt out of the class settlement.  The City of Columbus became a Settling Class Member in the settlement of public water system claims against 3M Company (“3M”) on December 11, 2023 when it did not opt out of the class settlement.  All claims against other Defendants or that are unrelated to PFAS contamination of public water systems are still pending.  The City of Columbus anticipates that it may be a party to future settlements of many of the remaining claims.  \n \nFiscal Impact: Settlement proceeds will be deposited into this special purpose fund to be used for expenses related to PFAS contamination.\n \nEmergency explanation:  it is necessary to establish a special purpose fund to accept funds from the settlement at the earliest possible time in light of anticipated damage awards being distributed imminently.\n \nTitle\n \nTo authorize the creation of the PFAS Settlement Fund; to accept funds from the City’s settlement of claims in the Multi-District Aqueous Film-Forming Foams Product Liability Litigation; and to declare an emergency. ($0.00)\n \nBody\n \nWHEREAS, in accordance with Ordinance 2051-2023, passed July 10, 2023, the City of Columbus, through the Office of the City Attorney, obtained outside special counsel to represent the City in the Multi-District Aqueous Film-Forming Foams (“AFFF”) Product Liability Litigation (“the MDL”) - IN RE:  AQUEOUS FILM-FORMING FOAMS PRODUCT LIABILITY LITIGATION in the United States District Court for the District of South Carolina, MDL Case No. 2:18-mn-2873-RMG; and \nWHEREAS, outside special counsel filed a complaint on behalf of the City of Columbus against seventeen AFFF companies on August 18, 2023.  The claims alleged were brought by the City of Columbus on behalf of the Department of Safety and two divisions of the Department of Public Utilities for damages suffered; and \nWHEREAS, the City of Columbus became a Settling Class Member in the settlement of public water system claims against Defendants E.I. DuPont de Nemours (n/k/a Eidp, Inc.), DuPont de Nemours, Inc., the Chemours Company, the Chemours Company FC, LLC, and Corteva, Inc. (collectively, “Dupont”) on December 4, 2023 when it did not opt out of the class settlement; and \nWHEREAS, the City of Columbus became a Settling Class Member in the settlement of public water system claims against 3M Company (“3M”) on December 11, 2023 when it did not opt out of the class settlement; and \nWHEREAS, it is anticipated the City of Columbus will receive settlement payments associated with the  claims ; and \nWHEREAS, all claims against other Defendants or that are unrelated to PFAS contamination of public water systems are still pending.  The City of Columbus anticipates that it will be a party to future settlements of those claims; and\nWHEREAS, the City of Columbus seeks to establish a special purpose fund titled “PFAS Settlement Fund” which is authorized to accept funds pursuant to the City’s settlements in the MDL; and\nWHEREAS, an emergency exists in the usual daily operation of the City Attorney’s Office in that it is  necessary to establish a special purpose fund to accept  funds from the settlement at the earliest possible time in light of anticipated damage awards being distributed imminently, for the immediate preservation of the public health, peace, property, safety, and welfare; NOW, THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the City Auditor is hereby authorized and directed to establish the PFAS Settlement Fund.\n \nSECTION 2. That this special purpose fund be authorized to accept funds pursuant to the City’s settlements in the MDL and that the PFAS Settlement Fund shall be used for expenses related to PFAS contamination and remediation.\nSECTION 3. That the City Attorney, including through outside counsel, is hereby authorized to take all steps necessary to resolve these matters in accordance with the terms of the settlements.  \n \nSECTION 4. That the City Attorney, including through outside counsel, is hereby authorized to make all future settlement decisions and take all future steps necessary to settle any and all remaining claims arising out of or associated with the MDL.\n \nSECTION 5. That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared an emergency measure and shall take effect and be enforced from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 153,
    "meeting_date": "2025-07-28",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services"
    ]
  }
}