{
  "success": true,
  "vote": {
    "id": 13013,
    "item_number": "CA-4",
    "title": "To Celebrate and Recognize the Life of Larry R. Jones",
    "description": "Title\n \nTo Celebrate and Recognize the Life of Larry R. Jones\n \nBody\n \nWHEREAS, Larry R. Jones was born in Columbus, Ohio in 1941 and rose from humble beginnings in Columbus City Schools to become a celebrated athlete, educator, mentor, and community leader whose perseverance, faith, and purpose inspired generations; and \n \nWHEREAS, a graduate of East High School and standout at the University of Toledo, Mr. Jones went on to play 10 years of professional basketball in the NBA and ABA. He became the first player in ABA history to score 2,000 points in a season, a four-time ABA All-Star, and the first president of the ABA Players’ Association, leaving an indelible mark on the sport; and\n \nWHEREAS, after his playing career, Mr. Jones served as a coach, corrections administrator, adjunct professor, motivational speaker, and community servant. He founded the A-TEAM (Achieving Through Education and Mentoring) summer youth basketball camp, encouraging countless young people to pursue excellence on and off the court; and\n \nWHEREAS, a man of deep faith and a devoted member of First Church of God, he was remembered for his humility, humor, and mentoring spirit. His bonds extended across the sports world, the classroom, and the community, always marked by compassion and encouragement; and\n \nWHEREAS, Mr. Jones’ enduring contributions to athletics, education, youth development, and civic life have left a lasting legacy in Columbus and beyond, shaping lives long after his playing days ended; now, therefore \n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: That this Council does hereby celebrate and recognize the life of Larry R. Jones (1941–2025), honoring his achievements as an athlete, educator, mentor, and leader, and commending his lasting impact on the City of Columbus and the many lives he touched.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 154,
    "meeting_date": "2025-09-08",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}