{
  "success": true,
  "vote": {
    "id": 13024,
    "item_number": "CA-15",
    "title": "To authorize the Finance and Management Director to modify and extend the contract for the option to purchase Fiber Network Maintenance, and Restoration Services with Harris and Heavener Excavating Inc., and to declare an emergency.  ($0.00)",
    "description": "Explanation  \n \nBACKGROUND:  This legislation authorizes the Finance and Management Director to modify and extend an existing Universal Term Contract (UTC) for the option to obtain Fiber Network Maintenance and Restoration Services with Harris and Heavener Excavating, Inc., CC# CC-017728, expires 2/13/2027.  This contract provides for routine network cable maintenance, and restoration services, including labor, parts, materials and supplies for the Department of Technology and the Division of Power.  This modification is necessary to maintain an uninterrupted supply of the services provided by the UTC, and to allow time for best value procurement process.  The contract, PO258181, was established in accordance with Request for Quotation RFQ016487, and will expire December 31, 2025.  It is in the best interest of the City that the contract be modified to allow for an extension for a period of five (5) months to and including May 31, 2026.\n \nPursuant to Section 329.09(a) of Columbus City Codes:\n(1) Amount of additional funds to be expended under the modification: No additional funding is necessary for this modification. \n(2) Why the need for additional goods or services could not be foreseen at the time the contract was initially awarded: N/A\n(3) Why it would not be in the city's best interests to have the additional contract requirements awarded through other procurement processes specified in this chapter: N/A\n(4) How the price for the additional goods or services which are the subject of the modification was determined: N/A\n \nEMERGENCY DESIGNATION:  The Finance and Management Department respectfully requests this legislation be considered an emergency to maintain an uninterrupted supply of the services provided by the UTC, and to allow time for best value procurement process. \n \nFISCAL IMPACT: No funding is required to modify and extend the option contract.  The Department of Technology and the Division of Power must set aside their own funding for their estimated expenditures.  \n \nTitle\n \nTo authorize the Finance and Management Director to modify and extend the contract for the option to purchase Fiber Network Maintenance, and Restoration Services with Harris and Heavener Excavating Inc., and to declare an emergency.  ($0.00)\n \nBody\n \nWHEREAS, the Purchasing Office entered into a Universal Term Contract for Fiber Network Maintenance, and Restoration Services for use by the Department of Technology and the Division of Power; and\n \nWHEREAS, it is necessary to modify and extend the existing Universal Term Contract with Harris and Heavener Excavating Inc., to continue routine network cable maintenance, and restoration services, including labor, parts, materials and supplies.; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Technology and the Division of Power, in that it is necessary to authorize the Finance and Management Director to immediately modify and extend a Universal Term Contract with Harris and Heavener Excavating Inc., for the option to obtain Fiber Network Maintenance, and Restoration Services necessary to maintain an uninterrupted supply of the services provided by the UTC, and to allow time for best value procurement process, thereby preserving the public health, property, safety, and welfare; now, therefore: \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Finance and Management Director is hereby authorized to modify and extend a contract for the option to obtain Fiber Network Maintenance, and Restoration Services with Harris and Heavener Excavating Inc., for a period of five (5) months to and including May 31, 2026.\n \nSECTION 2. That this modification is in accordance with relevant provisions of Chapter 329 of the Columbus City Codes.\n \nSECTION 3.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 154,
    "meeting_date": "2025-09-08",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}