{
  "success": true,
  "vote": {
    "id": 13098,
    "item_number": "CA-1",
    "title": "To Celebrate and Recognize the Urban Family Development Center (UFDC) for 10 Years of Impact and Service",
    "description": "Title\n \nTo Celebrate and Recognize the Urban Family Development Center (UFDC) for 10 Years of Impact and Service\n \nBody\n \nWHEREAS, the Urban Family Development Center (UFDC) was founded in 2014 by David Fluellen with a mission centered on the core values of Inspiring, Supporting, and Celebrating families, and has become a trusted partner in empowering families to achieve success despite their circumstances; and \n \nWHEREAS, guided by the belief that “Family is Everything” and that stabilizing families is the foundation of community resilience, UFDC provides holistic and culturally responsive support to address poverty and its impact on family stability in Franklin and Montgomery Counties; and\n \nWHEREAS, UFDC’s Dads2B program serves current and expecting fathers, offering education sessions that focus on prenatal health, parenting skills, and the importance of a father’s role in early child development. By engaging fathers early, this program contributes to healthier pregnancy and birth outcomes, which are critical factors in reducing infant mortality; and\n \nWHEREAS, UFDC’s Family First program takes a comprehensive approach to family stabilization, working with parents and guardians to craft tailored Family Development Plans. These include goal setting, financial coaching, intensive case management, and support for parenting partners aimed at stronger communication, healthier environments, and more stable home lives—conditions which are known to improve infant health and reduce infant mortality risk; and\n \nWHEREAS, since its founding, UFDC has proudly served thousands of families, including nearly 1,300 fathers, helping them gain practical skills, confidence, and support to build healthier, more stable lives. Its focus on long-term, generational change includes improving prenatal care, safe sleep practices, father involvement, parental education, and the overall environments in which infants are born and raised; now, therefore \n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: That this Council does hereby celebrate and recognize the Urban Family Development Center (UFDC) for its critical contributions toward strengthening families, improving infant health, reducing infant mortality, and promoting stability across the Columbus community and beyond.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 155,
    "meeting_date": "2025-09-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}