{
  "success": true,
  "vote": {
    "id": 13152,
    "item_number": "CA-55",
    "title": "To accept the application (AN25-011) of Shawn S. Schlosser and Nicole A. Schlosser for the annexation of certain territory containing 24.4± acres in Prairie Township. ($0.00)",
    "description": "Explanation\n \nBACKGROUND:\nThis ordinance approves the acceptance of certain territory (AN25-011) by the city of Columbus. The Ohio Revised Code stipulates that to be effective, City acceptance must take place a minimum of 60 days from the receipt by the City Clerk of the approval notice from the county. If City Council does not accept the ordinance within 120 days of its first consideration, the annexation will be considered rejected. This petition was filed with Franklin County on May 9, 2025. City Council approved a service ordinance addressing the site on May 19, 2025. Franklin County approved the annexation on June 17, 2025 and the City Clerk received notice on July 10, 2025. \nFISCAL IMPACT: \nProvision of municipal services does represent cost to the City; however, the annexation of land also has the potential to create revenue to the City.\nTitle\n \nTo accept the application (AN25-011) of Shawn S. Schlosser and Nicole A. Schlosser for the annexation of certain territory containing 24.4± acres in Prairie Township. ($0.00)\nBody\n \nWHEREAS, a petition for the annexation of certain territory in Prairie Township was filed on behalf of Shawn S. Schlosser and Nicole A. Schlosser on May 9, 2025; and\nWHEREAS, the petition was considered and approved by the Franklin County Board of Commissioners at a hearing on June 17, 2025; and\nWHEREAS, on July 10, 2025, the City Clerk received from Franklin County a certified copy of the resolution addressing the petition; and\nWHEREAS, sixty days have now elapsed since receipt of the resolution in accordance with the provisions of the Ohio Revised Code; and \nWHEREAS, it is in the best interest of the city of Columbus to accept the annexation of the territory addressed by the petition; now, therefore, \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS\nSECTION 1. That the annexation proposed by Shawn S. Schlosser and Nicole A. Schlosser in a petition filed with the Franklin County Board of Commissioners on May 9, 2025 and subsequently approved by the Board on June 17, 2025 is hereby accepted and said territory is hereby annexed to the city of Columbus. Said territory is described as follows:\nSituated in the State of Ohio, County of Franklin, Township of Prairie, Virginia Military Survey Number 5742-9221, and 13071 and part of that 25.403 acre tract as conveyed to Shawn S. Schlosser and Nicole A. Schlosser, of record in Instrument Number 201303220048212 (PID: 240-000036-00), and part of the 0.8658 acre tract as conveyed to Franklin County Commissioners (Parcel 46 WD), of record in Official Record 16889, Page E15, and part of that 126.239 acre tract as conveyed to the City of Columbus, of record in Instrument Number 202412230134862 (PID 246-317168-00) and being portions of Old Hall Road (Width Varies) and Hall Road (Width Varies), all deed references are on record at the Recorder's Office Franklin County, Ohio and being more particularly described as follows:\nBeginning at a northwesterly corner of Reserve \"B\" of that plat entitled \"Great Oak Section 1\", of record in Plat Book 109, Page 50, and being a point in the southerly line of Reserve \"A\" of that plat entitled \"Westbend Section 1\", of record in Plat Book 96, Page 54, and being a point in the existing City of Columbus Corporation line of record in Ordinance Number 2117-00, Case Number 29-00, recorded in Instrument Number 200103150052491;\nThence Southerly, with said corporation line, with the westerly line of said Reserve \"B\", and with the westerly line of a 22.30 acre tract as conveyed to Anaya Communities, LLC, of record in Instrument Number 201812140169325, same being the existing City of Columbus Corporation line of record in Ordinance Number 3307-2023, Case Number 30-23, recorded in Instrument Number 202402120014531, a distance of approximately 1163 feet to corner in the northerly line of a 111. 733 acre tract as conveyed to The Board of Trustees of Prairie Township, of record in Instrument number 201304080065970, and being in the Corporation Detachment line of record in Ordinance Number 3208-2024;\nThence Westerly, with the northerly line of said 111. 733 acre tract and with said Corporation Detachment line, a distance of approximately 604 feet to a corner thereof;\nThence Northerly, with an easterly line of said 111. 733 acre tract, through the right of way of Hall Road, and in part with the easterly right of way line of Old Hall Road, and across said 0.8658 acre tract, and in part with the said Corporation Detachment line, and passing through said 126.239 acre tract approximate a distance of 2323 feet to a point in the northerly right of way line of Old Hall Road, being in the existing City of Columbus Corporation line of record in Ordinance Number 0036-2023, Case Number 32-22, recorded in Instrument Number 202303210026925;\nThence Easterly, with said existing corporation line, with said northerly right of way of Old Hall Road and through said 126.239 acre tract, an approximate distance of 321 feet to a point;\nThence Southerly, with the said existing corporation line and the existing City of Columbus Corporation line of record in Ordinance Number 2427-99, Case Number 32-99, recorded in Instrument Number 200003080046012, through said 126.239 acre tract, in part through said right of way and in part with the westerly line of Lots 120-121, Lots 124-131 of a plat entitled Westbend Section 3 of record in Plat Book 101, Page 54, an approximate distance of 1144 feet to the southwesterly corner of Reserve \"E\" of said Westbend Section 3;\nThence Easterly, continuing with said existing corporation line, in part with the southerly line of said Reserve \"E\" of said Westbend Section 3, through the right of way of Hall Road, and in part with the southerly line of Reserve \"A\" of said Westbend Section 1, and in part with the southerly line of a 4.6991 acre tract as conveyed to Franklin County Commissioners, of record in Official Record 17416D16, and in part with the northerly line of said 0.8658 acre tract an approximate distance of 539 feet to The Point of Beginning and containing 24.4± acres of land, more or less;\nThe annexation description of the location of the property is to be annexed and is not a boundary survey as defined in O.A.C. Chapter 4733.37.\nThe above annexation contains a perimeter distance of 3,167 feet contiguous with the existing City of Columbus Corporation Line by Ordinance Numbers 2427-99, 2117-00, 3307-2023, and 0036-2023, with a total perimeter of 6,094 feet to be annexed, and 52% of the perimeter length is contiguous to the City of Columbus Corporation line.\nSECTION 2. That the City Clerk is hereby authorized and directed to make three copies of this ordinance to each of which shall be attached a copy of the map accompanying the petition for annexation, a copy of the transcript of proceedings of the Board of County Commissioners relating thereto, and a certificate as to the correctness thereof, the City Clerk shall then forthwith deliver one copy to the County Auditor, one copy to the Board of Elections thereof and do such other things as may be required by law.\nSECTION 3. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 155,
    "meeting_date": "2025-09-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "General"
    ]
  }
}