{
  "success": true,
  "vote": {
    "id": 13174,
    "item_number": "SR-17",
    "title": "To authorize the Director of the Department of Neighborhoods to enter into a non-profit service contract with the Center for Employment Opportunities, Inc. for litter abatement work; to authorize the transfer of $250,000.00 within the General Fund Citywide Account to the Department of Neighborhoods; to authorize the total expenditure of $450,000.00 from the Department of Neighborhoods' General Fund; and to declare an emergency. ($450,000.00)",
    "description": "Explanation\n \nBackground: \n \nThe Department of Neighborhoods and the Department of Public Service work collaboratively to support community needs.\n \nThis ordinance authorizes a non-profit professional service agreement in an amount not to exceed $450,000.00o the Center for Employment Opportunities, Inc. (CEO). This contract will allow the City of Columbus to work with CEO to engage participants in their job training program to provide services including:\n•                     Litter abatement and disposal\n•                     Illegal dumping removal and disposal\n•                     Clearing weeds and brush\n•                     Alley clean-up\n \nCEO is dedicated to providing, immediate, effective and comprehensive employment services to men and women recently released from incarceration. It is a highly structured and tightly supervised program that helps participants regain the skill and confidence needed for a successful transition to stable, productive lives.\n \nThe Department of Neighborhoods and the Department of Public Service will work collaboratively to identify areas across Columbus where the CEO work crew will focus. City staff primarily provide these vital services, and this collaborative group enhances responsiveness by addressing urgent cleanup needs in real time, often within hours. Their flexibility allows them to support unique situations without disrupting City operations. This partnership strengthens service delivery, ensuring both planned and immediate needs are met efficiently for the benefit of the community.    \n \nContract Compliance: Center for Employment Opportunities, Inc., CC023706, exp. 8-27-27\n \nFiscal Impact: The funding of $200,000.00 is available within the Department of Neighborhoods General Fund.  The funding of $250,000.00 will be transferred from the General Fund Citywide Account to the Department of Neighborhoods General Fund budget. \n \nEmergency Justification:  An emergency designation is essential to resume stalled clean-up efforts that directly benefit communities’ health and safety while impacting local jobs. The CEO program efforts swiftly and directly improve neighborhood environments. Delaying 30 days risks further degradation to multiple sites that have already been reported.\n \nTitle\n \nTo authorize the Director of the Department of Neighborhoods to enter into a non-profit service contract with the Center for Employment Opportunities, Inc. for litter abatement work; to authorize the transfer of $250,000.00 within the General Fund Citywide Account to the Department of Neighborhoods; to authorize the total expenditure of $450,000.00 from the Department of Neighborhoods' General Fund; and to declare an emergency. ($450,000.00)\n \nBody\n \nWHEREAS, the City is focused on supporting community needs to strengthen neighborhoods; and  \n \nWHEREAS, contracting with the Center for Employment Opportunities will provide additional capacity to conduct litter abatement, illegal dumping removal, alley clean-up and disposal and the clearing of weeds and brush; and \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Neighborhoods in that it is immediately necessary to authorize the Director of the Department of Neighborhoods to enter into contract with the Center for Employment Opportunities, Inc. to begin clean-up services as previous efforts were stalled and these services directly benefit communities' health and safety while impacting jobs, and the program efforts improve neighborhood environments, delaying thirty days risks further degradation to multiple sites that have already been reported, all for the immediate preservation of the public health, peace, property, safety and welfare; and now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Neighborhoods be, and hereby is, authorized to enter into a non-profit service contract with the Center for Employment Opportunities for community clean-up work up to $450,000.00, or so much thereof as may be needed, in accordance with the provisions of Columbus City Code.\n \nSECTION 2. That the transfer of $250,000.00 or so much thereof as may be needed, is hereby authorized within Fund 1000 (General Fund) from Dept-Div 45-01 (Financial Management), Object Class 10 (Transfer Out Operating) to Dept-Div 4801 (Neighborhoods), Object Class 05 (Other) per the accounting codes in the attachment to this ordinance.\nSECTION 3. That the expenditure of $450,000.00 is authorized in the Department of Neighborhoods General Fund, Fund 1000, per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the funds are hereby deemed appropriated and transfers authorized to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modification associated with this ordinance. \nSECTION 6.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 155,
    "meeting_date": "2025-09-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Community Services",
      "Contracts & Agreements"
    ]
  }
}