{
  "success": true,
  "vote": {
    "id": 13173,
    "item_number": "SR-16",
    "title": "To authorize the Director of the Recreation and Parks Department to execute a Construction, Contribution, and Maintenance Agreement with Adaptive Sports Connection in conjunction with their construction of a new building on leased land at O’Shaughnessy Reservoir; to authorize the transfer of $500,000.00 between the General Fund Income Tax Set Aside Subfund and the Recreation and Parks Bond Fund; to authorize the appropriation of $500,000.00 in the Income Tax Set Aside Subfund and Recreation and Parks Voted Bond Fund; to authorize the expenditure of $500,000.00 from the Recreation and Parks Voted Bond Fund; to waive competitive bidding provisions of the Columbus City Code and to declare an emergency. ($500,000.00)",
    "description": "Explanation\nBackground: This legislation authorizes the Director of the Recreation and Parks Department to execute construction, contribution, and maintenance agreements with Adaptive Sports Connection (Hereinafter \"ASC\"). The existing lease with the ASC was authorized by Ordinance 0425-2025. \n \nASC will be demolishing the existing facility at this location and commencing the construction of a new building as documented in the construction agreement.  The Recreation and Parks Department has determined that it is in the City’s best interest to enter into this agreement with ASC for the purpose of constructing an adventure and wellness facility to support the services provided by the non-profit organization. \n \nThis property will additionally require the execution of an operating and maintenance agreement that will run concurrently with the City and existing ASC lease. This agreement will define the requirements of ASC regarding stormwater retention basin and septic system maintenance.  ASC will need to build a stormwater retention basin adjacent to, but outside the current Leased Premises. ASC will maintain the already existing septic system serving the Leased Premises, including the leach field for its wastewater management also adjacent to, but outside the current Leased Premises. \n \nThe City of Columbus, Recreation and Parks Department will contribute $500,000.00 towards the construction of this new facility. As a result, there is a need for the approval of the contribution agreement between the City and ASC.\n \nPrincipal Parties: \nAdaptive Sports Connection\n6000 Harriott Drive \nPowell, Ohio 43065\nSharon Schreiber, (614) 389-3921\nContract Compliance Number: 030387\nGroup: Non Profit\n \nEmergency Justification: Emergency action is requested to ensure that ASC can be issued a notice to proceed construction immediately following passage of this ordinance so that exterior construction can be complete prior to the 2025 winter season for the benefit adaptive sports participants and Spring 2026 opening.\n \nCommunity input/issues: ASC has been widely accepted as part of the diverse group of recreational enthusiasts that utilize O’Shaughnessy Reservoir. The community has expressed interest in the availability of adaptive sports opportunities. \nBenefits to the Public: ASC offers specialized programming to serve those that have varying physical and cognitive challenges, maintaining an ongoing partnership with the Therapeutic Recreation Section of the Columbus Recreation and Parks Department.\n \nArea(s) Affected: O'Shaughnessy Reservoir and Far Northwest (31)\n \nMaster Plan Relation: This project will support the Recreation and Parks Master Plan by promoting blueways, encouraging passive uses of natural areas, and strengthening partnerships.\n \nFiscal Impact: $500,000.00 is budgeted and available from within the Recreation and Parks Voted Bond Fund 7712 to meet the financial obligations of this expenditure. The funds will not be available to the Recreation and Parks Department until the proceeds of the 2024-2025 bond sale are available at a future date. Therefore, it is necessary to certify the required funds against the General Fund 1000, Income Tax Set Aside Subfund 100099. Upon the sale of bonds, this will be reimbursed.\nTitle\nTo authorize the Director of the Recreation and Parks Department to execute a Construction, Contribution, and Maintenance Agreement with Adaptive Sports Connection in conjunction with their construction of a new building on leased land at O’Shaughnessy Reservoir; to authorize the transfer of $500,000.00 between the General Fund Income Tax Set Aside Subfund and the Recreation and Parks Bond Fund; to authorize the appropriation of $500,000.00 in the Income Tax Set Aside Subfund and Recreation and Parks Voted Bond Fund; to authorize the expenditure of $500,000.00 from the Recreation and Parks Voted Bond Fund; to waive competitive bidding provisions of the Columbus City Code and to declare an emergency. ($500,000.00)\nBody\n \nWHEREAS, the CITY owns certain real property located 6000 Harriot Drive, Powell, Ohio 43065 (“Property”); and\nWHEREAS, ASC currently leases a 1.510 acre ± portion of the Property containing an existing building and structures; and\nWHEREAS, ASC uses the Leased Premises as its primary place of business to operate and manage a non-profit adaptive sports recreational activities program to enhance the quality of life for people with disabilities and to promote the full utilization of existing therapeutic sports programs and facilities by persons with disabilities; and\nWHEREAS, ASC will be making substantial improvements to the Premises that will require demolition, significant alteration, and new construction; and\n \nWHEREAS, ASC will need to build a stormwater retention basin adjacent to, but outside the current Leased Premises; as a result of the certain improvements made on said Premises and \n \nWHEREAS, ASC will maintain the already existing septic system serving the Leased Premises, including the leach field for its wastewater management also adjacent to, but outside the current Leased Premises; and \n \nWHEREAS, the CITY may make a contribution to this improvement in an amount not-to-exceed $500,000.00 from the Recreation and Parks Voted Bond Fund 7712 for improvements made by ASC to the leased Premises; and\n \nWHEREAS, ASC will begin demolition of existing structures and the new construction of its building immediately following the execution of the construction agreement; and\n \nWHEREAS, it is in the best interest of the Recreation and Parks Department to waive the competitive bidding requirements of the Columbus City Code for the construction agreement; and \n \nWHEREAS, the City anticipates incurring certain Original Expenditures (as defined in Section 1.150-2(c) of the Treasury Regulations (the \"Treasury Regulations\") promulgated pursuant to the Internal Revenue Code of 1986, as amended, with respect to the construction of the project described in this ordinance (the \"Project\"); and\n \nWHEREAS, it is necessary to authorize the transfer of $500,000.00 between the General Fund 1000, Income Tax Set Aside Subfund 100099, and the Recreation and Parks Bond Fund, Fund 7702; and\n \nWHEREAS, funds will need to be appropriated within the General Fund 1000, Income Tax Set Aside Subfund 100099 and within the Recreation and Parks Bond Fund, Fund 7702; and\n \nWHEREAS, the City will reimburse the General Fund 1000, Income Tax Set Aside Subfund 100099; and\n \nWHEREAS, this transfer should be considered as a temporary funding method; and\n \nWHEREAS, the aggregated principal amount of obligations which the City will issue to finance this project is presently expected not to exceed $500,000.00; and\n \nWHEREAS, it is necessary to authorize the expenditure of $500,000.00 from the Recreation and Parks Voted Bond Fund 7702; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Department of Recreation and Parks in that it is immediately necessary to authorize the Director of Recreation and Parks to execute the Construction, Contribution, and Maintenance Agreements with Adaptive Sports Connection to ensure that exterior construction can be complete prior to the 2025 winter season for the benefit adaptive sports participants and the Spring 2026 facility opening, all for the immediate preservation of the public health, peace, property, safety and welfare; and NOW, THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Recreation and Parks Department be and is hereby authorized to execute Construction and Maintenance Agreements with the Adaptive Sports Connection (ASC) in conjunction with their adaptive sports activities on O’Shaughnessy Reservoir.\n \nSECTION 2. That the Director of the Recreation and Parks Department be and is hereby authorized to execute a Contribution Agreement, in the amount not-to-exceed $500,000.00, with the Adaptive Sports Connection in conjunction with their facility improvements to the leased City of Columbus Property.\n \nSECTION 3. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 4. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 6. That from the unappropriated monies and from all monies estimated to come into said funds from any and all sources and unappropriated for any other purpose during the fiscal year ending December 31, 2025, the sum of $500,000.00 is appropriated in General Fund 1000, Income Tax Set Aside Subfund 100099, in Object Class 10 Transfer Out Operating, and in Fund 7712, Recreation and Parks Bond Fund, in Object Class 06 Capital Outlay per the account codes in the attachment to this ordinance.\n \nSECTION 7. That the transfer of $500,000.00 or so much thereof as may be needed, is hereby authorized between the General Fund 1000, Income Tax Set Aside Subfund 100099, and the Recreation and Parks Bond Fund, Fund 7712, per the account codes in the attachment to this ordinance.\n \nSECTION 8. That the City Auditor is hereby authorized to transfer said funds to the Recreation and Parks Voted Bond Fund 7712, at such time as is deemed necessary by the City Auditor, and to expend said funds, or so much thereof as may be necessary.\n \nSECTION 9. That upon obtaining other funds from the 2024-2025 Bond Sale for the City of Columbus, the City Auditor is hereby authorized and directed to repay the General Fund 1000, Income Tax Set Aside Subfund 100099 the amount transferred under Section 6.\n \nSECTION 10. That the City intends that this ordinance constitutes an \"official intent\" for purposes of Section 1.150 2(e) of the Treasury Regulations, and that the City reasonably expects to reimburse itself for certain Original Expenditures incurred with respect to the Project from the proceeds of obligations to be issued by the City in a principal amount currently estimated to be $500,000.00 (the \"Obligations\"). The City intends to make a reimbursement allocation on its books for the Original Expenditures not later than eighteen months following the later to occur of the date of the Original Expenditure to be reimbursed or the date the Project for which such Original Expenditures were made is \"placed in service\" within the meaning of Treasury Regulations Section 1.150 2(c).  Upon the issuance of the Obligations, the proceeds of such Obligations shall be used to reimburse the fund from which the advance for costs of the Project will be made.\n \nSECTION 11. That for the purpose stated in Section 2, the expenditure of $500,000.00, or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Recreation and Parks Voted Bond Fund 7712 in object class 06 Capital Outlay per the accounting codes in the attachments to this ordinance.  \n \nSECTION 12.  That this Council finds it in the best interests of the City to waive the competitive bidding provisions of City Code Chapter 329 to enter into this construction agreement and does hereby waive the same.\n \nSECTION 13.  That this Council finds it in the best interests of the City to authorize the demolition of existing structures and commence construction of new facility at this leased property.\n \nSECTION 14. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 155,
    "meeting_date": "2025-09-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}