{
  "success": true,
  "vote": {
    "id": 13182,
    "item_number": "SR-25",
    "title": "To authorize the Director of the Department of Development to establish contracts with various contractors for the Lead Safe services by the Division of Housing; to waive competitive bid requirements of the Columbus City Code; to allow expenditures prior to the establishment of Purchase Orders back to and including March 1, 2025; to authorize the expenditure of $1,940,000.00 from the Lead Hazard Reduction 24 Grant; and to declare an emergency. ($1,940,000.00)",
    "description": "Explanation\n \nBACKGROUND\n \nThis legislation authorizes the Director of the Department of Development to waive the competitive bidding requirements of Columbus City Codes Chapter 329 and to establish contracts for the Lead Safe Columbus Program services for residential properties within the city limits of Columbus, Ohio on behalf of the Division of Housing.  The Contractor will perform lead safe repairs using the 2012 HUD Lead Safe Guidelines and provide other services pertaining to healthy homes repairs on residential properties within the city limits of Columbus, Ohio. \n \nThe Lead Safe Columbus Program funding is obtained through the U.S. Department of Housing and Urban Development (HUD) for release of funds from the Lead Hazard Reduction Demonstration Grant Program, authorized by Sec. 1011 of the Residential Lead-Based Paint Hazard Reduction Act of 1992 (Title X of the Housing & Community Development Act of 1992) for the following multi-year project: Lead Safe Columbus grant period running March 2025 through March 2029.\n \nThe Department of Development advertised RFQ030391 through the Vendor Services portal on May 13, 2025, and accepted proposals for qualifications for lead abatement contractors through the Bonfire portal on June 6, 2025.  A total of nineteen (19) responses were received.  A total of 9 contractors were selected by an evaluation committee consisting of Staff from the Department of Development.  The qualifications were based on prior experience, equipment, staffing, and other factors.  The resulting contracts will be established for one year with an option to extend through the grant ending March 2029.  \nBid Waiver Justification: City Code 329 was modified to require all service contractors to pay a responsible wage and provide a health insurance benefit.  Housing and Fiscal found the Invitation to Bid (ITB) process does not allow a City agency to negotiate pricing to ensure awarded bidders account for responsible wage requirements.  In addition, the ITB process is limited to the lowest bid rather than weighing the contractor’s ability and capacity to perform the demand of the contract.   \nBy processing the procurement project as a Request for Statement of Qualifications (RFSQ) and scoring each offeror on their experience, equipment, and personnel allowed the evaluation committee to determine the most qualified contractors to perform the services on residential properties within the city limits of Columbus, Ohio.  \nThe Division of Housing published and notified registered vendors of the procurement project through the City’s Vendor Services portal and bulletin. \nThe RFQ provided instructions to submit supporting documentation on the City’s Bonfire portal. \nA bid waiver is required to enter into contracts because the Request for Statement of Qualifications (City Code 329.27) process allows agencies to award only professional service contracts, and technical proposals were not requested from offers since we provided technical specification requirements to follow.  \n \nEmergency action is requested to allow for the immediate approval to provide services as there are citizens waiting for services to remediate the health and safety hazards within their homes.\n \nFISCAL IMPACT:  Funding is available within the Lead-24 Grant (G442500).\n \nAWARDED VENDORS: \n \n\n\n\nODI Certification\n\nVendor Number\n\n Cert Date Expiration \n\nVendor\n\nContract Amount\n\n\n\n Majority\n\n052081\n\n3/20/2027\n\nNewark Building Solutions\n\n$250,000.00\n\n\n\nMBE/WBE \n\n048871\n\n4/19/2026\n\nAisha Kamilah Cooley\n\n$180,000.00\n\n\n\n Majority\n\n051998\n\n3/14/2027\n\nRonald Horton Jr\n\n$250,000.00\n\n\n\nMBE/WBE \n\n021897\n\n1/3/2026\n\nSavKon Construction\n\n$180,000.00\n\n\n\n Majority\n\n043432\n\n8/12/2027\n\nTTI Enterprise\n\n$200,000.00\n\n\n\n Majority\n\n008433\n\n7/21/2027\n\nColiseum Home Improvements\n\n$250,000.00\n\n\n\n Majority\n\n052137\n\n3/28/2027\n\nCitadel Construction Group LLC\n\n$200,000.00\n\n\n\n Majority\n\n005539\n\n7/16/2027\n\nReliable Home Improvements of Ohio Inc.\n\n$250,000.00\n\n\n\n Majority\n\n052055\n\n3/19/2027\n\nKenneth Burgess \n\n$180,000.00\n\n\n\n \n\n \n\n \n\nTotal \n\n$1,940,000.00\n\n\n \n \n \nTitle\n \nTo authorize the Director of the Department of Development to establish contracts with various contractors for the Lead Safe services by the Division of Housing; to waive competitive bid requirements of the Columbus City Code; to allow expenditures prior to the establishment of Purchase Orders back to and including March 1, 2025; to authorize the expenditure of $1,940,000.00 from the Lead Hazard Reduction 24 Grant; and to declare an emergency. ($1,940,000.00)\n \n \n \nBody\n \nWHEREAS, the Department of Development advertised RFQ030391 on Vendor Services and accepted proposals for lead abatement services in June 2025, a total of nineteen (19) responses were received; and\n \nWHEREAS, the RFSQ process was used to ensure contract prices are consistent with the new wage and benefit requirements and to allow the City to pay one price list for all services under the resulting contracts; and\n \nWHEREAS, a waiver to competitive bids is required to enter into contracts because the Request for Statement of Qualifications (City Code 329.27) process allows agencies to award only professional service contracts, and technical proposals were not requested from offers since we provided technical specification requirements to follow; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to authorize the Director to enter into these contracts to begin the Lead Safe Columbus program services, for the immediate preservation of the public health, peace, property, safety and welfare; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Development be and is hereby authorized to establish lead abatement contractors service contracts for one year with an option to extend through the grant ending March 2029, for the following contractors and amounts, with reimbursement of expenses incurred prior to the creation of purchase orders back to and including March 1, 2025 hereby authorized:\n \n\n\n\nODI Certification\n\nVendor Number\n\n Cert Date Expiration \n\nVendor\n\nContract Amounts\n\n\n\n Majority\n\n052081\n\n3/20/2027\n\nNewark Building Solutions\n\n$250,000.00\n\n\n\nMBE/WBE \n\n048871\n\n4/19/2026\n\nAisha Kamilah Cooley\n\n$180,000.00\n\n\n\n Majority\n\n051998\n\n3/14/2027\n\nRonald Horton Jr\n\n$250,000.00\n\n\n\nMBE/WBE \n\n021897\n\n1/3/2026\n\nSavKon Construction\n\n$180,000.00\n\n\n\n Majority\n\n043432\n\n8/12/2027\n\nTTI Enterprise\n\n$200,000.00\n\n\n\n Majority\n\n008433\n\n7/21/2027\n\nColiseum Home Improvements\n\n$250,000.00\n\n\n\n Majority\n\n052137\n\n3/28/2027\n\nCitadel Construction Group LLC\n\n$200,000.00\n\n\n\n Majority\n\n005539\n\n7/16/2027\n\nReliable Home Improvements of Ohio Inc.\n\n$250,000.00\n\n\n\n Majority\n\n052055\n\n3/19/2027\n\nKenneth Burgess \n\n$180,000.00\n\n\n\n \n\n \n\n \n\nTotal \n\n$1,940,000.00\n\n\n \n \nSECTION 2. That Council finds that it is in the best interest of the City to waive the competitive bidding provisions of Chapter 329 of the Columbus City Codes to enter into these contracts and does hereby waive the same.\n \nSECTION 3. That for the purpose as stated in Section 1, the expenditure in an amount of $1,940,000.00 or so much thereof as may be needed, is hereby authorized within Fund 2220 (General Government Grants Fund), Project G442500, Dept-Div 4410 (Housing), in object class 03 (Services)per the existing ACPO011645 that was established via Ordinance 3263-2024 which accepted the grant.\n \nSECTION 4.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 155,
    "meeting_date": "2025-09-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}