{
  "success": true,
  "vote": {
    "id": 13210,
    "item_number": "CA-18",
    "title": "To authorize the Director of Public Service to enter into agreements with CSX Transportation Inc. relative to the Arterial Street Rehabilitation - Williams Road Corridor - Scioto River to South Hamilton Road project; to authorize the encumbrance and expenditure of up to $23,485.00 from the Streets and Highways Bond Fund; and to declare an emergency. ($23,485.00)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Service to enter into agreements with CSX Transportation, Inc. (“CSX”) relative to the Arterial Street Rehabilitation - Williams Road Corridor - Scioto River to South Hamilton Road project.\n \nAccording to data from the Ohio Rail Development Commission, the two at-grade rail crossings on Williams Road are among the top 15% most hazardous crossings in Ohio Pursuant to Ordinance 2907-2024, the Department of Public Service engaged Woolpert, Inc. for the provision of planning and preliminary engineering services culminating in the preparation of a feasibility study evaluating the proposed construction of a separated grade crossing at the intersection of Williams Road and Athens Industrial Track and the reconstruction of the CSX railroad bridge over Williams Road to accommodate widening of that roadway to potentially address those signficant safety challenges. That scope of work necessitates that the Department of Public Service contract with CSX to review and approve engineering plans, design plans, construction specifications, drawings, and other documents necessary to the completion of the project to identify and mitigate potential conflicts between rail operations and public infrastructure in proximity to railway corridors. The purpose of this legislation is to authorize the execution of an engineering agreement between the Department of Public Service and CSX, pursuant to which the latter will perform a thorough plan review and other design and engineering services necessary to the completion of the Arterial Street Rehabilitation - Williams Road Corridor - Scioto River to South Hamilton Road project.\n2.  FISCAL IMPACT\nFunding in the amount of $23,485.00 is available for this project in the Streets and Highways Bond Fund, Fund 7704, within the Department of Public Service.\n3.  EMERGENCY DESIGNATION\nEmergency action is requested to enable the City to execute the requisite engineering agreement with CSX no later than October 31, 2025, so as to prevent unnecessary delays in the completion of the project.  \nTitle\nTo authorize the Director of Public Service to enter into agreements with CSX Transportation Inc. relative to the Arterial Street Rehabilitation - Williams Road Corridor - Scioto River to South Hamilton Road project; to authorize the encumbrance and expenditure of up to $23,485.00 from the Streets and Highways Bond Fund; and to declare an emergency. ($23,485.00)\nBody\nWHEREAS, according to data from the Ohio Rail Development Commission, the two at-grade rail crossings on Williams Road are ranked among the top 15% most hazardous crossings in the state; and\nWHEREAS, Ordinance 2907-2024 authorized the execution of a professional service contract between the Department of Public Service and Woolpert, Inc. for the provision of planning and preliminary engineering services culminating in the preparation of a feasibility study evaluating the proposed construction of a separated grade crossing at the intersection of Williams Road and Athens Industrial Track and the reconstruction of the CSX railroad bridge over Williams Road to accommodate widening of that roadway to potentially address those significant safety challenges; and \nWHEREAS, the aforementioned effort necessitates the execution of an engineering agreement between the Department of Public Service and CSX, pursuant to which the latter will perform a thorough plan review and other design and engineering services necessary to the completion of the Arterial Street Rehabilitation - Williams Road Corridor - Scioto River to South Hamilton Road project; and   \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to authorize the passage of this legislation to enable the City to execute the requisite engineering agreement with CSX no later than October 31, 2025, so as to prevent unnecessary delays in the completion of the project, thereby preserving the public health, peace, property, safety, and welfare; now therefore,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1.  That the Director of Public Service, or a designee, be and is hereby authorized to execute an engineering agreement or a similar instrument, and any amendments or modifications thereto as may be necessary, with CSX Transportation Inc. relative to the Arterial Street Rehabilitation - Williams Road Corridor - Scioto River to South Hamilton Road project.\n \nSECTION 2.  That the expenditure of $23,485.00, or so much thereof as may be needed, is hereby authorized in Fund 7704 (Streets and Highways Bond Fund), Dept-Div 5912 (Design and Construction), Project P533008-100000 (Arterial Street Rehabilitation - Williams Road Corridor - Scioto River to South Hamilton Road), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this Ordinance.\n \nSECTION 3.   That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.   That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this Ordinance.\n \nSECTION 5.   That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 6.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 156,
    "meeting_date": "2025-09-29",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}