{
  "success": true,
  "vote": {
    "id": 13218,
    "item_number": "CA-26",
    "title": "To authorize the Director of the Recreation and Parks Department to enter into contract with Setterlin Building Company for the Cultural Arts Center Renovations 2025 Project; to authorize the transfer of $919,537.00 between the General Fund Income Tax Set Aside Subfund and the Recreation and Parks Bond Fund; to authorize the appropriation of $919,537.00 in the Income Tax Set Aside Subfund and Recreation and Parks Voted Bond Fund; to authorize the expenditure of $919,537.00 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($919,537.00)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Director of the Recreation and Parks Department to enter into contract with Setterlin Building Company for the Cultural Arts Center Renovations 2025 Project. The contract amount is $789,450.00, with alternates of $44,220.00 and a contingency of $83,367.00, for a total of $917,037.00. An additional $2,500.00 is being authorized for interdepartmental inspections and fees for a total of $919,537.00 being authorized by this ordinance. \n \nThe interior portion of the project at the Priscilla R. Tyson Cultural Arts Center will includes flooring and restroom improvements. The current main gallery flooring was installed over 20 years ago. The existing floor does not support new gallery layouts or special event layouts. The flooring improvements will help support fine arts programming and special events capabilities. The restrooms on the first and third floors of the facility will be improved by providing ADA accessible stalls and ambulatory stalls. Also, the current restrooms do not provide appropriate access to mechanicals, resulting in operational issues, so maintenance access in the restrooms will be improved as part of this project. Construction is expected to start in winter of 2025 and be completed in the spring of 2026. \n \nVendor Bid/Proposal Submissions (Office of Diversity and Inclusion designation status):\nBids were advertised through Vendor Services, in accordance with City Code Section 329, on July 28, 2025 and received by the Recreation and Parks Department on August 21, 2025. Bids were received from the following companies:\n \nSetterlin Building Company                     $789,450.00\nMiles-McClellan Construction                     $989,048.00\nElford                                                                                    $933,700.00\n2K General Company                                          withdrawn\nHGC Construction                                          non-responsive\nMetro Property Services                     non-responsive\n \nAfter reviewing the bids that were submitted, it was determined that Setterlin Building Company was the lowest and most responsive bidder. Setterlin Building Company and all proposed subcontractors have met code requirements with respect to prequalification, pursuant to relevant sections of Columbus City Code Chapter 329.\n \nAs part of their bid, Setterlin Building Company has proposed the following vendors as subcontracts for this project:\nNorth Drywall Services\nWanner Metalworx\nMill Tech\nBerglund Construction\nThe Final Floor\nWeiffenbach Marble & Tile Co\nWF Bolin Painting\nColumbus Graphics\nS&S Midwest\nAccurate Mechanical, Inc.\nImperial Heating & Cooling Inc.\nRyco Electric\n \nPrincipal Parties: \nSetterlin Building Company\n560 Harmon Avenue\nColumbus, Ohio 43223\nJordan Spano, (614) 459-7077                                                   \nContract Compliance Number: 004372\nContract Compliance Expiration Date: April 9, 2027\n \nEmergency Justification: Emergency action is requested to keep the project on schedule to minimize impacts to scheduled exhibits, classes, and venue rentals that are scheduled for the spring of 2026.\n \nBenefits to the Public: This unique facility provides access to fine arts and special events within a historic setting. These improvements aim to ensure all residents can access this space and anticipate future needs. \n \nCommunity Input/Issues: This project was deemed necessary based upon data provided by the 2023 CIP Scoping Project, staff reports, and community 311 requests.\n \nArea(s) Affected: Downtown (55)\n \nMaster Plan Relation: This project will support the Recreation and Parks Master Plan by providing options to increase utilization of special use spaces and providing amenities to more user groups.\n \nFiscal Impact: $919,537.00 is budgeted and available from within the Recreation and Parks Voted Bond Fund 7712 to meet the financial obligations of this expenditure. The funds will not be available to the Recreation and Parks Department until the proceeds of the 2024-2025 bond sale are available at a future date. Therefore, it is necessary to certify the required funds against the General Fund 1000, Income Tax Set Aside Subfund 100099. Upon the sale of bonds, this will be reimbursed.\n \nTitle\n \nTo authorize the Director of the Recreation and Parks Department to enter into contract with Setterlin Building Company for the Cultural Arts Center Renovations 2025 Project; to authorize the transfer of $919,537.00 between the General Fund Income Tax Set Aside Subfund and the Recreation and Parks Bond Fund; to authorize the appropriation of $919,537.00 in the Income Tax Set Aside Subfund and Recreation and Parks Voted Bond Fund; to authorize the expenditure of $919,537.00 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($919,537.00)\n \nBody\n \nWHEREAS, it is necessary authorize the Director of Recreation and Parks to enter into contract with Setterlin Building Company for the Cultural Arts Center Renovations 2025 Project; \n \nWHEREAS, the City anticipates incurring certain Original Expenditures (as defined in Section 1.150-2(c) of the Treasury Regulations (the \"Treasury Regulations\") promulgated pursuant to the Internal Revenue Code of 1986, as amended, with respect to the construction of the project described in this ordinance (the \"Project\"); and\n \nWHEREAS, it is necessary to authorize the transfer of $919,537.00 between the General Fund 1000, Income Tax Set Aside Subfund 100099, and the Recreation and Parks Bond Fund, Fund 7712; and\n \nWHEREAS, funds will need to be appropriated within the General Fund 1000, Income Tax Set Aside Subfund 100099 and within the Recreation and Parks Bond Fund, Fund 7712; and\n \nWHEREAS, the City will reimburse the General Fund 1000, Income Tax Set Aside Subfund 100099; and\n \nWHEREAS, this transfer should be considered as a temporary funding method; and\n \nWHEREAS, the aggregated principal amount of obligations which the City will issue to finance this project is presently expected not to exceed $919,537.00; and\n \nWHEREAS, it is necessary to authorize the expenditure of $919,537.00 from the Recreation and Parks Voted Bond Fund 7712; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Recreation and Parks Department in that it is immediately necessary to authorize the Director to enter into contract with Setterlin Building Company to keep the project on schedule to minimize impacts to scheduled exhibits, classes, and venue rentals that are scheduled for the spring of 2026, all for the preservation of the public health, peace, property, safety, and welfare and, NOW, THEREFORE \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Recreation and Parks Department be and is hereby authorized to enter into contract with Setterlin Building Company for the Cultural Arts Center Renovations 2025 Project. \n \nSECTION 2. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 4. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 5. That from the unappropriated monies and from all monies estimated to come into said funds from any and all sources and unappropriated for any other purpose during the fiscal year ending December 31, 2025, the sum of $919,537.00 is appropriated in General Fund 1000, Income Tax Set Aside Subfund 100099, in Object Class 10 Transfer Out Operating, and in Fund 7712, Recreation and Parks Bond Fund, in Object Class 06 Capital Outlay per the account codes in the attachment to this ordinance.\n \nSECTION 6. That the transfer of $919,537.00 or so much thereof as may be needed, is hereby authorized between the General Fund 1000, Income Tax Set Aside Subfund 100099, and the Recreation and Parks Bond Fund, Fund 7712, per the account codes in the attachment to this ordinance.\n \nSECTION 7. That the City Auditor is hereby authorized to transfer said funds to the Recreation and Parks Voted Bond Fund 7712, at such time as is deemed necessary by the City Auditor, and to expend said funds, or so much thereof as may be necessary.\n \nSECTION 8. That upon obtaining other funds from the 2024-2025 Bond Sale for the City of Columbus, the City Auditor is hereby authorized and directed to repay the General Fund 1000, Income Tax Set Aside Subfund 100099 the amount transferred under Section 5.\n \nSECTION 9. That the City intends that this ordinance constitutes an \"official intent\" for purposes of Section 1.150 2(e) of the Treasury Regulations, and that the City reasonably expects to reimburse itself for certain Original Expenditures incurred with respect to the Project from the proceeds of obligations to be issued by the City in a principal amount currently estimated to be $919,537.00 (the \"Obligations\"). The City intends to make a reimbursement allocation on its books for the Original Expenditures not later than eighteen months following the later to occur of the date of the Original Expenditure to be reimbursed or the date the Project for which such Original Expenditures were made is \"placed in service\" within the meaning of Treasury Regulations Section 1.150 2(c).  Upon the issuance of the Obligations, the proceeds of such Obligations shall be used to reimburse the fund from which the advance for costs of the Project will be made.\n \nSECTION 10. That for the purpose stated in Section 1, the expenditure of $919,537.00, or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Recreation and Parks Voted Bond Fund 7712 in object class 06 Capital Outlay per the accounting codes in the attachments to this ordinance.  \n \nSECTION 11. That for the reasons stated in the preamble, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten (10) days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 156,
    "meeting_date": "2025-09-29",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}