{
  "success": true,
  "vote": {
    "id": 13232,
    "item_number": "CA-40",
    "title": "To authorize the Director of Public Safety to accept the donations of vehicles from National Insurance Crime Bureau for the value of approximately $120,000.00, to waive Columbus City Code 329.34; and to declare an emergency. ($0.00)",
    "description": "Explanation\n \nBACKGROUND: The Division of Police is requesting to accept donations from the National Insurance Crime Bureau (NICB), a leading non-profit organization dedicated to preventing insurance fraud and theft. The Division was contacted by the NICB to accept up to six donated used vehicles for use by the City to help in reducing crime. The approximate value of these vehicles is $120,000.00. These vehicles will be titled in the name of City of Columbus and will be returned to NICB at the end of their useful life.  The purpose of the donation is to facilitate in the investigation of insurance related crime and or fraud through covert use.\nEmergency Designation: Emergency legislation is requested so that the Division of Police may immediately accept these vehicles and deploy for covert investigations.\nFISCAL IMPACT:  There is no fiscal impact to the City.  \nTitle\n \nTo authorize the Director of Public Safety to accept the donations of vehicles from National Insurance Crime Bureau for the value of approximately $120,000.00, to waive Columbus City Code 329.34; and to declare an emergency. ($0.00)\nBody\n \nWHEREAS, the Division of Police was contacted with an unsolicited offer to receive six donated used vehicles from NICB; and\nWHEREAS, these used vehicles will be used by the Division of Police to assist in the investigation of insurance related crime and or fraud through covert use; and\nWHEREAS, it is in the best interest of the City to receive these donations; and\nWHEREAS, an emergency exists in the usual daily operation of the Division of Police, Department of Public Safety, in that it is immediately necessary to authorize the Director to receive said donations for the immediate preservation of the public health, peace, property, safety, and welfare; NOW, THEREFORE\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Public Safety is authorized to accept the donations of up to six used vehicles with the approximate value of $120,000.00 from National Insurance Crime Bureau\nSECTION 2.  That this Council finds it is in the best interest of the City to receive these donations.\nSECTION 3.  That at the end of the useful life of the vehicles, the vehicles will be returned to NICB; it is hereby declared that Columbus City Code 329.34 is waived for purposes of returning said vehicles at the end of their useful life.\nSECTION 4.  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 156,
    "meeting_date": "2025-09-29",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services"
    ]
  }
}