{
  "success": true,
  "vote": {
    "id": 13234,
    "item_number": "CA-42",
    "title": "To authorize the Director of the Department of Public Utilities to enter into a contract modification with Stantec Consulting Services for the Construction Administration/Construction Inspection Services 2023-2025 contract; to authorize an amendment to the 2025 Capital Improvement Budget; and to authorize the expenditure of $18,181.26 from the Water Bond Fund for the modification. ($18,181.26)",
    "description": "Explanation\n1.  BACKGROUND \nThis ordinance authorizes the Director of the Department of Public Utilities to enter into a contract modification with Stantec Consulting Services Inc., for construction administration/inspection services for Department of Public Utilities construction projects bid during the calendar years 2023 through 2025 as part of the Construction Administration/Construction Inspection Services 2023-2025 contracts.  \n \nStantec Consulting Services Inc. will be assigned construction projects as tasks on their contract and will ensure the work is performed to City of Columbus construction standards and specifications.  As projects are added to the contract, the contract will be modified to authorize Stantec Consulting Services Inc., to perform the work and to add funding to pay for the work.\n \nThis modification is for Stantec Consulting Services Inc., to perform construction administration/inspection services for the Indianola Booster Station project, C.I.P. No. 690473-100018 an amount up to $18,181.26.  \n \nThis project is located in Planning Area - 39-Clintonville\n \n1.1. Amount of additional funds to be expended:  $18,181.26\nCost summary: \nOriginal Contract:                             $453,854.08 (ORD 0956-2023; PO387786, PO387804, PO387812)\nModification #1:                                 $48,351.00 (ORD 1440-2023; PO407688)\nModification #2:                             $1,607,074.22 (ORD 3042-2023; PO425235, PO425237)\nModification #3:                                $320,534.69 (ORD 0450-2024; PO444538)\nModification #4:                                $542,076.68 (ORD 1320-2024; PO460584)                               \nModification #5:                                $130,000.00 (ORD 0276-2025; PO512231)\nModification #6:                      $494,528.30 (ORD 0628-2025; PO523988/PO524000)\nModification #7:                                $349,988.32 (ORD 1183-2025 PO TBD)\nModification #8:                                $521,560.00 (ORD 1241-2025 PO512728)\nModification #9:                                 $63,454.56 (ORD 1675-2025 PO TBD)\nModification #10:                               $18,181.26 (Current ordinance)\nTotal:                                                $4,549,603.11                                                                                \n \n1.2. Reasons additional goods/services could not be foreseen:  \nThis is a three-year contract for fiscal years 2023 - 2025 for which modifications were anticipated pursuant to the original authorizing legislation under Ordinance 0956-2023 to account for future construction projects being assigned to Stantec Consulting Services Inc. for inspection services.  Those future construction projects were not known when the contract was put into place.\n \n1.3. Reason other procurement processes are not used:  \nThis is a multi-year contract that will be modified as required to provide construction administration/inspection services for future construction projects that bid during the three-year (2023-2025) time frame.  Those future construction projects were not known when the contract was put into place. \n \n1.4. How cost of modification was determined:\nThe cost of this modification was determined by negotiations between Stantec Consulting Services Inc. and Department of Public Utilities project staff based upon the existing contract labor titles, maximum labor rates, allowable contract expenses, and the time estimated to be needed to perform contract tasks.\n \n2. ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT\nDivision of Water projects include replacement or rehabilitation of water lines and pump stations that have a high break frequency and valves that are inoperable.  Replacement of these water lines will improve water service, decrease burden on water maintenance operations, and reduce water loss. The Neighborhood Liaison(s) will be contacted and informed of this project during the design phase.  Further community outreach may result through the Neighborhood Liaison Program.\n \n3.  CONTRACT COMPLIANCE INFORMATION\nStantec Consulting Services Inc. contract compliance number is CC-000462 and expires 7/1/2027. \n \nStantec Consulting Services Inc. plans to do the work on this contract without the use of subconsultants.\n \nStantec Consulting Services Inc. was in good standing at the time of this contract modification.\n  \n4.  FISCAL IMPACT\nFunds are appropriated and available within the Water Bond Fund, Fund 6006, for this expenditure.  An amendment to the 2025 Capital Improvement Budget is needed to align budget authority with the proper project.  A transfer of cash and appropriation between projects within the Water Bond Fund, Fund 6006, is needed to align cash and appropriation with the proper project.  \n \nTitle\nTo authorize the Director of the Department of Public Utilities to enter into a contract modification with Stantec Consulting Services for the Construction Administration/Construction Inspection Services 2023-2025 contract; to authorize an amendment to the 2025 Capital Improvement Budget; and to authorize the expenditure of $18,181.26 from the Water Bond Fund for the modification. ($18,181.26) \n \nBody\nWHEREAS, the Department of Public Utilities advertised a Request for Proposals for Construction Administration/Construction Inspection Services; and\n \nWHEREAS, Stantec Consulting Services Inc. was one of six firms selected by the evaluation committee to provide these services; and \n \nWHEREAS, Ordinance 0956-2023 authorized the contract with Stantec Consulting Services Inc. for these services and assigned the first task to be performed; and\n \nWHEREAS, additional construction inspection/administration tasks needs to be performed; and\n \nWHEREAS, the contract with Stantec Consulting Services Inc. will need to be modified to add these tasks to the contract and to add funding to pay for the tasks; and \n \nWHEREAS, the 2025 Capital Improvement Budget must be modified to align budget authority with the proper project; and\n \nWHEREAS, a transfer of cash and appropriation within the Water Bond Fund, Fund 6006, is needed to align cash and appropriation with the proper project; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2025 Capital Improvement Budget authorized by Ordinance 1790-2025 be amended as follows to establish sufficient budget authority for this project:\n \nFund / Project Number / Project Name (Funding Source) / Current Authority / Revised Authority / Change \n6006 / 690473-100014 / Smoky Row Booster Station Roof Improvements (Voted Water Carryover) / $5,487/ $0.00 / ($5,487) (to match cash)\n6006 / 690473-100016 / Westgate West Tank Foote Repairs & Valve House Demo (Voted Water Carryover) / $7,115/ $0.00 / ($7,115) (to match cash)\n6006 / 690473-100018 / Indianola Booster Station Demolition (Voted Water Carryover) / $121,098/ $146,533/ $25,435 (to match cash)\n \nSECTION 2.  That the Director of the Department of Public Utilities is authorized to enter into a contract modification for the Construction Administration/Construction Inspection Services 2023-2025 contract with Stantec Consulting Services Inc., 1500 Lake Shore Drive, Suite 100, Columbus, Ohio, 43204, for construction administration and inspection services for the Indianola Booster Station Demolition Contract project in accordance with the terms and conditions as shown in the contract on file with the Department of Public Utilities, in an amount not to exceed $18,181.26.\n \nSECTION 3. That an expenditure of $18,181.26 or so much thereof as may be needed, is hereby authorized from the Water Bond Fund, Fund 6006, to pay for this contract modification per the accounting codes in the attachment to this ordinance.\n \nSECTION 4. That funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this Ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this Ordinance.\n \nSECTION 6.  That the City Auditor is authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 7.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 156,
    "meeting_date": "2025-09-29",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}