{
  "success": true,
  "vote": {
    "id": 13243,
    "item_number": "CA-51",
    "title": "To amend Ordinance No. 1156-2025, passed by Columbus City Council on May 12, 2025, to allow for a correction of the name listed within the ordinance from “Nelson Park Preservation Association LLC” to “Nelson Park Preservation Associates LLC”; and to declare an emergency. ($0.00)",
    "description": "Explanation\n \nBACKGROUND:  This legislation authorizes an amendment to Ordinance No. 1156-2025, passed by Columbus City Council on May 12, 2025, to allow for a correction of the name listed within the ordinance.  \n \nOrdinance No. 1156-2025, passed by Columbus City Council on May 12, 2025, authorized the Director of the Department of Development to execute separate commitment letters, loan agreements, promissory notes, mortgages, and restrictive covenants with Nelson Park Preservation Association LLC for the Nelson Park Apartments project based on their funding sources.  It was recently discovered that the name listed in the ordinance was incorrect as a clerical error occurred in stating  “Nelson Park Preservation Association LLC”.  The legal name, as registered with the Ohio Secretary of State, is “Nelson Park Preservation Associates LLC”.  Therefore, an amendment to the original ordinance to correct the name is needed and all other aspects of the ordinance remain the same.\n \nEmergency action is requested in order to correct this error to ensure that progress with the project and closing of all related documents can be accurately recorded.\n \nFISCAL IMPACT:  No funding is required for this legislation.\n \n \nTitle\n \nTo amend Ordinance No. 1156-2025, passed by Columbus City Council on May 12, 2025, to allow for a correction of the name listed within the ordinance from “Nelson Park Preservation Association LLC” to “Nelson Park Preservation Associates LLC”; and to declare an emergency. ($0.00)\n \n \n \nBody\n \nWHEREAS, Ordinance No. 1156-2025, passed by Columbus City Council on May 12, 2025, authorized the Director of the Department of Development to execute separate commitment letters, loan agreements, promissory notes, mortgages, and restrictive covenants with Nelson Park Preservation Association LLC for the Nelson Park Apartments project based on their funding sources; and\n \nWHEREAS, it was recently discovered that a clerical error occurred in stating “Association” within the name of the organization.  The legal name, as registered with the Ohio Secretary of State, is “Nelson Park Preservation Associates LLC”; and\n \nWHEREAS, the Director of the Department of Development requests that Ordinance No. 1156-2025 be amended in order to correct the organization name: and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to amend Ordinance 1156-2025, passed by Columbus City Council on May 12, 2025 in order correct the clerical error within the ordinance and to assure that the project is not impacted financially and that all documents are correct to assure they are properly recorded within the files and the Auditors thereby preserving the public health, peace, property, safety, and welfare; NOW THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Title of Ordinance No. 1156-2025, passed by Columbus City Council on May 12, 2025, be amended to read as follows with additions in underline and deletions in strikethrough: \n \nThis ordinance authorizes the appropriation in an amount up to $1,173,587.48, the transfer between object classes in an amount up to $126,639.13, and the expenditure of funds in an amount up to $1,500,000.00 of the 2019, 2020, 2021, and 2022 HOME Investment Partnerships Program, and the HOME Investment Partnerships ARP Program (HOME-ARP) funds from the U.S. Department of Housing and Urban Development; authorizes the Director of the Department of Development to enter into separate commitment letters, loan agreements, promissory notes,  mortgages, and restrictive covenants with Nelson Park Preservation Association LLC Nelson Park Preservation Associates LLC, in an amount up to $1,500,000.00 for the Nelson Park Apartments project based on their funding sources; and to authorize an emergency. ($1,500,000.00) \n \nSECTION 2.  That SECTION 6 of Ordinance No 1156-2025 be amended as follows with additions in underline and deletions in strikethrough:\n \nSECTION 6. That the Director of Development is hereby authorized to enter into separate commitment letters, loan agreements, promissory notes, mortgages, and restrictive covenants with Nelson Park Preservation Association LLC., Nelson Park Preservation Associates LLC., based on their funding sources for the Nelson Park Apartments project in an amount up to $1,500,000.00.\n \nSECTION 3.  That the existing Title and SECTION 6 of Ordinance No 1156-2025 are hereby repealed. \n \nSECTION 4.                      That all other aspects of Ordinance 1156-2025 are still in effect.\n \nSECTION 5.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure which shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes it.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 156,
    "meeting_date": "2025-09-29",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services",
      "Parks & Recreation"
    ]
  }
}