{
  "success": true,
  "vote": {
    "id": 13338,
    "item_number": "CA-10",
    "title": "To authorize an appropriation within the Neighborhood Initiatives subfund in support of Columbus City Council’s Participatory Budgeting Initiative; to authorize the payment of reasonable food and non-alcoholic beverage expenses; and to declare an emergency. ($225,000.00)",
    "description": "Explanation\nThis ordinance authorizes an appropriation of funds to support the operating expenses associated with Columbus City Council’s participatory budgeting initiative. The purpose of the funds to be utilized via this appropriation is to recognize and support the service of residents who volunteer their time and expertise to the Participatory Budgeting (PB) Steering Committee or to serve as Budget Delegates by providing fair stipends for dedicating their time and contribution towards the PB process. These funds will also support agreements with community-based organizations that will serve as conveners, facilitators, and trusted messengers to help engage nearby residents. Funds will also be used to provide food and beverages for participants.\n \nIn July of 2025 Council added a $9 million appropriation to the city’s Capital Improvement Program for year 2026 to fund proposals solicited via a community engagement process titled participatory budgeting. In partnership with the Department of Finance and Management and various administrative departments, Council intends to execute a participatory budgeting process in 2026 to solicit proposals for the 2026 Capital Improvement Budget.\n \nParticipatory Budgeting (PB) is a democratic process where community members directly give input on how to spend a portion of a public budget. The goal of establishing a Participatory Budgeting (PB) initiative in Columbus is to ensure public spending aligns with community values, strengthens democracy, and promotes equity across neighborhoods. \n \nThis ordinance appropriate funds to support the Participatory Budgeting Steering Committee, including an allocation for member stipends and for food and beverages to be provided during in-person Steering Committee meetings held at City Hall.  \n \nThe Participatory Budgeting Steering Committee will be compromised of Columbus residents who bring lived experience, represent the interest of their neighborhood and districts, and reflect communities that have historically been under-represented or excluded from local decision-making processes. The Committee, working collaboratively with the support of city staff, will support Columbus City Council in shaping the structure of the PB pilot cycle, such as developing a broad strategy plan for community outreach and engagement, and guiding improvements to the process. Each member will ensure the process is transparent, inclusive, equitable, and aligns with the community needs and priorities. \n \nThe Committee will convene during the design phase of the process over a ten (10) week period, from November to February, with additional meetings scheduled as necessary. Meeting will be held once per week, each lasting up to two (2) hours. From February until the completion of the process, the Committee will shift to meeting once per month. Members are further expected to participate in a minimum of two (2) idea collection and voting events, as well as an evaluation and reflection session.  Each member will receive a stipend for the completion of one full committee cycle, not to exceed one (1) year in duration. \n \nFiscal Impact: Funding is available within the Neighborhood Initiatives subfund.\n \nEmergency action is requested as Steering Committee work is expected to be initiated within the next several weeks, and there are corresponding expenses for which appropriations are required.\n \nTitle\nTo authorize an appropriation within the Neighborhood Initiatives subfund in support of Columbus City Council’s Participatory Budgeting Initiative; to authorize the payment of reasonable food and non-alcoholic beverage expenses; and to declare an emergency. ($225,000.00)\n \nBody\nWHEREAS, City Council authorizes the Departments of Finance and Management, Recreation and Parks, Development, Public Safety, Public Service, and Neighborhoods, as well as Columbus Water and Power, to work collaboratively with Council’s community engagement team to solicit project proposals from the community for the 2026 Capital Improvement Budget; and\n \nWHEREAS, Participatory Budgeting (PB) is a democratic process where community members directly give input on how to spend a portion of a public budget; and\n \nWHEREAS, the purpose of the funds to be utilized via this appropriation is to recognize and support the service of residents who volunteer their time and expertise to the PB process; and\n \nWHEREAS, these funds will also support agreements with community-based organizations that will serve as conveners, facilitators, and trusted messengers to help engage nearby residents; and\n \nWHEREAS, an emergency exists in the usual daily business of City Council in that it is immediately necessary to establish appropriations in support of participatory budgeting to accommodate upcoming expenses; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Auditor is hereby authorized and directed to appropriate $225,000.00 within the Neighborhood Initiatives subfund, fund 1000, subfund 100018, per the accounting codes in the attachment to this ordinance.\n \nSECTION 2. That the distribution of food and beverages associated with the execution of any programming associated with this appropriation are deemed to be for a public purpose and hereby authorized.  Food and beverage costs are authorized in an amount not to exceed the per-person, per-meal costs under the applicable per diem by meal established by location as set by the Federal General Services Administration.\n \nSECTION 3. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approved by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 158,
    "meeting_date": "2025-10-20",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services"
    ]
  }
}