{
  "success": true,
  "vote": {
    "id": 13332,
    "item_number": "CA-4",
    "title": "To authorize the Director of the Department of Technology to modify an existing contract with  OST Inc.OST Inc. of the District of Columbia (OST Inc.) to extend the contract term for an additional twelve (12) month period and to add additional funding; to authorize the expenditure of $100,000.00 from the General Fund; and to declare an emergency. ($100,000.00)",
    "description": "Explanation                                          \nThis ordinance authorizes the Director of the Department of Technology to modify an existing agreement with OST Inc. of the District of Columbia (OST Inc.) through the extension of purchase order PO485122. This extension will add twelve (12) months from the current expiration date of January 8, 2026, making the new expiration date January 8, 2027. This agreement was previously authorized by Ordinance 2984-2024. These professional services support DoT’s operational needs and have played a critical role in the initial phases of the Zero Trust Network (ZTN) initiative, aiding the department in the transformation of the city’s network systems to enhance cybersecurity, asset management, and network efficiency across over 250 city locations.\nIn addition, this ordinance authorizes the Director of the Department of Technology to modify the original contract to add funds to pay for additional services for the Civil Service Commission in the amount of $100,000.00 from the General Fund. \n1.1 Amount of additional funds to be expended: \nThe original contract amount:                                                           $800,000.00 (PO485122, Ord. 2984-2024)                          \nContract modification amount:                                                                         $100,000.00 (This ordinance)\nTotal contract amount:                                                                 $900,000.00\n \n1.2 Reasons additional goods/services could not be foreseen:  \nThis modification is necessary to provide additional funding to ensure continuity of service and maintain the ZTN initiative, enhancing cybersecurity, asset management, and network efficiency. This modification will allow systems to proceed to prevent any interruptions in service.  \n1.3 Reason other procurement processes are not used:\nThe city currently has an agreement with OST for cybersecurity, asset management, and network productivity services.  This modification adds funds to include the services provided to the Civil Service Commission.  It is in the best interest of the city to modify this contract.\n1.4 How cost of modification was determined:\nThe cost of this contract modification is based on the pricing as defined in the original proposal.\nFISCAL IMPACT\nFunding in the amount of $100,000.00 is budgeted and available in the General Fund, Fund 1000.\nEMERGENCY DESIGNATION\nThis ordinance is being submitted with emergency designation to ensure that there is no interruption in critical city operations including email, authentication services, VoIP, business system analysts, program management, operating systems, GIS, boundary networking, storage, databases, and the ZTN initiative.  \nCONTRACT COMPLIANCE\nVendor Name: OST Inc. of the District of Columbia \nVendor Acct#: 042892 \nExpiration Date: 8/6/2026\nTitle\nTo authorize the Director of the Department of Technology to modify an existing contract with  OST Inc.OST Inc. of the District of Columbia (OST Inc.) to extend the contract term for an additional twelve (12) month period and to add additional funding; to authorize the expenditure of $100,000.00 from the General Fund; and to declare an emergency. ($100,000.00)\nBody\nWHEREAS, this ordinance authorizes the Director of the Department of Technology to extend PO485122 for a period of twelve (12) months, to January 8, 2027, to allow for the completion of the project; and\nWHEREAS, this ordinance modifies the contract to add $100,000.00 in funding to support professional services to include the Civil Service Commission; and\nWHEREAS, an emergency exists in the usual daily operation of the Department of Technology in that it is immediately necessary to authorize the Director to modify an existing contract with OST Inc. of the District of Columbia (OST Inc.) to extend the contract term for an additional twelve month period and to add additional funding to cover the cost for services to the Civil Service Commission and to ensure that there is no interruption in critical city operations including email, authentication services, VoIP, business system analysts, program management, operating systems, GIS, boundary networking, storage, databases, and the Zero Trust Network initiative, all for the immediate preservation of the public health, peace, property, safety and welfare; and NOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1. That the Director of the Department of Technology be and is hereby authorized to modify an existing agreement with OST Inc. of the District of Columbia (OST Inc.) to extend the contract term of the purchase order PO485122 through January 8, 2027 and to add additional funding to cover cost for services to be provided to the Civil Service Commission.\nSECTION 2. That the expenditure of $100,000.00 or so much thereof as may be necessary is hereby authorized per the accounting codes in the attachment to this ordinance. (see 2252-2025 EXP)\nSECTION 3. That funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\nSECTION 5. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 158,
    "meeting_date": "2025-10-20",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}