{
  "success": true,
  "vote": {
    "id": 13389,
    "item_number": "SR-9",
    "title": "To authorize appropriation in an amount up to $892,026.96, the transfer between object classes in an amount up to $3,468.84, and the expenditure in an amount up to $1,100,000.00 of 2022 and 2023 HOME Investment Partnerships Program (HOME) entitlement grant funds from the U.S. Department of Housing and Urban Development; and to authorize the Director of the Department of Development enter into a commitment letter, loan agreement, promissory note, mortgage, and restrictive convent with Habitat for Humanity-MidOhio to construct single family homes with each address having its own set of loan documents.  ($1,100,000.00)",
    "description": "Explanation\n \nBACKGROUND:  This legislation authorizes the appropriation in an amount up to $892,026.96, the transfer between object classes in an amount up to $3,468.84 and expenditure in an amount up to $1,100,000.00 of 2022 and 2023 HOME Investment Partnerships Program (HOME) entitlement grants from the U.S. Department of Housing and Urban Development and authorizes the Director of the Department of Development to enter into a commitment letter, loan agreement, promissory note, mortgage, and restrictive convent with Habitat for Humanity-MidOhio to construct single family homes.  These single family homes will each have their own set of loan documents.  The funding of these homes will be in an amount up to $1,100,000.00 which will be comprised of the $895,495.80 of 2022 HOME Investment Partnerships Program funds and $204,504.20 of the 2023 HOME Investment Partnerships Program funds.\n \nHabitat for Humanity is a global nonprofit housing organization working in local communities across all 50 states in the U.S. and in approximately 70 countries. Habitat’s vision is of a world where everyone has a decent place to live. Habitat works toward the City’s vision by building strength, stability, and self-reliance in partnership with families in need of decent and affordable housing. Habitat homeowners help build their own homes alongside volunteers and pay an affordable mortgage.\n \nHabitat has a well-planned construction schedule that must take into account timing of public and private funding availability, volunteer labor, and subcontractor schedules.  Habitat for Humanity is the only developer building homeownership units with HOME funds for qualified homebuyers who earn between 30-80 % AMI and every home on the list is one purchased or optioned from/with the Land Bank. \n \nHabitat offers a zero percent interest mortgage and also brings up to 58% of the funding to each deal with the use of donor dollars, the mortgage payments of other Habitat homeowners, and in-kind donations for materials.  The units Habitat plans to build in the 2025-2026 construction season and are funded, in part, with City of Columbus HOME funds:  \n \n1277 E. 22nd Avenue (010-079334) (HOME 2022) Habitat will partner with a family from their pool of vetted applicants to build their single-family, two-story, four-bedroom or five-bedroom house on this lot.   \n \n1283 E. 22nd Avenue (010-079333) (HOME 2022) Habitat will partner with a family from their pool of vetted applicants to build their single-family, two-story, four-bedroom or five-bedroom house on this lot.\n \n1516 Genessee Avenue (010-059894) (HOME 2022) Habitat will partner with a family from their pool of vetted applicants to build their single-family, two-story, four-bedroom or five-bedroom house on this lot.\n \n2323 Grasmere Avenue (010-075145) (HOME 2022) Habitat will partner with a family from their pool of vetted applicants to build their single-family, two-story, three-bedroom or four-bedroom house on this lot.\n \n2322 Grasmere Avenue (010-075098) (HOME 2022) Habitat will partner with a family from their pool of vetted applicants to build their single-family, two-story, three-bedroom or four-bedroom house on this lot.\n \n1586 E. Blake Avenue (010-060860) (HOME 2022) Habitat will partner with a family from their pool of vetted applicants to build their single-family, four-bedroom or five-bedroom house on this lot.\n \n1558-1560 E. Blake Avenue (010-060888) (HOME 2022) Habitat will partner with a family from their pool of vetted applicants to build their single-family, four-bedroom or five-bedroom house on this lot.\n \n1596 E. Blake Avenue (010-060951) (HOME 2022) Habitat will partner with a family from their pool of vetted applicants to build their single-family, four-bedroom or five-bedroom house on this lot.\n \n \n1598 E. Blake Avenue (010-TBD)(the lot will be split and number) (HOME 2022 & HOME 2023) Habitat will partner with a family from their pool of vetted applicants to build their single-family, two-story, four-bedroom or five-bedroom house on this lot.\n \n1153 Minnesota Avenue (010-076126) (HOME 2023) Habitat will partner with a family from their pool of vetted applicants to build their single-family, two-story, three-bedroom or four-bedroom house on this lot.\n \n1848 Aberdeen Avenue (010-069498) (HOME 2023) Habitat will partner with a family from their pool of vetted applicants to build their single-family, two-story, three-bedroom or four-bedroom house on this lot.\n \nThis legislation represents appropriation for a part of the HOME portion of the 2022 Action Plan per ordinance 2800-2021 and the 2023 Action Plan per ordinance 3353-2022.\n \nContract Compliance:  the vendor number is 004859 and expires 1/27/2027.\n \nFiscal Impact: $895,495.80 is available from the 2022 HOME grant (G442102) and $204,504.20 is available within the 2023 HOME grant (G442202).  The commitment of funds through this legislation is conditioned on compliance with HUD’s environmental review requirements. The funding from HOME Fund (2201) is only authorized if all HOME review and comment requirements have been met prior to any commitment of funds, as approved by the Responsible Entity Agency Official. An Authorization to Utilize Grant Funds will be received by the City from HUD in advance of the execution of documents for this project.\n \n \nTitle\n \nTo authorize appropriation in an amount up to $892,026.96, the transfer between object classes in an amount up to $3,468.84, and the expenditure in an amount up to $1,100,000.00 of 2022 and 2023 HOME Investment Partnerships Program (HOME) entitlement grant funds from the U.S. Department of Housing and Urban Development; and to authorize the Director of the Department of Development enter into a commitment letter, loan agreement, promissory note, mortgage, and restrictive convent with Habitat for Humanity-MidOhio to construct single family homes with each address having its own set of loan documents.  ($1,100,000.00)\n \n \n \nBody\n \nWHEREAS, the City of Columbus is a participating jurisdiction of the U.S. Department of Housing and Urban Development; and\n \nWHEREAS, the City of Columbus is the recipient of HOME Investment Partnerships funds from the U.S. Department of Housing and Urban Development; and\n \nWHEREAS, the Columbus City Council has approved the 2022 Action Plan per ordinance 2800-2021 and the 2023 Action Plan per ordinance 3353-2022; and\n \nWHEREAS, the Department of Development desires to support Habitat for Humanity-MidOhio with financial support for the construction of single family homes; and\n \n  \n \nWHEREAS, this legislation authorizes the appropriation in an amount up to $892,026.96, the transfer between object classes in an amount up to $3,468.84, and the expenditure in an amount up to $1,100,000.00 of the 2022 and 2023 HOME Investment Partnership Program funds; and\n \nWHEREAS, the Director of the Department of Development is authorized to enter into a commitment letter, loan agreement, promissory note, mortgage, and restrictive convent with Habitat for Humanity-MidOhio to construct single family homes with each address having its own set of loan documents; and NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2025, the sum of $892,026.96 is appropriated within Fund 2201 (HOME), from Dept-Div 44-10 (Housing), G442102 (2022 HOME grant), object class 05 (Other Expenses) per the account codes in the attachment to this ordinance.\n \nSECTION 2.  That the transfer of appropriation between object classes in an amount up to $3,468.84 or so much thereof as may be needed, is hereby authorized in Fund 2201 (HOME), from Dept-Div 44-10 (Housing), G442102 (2022 HOME grant), per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That the expenditure in an amount up to $895,495.80 or so much thereof as may be needed, is hereby authorized in Fund 2201 (HOME), from Dept-Div 44-10 (Housing), G442102 (2022 HOME grant), object class 05 (Other Expenses) per the account codes in the attachment to this ordinance.\n \nSECTION 4.  That the expenditure in an amount up to $204,504.20 or so much thereof as may be needed, is hereby authorized in Fund 2201 (HOME), from Dept-Div 44-10 (Housing), G442202 (2023 HOME grant), object class 05 (Other Expenses) per the account codes in the attachment to this ordinance.\n \nSECTION 5.  That the commitment of funds through this legislation is conditioned on compliance with HUD’s environmental review requirements. The funding from HOME Fund (2201) is only authorized if all HOME review and comment requirements have been met prior to any commitment of funds, as approved by the Responsible Entity Agency Official. An Authorization to Utilize Grant Funds will be received by the City from HUD in advance of the execution of documents for this project.\n \nSECTION 6.  That the Director of Development is hereby authorized to enter into a commitment letter, loan agreement, promissory note, mortgage, and restrictive convent with Habitat for Humanity-MidOhio to construct six single family homes with each address having its own set of loan documents.                       \n \nSECTION 7.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n                                          \nSECTION 8.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 9.  At the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements.\n \nSECTION 10.  This ordinance shall take effect and be in force from and after the earliest date permitted by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 158,
    "meeting_date": "2025-10-20",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Grants"
    ]
  }
}