{
  "success": true,
  "vote": {
    "id": 13443,
    "item_number": "CA-46",
    "title": "To authorize the Director of the Department of Public Utilities to enter into a contract with Suburban Propane, L.P. for Offsite Biosolids Anaerobic Digestion; and to authorize the expenditure if $935,000.00 from the Sewer Operating Fund. ($935,000.00) (Amended by ord. 0333-2026 on 2/9/2026 -LG)",
    "description": "Explanation\n \nBACKGROUND\nThis legislation authorizes the Director of the Department of Public Utilities to enter into a contract with Suburban Propane, L.P. for Offsite Biosolids Anaerobic Digestion through December 31, 2026.\n \nThe City of Columbus operates a composting facility that processes sewage sludge from two interconnected wastewater treatment plants into soil conditioner / mulch for wholesale. The City of Columbus Composting Facility has goals to reduce the amount of waste products going to landfills. In pursuit of these goals The City of Columbus Compost Facility has partnerships with other sustainable focused facilities in the area including the offsite anaerobic digester owned and operated by Suburban Propane, L.P. \n \nThe offsite anaerobic digester was constructed via a public-private partnership between 2006 and 2009 as a means of redirecting organic materials from SWACO landfills and providing a reliable outlet for City Water Reclamation Facility biosolids and City of Columbus fats, oils, and greases (FOG). The facility employs three permanent and four seasonal jobs. It is the only waste grease and food waste receiving anaerobic digester in Franklin County. The facility redirects organics that would otherwise degrade to methane in a landfill and contribute to human caused global warming through unmitigated methane production. City produced biosolids are a key feedstock to keep the offsite digester functional and within acceptable operating parameters.\n \nThis outlet currently accounts for an average 15-20% of the City’s biosolids on a wet ton basis and has been integral to operations since its inception nearly two decades prior. The digester is located only 0.5 miles from the Jackson Pike Water Reclamation Plant. Transport of the City’s biosolids is performed by the Compost Facility’s operational staff. The minimal travel distance saves on costs of labor and equipment wear and tear while maximizing the number of loads which can be disposed in one day.\n \nThe offsite anaerobic digester will accept dewatered, class-B biosolids or unclassified biosolids as a feedstock for their anaerobic digestion process, co-digesting with other organics redirected from local landfills, and ultimately take ownership and land apply the biosolids.\n \n \nBid Waiver \nThe Central Ohio Bioengergy Facility was constructed through a public-private partnership with the division between 2006 and 2009. The City has contracted annually for 25,000.00 wet tons of biosolids per year since 2009 through the original contract. The contract is ending in December 2025 with a third party (Kurtz) and the division cannot find an equivalent beneficial reuse outlet in the contiguous 6 County region that can be serviced by City fleet equipment. The existing facility operations are crucial for organic waste management in Central Ohio and biosolids from our Water Reclamation Plants serve as a key nutrient source for successful operations.\n \nCONTRACT AMOUNTS/TIMELINE\nThis Contract will go into effect in December 2025 and remain in force for one (1) year from the date of execution by the City of Columbus with the option to renew annually for three (3) additional one (1) year periods upon mutual agreement between the parties, availability of budgeted funds and approval by City Council. If unforeseen issues or difficulties are encountered that would require additional funding, a modification would be requested.\n \nSUPPLIER: Suburban Propane, L.P., vendor #019071 Status PENDING\n \nThe company is not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.  \n \n \nFISCAL IMPACT:  $935,000.00 is budgeted and needed for this service. \n \n$0.00 was spent in 2024\n$0.00 was spent in 2023\n \n \nTitle\n \nTo authorize the Director of the Department of Public Utilities to enter into a contract with Suburban Propane, L.P. for Offsite Biosolids Anaerobic Digestion; and to authorize the expenditure if $935,000.00 from the Sewer Operating Fund. ($935,000.00) (Amended by ord. 0333-2026 on 2/9/2026 -LG)\n \n \nBody\n \nWHEREAS, the Department of Public Utilities has a need for a Offsite Anaerobic Digester Outlet; and \n \nWHEREAS, a waiver of the competitive bidding requirements of Columbus City Code Chapter 329 is needed for this purchase and service; and \n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities to authorize the Director enter into a contract with Suburban Propane, L.P. for Offsite Biosolids Anaerobic Digestion; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Public Utilities be and is hereby authorized to enter into a contract with Suburban Propane, L.P. for Offsite Biosolids Anaerobic Digestion in accordance with the terms, conditions and specifications on file.\n \nSECTION 2. This Council finds it is in the best interest of the City of Columbus to waive the relevant provisions of Columbus City Code Section 329 to permit the aforementioned purchase.\n \nSECTION 3.  That the expenditure of $935,000.00 or so much thereof as may be needed, be and is hereby authorized in Object Class 03 Services in Fund 6100-Sewerage Operating per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this Ordinance.\n \nSECTION 6.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 159,
    "meeting_date": "2025-10-27",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}