{
  "success": true,
  "vote": {
    "id": 13449,
    "item_number": "CA-52",
    "title": "To authorize the Director of Public Utilities to modify an existing non-profit contract with Solar United Neighbors for implementing the Low to Moderate Income (LMI) Solar Co-Op Program; and to declare an emergency. ($0.00)",
    "description": "Explanation \n \nBackground: This ordinance authorizes the Director of Public Utilities to modify the scope of an existing non-profit  contract with Solar United Neighbors for implementing the Low to Moderate Income (LMI) Solar Co-Op Program. The modification amount being authorized by this ordinance is $0.00.\n \nSolar United Neighbors is a 503(c)(3) nonprofit dedicated to building a clean, equitable energy system with rooftop solar as the cornerstone. SUN utilizes solar co-ops (a bulk-purchasing model) to provide discounted solar rates that help people go solar, jump-start and grow local clean energy markets, bring new constituencies into the movement, and build support for inclusive clean energy policies. SUN also works closely with community partners to ensure that the economic and social benefits of renewable energy development are invested into the local communities they serve. \nSUNS’s Ohio program, which began in 2016, has launched 38 co-ops to help migrate 611 people to solar, and in the process saving them an estimated $16.8 million in energy bill savings over their panels’ lifespans, while supporting 91 local jobs, and offsetting 172.7 million pounds of carbon emissions. These co-ops included a total of 3 co-ops in Columbus, through which SUN was able to take 67 people solar, facilitating the installations of 532 kW of solar capacity, saving people an estimated $1 million over their panels’ lifespans, and investing $1.3 million into the local economy. With over 67 solar installations facilitated and 518 participants in the solar info sessions throughout the Columbus Area Solar Co-ops since 2020, SUN has identified an emerging pattern of underserved communities. These are diverse communities that unfortunately have limited means to achieve any degree of energy independence. This can lead directly to higher utility costs and negative health outcomes. \nIn alignment and support of the Columbus Climate Action Plan, the Sustainable Columbus office is partnering with SUN and IMPACT Community Action to develop a low- to moderate-income (LMI) solar program that applies and adapts SUN’s proven co-op model to maximize engagement of low-income communities and maximize the benefits that low-income households receive from solar. This pilot program has helped individual LMI homeowners go solar and provide battery backup on their own homes, free of charge. They have also received the associated financial benefits of solar (30% federal income tax credit, solar renewable energy credits, increased property value and renewable energy property tax exclusion, and solar electricity production). The program has been designed to cover up to 100% of the LMI homeowner’s post-energy efficiency electricity usage, helping the homeowner see day-one savings on their monthly electric bill and extending those savings for the lifetime of the solar energy system. Additionally, this program will help determine the barriers to going solar, show demand for rooftop solar in lower-income communities, build trust, educate the community, and address energy burdens. IMPACT Community Action will work directly with SUN to identify Co-Op participants, mostly through their Weatherization program - a federal program that provides energy efficiency upgrades and includes a home audit. \nSUN will continue to engage low-income communities around solar and increase the resiliency of their neighborhood by expanding the scope of the Low- to Moderate- Income (LMI) Solar Co-op program to include buildings owned by nonprofits and other organizations on the Division of Power grid that serve the community. In support of the Columbus Climate Action Plan, the pilot program thus far has helped to serve 17-low to moderate- income homeowners in Columbus. 16 of those homeowners are on AEP Ohio’s grid, 1 homeowner is on the Division of Power’s grid. However, due to recruitment challenges given the small scale of Division of Power’s grid, we believe it is in the best interest of the residents to broaden the scope to include other community buildings. \nSUN will leverage community relationships to identify organizations in low-income neighborhoods that are serviced by the division of power to qualify for the program. SUN will then work with local solar installers to install solar and/or battery backup to power community building(s) with affordable, renewable energy for years to come.  \nThe contract was first executed on August 2, 2023, and then amended to include additional funding on August 8, 2024 and extend the contract expiration date to the completion of the program. This contract amendment is to expand the scope.  SUN will be identifying and qualifying organization(s) for the program, completing necessary contracting agreements between parties, installing the solar array, gathering results, and promoting the impact of the program. \nThis program helps to achieve multiple priorities of the City of Columbus. It supports the Columbus Climate Action Plan by increasing the amount of renewable energy in our community. It also supports the health and safety of residents in our low-income neighborhoods by providing clean and affordable energy to a valued community resource. There is one sub-consultant or contractor as part of this contract. Ohio Power Solutions will be completing the solar installation(s).\n \nPrincipal Parties: \nSolar United Neighbors \n1350 Connecticut Ave. NW, Suite 412\nWashington, DC 20036\nAngela DeMonbreun, (904) 351-8570\nContract Compliance Number: 018434\nContract Compliance Expiration Date: PENDING UPDATE\n \nSubcontractor: \nIMPACT Community Action\n711 Southwood Ave. \nColumbus, OH 43207\nContract Compliance Number: 001447\nContract Compliance Expiration Date: November 8, 2025\nFiscal Impact: No fiscal action is required at this time.\n$21,011.58 has been spent so far in 2025\n$00.00 was spent in 2024\n$247,000.00 was spent in 2023\n \nEmergency Justification: Emergency action is requested in order to order the products needed to fulfill the project need and have them installed before the federal residential solar requirement shifts occur on December 31, 2025. \n \nTitle\nTo authorize the Director of Public Utilities to modify an existing non-profit contract with Solar United Neighbors for implementing the Low to Moderate Income (LMI) Solar Co-Op Program; and to declare an emergency. ($0.00)\n \nBody\n \nWHEREAS, it is necessary to authorize the Director of the Department of Public Utilities to modify and extend a non-profit contract with Solar United Neighbors for implementing the Low to Moderate Income (LMI) Solar Co-Op Program; and\nWHEREAS, this modification will adjust the scope of the original project contract PO410736 to include additional items including community buildings; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Department of Public Utilities in that it is immediately necessary to authorize the Director to modify an existing non-profit contract with Solar United Neighbors to allow for the time needed to order products and install them prior to December 31, 2025, to meet the federal changes in the residential solar requirements all for the immediate preservation of the public health, peace, property, safety, and welfare; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Public Utilities be and is hereby authorized to modify and extend contract, PO410736, with Solar United Neighbors in accordance with the terms and conditions of the agreement on file for implementing the Low to Moderate Income (LMI) Solar Co-Op Program.\n \nSECTION 2. That the Director of Public Utilities is authorized to execute memoranda of understanding or other documents with organizations that may be necessary to carry into effect the undertakings and obligations of the City of Columbus set forth in the contract with Solar United Neighbors and IMPACT Community Action as modified.\n \nSECTION 3. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 159,
    "meeting_date": "2025-10-27",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Community Services",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}