{
  "success": true,
  "vote": {
    "id": 13457,
    "item_number": "CA-60",
    "title": "To authorize the Director of the Department of Development to modify a contract with Black Bronco Construction LLC to modify the scope of service to include performing lead safe renovations at shelters, transitional housing, and dormitory style living facilities; and to declare an emergency. ($0.00)",
    "description": "Explanation\n \nBACKGROUND:  This ordinance authorizes the Director of the Department of Development to modify the contract scope of service to include performing lead safe renovations at shelters, transitional housing, and dormitory style facilities which may also be considered as commercial living spaces with Black Bronco Construction LLC.  The original scope of service did not include performing these necessary repairs at shelters and or transitional housing and has since been identified as a great need within the community. Black Bronco Constructions LLC is an authorized lead-abatement contractor and has the capacity to perform this work in addition to the residential lead abatement services that they are currently performing on behalf of the Department of Development.  \n \nOriginal Agreement                     $1,200,000.00                     Ord. 1877-2024   PO459351\nModification No. 1                     $              0.00    \nTotal                                                               $1,200,000.00\n \nThe City of Columbus received grant funding for the Lead-Safe Housing Renovation, Repair, and Painting (RRP) from the State of Ohio Department of Development totaling $5,356,000.00 which was approved via Ordinance 3209-2023.  The funding from this grant assists low and moderate income owners with primary prevention and to reduce immediate and presumed lead hazards in residential properties built prior to 1978.  The renovations include but are not limited to roof replacements, framing to soffits, fascia, rakes, rafters, and trusses as necessary, installation of gutters/downspouts, repair of porch structures.  Ordinance 1877-2024 authorized the Director of the Department of Development to enter into a contract with Black Bronco Construction LLC to perform residential and commercial residential lead abatement services utilizing the grant funding from the Ohio Department of Development.  \n \nEmergency Designation:  Emergency action is requested to modify the scope to allow for the immediate repairs to shelters, transitional housing and dormitory style units which may be considered as commercial living spaces to provide safe housing and to comply with the terms of the grant from the State of Ohio as quickly as possible to assure that funding is expended prior to the term date. \n \nContract Compliance:  the vendor number is 011955 and expires 03/20/2027\n \nFiscal Impact: Funding is available within the ODOD Lead Grant (G442400) Fund budget for this purpose.\n \n \nTitle\n \nTo authorize the Director of the Department of Development to modify a contract with Black Bronco Construction LLC to modify the scope of service to include performing lead safe renovations at shelters, transitional housing, and dormitory style living facilities; and to declare an emergency. ($0.00)\n \n \n \nBody\n \nWHEREAS, the Lead-Safe Home Renovations Program was established to assist low and moderate income homeowners with lead abatement services that would impact a household remaining safely in their home and to assist shelters, transitional housing, and dormitory style facilities which may be considered commercial living spaces; and \n \nWHEREAS, the Department of Development has advertised Lead-Safe Home Renovations Program requesting pricing from contractors to provide lead safe abatement services; and \n \nWHEREAS, the Columbus City Council approved Ordinance 1877-2024 authorizing the Director of the Department of Development to enter into contract with Black Bronco Construction LLC for Lead-Safe Home Renovations; and\n \nWHEREAS, there is a need to modify the scope of service to also include shelters, transitional housing, and dormitory style facility which may be considered as commercial living space repairs; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to modify the contract with Black Bronco Construction LLC to modify the scope of service to include shelters, transitional housing, and dormitory style living facilities within the lead safe abatement repair services under the Lead-Safe Home Renovations Program, and to expend funding prior to the term of the grant all for the immediate preservation of the public health, peace, property, safety, and welfare; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Development is hereby authorized to modify a contract with Black Bronco Construction LLC to modify the scope of service to allow the contractor to also perform repairs at shelters, transitional housing, and dormitory style living facilities which may be considered commercial living spaces.\n                     \nSECTION 2.  That all other aspects of PO459351 with Black Bronco Construction are still valid and enforceable.  \n                                          \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5.  For the reasons stated in the Preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 159,
    "meeting_date": "2025-10-27",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Emergency Services",
      "Housing"
    ]
  }
}