{
  "success": true,
  "vote": {
    "id": 13461,
    "item_number": "SR-4",
    "title": "To authorize the City Clerk to enter a grant agreement with National Veterans Memorial and Museum Operating Cooperation in support of the National Veterans Memorial and Museum's Veterans Day National Ceremony; to authorize an appropriation and expenditure of $10,000.00 from the Neighborhood Initiatives subfund; and to declare an emergency. ($10,000.00)",
    "description": "Explanation\n \nBACKGROUND: The purpose of this legislation is to authorize the CityClerk to enter into a grant agreement with National Veterans Memorial and Museum Operating Cooperation in support of the National Veterans Memorial and Museum's Veterans Day National Ceremony. The National Veterans Memorial and Museum’s Veterans Day National Ceremony and community flag planting program unite Columbus residents in honoring those who have served while strengthening community connection, civic pride, and shared understanding. These free, public programs bring together Veterans, families, students, and residents of all ages and backgrounds to celebrate service, sacrifice, and the power of community. The Veterans Day National Ceremony features a keynote address that highlights veterans’ dedication and service in defense of our freedoms - sparking dialogue, empathy, civility, and a deeper commitment to service among attendees. The event is live streamed nationally, extending Columbus’s reputation as a city that honors and uplifts its veterans. Complementing the ceremony, the annual flag planting engages hundreds of local volunteers, including students, youth groups, and civic organizations, who collectively fill the NVMM lawn with thousands of flags - each representing gratitude and remembrance. This hands-on community activity fosters service participation, civic responsibility, and intergenerational connection. Target constituencies include Columbus residents, Veterans, military families, students (K-12), and volunteers of all ages and abilities.\n \nSuccess is measured through both participation and personal reflection. Post-event surveys invite attendees to share how their perspectives on service and Veteran contributions have evolved. Since opening, more than 90% of respondents have reported a positive change in understanding, appreciation, or empathy toward Veterans and their families after attending our ceremonies. These outcomes demonstrate the program’s power to strengthen civic connection, bridge divides, and inspire a culture of respect and service that extends beyond the Museum into neighborhoods across Columbus. \n \nNone of the funds appropriated by Columbus City Council are permitted to be spent on food or beverages of any kind.\n \nFISCAL IMPACT: Funds are available in the Neighborhood Initiatives subfund, subfund 100018.\n \nREASON FOR EMERGENCY: The National Veterans Memorial and Museum's annual National Veterans Day Event is scheduled to take place on Tuesday, November 11th, making this request for funding urgent.\n \nTitle\n \nTo authorize the City Clerk to enter a grant agreement with National Veterans Memorial and Museum Operating Cooperation in support of the National Veterans Memorial and Museum's Veterans Day National Ceremony; to authorize an appropriation and expenditure of $10,000.00 from the Neighborhood Initiatives subfund; and to declare an emergency. ($10,000.00)\n \nBody\n \nWHEREAS, the National Veterans Memorial and Museum will host its annual Veterans Day National Ceremony on Tuesday, November 11th, 2025; and\n \nWHEREAS, the purpose of the event is to honor the service and sacrifice on U.S. military veterans; and\n \nWHEREAS, the ceremony will be complemented by an annual flag planting event that engages hundreds of local volunteers, including students, youth groups, and civic organizations, who collectively fill the National Veterans Memorial and Museum lawn with thousands of flags; and\n \nWHEREAS, Columbus City Council is pleased to honor U.S. military veterans and foster dialogue, empathy, civility, and a deeper commitment to service among ceremony attendees; and\n \nWHEREAS, an emergency exists in the usual daily operation of the City Clerk's office in that it is immediately necessary to authorize the City Clerk to enter into a grant agreement with the National Veterans Memorial and Museum Operating Cooperation to provide funding in support of the annual National Veterans Day Event which is scheduled to take place on Tuesday, November 11th, all for the immediate preservation of the public health, peace, property, safety and welfare; and NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the City Clerk is hereby authorized to enter into a grant agreement with National Veterans Memorial and Museum Operating Cooperation in support of the National Veterans Memorial and Museum's 2025 Veterans Day National Ceremony.\n \nSECTION 2. That the City Auditor is hereby authorized and directed to appropriate $10,000.00 from the Neighborhood Initiatives subfund, subfund 100018, to the City Clerk per the accounting codes attached to this ordinance.\n \nSECTION 3. That the expenditure of $10,000.00, or so much thereof as may be needed pursuant to the action authorized in SECTION 1 of this ordinance, is hereby authorized from the Neighborhood Initiatives subfund, subfund 100018, per the accounting codes attached to this ordinance.\n \nSECTION 4. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contract modifications associated with this ordinance.\n \nSECTION 5. That, for the reason stated in the preamble, which is hereby made a part hereof, this ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 159,
    "meeting_date": "2025-10-27",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}