{
  "success": true,
  "vote": {
    "id": 1350,
    "item_number": "CA-55",
    "title": "To authorize the Director of Public Service to enter into a professional services contract with Dynotec, Inc. for the Bikeway Development - Tussing Road SUP Brice Road to Hines Road project; to authorize the expenditure of up to $722,304.00 from the Streets and Highways Bond Fund to pay for this contract; and to declare an emergency. ($722,304.00)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Service to enter into professional services contracts with Dynotec, Inc. in the amount of up to $722,304.00 for the Bikeway Development - Tussing Road SUP Brice Road to Hines Road project.\n \nThe intent of this project is to provide the City of Columbus, Department of Public Service, additional resources for the development of Bikeway Development - Tussing Road SUP Brice Road to Hines Road.  This project consists of design for a new shared use path (SUP) along the south side of Tussing Road from Brice Road to Hines Road. \n \nThe Department of Public Service, Office of Support Services, solicited Requests for Proposals for the Bikeway Development - Tussing Road SUP Brice Road to Hines Road contract.  The project was formally advertised on the Vendor Services and Bonfire web sites from May 26, 2021, to June 17, 2021.  The City received eight (8) responses.  All proposals were deemed responsive and were fully evaluated when the Evaluation Committee met on June 23, 2021.  The responding firms were:  \n \nCompany Name                                                               City/State                                 Majority/MBE/MBR/F1/AS1/PHC\nArcadis U.S.                                                                                    Columbus, OH                                                               Majority\nDynotec, Inc.                                                                                    Columbus, OH                                                               MBE\nE.L. Robinson                                                                                    Grandview Heights, OH                                          Majority\nFishbeck                                                                                    Columbus, OH                                                               Majority\nIBI Group                                                                                    Columbus, OH                                                               Majority\nMichael Baker International                                          Columbus, OH                                                               Majority\nThe Osborn Engineering                                                               Columbus, OH                                                               Majority\nResource International, Inc.                                          Columbus, OH                                                               WBE\n \nDynotec, Inc. Engineering received the highest score for the Bikeway Development - Tussing Road SUP Brice Road to Hines Road project by the evaluation committee and will be awarded the contract.  \n \nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against Dynotec, Inc.\n \n2.  CONTRACT COMPLIANCE\nDynotec, Inc.’s contract compliance number is CC005053 and expires 1/31/2022.  \n \n3.  FISCAL IMPACT\nFunding for this contract is budgeted and available within Fund 7704, the Streets and Highways Bond Fund.  Funds have been appropriated.\n \n4. EMERGENCY DESIGNATION\nEmergency action is requested to expedite this contract to complete the project in a timely manner, to ensure the safety of the travelling public.\n \nTitle\nTo authorize the Director of Public Service to enter into a professional services contract with Dynotec, Inc. for the Bikeway Development - Tussing Road SUP Brice Road to Hines Road project; to authorize the expenditure of up to $722,304.00 from the Streets and Highways Bond Fund to pay for this contract; and to declare an emergency. ($722,304.00)\n \nBody\n \nWHEREAS, there is a need to enter into a professional services contract to provide for the design of a new shared use path (SUP) along the south side of Tussing Road from Brice Road to Hines Road.; and\n \nWHEREAS, the Department of Public Service, Office of Support Services, solicited Requests for Proposals for the Bikeway Development - Tussing Road SUP Brice Road to Hines Road project; and\n \nWHEREAS, Dynotec, Inc. submitted the best overall proposal for this project; and\n \nWHEREAS, it is necessary to enter into a contract with Dynotec, Inc. for the provision of professional engineering consulting services described above in the amount of up to $722,304.00; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to authorize the Director of Public Service to enter into contract with Dynotec, Inc. in order to provide funding for the Bikeway Development - Tussing Road SUP Brice Road to Hines Road so that upcoming construction projects may be governed by updated standards, policies, and practices as soon as possible, to ensure the safety of the travelling public thereby preserving the public health, peace, property, safety and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Service be, and hereby is, authorized to enter into a professional services contract with Dynotec, Inc. located at 2931 E. Dublin-Granville Road, Suite 200, Columbus, Ohio,  43231, for the Bikeway Development - Tussing Road SUP Brice Road to Hines Road project in an amount up to $722,304.00.\n \nSECTION 2.  That the expenditure of $722,304.00, or so much thereof as may be needed, is hereby authorized in Fund 7704 (Streets and Highways Bond Fund), Dept-Div 5911 (Infrastructure Management), Project P540002-100105 (Bikeway Development - Tussing Road SUP Brice Road to Hines Road), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 6.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 20,
    "meeting_date": "2021-07-12",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}