{
  "success": true,
  "vote": {
    "id": 13508,
    "item_number": "CA-37",
    "title": "To authorize the Director of the Department Development to modify a grant agreement with R.H. Brown & Company, LLC to extend the agreement term to December 31, 2026. ($0.00)",
    "description": "Explanation\n \nBACKGROUND\nThis ordinance authorizes the Director of the Department Development to modify (Modification No. 2) a service contract with R.H. Brown & Company, LLC to extend the contract term from December 31, 2025 to December 31, 2026. \n \nOriginal Agreement                     $     300,000.00                                          Ord. 3047-2023                                          PO421838\nModification No. 1                     $     323,600.00                                          Ord. 1745-2024                                          PO460800\nModification No. 2                     $                          0.00                     \nTotal                                                               $     623,600.00\n \nThe City’s Emergency Re-housing Initiative assists tenants who have been involuntarily displaced and are struggling to find available rental housing and re-housing assistance.  This initiative includes helping tenants identify rental housing that meets their needs based on the affordability of rent, family size, and location.  R.H. Brown Company, LLC works with and supports those in need of emergency rehousing in evaluating choices and making informed decisions for their housing needs.  \n \nWith the original service contract, authorized by Ordinance No. 3047-2023 and later modified by Ordinance No. 1745-2024, R.H. Brown & Co provides professional relocation services to Displaced Tenant Services program participants with individualized housing search assistance, relocation navigation, and advocacy to housing providers on behalf of displaced residents.  Funding for this contract and first modification were provided by the Emergency Rental Assistance Grant Fund and the General Fund, Neighborhood Initiatives Subfund.\n \nThe service contract with R.H. Brown & Co is designed at a scale for the provider to serve groups of displaced tenants during emergency events. The timing and scale of these events cannot be anticipated.  While the Emergency Rental Assistance Grant Fund dollars have been fully deployed, the General Fund, Neighborhood Initiatives Subfund portion of the contract has not been fully expended to date but should remain in place to continue services in case of an emergency.  \n \nThis Ordinance is being submitted in accordance with the relevant provisions of Chapter 329 of City Code pertaining to contract modifications:\n1.                     Amount of additional funds: No additional funds are necessary.\n2.                     Reason additional funds were not foreseen: No additional funding is required. Due to the unpredictable timing of large displacement events, current funding will likely not be expended before the current contract expiration of December 31, 2025.  An extension of the contract for one additional year is requested.\n3.                     Reason other procurement processes were not used: The services of the current contract with R.H. Brown & Company, LLC are currently integrated into the Displaced Tenant Services program.\n4.                     How was cost determined: Cost and pricing shall remain the same as the original agreement.\n \nFISCAL IMPACT:  No additional funding is required.\n \nCONTRACT COMPLIANCE:  The vendor number is 046895 and contract compliance is pending.\n \n \nTitle\n \nTo authorize the Director of the Department Development to modify a grant agreement with R.H. Brown & Company, LLC to extend the agreement term to December 31, 2026. ($0.00)\n \n \nBody\n \nWHEREAS, Ordinance No. 3047-2023 authorized the Director of the Department of Development to enter into a service contract with R.H. Brown & Company, LLC in an amount up to $300,000.00; and\n \nWHEREAS, Ordinance No. 1745-2024 authorized the Director of the Department of Development to modify the service contract with R.H. Brown & Company, LLC to add an additional $323,600.00 in funding and to extend the contract term to December 31, 2025; and\n \nWHEREAS, the usual daily operation of the Department of Development in that it is necessary to authorize the Director of the Department of Development to modify the service contract with R.H. Brown & Company, LLC to extend the contract expiration for one additional year; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Development be and is hereby authorized to modify the service contract with R.H. Brown & Company, LLC to extend the agreement term to December 31, 2026.\n \nSECTION 2.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 160,
    "meeting_date": "2025-11-03",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Grants"
    ]
  }
}