{
  "success": true,
  "vote": {
    "id": 13523,
    "item_number": "SR-8",
    "title": "To authorize the Director of Public Utilities to enter into a Guaranteed Maximum Reimbursement Agreement with Western Property, LLC for the Upper Scioto West Subtrunk - West Of Cosgray Road Jameson Estates project; to amend the 2025 Capital Improvement Budget; to authorize a transfer of cash and appropriation within the Sanitary Bond Fund; to authorize an expenditure of up to $7,328,451.00 from the Sanitary Bond Fund; and to declare an emergency. ($7,328,451.00)",
    "description": "Explanation\n1. BACKGROUND\nThis ordinance authorizes the Director of Public Utilities to enter into a Guaranteed Maximum Reimbursement Agreement (GMRA) with Western Property, LLC for the Upper Scioto West Subtrunk - West of Cosgray Road Jameson Estates project, CIP# 650497-100002, in an amount up to $7,328,451.00, pursuant to Section 186 (Public Improvements by Contract or Direct Labor) of the Columbus City Charter.  \n \nThis project is a sanitary sub-trunk sewer project that extends sewer approximately 7,100 LF to a point west of Cosgray Road and north of Hayden Run Road to serve the developing areas. This project will provide sanitary sewer access for a currently unserved area as well as for future development areas. The approximate tributary area for the sanitary sewer will be 1,700 acres and will serve approximately 20,000 people when the tributary area is fully developed.\n \nWork for this project consists of the construction of approximately 575 linear feet of 18-inch sanitary sewer, 1,009 linear feet of 24-inch sanitary sewer, 683 linear feet of 30-inch sanitary sewer, and 4,804 linear feet of 36-inch sanitary sewer, and other such work as may be necessary to complete the contract in accordance with the drawings (CC-20662) for the project. The project will extend sanitary access to undeveloped parcels located within the Hayden Run community planning area.\n \nUpon passage of this Ordinance, the City of Columbus will agree to pay a maximum reimbursement amount of up to $7,328,451.00 to Western Property, LLC for construction of the Upper Scioto West Subtrunk - West of Cosgray Road Jameson Estates project, CIP# 650497-100002.  The developer has agreed to construct the improvements at their cost and then obtain reimbursement from the City.  The guaranteed maximum reimbursement agreement provides the developer constructs the public improvement on the City's behalf, the project is publicly bid and follows the City’s bid processes, the developer submits requests for reimbursement of construction costs related to the project, only pre-approved construction costs are reimbursed, and there is a limit to the dollar amount of costs that will be reimbursed. \n \nThe project is located within Community Area 30 - Hayden Run.  \n \nTIMELINE: The work under this contract shall be completed in a manner acceptable to the City within 365 calendar days after the date of the Notice to Proceed.\n \nESTIMATED COST OF PROJECT: The GMRA amount is $7,328,451.00 including a 10% construction contingency amount that will be utilized to fund needed and approved changes in the work.  No contract modifications are anticipated at this time; however, construction demand might later compel modification of this contract if unforeseen difficulties are encountered.\n \nCost summary: \n             Original Contract                                                                                $7,328,451.00                                          \n                     Future Anticipated Needs                                                            $           0.00\n                     CONTRACT TOTAL                                                                          $7,328,451.00\n                     \n \n2. ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT\nThis project is a sanitary sub-trunk sewer that extends approximately 7,100 linear feet to a point west of Cosgray Rd and north of Hayden Run Rd. to serve developing areas. This project will provide sanitary sewer access for a currently unserved area as well as for future areas. The approximate tributary area for the sanitary sewer will be 1,700 acres and will serve approximately 20,000 people when the tributary area is fully developed.\n3. CONTRACT COMPLIANCE INORMATION\nWestern Property, LLC is not currently registered with the City.  The company will need to become contract compliant prior to execution of the reimbursement agreement.\n \n4. FISCAL IMPACT\nA transfer of funds and an expenditure within the Sanitary Bond Fund, Fund 6109, in the amount of $7,328,451.00, is needed to fund this contract. An amendment to the 2025 Capital Improvement Budget is needed to align budget authority with the proper project.  This ordinance is contingent on the deposit of the 2025 General Obligation Bond Sale of the City of Columbus.\n \n5. EMERGENCY DESIGNATION\nEmergency designation is requested as a Notice to Proceed for this project must be issued before the end of 2025 to prevent delays in the construction of the planned developments in the area.\n \nTitle\nTo authorize the Director of Public Utilities to enter into a Guaranteed Maximum Reimbursement Agreement with Western Property, LLC for the Upper Scioto West Subtrunk - West Of Cosgray Road Jameson Estates project; to amend the 2025 Capital Improvement Budget; to authorize a transfer of cash and appropriation within the Sanitary Bond Fund; to authorize an expenditure of up to $7,328,451.00 from the Sanitary Bond Fund; and to declare an emergency. ($7,328,451.00)\n \nBody\nWHEREAS sanitary sewer needs to be constructed for the Upper Scioto West Subtrunk - West of Cosgray Road Jameson Estates project, CIP# 650497-100002, to allow development of the area to proceed; and\n \nWHEREAS, Western Property, LLC is willing to construct this sanitary sewer and be reimbursed by the City for doing so; and  \n \nWHEREAS it is necessary for the Director of Public Utilities to enter into a Guaranteed Maximum Reimbursement Agreement with Western Property, LLC for the Upper Scioto West Subtrunk - West of Cosgray Road Jameson Estates project to do this reimbursement; and \n \nWHEREAS, funding must be available to perform this reimbursement; and\n \nWHEREAS, it is necessary to amend the 2025 Capital Improvement Budget to align budget authority with the proper project; and\n \nWHEREAS, it is necessary to authorize a transfer of cash and appropriation within the Sanitary Bond Fund to align cash and appropriation with the proper project; and\n \nWHEREAS, it is necessary to authorize an expenditure to pay for the project; and\n \nWHEREAS, the City anticipates incurring certain Original Expenditures (as defined in Section 1.150-2(c) of the Treasury Regulations (the “Treasury Regulations”) promulgated pursuant to the Internal Revenue Code of 1986, as amended) with respect to the services of the Project described in this Ordinance (collectively, the “Project”); and\n \nWHEREAS, reimbursement must be made to Western Property, LLC under the terms of the Guaranteed Maximum Reimbursement Agreement; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Utilities in that it is immediately necessary to authorize the Director of Public Utilities to enter into a Guaranteed Maximum Reimbursement Agreement with Western Property, LLC for the Upper Scioto West Subtrunk - West Of Cosgray Road Jameson Estates project as a Notice to Proceed for this project must be issued before the end of 2025 to prevent delays in the construction of the planned developments in the area, thereby preserving the public health, peace, property, safety and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2025 Capital Improvement Budget authorized by Ordinance 1790-2025 be amended as follows to establish sufficient budget authority for this project:\n \nFund / Project Number / Project Name (Funding Source) / Current Authority/ Revised Authority / Change \n6109 / 650234-100200 / DOSD Roof Replacements, No. 3 (Voted Sanitary Carryover) / $3,000,000.00 / $0.00 / ($3,000,000.00)\n6109 / 650265-100200 / DOSD HVAC and Air Purification System Replacements, No. 2 (Voted Sanitary Carryover) / $2,355,000.00 / $0.00 / ($2,355,000.00)\n6109 / 650999-100000 / DOSD Specialized Vehicle/Equipment (Voted Sanitary Carryover) / $2,481,609.00/ $508,158.00 / ($1,973,451.00)\n \n6109 / 650497-100002 / The Upper Scioto West Subtrunk - West of Cosgray Road Jameson Estates (Voted Sanitary Carryover) / $0.00 / $7,328,451.00 / $7,328,451.00\n \nSECTION 2. This ordinance is contingent on the deposit of the 2025 General Obligation Bond Sale of the City of Columbus.\nSECTION 3.  That the City Auditor is hereby authorized to transfer up to $7,328,451.00 within the Sanitary Bond Fund, Fund 6109, per the account codes in the attachment to this ordinance.\n \nSECTION 4.  That the Director of Public Utilities is hereby authorized to enter into a Guaranteed Maximum Reimbursement Agreement with Western Property, LLC, 3300 Riverside Drive, Suite 100, Columbus Ohio, 43221, for the construction of the Upper Scioto West Subtrunk - West Of Cosgray Road Jameson Estates project, CIP# 650497-100002, in accordance with the terms and conditions on file in the Department of Public Utilities.\n \nSECTION 5. That an expenditure not to exceed $7,328,451.00 is authorized per the accounting codes in the attachment to this Ordinance.\nSECTION 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this Ordinance.\nSECTION 7.  That the City Auditor is authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\nSECTION 8.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary. \nSECTION 9.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 160,
    "meeting_date": "2025-11-03",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}