{
  "success": true,
  "vote": {
    "id": 13596,
    "item_number": "SR-14",
    "title": "To authorize the acceptance of funds from the City’s settlement of claims in the Multidistrict Visa and Mastercard Payment Card Interchange Fees Antitrust Litigation; and to declare an emergency. ($0.00)",
    "description": "Explanation\n \nThe purpose of this ordinance is to authorize the acceptance of settlement funds associated with litigation concerning fees for accepting Visa and Mastercard payment cards.  This ordinance authorizes the City of Columbus to accept funds from the City’s settlement of claims in the Multidistrict Visa and Mastercard Payment Card Interchange Fees Antitrust Litigation (hereinafter also referred to as “the MDL”) - IN RE: PAYMENT CARD INTERCHANGE FEE AND MERCHANT DISCOUNT ANTITRUST LITIGATION, in the United States District Court for the Eastern District of New York, MDL Case No. 1:05-md-01720.\n \nThe MDL involves claims against Visa U.S.A. Inc., Visa International Service Association, and Visa Inc. (hereinafter collectively “Visa”); Mastercard International Incorporated and Mastercard Incorporated (hereinafter collectively “Mastercard”); and Visa’s and Mastercard’s member banks.  The claims involve allegations that merchants paid excessive interchange fees between January 1, 2004 and January 25, 2019 to accept Visa and Mastercard payment cards because Visa and Mastercard, individually and together with their respective member banks, violated antitrust laws.  The City of Columbus is a Class Member in the MDL because the City accepted Visa-Branded Cards or Mastercard-Branded Cards in the United States between January 1, 2004 and January 25, 2019.  \n \nThe City became a Settling Class Member in the settlement of the claims in the MDL on July 23, 2019 when it did not opt out of the class settlement.\n \nFiscal Impact: Settlement proceeds will be deposited into the general fund. \n \nEmergency explanation: it is necessary to establish the authority to accept these funds from the settlement at the earliest possible time in light of anticipated damage awards being distributed imminently.\n \nTitle\n \nTo authorize the acceptance of funds from the City’s settlement of claims in the Multidistrict Visa and Mastercard Payment Card Interchange Fees Antitrust Litigation; and to declare an emergency. ($0.00)\n \nBody\n \nWHEREAS, the City of Columbus is a Class Member in the Multidistrict Visa and Mastercard Payment Card Interchange Fees Antitrust Litigation - IN RE: PAYMENT CARD INTERCHANGE FEE AND MERCHANT DISCOUNT ANTITRUST LITIGATION, in the United States District Court for the Eastern District of New York, MDL Case No. 1:05-md-01720; and\nWHEREAS, the City of Columbus became a Settling Class Member in the MDL in the settlement of claims against Visa U.S.A. Inc., Visa International Service Association, and Visa Inc. (hereinafter collectively “Visa”); Mastercard International Incorporated and Mastercard Incorporated (hereinafter collectively “Mastercard”); and Visa’s and Mastercard’s various member banks on July 23, 2019 when it City did not opt out of the class settlement; and \nWHEREAS, it is anticipated the City of Columbus will receive settlement payments associated with the claims; and \nWHEREAS, the City of Columbus seeks to establish the authority to accept funds pursuant to the City’s settlement in the MDL; and\nWHEREAS, an emergency exists in the usual daily operation of the City Attorney’s Office in that it is necessary to allow for the acceptance of funds from the settlement at the earliest possible time in light of anticipated damage awards being distributed immediately, all for the immediate preservation of the public health, peace, property, safety, and welfare; and NOW, THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Council does hereby authorize the acceptance of funds pursuant to the City’s settlement in the MDL.\nSECTION 2. That the City Attorney is hereby authorized to take all steps necessary to resolve these matters in accordance with the terms of the settlement.  \n \nSECTION 3. That the City Attorney is hereby authorized to make all future settlement decisions and take all future steps necessary to settle any and all remaining claims arising out of or associated with the MDL.\n \nSECTION 4. That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared an emergency measure and shall take effect and be enforced from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 161,
    "meeting_date": "2025-11-17",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services"
    ]
  }
}