{
  "success": true,
  "vote": {
    "id": 13619,
    "item_number": "0",
    "title": "To amend various sections of Chapter 1105 of the Columbus City Codes, to enact new water rates and charges for the year beginning January 1, 2026; to expand eligibility for low income and eligible senior customer discount programs; to update the rate schedules to reflect monthly billing, and to repeal the existing sections being amended.",
    "description": "Explanation \nThis ordinance authorizes an increase in water rates and fees effective January 1, 2026 for the Division of Water and amends Chapter 1105 of the Columbus City Codes, 1959. \n \nWith the 2026 rates increases for water, sewer, and storm combined -- based on an average residential customer with water use of 20 ccf's per quarter, City of Columbus residents are estimated to see their total bill increase $10.48 per month, or $125.80 per year, which equates to a combined bill increase of 11.72%. Low Income Discount participant's overall bill impact is 11.65%. Outside city customers overall bill impact is 12.88%. Customer's bill impact will vary with usage. \n \nThe Utility Advisory Board (UAB) met on October 29, 2025, and after reviewing the Department of Public Utilities' projected expenditures for Fiscal Year 2026, recommends to City Council an increase in water rates that is estimated to result in an over bill increase of 11.72%. The UAB also recommends an increase to water system capacity charges, that have not been updated since 2006, and an adjustment to commercial water commodity charges to reflect a uniform commercial rate, both in accordance with the current cost of service. \n \nThe proposed rate configuration for 2026 recognizes that water and sewer charges disproportionately affect lower income groups. The Department of Public Utilities will continue the Low Income Discount Programs that discounts participant's water commodity portion of their bill. The Board recommends an increase to the percentage of the discount from 25% to 30%. The Department of Public Utilities will also continue the Senior Customer Discount that waives the monthly water service charges. \n \nColumbus Water & Power is beginning the process of switching residential water and sewer customers from quarterly billing to monthly billing. This change has been a long-time objective but was recently made possible by our enhanced meter project and state-of-the-art billing platform. The transition will be rolled out by zones over the next two years as the advanced meters are installed. Customers will benefit from this change due to receiving smaller, more manageable water and sewer bills. Smaller, more frequent bills allow customers to better understand their usage patterns and budget easier. This ordinance updates the rate schedules to clarify that residential water and sewer customers pay the same applicable rate whether they are billed monthly or quarterly. \n \nFISCAL IMPACT: These rate increases will generate approximately $40 million in additional revenue in Fiscal Year 2026. Combined with rate increases for Sewer and Stormwater, the overall impact to a City of Columbus' residents bill will be approximately 11.72%, depending on usage. \n \nTitle \nTo amend various sections of Chapter 1105 of the Columbus City Codes, to enact new water rates and charges for the year beginning January 1, 2026; to expand eligibility for low income and eligible senior customer discount programs; to update the rate schedules to reflect monthly billing, and to repeal the existing sections being amended. \n \nBody \nWHEREAS, it is necessary to establish new water services rates and charges, effective January 1, 2026, for water service provided by the City of Columbus in order to recover the cost of rendering said water services; and \n \nWHEREAS, the City of Columbus, Department of Public Utilities, Division of Water requests that an eighteen percent rate increase be applied to water rates for 2026; and \n \nWHEREAS, City Council recognizes that increased water rates disproportionately impact low income residents. Low income residents already pay a higher percentage of their household income in utility bills, and this percentage would increase with higher rates; and \n \nWHEREAS, City Council further recognizes that past rate increases in the City have demonstrated that increasing rates leads to increased delinquencies among the City's customers; delinquency rates are higher among low income residents. It is well recognized that increased delinquencies are expensive for the City and its customers; and \n \nWHEREAS, the City of Columbus, Department of Public Utilities, Division of Water requests that water system capacity fees be increased and water commodity charges be adjusted to a uniform rate to reflect the current cost of service; and \n \nWHEREAS, City Council finds that continuing the discount rate for low income users is appropriate to assist those least able to manage the impacts of increased sewer and water rates and recognizes that an increase from 25% to 30% will help reduce this financial impact to low income customers; and \n \nWHEREAS, the Utility Advisory Board has adopted recommendations that are consistent with the rates and charges established in this legislation; and \n \nWHEREAS, historically most residential water and sewer customers were billed quarterly based on meter reading and billing process efficiency; and \n \nWHEREAS, with the implementation of widescale installation of advanced meters, Columbus Water & Power can now begin to bill residential water and sewer customers monthly; and \n \nWHEREAS, monthly billing provides customers with a smaller, more frequent and manageable utility bill, which allows them to better manage their household budget and monitor their water usage; and \n \nWHEREAS, it is appropriate to update the residential rate schedules for water customers to reflect that those customers will pay the same applicable rate whether they are billed monthly or quarterly; and \n \nWHEREAS, City Council finds that the rates and charges and the low income and eligible senior discounts established therein are equitable to all of the City's customers, and in accordance with cost of service; and \n \nWHEREAS, affordable and reasonably priced utility services are essential for the residents of Columbus, and the State of Ohio; and \n \nWHEREAS, Columbus is one of the fastest growing cities in the nation; and \n \nWHEREAS, infrastructure investments are needed leading utility rates to increase; and \n \nWHEREAS, the cost living is expected to continue to rise; and \n \nWHEREAS, the Columbus region has the highest number of data centers in the state at 105; and \n \nWHEREAS, access to water and power are essential to the health of our community; and \n \nWHEREAS, the city has utility discount programs that only have 8,500 participants, and \n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities to amend Sections 1105.04, 1105.041, 1105.055, 1105.12, 1105.17, and 1105.21 for the public health, safety and welfare; NOW, THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS: \n \nSECTION 1. City Council finds that the requested changes in water rates and charges are equitable and in accordance with cost of service. \n \nSECTION 2. That effective January 1, 2026, Section 1105.04 of the Columbus City Codes is hereby amended to read as follows: \nSEE ATTACHMENT 1 - SECTION 1105.04. \n \nSECTION 3. That effective January 1, 2026, Section 1105.041 is hereby amended to read as follows: \nSEE ATTACHMENT 1 - SECTION 1105.041. \n \nSECTION 4. That effective January 1, 2026, Section 1105.055 is hereby amended to read as follows: \nSEE ATTACHMENT 1 - SECTION 1105.055. \n \nSECTION 5. That effective January 1, 2026, Section 1105.12 is hereby amended to read as follows: \nSEE ATTACHMENT 1 - SECTION 1105.12. \n \nSECTION 6. That effective January 1, 2026, Section 1105.17 is hereby amended to read as follows: \nSEE ATTACHMENT 1 - SECTION 1105.17. \n \nSECTION 7. That effective January 1, 2026, Section 1105.21 is hereby amended to read as follows: \nSEE ATTACHMENT 1 - SECTION 1105.21. \n \nSECTION 8. That water rates herein established shall be applicable to all water used on or after January 1, 2026. \n \nSECTION 9. That water system capacity charges herein established shall be effective on or after April 1, 2026. \n \nSECTION 10. That effective January 1, 2026, existing Sections 1105.04; 1105.041; 1105.055; 1105.12 and 1105.21, of the Columbus City Codes are hereby repealed. \n \nSECTION 11. That effective April 1, 2026 existing Section 1105.17, of the Columbus City Code is hereby repealed. \n \nSECTION 12. That no later than June 30, 2026, the Director of Columbus Water and Power, or a designee, shall furnish and present a report to Columbus City Council that shall include, at a minimum, information pertaining to the following: \n1. The delinquency rate of customers of Columbus Water and Power; \n2. The rate of participation in utility discount programs; \n3. Details of a communication and community engagement plan to increase discount program accessibility to residents residing in multifamily housing units or are subject to a master meter; \n4. Details regarding the impact of water utilization and the corresponding cost of service provision to regional high-capacity users; \n5. Details regarding plans for Columbus Water and Power to ensure that high-capacity users are supporting a fair share of corresponding infrastructure investment and expansion; \n6. Potential modifications to Columbus Water and Power’s capital investment plans to mitigate future rate increases, including a scenario under which future rate increases would be limited to the regional rate of inflation. \n \nSECTION 12 13. That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 162,
    "meeting_date": "2025-11-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Community Services",
      "Infrastructure"
    ]
  }
}