{
  "success": true,
  "vote": {
    "id": 13641,
    "item_number": "CA-20",
    "title": "To authorize the Clerk to enter into a grant agreement with Women2Women in support of programming serving female teens, mothers, and victims of human trafficking; to authorize an expenditure within the Neighborhood Initiatives subfund; and to declare an emergency. ($20,000.00)",
    "description": "Explanation\nThis ordinance authorizes the City Clerk to enter into a grant agreement with Women2Women in support of programming serving female teens, mothers, and victims of human trafficking.\n \nWomen2Women, a 501c3 nonprofit, has served the greater Columbus community since 1996.  Women2Women proposes holistic programming targeted at high-achieving female teens, teen mothers, and adult women and their families who have been victims of human trafficking and other forms of violence. The programs also serve women who are returning citizens, experiencing homelessness, low-wage earners, or who may have co-occurring behavioral health needs and substance use disorders.\n \nSince its inception, Women2Women programs have reached over 40K families and has been recognized for its work.  In 2017, Women2Women was one of seven national organizations awarded the President’s National Lifetime Achievement Award (from President Obama) for its commitment to building a stronger nation through volunteer service. The members of Women2Women are professional women of achievement and leaders in their respective fields.  They serve as sitting judges, medical doctors, and educational and industry professionals.  They are committed to social justice and partnering to provide volunteer, grassroots hands and hearts on work to improve the lives of those they serve.\n \nWomen2Women collaborates with Alvis/Amethyst, Kingdom Knowledge Foundation (key focus on the Westside), and Choices. All these organizations service the urban communities facing stringent levels of poverty, women who are returning citizens, families with an adult family member challenged with recovery issues, and children who experience high levels of illiteracy. \n \nW2W programs consist of life skills or mentoring support for women and children residing in supportive programs, their homes, victims in transitional residency, and vulnerable communities. W2W provides in-services to community agencies, shelters, re-entry programs, and businesses with their mission to help children and families. The funding will provide W2W a contributing role as a resource for diverse families navigating systems of care, social support, and economic self-sufficiency.\n \nFiscal Impact: Funding is available within the Neighborhood Initiatives subfund.\n \nEmergency action is requested in order to ensure that critical services deployed by Women2Women are not disrupted by a lack of resources.\n \nTitle\nTo authorize the Clerk to enter into a grant agreement with Women2Women in support of programming serving female teens, mothers, and victims of human trafficking; to authorize an expenditure within the Neighborhood Initiatives subfund; and to declare an emergency. ($20,000.00)\n \nBody\nWHEREAS, Women2Women, a 501c3 nonprofit, has served the greater Columbus community since 1996; and\n \nWHEREAS, since its inception, Women2Women programs have reached over 40K families and has been recognized for its work; and\n \nWHEREAS, W2W programs consist of life skills or mentoring support for women and children residing in supportive programs, their homes, victims in transitional residency, and vulnerable communities; and\n \nWHEREAS, an emergency exists in the usual daily business of City Council in that it is immediately necessary to authorize the City Clerk to enter into a grant agreement in order to ensure that critical services deployed by Women2Women are not disrupted by a lack of resources, all for the immediate preservation of the public health, peace, property, safety and welfare; and now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the City Clerk is hereby authorized to enter into a grant agreement with Women2Women in support of programming serving female teens, mothers, and victims of human trafficking.\n \nSECTION 2. That per the action authorized by Section 1 of this ordinance, the expenditure of $20,0,0.00 within the Neighborhood Initiatives subfund, fund 1000, subfund 100018, is hereby authorized per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 4. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 162,
    "meeting_date": "2025-11-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}