{
  "success": true,
  "vote": {
    "id": 13689,
    "item_number": "SR-11",
    "title": "To authorize the Director of the Department of Public Service to enter into a contract with Azteca Systems, LLC, relative to the Cityworks Asset Management System (AMS); to waive the formal bidding requirements of the Columbus City Codes; to authorize the expenditure of $165,000.00 from various funds to pay for the contract; and to declare an emergency. ($165,000.00)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Service to enter into a contract with Azteca Systems, LLC to provide customized software and services for the Cityworks Asset Management System (AMS). \n \nThe intent of this project is to provide the Department of Public Service with software and services for the development and deployment of Cityworks Asset Management System (AMS) that will be used to support the management of assets within the department.  Cityworks AMS, a proprietary software solution, is a customizable citywide Asset Management solution used by various City of Columbus departments, including the Department of Public Service, the Department of Public Utilities, and the Department of Technology. \n \nPursuant to Ordinance 2536-2024, the Department of Public Service entered into a sole source contract with Azteca Systems, LLC. The original contract was for one (1) year from date of execution, with the option to renew for an additional two (2) years on a year-to-year basis, or a portion thereof, based upon mutual agreement of the parties, availability of funding, and approval by Columbus City Council. That contract expired on November 14, 2025, before the first one-year renewal could be finalized, necessitating the execution of a new service contract, valued at $165,000, between the parties.  \n \nSearches in the System for Award Management (Federal) and the Findings for Recovery list (State) produced no findings against Azteca Systems, LLC. \n \n2.  CONTRACT COMPLIANCE INFORMATION\nThe contract compliance number for Azteca Systems, LLC, is CC041096, which expires April 11, 2026.  \n \n3.  FISCAL IMPACT\nFunds for this planned expenditure are budgeted in the General Fund, the Mobility Enterprise Fund, and the Street Construction Maintenance and Repair Fund.\n \n4.  EMERGENCY DESIGNATION\nEmergency action is requested so as to prevent a lengthy lapse in service, as the existing contract expired on November 14, 2025, preserving the public health, peace, property, safety and welfare.\n \nTitle\nTo authorize the Director of the Department of Public Service to enter into a contract with Azteca Systems, LLC, relative to the Cityworks Asset Management System (AMS); to waive the formal bidding requirements of the Columbus City Codes; to authorize the expenditure of $165,000.00 from various funds to pay for the contract; and to declare an emergency. ($165,000.00)\n \nBody\nWHEREAS, the Department of Public Service has a need for customized asset management software and services only offered through Azteca Systems, LLC; and\n \nWHEREAS, pursuant to Ordinance 2536-2024, the Director of Public Service entered into a one-year sole source contract, with the option to renew for an additional two (2) years on a year-to-year basis, with Azteca Systems, LLC, for development and purchase of asset management software and services for the department to ensure system compatibility and monitoring across multiple city departments; and\n \nWHEREAS, the existing contract expired on November 14, 2025, before the first one-year renewal could be finalized, necessitating the execution of a new contract between the parties; and \n \nWHEREAS, it is necessary to waive the competitive bidding provisions outlined in City Code Chapter 329 in order to allow the Department of Public Service to enter into the requisite contract with Azteca Systems, LLC; and\n \nWHEREAS, funding for this purchase is available in various Department of Public Service operating funds; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service, in that it is immediately necessary to authorize the Director to enter into contract with Azteca Systems, LLC to prevent a lengthy lapse in service, as the existing contract expired on November 14, 2025, for the immediate preservation of the public health, peace, property, and safety; and NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Public Service be and is hereby authorized to enter a contract with Azteca Systems, LLC, 11075 S. State Street-Suite 24, Sandy, Utah, for the development and purchase of asset management software and services. This contract will be for one (1) year from date of execution, with the option to renew for an additional year, or a portion thereof, based upon mutual agreement of the parties, availability of funding, and approval by Columbus City Council.\n \nSECTION 2.  That this Council finds it in the best interest of the City to waive the competitive bidding provisions of Columbus City Code Chapter 329.\nSECTION 3.  That the expenditure of $16,500.00 or as much thereof as may be needed, is hereby authorized in Fund 2265 (Street, Construction, Maintenance, and Repair Fund), Dept-Div 5901 (Director’s Office) in Object Class 03 (Purchased Services) per the accounting codes in the attachment to this ordinance. \nSECTION 4.  That the expenditure of $24,750.00 or as much thereof as may be needed, is hereby authorized in Fund 1000 (General Fund), Dept-Div 5902 (Division of Refuse Collection) in Object Class 03 (Purchased Services) per the accounting codes in the attachment to this ordinance. \nSECTION 5.  That the expenditure of $24,750.00 or as much thereof as may be needed, is hereby authorized in Fund 6500 (Mobility Enterprise Fund), Dept-Div 5906 (Division of Parking Services) in Object Class 03 (Purchased Services) per the accounting codes in the attachment to this ordinance. \nSECTION 6.  That the expenditure of $49,500.00 or as much thereof as may be needed, is hereby authorized in Fund 2265 (Street, Construction, Maintenance, and Repair Fund), Dept-Div 5911 (Division of Infrastructure Management) in Object Class 03 (Purchased Services) per the accounting codes in the attachment to this ordinance. \nSECTION 7.  That the expenditure of $49,500.00 or as much thereof as may be needed, is hereby authorized in Fund 2265 (Street, Construction, Maintenance, and Repair Fund), Dept-Div 5913 (Division of Traffic Management) in Object Class 03 (Purchased Services) per the accounting codes in the attachment to this ordinance. \nSECTION 8. That funds are hereby deemed appropriated and expenditures and transfers are authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 9. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 10. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 162,
    "meeting_date": "2025-11-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}