{
  "success": true,
  "vote": {
    "id": 13691,
    "item_number": "SR-13",
    "title": "To authorize the Board of Health to enter a contract with Center for Disease Detection, LLC., for medical laboratory services, for the period of November 1, 2025 to October 31, 2026; to authorize the expenditure not to exceed $563,000.00 from the Health Department Grant fund. ($563,000.00)",
    "description": "Explanation\n \nBACKGROUND:   This ordinance authorizes the Board of Health to enter into a contract with the Center for Disease Detection, LLC, (CDD) for medical laboratory testing services provided to Columbus Public Health clinics. The contract period is November 1, 2025 to October 31, 2026, in an amount not to exceed $563,000.00, with the option to renew for four (4) additional years. \n \nColumbus Public Health (CPH) has a need for medical laboratory testing for residents that receive care from multiple programs within Columbus Public Health including Clinical Health and Alcohol and Drug Services. Clinical lab testing includes drugs of abuse to aid in treatment, TB testing and management of disease, gynecologic and urologic concerns, sexually transmitted infection testing, HIV services including PEP, PrEP and ART, and annual pap smears, HPV testing, colposcopic biopsies, and other preventative services.\n \nCPH advertised and solicited competitive bids in accordance with the relevant provisions of Section 329 relating to competitive bidding (Request for Quotation No. RFQ030534). Four (4) bids were received and Center for Disease Detection, LLC., was awarded as the overall lowest, responsive, responsible and best bidder. CDD’s contract compliance is CC-053369 expiring August 25, 2027.  \n \nFISCAL IMPACT:  $563,000.00 is budgeted in the Health Department Grant Fund. \n \nTitle\n \nTo authorize the Board of Health to enter a contract with Center for Disease Detection, LLC., for medical laboratory services, for the period of November 1, 2025 to October 31, 2026; to authorize the expenditure not to exceed $563,000.00 from the Health Department Grant fund. ($563,000.00)\n \nBody\n \nWHEREAS, Columbus Public Health has a need to enter into a contract for Laboratory Testing Services for the contract period of November 1, 2025 to October 31, 2026; and \n \nWHEREAS, Columbus Public Health advertised and solicited formal bids on June 13, 2025 and selected the overall lowest, responsive, responsible and best bidder, Center for Disease Detection, LLC., to provide these services; and\n \nWHEREAS, it has become necessary in the usual daily operation of Columbus Public Health Clinics to provide health care services and for the prevention of infectious diseases; NOW, THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Board of Health is hereby authorized to enter into a contract with the Center for Disease Detection, LLC., for medical laboratory services for the period of November 1, 2025 to October 31, 2026.\n \nSECTION 2.  That to pay the costs of said contract, an expenditure not to exceed $563,000.00 is authorized from the Health Department Grant fund, Fund No. 2251, per the attached accounting document. \n \nSECTION 3. That Columbus Public Health shall furnish and provide a report to Columbus City Council no later than September 30, 2026 that includes at least the following items:\n1.                     A summation of the cost for providing the same service within Columbus Public Health for each year between 2023-2025;\n2.                     A summation of the throughput and/or productivity of the internal operation between 2023-2025;\n3.                     A comparison of budgeted costs and actual costs associated with this agreement.\n4.                     A summation of the throughput and/or productivity corresponding to the activities authorized under this agreement.\nSECTION 4. That per the action directed under Section 3 of this ordinance, this contract may be subject to non-renewal if Columbus City Council determines that the contract does not meet the quality and clinical needs of Columbus Public Health.\nSECTION 4 5.  That the funds necessary to carry out the purpose of this Ordinance are deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6 7.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 162,
    "meeting_date": "2025-11-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Grants"
    ]
  }
}