{
  "success": true,
  "vote": {
    "id": 13741,
    "item_number": "CA-19",
    "title": "To authorize the Director of the Department of Development to enter into three grant agreements in an aggregate amount up to $137,000.00 with the Franklinton Special Improvement District of Columbus, the 5th Avenue and 4th Street Special Improvement District, and the University District Special Improvement District, Inc.; to authorize the transfer and expenditure of up to $137,000.00 from the General Fund; to authorize advance funding per a predetermined schedule; and to declare an emergency. ($137,000.00)",
    "description": "Explanation\n \nBACKGROUND: This legislation authorizes the Director of the Department of Development to enter into three grant agreements in an aggregate amount not to exceed $137,000.00 with 1) the Franklinton Special Improvement District of Columbus funded in an amount not to exceed $57,000.00; 2) the 5th Avenue and 4th Street Special Improvement District funded in an amount not to exceed $35,500.00; and the University District Special Improvement District, Inc. funded in an amount not to exceed $44,500.00. \n \nThe Special Improvement Districts (SIDs) provide services including but not limited to safety, cleanliness, and beautification through special assessments levied on properties within the SID boundary. The funding allocated in this agreement include payments in lieu of taxes for city-owned properties within the district as well as supplementary funding to further support the mission of the SIDs.\n \nEmergency action is requested to ensure continuous programming to promote job creation and economic development.\n \nFISCAL IMPACT: Funding is available within the Economic Development Division’s 2025 General Fund budget, but will require a transfer between object classes.\n \nCONTRACT COMPLIANCE:\n•                     Franklinton Special Improvement District of Columbus: the vendor number is 035762 and contract compliance expires on 01/14/2027\n•                     5th Avenue and 4th Street Special Improvement District: the vendor number is 035115 and contract compliance expires on 04/02/2027\n•                     University District Special Improvement District, Inc.: the vendor number is 016992 and contract compliance expires on 02/26/2026\n \n \nTitle\n \nTo authorize the Director of the Department of Development to enter into three grant agreements in an aggregate amount up to $137,000.00 with the Franklinton Special Improvement District of Columbus, the 5th Avenue and 4th Street Special Improvement District, and the University District Special Improvement District, Inc.; to authorize the transfer and expenditure of up to $137,000.00 from the General Fund; to authorize advance funding per a predetermined schedule; and to declare an emergency. ($137,000.00)\n \n \n \nBody\n \nWHEREAS, the Special Improvement Districts (SIDs) provide services including but not limited to safety, cleanliness, and beautification; and\n \nWHEREAS, these services are funded through special assessments levied on properties within the SID boundary; and\n \nWHEREAS, the Department of Development seeks to make a payment-in-lieu of taxes for City-owned parcels within the respective SID boundaries, as well as contribute supplemental funding to support the mission of the respective SIDs;\n \nWHEREAS, advanced funding per a predetermined schedule is also authorized; and\n \nWHEREAS, this ordinance authorizes the transfer and expenditure of up to $137,000.00 from the 2025 General Fund Budget; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development for the immediate preservation of the public health, safety, peace, and property, and that it is immediately necessary to enter into this grant agreement to ensure continuous programming, and to promote job creation and economic development; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     That the Director of the Department of Development is authorized to enter into three grant agreements in an aggregate amount not to exceed $137,000.00 with 1) the Franklinton Special Improvement District of Columbus funded in an amount not to exceed $57,000.00; 2) the 5th Avenue and 4th Street Special Improvement District funded in an amount not to exceed $35,500.00; and the University District Special Improvement District, Inc. funded in an amount not to exceed $44,500.00.\n \nSECTION 2. That the advancement of funds per a predetermined schedule to be included in the agreement is hereby authorized.\n \nSECTION 3.  That for the purpose as stated in Section 1, the transfer of $137,000.00 within Fund 1000 (General Fund), Dept-Div 44-02 (Economic Development Division), object class 03 (Services) to object class 05 (Other) per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That for the purpose as stated in Section 1, the expenditure of $137,000.00 or so much thereof as may be needed is hereby authorized in Fund 1000 (General Fund), Dept-Div 44-02 (Economic Development Division), in object class 05 (Other) per the accounting codes in the attachment to this ordinance.\n \nSECTION 5. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 7. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 163,
    "meeting_date": "2025-12-08",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}