{
  "success": true,
  "vote": {
    "id": 13812,
    "item_number": "CA-90",
    "title": "To set forth a statement of municipal services and zoning conditions to be provided to the area contained in a proposed annexation (AN25-027) of 15.4± Acres in Jefferson Township to the City of Columbus as required by the Ohio Revised Code and to declare an emergency. ($0.00)",
    "description": "Explanation\n \nBACKGROUND: This ordinance is being submitted to set forth the municipal services and zoning conditions the city of Columbus will provide upon annexation of a territory located in Jefferson Township. This ordinance is required by the Ohio Revised Code (ORC) as enacted by the General Assembly of the State of Ohio. An annexation petition has been filed with Franklin County for this property. A service ordinance must be passed before the annexation meeting takes place before the Board of County Commissioners of Franklin County. Information regarding municipal services that would be available, should the subject site be annexed, has been compiled and is reflected in this ordinance. Should the petition be approved by the County Commissioners, a second City ordinance accepting the annexation will be required to complete the process. The time frames specified in the ORC require that this legislation be filed as emergency. \n \nFISCAL IMPACT: The statement of municipal services and zoning conditions for a proposed annexation area has no fiscal impact. While provision of the stated services does represent cost to the City, annexation of land also has the potential to create revenue to the city. ($0.00)\n \nEmergency designation: An emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to present this ordinance to the Franklin County Board of Commissioners in accordance with the Ohio Revised Code all for the preservation of the public peace, property, health, safety, and welfare.\n \n \nTitle\n \nTo set forth a statement of municipal services and zoning conditions to be provided to the area contained in a proposed annexation (AN25-027) of 15.4± Acres in Jefferson Township to the City of Columbus as required by the Ohio Revised Code and to declare an emergency. ($0.00)\n \n \n \nBody\n \nWHEREAS, a petition for the annexation of certain territory in Jefferson Township is anticipated to be filed on behalf of Joseph R and Lexie C. Blalock, Richard C. Wolf, and Bruce L., Andrea V., Robert B., and Karen L. Minto on December 11, 2025; and\n \nWHEREAS, a hearing on said petition is tentatively scheduled before the Board of County Commissioners of Franklin County on January 13, 2026; and\n \nWHEREAS, the Ohio Revised Code requires that before said hearing the Municipal Legislative Authority shall adopt a statement indicating what services, if any, the municipal corporation will provide to the territory proposed for annexation upon annexation; and\n \nWHEREAS, the Ohio Revised Code requires that before said meeting the Municipal Legislative Authority to adopt an ordinance stating zoning buffering conditions; and\n \nWHEREAS, properties proposed for annexation are within the Far East Land Use Plan (C2P2)(2018); and\n \nWHEREAS, upon annexation, properties will have uniform access to City services as they become available; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to present this ordinance to the Franklin County Board of Commissioners in accordance with the Ohio Revised Code all for the immediate preservation of the public peace, property, health safety and welfare; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS\n \nSection 1. That the City of Columbus will provide the following municipal services for 15.4± acres in Jefferson Township upon the annexation of said area to the City of Columbus:\n \nPublic Safety: The Department of Public Safety will be able to provide the appropriate level of safety related services to the site upon annexation of the property.\n \nRefuse Collection: Residential refuse collection services will be available upon annexation of the property.\n \nWater: Water service will be available at the owner’s expense upon annexation of the property.  \n \nSewers: All sanitary and storm sewers required shall be constructed privately by the owners and developers at their own cost and expense with no cost to the City.\n \nSanitary: Sanitary service will be available at the owner’s expense upon annexation of the property.\n \nAll sanitary and storm sewers required shall be constructed privately by the owners/developers at their own expense with no cost to the city.\n \nSection 2. That if this 15.4± acre site is annexed and if the City of Columbus permits uses in the annexed territory that the City of Columbus determines are clearly incompatible with the uses permitted under current county or township zoning regulations in the adjacent land remaining within Jefferson Township, the Columbus City Council will require, in the zoning ordinance permitting the incompatible uses, the owner of the annexed territory to provide a buffer separating the use of the annexed territory and the adjacent land remaining within Jefferson Township. For the purpose of this section, “buffer” includes open space, landscaping, fences, walls, and other structured elements: streets and street right-of-way; and bicycle and pedestrian paths and sidewalks.\n \nSection 3. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 163,
    "meeting_date": "2025-12-08",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services",
      "Planning & Development"
    ]
  }
}