{
  "success": true,
  "vote": {
    "id": 13843,
    "item_number": "0",
    "title": "To accept various deeds for parcels of real property to be used as road rights-of-way; to dedicate these parcels as public rights-of-way; and to name said rights-of-way as described within this Ordinance. ($0.00)",
    "description": "Explanation\n1.  BACKGROUND\nFrom time to time, various parcels of land are deeded to the City of Columbus for public street and/or alley purposes.   Section 191 of the City Charter requires that property proposed for use as a public street or alley must be accepted and dedicated as public right-of-way by an ordinance specifically passed for such purpose.  The following legislation provides for the City to accept deeds for various parcels of real property, to dedicate the parcels as road right-of-way, and name the parcels as public roadways. Passage of this Ordinance also exempts the properties deeded to the City from property taxes.\n \n2.  FISCAL IMPACT\nThere is no expenditure associated with this Ordinance.\n \nTitle\nTo accept various deeds for parcels of real property to be used as road rights-of-way; to dedicate these parcels as public rights-of-way; and to name said rights-of-way as described within this Ordinance. ($0.00)\n                     \n..Body\nWHEREAS, Section 191 of the City Charter requires that property to be used as a public street or alley must be accepted and dedicated as public right-of-way by an ordinance specially passed for such purpose; and\n \nWHEREAS, the City of Columbus has been asked to accept various deeds for real property, to dedicate those parcels of real property for the purpose of road rights-of-way, and to name said property as public roadways; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED, Turning Branch, LLC has deeded property to the City of Columbus, Ohio, to be used as Shannon Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED, Ebright Road Parent Phase 2 LLC has deeded property to the City of Columbus, Ohio, to be used as Ebright Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED, Hague Ravines, LLC has deeded property to the City of Columbus, Ohio, to be used as Hague Avenue right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED, Calkar, LLC has deeded property to the City of Columbus, Ohio, to be used as Fifth Avenue and Stelzer Road right-of-way; and\n \nWHEREAS, by virtue of a QUITCLAIM DEED, Anthony M. Roseboro, Trustee has deeded property to the City of Columbus, Ohio, to be used as Harlem Road and Central College Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED, Lakhany Buckeye Propco, LLC has deeded property to the City of Columbus, Ohio, to be used as Livingston Avenue and Alum Creek Drive right-of-way; and\n                     \nWHEREAS, by virtue of a GENERAL WARRANTY DEED, High Draw LLC, and LTSG Commercial Properties LLC has deeded property to the City of Columbus, Ohio, to be used as Winchester Pike right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED, Racetrac, Inc. has deeded property to the City of Columbus, Ohio, to be used as Winchester Pike and Gender Road right-of-way; and\n \nWHEREAS, by virtue of a LIMITED WARRANTY DEED, CLS Georgesville, LLC has deeded property to the City of Columbus, Ohio, to be used as Georgesville Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED, Angelo J. Dallas and Angelo J. Dallas, III have deeded property to the City of Columbus, Ohio, to be used as Trabue Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED, 5CL Properties LLC has deeded property to the City of Columbus, Ohio, to be used as Cleveland Avenue and Second Avenue right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED, JM&J Leasing Wilson Road LLC has deeded property to the City of Columbus, Ohio, to be used as Wilson Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED, 7520 Worthington Galena Road LLC has deeded property to the City of Columbus, Ohio, to be used as Worthington-Galena Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED, Faisal Ilyas has deeded property to the City of Columbus, Ohio, to be used as Sunbury Road, McCutcheon Road, and Innis Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED, AREC 36, LLC has deeded property to the City of Columbus, Ohio, to be used as Georgesville Road right-of-way; and\n \nWHEREAS, by virtue of a QUITCLAIM DEED, Anthony M. Roseboro, Trustee has deeded property to the City of Columbus, Ohio, to be used as Sullivant Avenue right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED, Solomon Foundation has deeded property to the City of Columbus, Ohio, to be used as Oak Breeze Drive and Southpoint Boulevard right-of-way; and                     \n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED, AAVII, LLC has deeded property to the City of Columbus, Ohio, to be used as Alkire Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED, Stelzer Road Partnership LLC has deeded property to the City of Columbus, Ohio, to be used as Stelzer Road right-of-way; and\n \nWHEREAS, by virtue of a GENERAL WARRANTY DEED, Board of Park Commissioners of the Columbus and Franklin County Metropolitan Park District has deeded property to the City of Columbus, Ohio, to be used as Brice Road right-of-way; and now therefore:\n \nWHEREAS, it has become necessary in the usual daily operation for the City to accept these deeds for property that will be used for road rights-of-way; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the City of Columbus hereby accepts the property more fully described in the attached, previously referenced GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on June 3, 2025 as Instrument Number 202506030057659 from Turning Branch, LLC and dedicates and names such property as Shannon Road.\n \nSECTION 2.  That the City of Columbus hereby accepts the property more fully described in the attached,  previously referenced GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on June 27, 2025 as Instrument Number 202506270067821 from Ebright Road Parent Phase 2 LLC and dedicates and names such property as Ebright Road.\n \nSECTION 3.  That the City of Columbus hereby accepts the property more fully described in the attached, previously referenced GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on June 20, 2025 as Instrument Number 202506200065109 from Hague Ravines, LLC and dedicates and names such property as Hague Avenue.\n \nSECTION 4.  That the City of Columbus hereby accepts the property more fully described in the attached, previously referenced GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on July 3, 2025 as Instrument Number 202507030070280 from Calkar, LLC and dedicates and names such property as Fifth Avenue and Stelzer Road.\n \nSECTION 5.  That the City of Columbus hereby accepts the property more fully described in the attached, previously referenced QUITCLAIM DEED recorded in the Franklin County, Ohio, Recorder’s Office, on June 18, 2025 as Instrument Number 202506180064396 from Anthony M. Roseboro, Trustee and dedicates and names such property as Harlem Road and Central College Road.\n \nSECTION 6.  That the City of Columbus hereby accepts the property more fully described in the attached, previously referenced GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on September 4, 2025 as Instrument Number 202509040096855 from Lakhany Buckeye Propco, LLC and dedicates and names such property as Livingston Avenue and Alum Creek Drive.\n                     \nSECTION 7.  That the City of Columbus hereby accepts the property more fully described in the attached, previously referenced GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on September 4, 2025 as Instrument Number 202509040096905 from High Draw LLC, and LTSG Commercial Properties LLC and dedicates and names such property as Winchester Pike.\n \nSECTION 8.  That the City of Columbus hereby accepts the property more fully described in the attached, previously referenced GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on September 4, 2024 as Instrument Number 202509040096868 from Racetrac, Inc. and dedicates and names such property as Winchester Pike and Gender Road.\n \nSECTION 9.  That the City of Columbus hereby accepts the property more fully described in the attached, previously referenced LIMITED WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on September 5, 2025 as Instrument Number 202509050097626 from CLS Georgesville, LLC and dedicates and names such property as Georgesville Road.\n \nSECTION 10.  That the City of Columbus hereby accepts the property more fully described in the attached, previously referenced GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on September 5, 2025 as Instrument Number 202509050097625 from Angelo J. Dallas and Angelo J. Dallas, III and dedicates and names such property as Trabue Road.\n \nSECTION 11.  That the City of Columbus hereby accepts the property more fully described in the attached, previously referenced GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on September 15, 2025 as Instrument Number 202509150102896 from 5CL Properties LLC and dedicates and names such property as Cleveland Avenue and Second Avenue.\n                     \nSECTION 12.  That the City of Columbus hereby accepts the property more fully described in the attached, previously referenced GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on September 15, 2025 as Instrument Number 202509150102895 from JM&J Leasing Wilson Road LLC and dedicates and names such property as Wilson Road.\n \nSECTION 13.  That the City of Columbus hereby accepts the property more fully described in the attached, previously referenced GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on September 15, 2025 as Instrument Number 202509150102894 from 7520 Worthington Galena Road LLC and dedicates and names such property as Worthington-Galena Road.\n \nSECTION 14.  That the City of Columbus hereby accepts the property more fully described in the attached, previously referenced GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on September 17, 2025 as Instrument Number 202509170104286 from Faisal Ilyas and dedicates and names such property as Sunbury Road, McCutcheon Road, and Innis Road.\n                     \nSECTION 15.  That the City of Columbus hereby accepts the property more fully described in the attached, previously referenced GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on September 22, 2025 as Instrument Number 202509220105738 from Arec 36, LLC and dedicates and names such property as Georgesville Road.\n \nSECTION 16.  That the City of Columbus hereby accepts the property more fully described in the attached, previously referenced QUITCLAIM DEED recorded in the Franklin County, Ohio, Recorder’s Office, on September 23, 2025 as Instrument Number 202509230106538 from Anthony M. Roseboro, Trustee and dedicates and names such property as Sullivant Avenue.\n                     \nSECTION 17.  That the City of Columbus hereby accepts the property more fully described in the attached, previously referenced GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on October 8, 2025 as Instrument Number 202510080113839 from Solomon Foundation and dedicates and names such property as Oak Breeze Drive and Southpoint Boulevard.\n \nSECTION 18.  That the City of Columbus hereby accepts the property more fully described in the attached, previously referenced GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on October 27, 2025 as Instrument Number 202510270121386 from AAVII, LLC and dedicates and names such property as Alkire Road.\n \nSECTION 19.  That the City of Columbus hereby accepts the property more fully described in the attached, previously referenced GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on October 27, 2025 as Instrument Number 202510270121385 from Stelzer Road Partnership LLC and dedicates and names such property as Stelzer Road.\n \nSECTION 20.  That the City of Columbus hereby accepts the property more fully described in the attached, previously referenced GENERAL WARRANTY DEED recorded in the Franklin County, Ohio, Recorder’s Office, on October 27, 2025 as Instrument Number 202510270121384 from Board of Park Commissioners of the Columbus and Franklin County Metropolitan Park District and dedicates and names such property as Brice Road.\n \nSECTION 21.  That all of the property identified in Sections 1-20 shall be used for road rights-of-way purposes.\n \nSECTION 22. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 164,
    "meeting_date": "2025-12-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Property & Real Estate",
      "Transportation"
    ]
  }
}