{
  "success": true,
  "vote": {
    "id": 13856,
    "item_number": "0",
    "title": "To amend various sections of the Columbus Building Code, Title 41, relating to the Home Improvement Contractor (\"HIC\") license requirements. ($0.00)",
    "description": "Explanation\n \nThe Department of Building and Zoning Services implements and enforces Columbus City Codes Title 41, the Columbus Building Code. As such, it has determined that it is necessary to amend various sections of Title 41 relating to the Home Improvement Contractor (\"HIC\") license requirements.  The main revisions will clarify the definitions of \"full year\" and \"hand's on\" experience, exempt architects and engineer's from the testing requirements for an HIC General license, and revise the application requirements.\n \nThese amendments were reviewed by the HIC Board at their regular meeting held on November 5, 2025.\n \nThere is no funding impact for this legislation.\n \nTitle\n \nTo amend various sections of the Columbus Building Code, Title 41, relating to the Home Improvement Contractor (\"HIC\") license requirements. ($0.00)\n \nBody\n \nWHEREAS, the Department of Building and Zoning Services implements and enforces Columbus City Codes Title 41, the Columbus Building Code; and\n \nWHEREAS, it has determined that it is necessary to amend various sections of the Columbus Building Code relating to the Home Improvement Contractor (\"HIC\") license requirements; and  \n \nWHEREAS, the main revisions will clarify the definitions of \"full year\" and \"hand's on\" experience, exempt architects and engineer's from the testing requirements for an HIC General license, and revise application requirements; and\n \nWHEREAS, these revisions were reviewed by the HIC Board at their regular meeting held on November 5, 2025; \n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Building and Zoning Services to revise requirements relating to HIC licenses; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That City Codes Section 4114.503 is hereby amended as follows:\n4114.503 - Application for department-issued license.\n(A) A person desiring to be a department-licensed contractor, including a journeyperson plumber, shall apply to the department on an application form prescribed therefor for such license, together with the nonrefundable fee prescribed by the fee schedule. The application shall be submitted at least seven calendar days prior to the date of the meeting of the relevant board of review.\n(B) The application for a department-issued license shall be confirmed and signed under oath by the applicant in front of a notary or a department official. The application for a license shall contain the following information:\n(1) Name of the applicant;\n(2) Date of birth (Applicant must be at least 18 years old);\n(3) Current residence, phone number, email address and business address(es) of the applicant;\n(4) Current residence and business telephone number(s) of the applicant;\n(45) Dates of previous licenses or registrations with the department, if any; and\n(56) Other information deemed necessary by the department.\n(C) The application for a license; that, as a prerequisite, requires an examination; or examinations, shall be submitted to the department no later than one (1) year after the date on which a passing score was achieved on any required examination given by an approved testing agency. After one (1) year from the date that a passing score was achieved on any required examination for a department issued license, the passing score for that examination shall become invalid. When more than one (1) examination is required for a department issued license, all examination scores shall be valid. Only valid examination scores shall be acceptable when making an application to the department.\nAdditionally, the application shall be submitted at least seven calendar days prior to the date of the meeting of the relevant board of review.\n(DC) In addition, the The applicant shall also furnish a statement of hand’s-on experience, as defined in Section 4114.505, with the application for a department-issued license. The statement of hand’s-on experience shall encompass the period of required experience as set forth in the qualifications for the type of license for which the application is made. The statement shall contain clearly and concisely provide the following information:\n(1) List of employer or projects with dates of same as applicable; and\n(2) Detailed work-related information about the employment or projects so listed; and\n(3) The length of time devoted to each such employment or project listed; and\n(4) The name of the employer or other responsible person with direct knowledge of the work performed by the applicant during such employment or project listed; and\n(5) A statement, made by the applicant, of the Any relevant schooling and training the applicant has completed. obtained shall also be included.\n(E)The statement of experience shall be notarized.\n(F)Before an application may be approved for any applicant, the applicant shall meet the following requirements:\n(1)Be not less than 18 years of age; and\n(2)Be a United States citizen or national, a lawful permanent resident, or an individual authorized to work in the United States.\nSECTION 2. That City Code Section 4114.505 is hereby amended as follows:\n \n4114.505 - Minimum experience qualifications for a department-issued license.\n \n(A) Home Improvement General Contractor License. The applicant for a home improvement general contractor license shall have a minimum of three full years of \"hands-on\" installation experience in the one-, two-, and three-family home improvement field.\n \n(AB) Home Improvement Limited Contractor License. The applicant for a home improvement limited contractor license in the following fields of specialization shall have a minimum of one full year of \"hands-on\" installation experience in that field for which a license is applied for:\n \n(1)Residential roofing;\n(2)Residential siding, windows, and doors;\n(3)Residential wood deck installation;\n(4)Residential basement waterproofing;\n(5)Residential prefabricated fireplaces and wood or coal stoves;\n(6)Residential masonry fireplaces;\n(7)Residential fencing;\n(8)Residential sidewalks and driveway approaches;\n(9)Residential exterior lathing and stucco;\n(10)Residential swimming pool and spas;\n(11)Residential asphalt paving;\n(12)Residential irrigation sprinkler; and/or\n(13)Residential gypsum board installer.\n \n(BC) \"Hands-on\" experience shall be characterized by the active personal involvement of the applicant in the activity directly related to the type of license for which an application was made. Such active personal involvement shall have provided for the acquisition of practical experience, knowledge, and mechanical aptitude in the physical installation, operation, control, adjustment, repair, and maintenance of the specific trade or craft.\n \n(CD) Sewer, Water, or Combined Sewer/Water Contractor License. All applicants for either a sewer contractor license or a water contractor license shall demonstrate prior approval from the department of public utilities in a manner as prescribed by such department.\n \n(DE) Journeyperson Plumber License. The minimum experience required for an applicant for a journeyperson plumber license shall be as follows:\n \n(1) Have a minimum of five full years of experience in the plumbing trade installing building services plumbing systems and apparatus including potable water systems; or, completed a United States Department of Labor, Bureau of Apprenticeship Training (USDOL, BAT) certified plumbing apprenticeship program.\n(2) Satisfactorily complete and pass, with a grade of at least 70 percent, the written examination(s) as prescribed herein. The required examinations shall be administered by an approved testing agency as identified by the chief building official and approved by the appropriate board of review. After one year from the date that a passing score was achieved on any required examination for a department-issued license, the passing score for that examination or examinations shall become invalid unless an application for licensure has been made.\n(3) An applicant's failure to pass the required examination shall not operate to deny the applicant the right to take such examination at a future scheduled date, provided the applicant makes proper application for such later examination with the approved testing agency.\n(EF) In the event there ceases to be an approved testing agency to provide the examination(s) required by C.C.  Chapter 4114, the director shall immediately notify, in writing, the Skilled Trades Review Board and the journeyperson plumbers of this fact. The director shall also issue a statement, in writing, of policy and procedure to be used until such time an approved testing agency has been identified by the director.\n \n(FG) In lieu of the above requirements of Section division (A), (B), or (C) above, an applicant for either a home improvement general contractor license or a home improvement limited contractor license may be:\n \n(1) A registered design professional who holds a current and valid certificate as an architect or engineer as allowed under the Ohio Revised Code and who is experienced in residential design and construction; or\n \n(2) A person with a degree in architecture or engineering graduate architect or engineer, with at least one full year's experience as a designer or installer in the specific field of work for the type of home improvement contractor license for which application is made.\n \n(G H) In lieu of the above requirements of Section divisions (C),  or (D) or (E) above, an applicant for either a sewer contractor license or a journeyperson plumber license may be:\n \n(1) A registered professional engineer who holds a current and valid certificate issued under the applicable provisions of the Ohio Revised Code in the specific field of work for the type of license for which application is made; or,\n(2) A graduate engineer with at least one (1) full years' experience as a designer or installer in the specific filed field of work for the type of license for which application is made.\n \n(HI) Determination of a Full Year. A \"full year\" of experience, where required in sections (A) through (FE) above, shall be based on 12 consecutive calendar months during which the applicant has hand’s on experience shall have been gainfully and verifiably employed for not less than 1,600 working hours at with the specific craft, trade, or profession for which an application for a department-issued license has been made.\n \nSECTION 3. That Section 4114.507 of Columbus City Code is hereby amended as follows:\n \n4114.507 Examinations required for a department-issued license.\n(A)                     Before submitting an application to the department to become a department licensed home improvement general contractor (“HIC General”), an applicant shall have satisfactorily completed and passed, with a grade of at least seventy (70) percent, all written examinations as prescribed by the director or board of review for the type of license for which an application will be made with the department. The required examinations shall be administered by an approved testing agency identified by the director. \n                     (B) After one (1) year from the date that a passing score was achieved on any required examination for a department issued license, the passing score for that examination or examinations shall become invalid. \n(B)                     The following are exempt from the examination requirement in division (A):\n(1) A registered design professional who holds a current and valid certificate as an architect or engineer as provided for under the Ohio Revised Code; or\n(2) A person with a degree in architecture or engineering with at least one full year's experience as a designer or installer in the specific field of work for the type of home improvement contractor license for which application is made.\nSECTION 4.  That the existing Sections 4114.503, 4114.505 and 4114.507 are hereby repealed.\nSECTION 5.  That this ordinance shall be in full force and effect at the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 164,
    "meeting_date": "2025-12-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements"
    ]
  }
}