{
  "success": true,
  "vote": {
    "id": 13878,
    "item_number": "CA-11",
    "title": "To amend Ordinance No. 0338-2025, approved by Columbus City Council on March 10, 2025 for the purposes of revising the 90-day period needed to execute the City of Columbus Enterprise Zone Agreement, to 90 days after passage from this ordinance. ($0.00)",
    "description": "Explanation\n \nBACKGROUND:  The need exists to amend Ordinance No. 0338-2025 (the “ORDINANCE”), approved by Columbus City Council (“Council”) on March 10, 2025.  The ORDINANCE authorized the Director of the Department of Development to enter into a City of Columbus Enterprise Zone Agreement (“AGREEMENT”) on behalf of the City with XPO LTL Properties LLC and XPO Logistics Freight, Inc. (collectively, the “ENTERPRISE”) for a tax abatement of seventy-five percent (75%) for a period of ten (10) consecutive years in consideration of the ENTERPRISE investing approximately $7,500,000.00 in real property improvements, the creation of thirty-five (35) net new full-time permanent positions with an estimated annual payroll of approximately $2,085,000.00 and the retention of sixty-five (65) full-time permanent positions with an estimated associated annual payroll of approximately $4,209,300.00 at 5400 Fisher Road, Columbus, Ohio 43228 Parcel No. 570-102664 (the “Project Site”).\n \nPrior to executing the AGREEMENT, the 90-day period needed to execute the City of Columbus Enterprise Zone Agreement expired, and the ENTERPRISE is requesting the 90-day period be extended to execute the AGREEMENT. \n \nThe need now exists to amend the ORDINANCE.  The ENTERPRISE is requesting the ORDINANCE be amended to revise the 90-day period needed to execute the AGREEMENT, to 90 days after passage from this ordinance. This will not impact on the scope of the project as authorized by Columbus City Council. All job retention, job creation, and investment commitments remain unchanged.\n \nThis legislation is presented as 30-legislation. \n  \nFISCAL IMPACT:  \n \nNo funding is required for this legislation.\n \n \nTitle\n \nTo amend Ordinance No. 0338-2025, approved by Columbus City Council on March 10, 2025 for the purposes of revising the 90-day period needed to execute the City of Columbus Enterprise Zone Agreement, to 90 days after passage from this ordinance. ($0.00)\n \n \n \nBody\n \nWHEREAS, the need exists to amend Ordinance No. 0338-2025, which was approved by Columbus City Council on March 10, 2025; and\n \nWHEREAS, the ordinance authorized the Director of the Department of Development to enter into an Enterprise Zone Agreement (“AGREEMENT”) on behalf of the City with XPO LTL Properties LLC and XPO Logistics Freight, Inc. (collectively, the “ENTERPRISE”) for a tax abatement of seventy-five percent (75%) for a period of ten (10) consecutive years in consideration of the ENTERPRISE investing approximately $7,500,000.00 in real property improvements, the creation of thirty-five (35) net new full-time permanent positions with an estimated annual payroll of approximately $2,085,000.00 and the retention of sixty-five (65) full-time permanent positions with an estimated associated annual payroll of approximately $4,209,300.00 at 5400 Fisher Road, Columbus, Ohio 43228, Parcel No. 570-102664 (the “Project Site”); and \n \nWHEREAS, prior to executing the AGREEMENT, the 90-day period needed to execute the City of Columbus Enterprise Zone Agreement expired, and the ENTERPRISE is requesting the 90-day period be extended to execute the AGREEMENT; and \n \nWHEREAS, it has become necessary in the usual daily operation the need exists to now seek an amendment from Columbus City Council for Ordinance No. 0338-2025, to revise the 90-day period needed to execute the City of Columbus Enterprise Zone Agreement, to 90 days after passage from this ordinance: NOW THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     That Section 4 of Ordinance No. 0338-2025 is hereby amended to revise the 90-day window needed to execute the City of Columbus Enterprise Zone Agreement, to 90 days after the passage of this ordinance, as follows, with additions in the underline and deletions is strikethrough:   \n \n                                          SECTION 4.                     That the City and the Enterprise must execute the attached Enterprise Zone Agreement within ninety (90) days of this Ordinance’s passage, or this Ordinance, and the authorization to enter into the tax abatement agreement, is null and void.  That the City and Enterprise must execute the Enterprise Zone Agreement within ninety (90) days of this proposed Ordinance, Ordinance No. 3183-2025, or this Ordinance, and authorization to enter into the tax abatement agreement, is null and void.  \n \nSECTION 2.                     The existing Section 4 of Ordinance No. 0713-205 is hereby repealed.  \n \nSECTION 3.                     That the remaining terms of the City of Columbus Enterprise Zone Agreements remain in full effect relative to the Ordinance.\n \nSECTION 4.                     That the City of Columbus Enterprise Zone Agreement be signed by XPO LTL Properties LLC and XPO Logistics Freight, Inc. within 90 days of passage of this ordinance, or this ordinance and the credit herein shall be null and void.\n \nSECTION 5.                     That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 164,
    "meeting_date": "2025-12-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Economic Development"
    ]
  }
}