{
  "success": true,
  "vote": {
    "id": 13920,
    "item_number": "CA-53",
    "title": "To authorize the Director of the Department of Public Safety to enter into a new contract with EMS Management & Consultants, Inc., for EMS billing services for the Division of Fire; to authorize the expenditure of $1.00 from the General Fund; and to declare an emergency. ($1.00)",
    "description": "Explanation\n \nBACKGROUND: This legislation authorizes the Director of the Department of Public Safety to enter into a contract with EMS Management & Consultants, Inc. (EMS|MC) for emergency medical services billing and collection, including the provision of service hardware devices, hardware installation, and related services. Under this contract, EMS|MC will provide and maintain interfaces with local hospitals, the City’s lockbox and ePayment providers, emergency facility electronic patient care reporting (EPCR) systems, and information as required for the Public Consulting Group/Ohio Ambulance Supplemental Payment Program, as well as collection interfaces with the City’s debt collection vendor, and an annual billing accuracy audit. The contract also includes data conversion, migration, and system-readiness services, along with other services to ensure seamless integration, transition, and ongoing support throughout the term of the agreement. This contract, effective April 1, 2026, through March 31, 2030, ensures the continued operation and modernization of the Division of Fire’s Third-Party EMS Reimbursement Program, originally established under Ordinance 1184-02, passed July 22, 2002.\n \nThe current contract for these services expires on March 31, 2026, and the City will not renew its EMS billing agreement with the current vendor. To maintain uninterrupted EMS billing operations during the transition period, the City previously entered into a one-year contract with Change Healthcare Technology Enabled Services, LLC for the period of April 1, 2025, through March 31, 2026, incorporating all terms of the original agreement with a reduced fee structure.\n \nA competitive bid seeking a vendor for EMS billing services was issued on August 29, 2025. After a diligent selection process, EMS|MC was chosen. With the expiration of the current contract approaching and the competitive process completed, it is now necessary to authorize a new agreement with EMS Management & Consultants, Inc., to assume full responsibility for the aforementioned services beginning March 31, 2026.\n \nEMS Management & Consultants (EMS|MC) is a leading provider of revenue cycle management and consulting services for EMS agencies across the country. With a client-first mindset, industry-leading technology, and deep regulatory expertise, EMS|MC supports over 1,500 agencies with solutions that drive compliance, performance, and operational excellence.\n \nContract Compliance:   EMS Management & Consultants. FID 56-1969494 / vendor number: 023930 \n \nProcurement Justification: A competitive Request for Proposals (RFP) process was conducted for the provision of EMS billing and collection services. Following the issuance of the RFP and the evaluation of all submissions, the pool of responding vendors was narrowed to three finalists. After comprehensive scoring by the evaluation committee, including competence, quality and feasibility, ability, past performance and price, EMS Management & Consultants, Inc. received the highest overall evaluation score and was selected as the recommended vendor for award. \n \nEmergency Designation: The current contract for these services, as authorized by previous ordinances, expires on March 31, 2026. Therefore, emergency action is necessary to authorize a new multi-year contract with EMS Management & Consultants, Inc. (EMS|MC) to ensure the uninterrupted continuation of emergency medical services billing and collection. This contract will provide for the ongoing receipt and management of EMS billing functions, including service hardware devices; hardware installation and associated services; maintenance of billing interfaces with local hospitals; lockbox interfaces with the City’s lockbox provider; ePayment interfaces with the City’s ePayment provider; emergency facility EPCR interfaces; information required for the Public Consulting Group/Ohio Ambulance Supplemental Payment Program interfaces; and collection interfaces with the City’s debt collection vendor, and an annual billing accuracy audit. The contract also includes data conversion, migration, and system-readiness services, as well as other services to ensure seamless integration, transition, and ongoing operational support throughout the term of the agreement.\n \nFISCAL IMPACT:  This ordinance seeks to enter into a new multi-year contract with EMS Management & Consultants, Inc. for EMS billing and collection services, effective April 1, 2026, to March 31, 2030, and to authorize the expenditure of $1 (one dollar) for these services, which will be funded through the Division of Fire’s 2025 General Fund operating budget and future General Fund appropriations throughout the contract term. For context, approximately $238,677.52 was expended in 2024 and $1,400,000.00 was expended in 2023 for EMS billing services. Payments for certain 2024 billing activities remain delayed due to the prior vendor’s cybersecurity incident, and account reconciliations are ongoing. A future ordinance will encumber 2026 General Fund dollars for this contract in order to fully fund the first year contract obligations.\n \nTitle\n \nTo authorize the Director of the Department of Public Safety to enter into a new contract with EMS Management & Consultants, Inc., for EMS billing services for the Division of Fire; to authorize the expenditure of $1.00 from the General Fund; and to declare an emergency. ($1.00)\n \nBody\n \nWHEREAS, the City contracts for EMS billing services, as initiated via Ordinance 1184-02, passed July 22, 2002; and\n \nWHEREAS, the contract with the current vendor expires on March 31, 2026, and the City has determined that the agreement will not be renewed; and \n \nWHEREAS, a competitive Request for Proposals (RFP) was issued for emergency medical services billing and collection, including the provision of service hardware devices; hardware installation and related equipment; maintenance of billing interfaces with local hospitals; lockbox interfaces with the City’s lockbox provider; ePayment interfaces with the City’s ePayment provider; emergency facility EPCR interfaces; Public Consulting Group/Ohio Ambulance Supplemental Payment Program interfaces; collection interfaces with the City’s debt collection vendor; data conversion, migration, and system-readiness services; and other services to ensure seamless integration, transition, and ongoing support for EMS billing operations throughout the contract term; and\n \nWHEREAS, after evaluation of all submissions and narrowing the field to four qualified finalists, EMS Management & Consultants, Inc. received the highest overall evaluation score and was selected as the recommended vendor for award; and\n \nWHEREAS, it is necessary to enter into a new contract with EMS Management & Consultants, Inc. effective April 1, 2026, through March 31, 2030 to ensure uninterrupted EMS billing, timely collection of EMS revenues, and continued support for the Division of Fire’s Third-Party EMS Reimbursement Program; and\n \nWHEREAS, continuation of these services is essential to maintain the Division of Fire’s operational readiness, ensure proper recovery of EMS transport costs, and support compliance with local and national reporting requirements; and \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Safety, in that it is immediately necessary to authorize the Director of Public Safety to enter into a contract with EMS Management & Consultants, Inc. so that the aforementioned services can continue without interruption upon the expiration of the current contract on March 31, 2026, for the immediate preservation of the public peace, property, health, safety, and welfare; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS\n \nSECTION 1. That the Director of the Department of Public Safety is hereby authorized to enter into a contract with EMS Management & Consultants, Inc. for the provision of emergency medical services billing and collection, including the duty to purchase and service hardware devices; hardware installation and associated services; the establishment and maintenance of billing interfaces with local hospitals; lockbox interfaces with the City’s lockbox provider; ePayment interfaces with the City’s ePayment provider; emergency facility EPCR interfaces; provide information to Public Consulting Group/Ohio Ambulance Supplemental Payment Program interfaces; collection interfaces with the City’s debt collection vendor and an annual billing accuracy audit. The contract shall also include data conversion, migration, and system-readiness services, as well as other services to ensure seamless integration, transition, and ongoing support for EMS billing operations throughout the term of the agreement, effective April 1, 2026, through March 31, 2030, in accordance with the results of the competitive Request for Proposals and the evaluation committee’s recommendation. Moreover, the contract will allow the parties to exercise an option of two (2), one (1) year renewals upon agreement by the parties and approval of Columbus City Council. Therefore, the term of the contract could potentially be for six (6) years. \n \nSECTION 2. EMS Management & Consultants, Inc. shall provide all required services, including support for data management, system integration, and customer service functions, and shall perform these services in accordance with the specifications and service levels set forth in the RFP and in the contract executed pursuant to this ordinance.\n \nSECTION 3.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting adjustments as may be required to revise the funding source, correct encumbrances, or reconcile appropriations for the contract authorized herein.\n \nSECTION 5.  That the expenditure of $1.00, or so much thereof as may be necessary, is hereby authorized from the General Fund, Fund 1000, Department/Division 3004 (Public Safety/Division of Fire), per the accounting codes listed in the attachment to this ordinance.\n \nSECTION 6. That all terms and conditions of the contract carried out pursuant to this ordinance shall remain in effect for the duration of the agreement unless otherwise modified by the parties and approved through subsequent legislation.\n \nSECTION 7.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 164,
    "meeting_date": "2025-12-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}