{
  "success": true,
  "vote": {
    "id": 13934,
    "item_number": "CA-67",
    "title": "To authorize the Director of the Department of Public Utilities to modify and increase the contract with Wade Trim, Inc., for the General Engineering Consulting Services #6 Project; and to authorize an expenditure of up to $500,000.00 within the Sanitary Bond Fund to pay for the contract modification.  ($500,000.00)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Utilities to enter into a planned contract modification for general engineering services with Wade Trim, Inc. for the General Engineering Consulting Services #6, CIP #650260-100500, in an amount up to $500,000.00.\n \nThis contract was awarded through the City’s Request for Proposal process with a three-year project assignment window and implemented in September of 2024.  This is the first of two planned contract modifications to add funding to the contract for continued services.\n \nGeneral Engineering Consultant (GEC) Services are necessary to provide technical and engineering assistance to the Division of Water Reclamation.  The GEC services may include the following tasks for small projects: investigations, inspections and evaluations of existing conditions, surveying, preparation of engineering or architectural drawings and specifications, review of contractors’ submittals including shop drawings, maintenance and operation (M&O) manuals, Standard Operating Procedures (SOPs).  The GEC services may also include assistance with new equipment or systems start-up and commissioning, instrumentation & control (I&C) work such as Human Machine Interface (HMI) and Programmable Logic Controller (PLC) programming, uploading documents onto the City’s Project Management Information System (PMIS), computerized maintenance software, preparation of record plan drawings for small projects, technical assistance in the preparation of Facilities/Equipment Maintenance (FEM) documents, and other similar related tasks. Small projects that may, on occasion, require engineering services under this contract include small Capital Improvement Projects (formerly known as “Plant Improvement Projects” or “PIPs”) and FEM service contracts.\n \nPlanning Area: 99 - Citywide\n \n1.1 Amount of additional funds to be expended:  $500,000.00\nOriginal Contract Amount:                                        $500,000.00 (ORD 2041-2024 PO466922)\nModification #1 Amount:                                                     $500,000.00 (current)\nTotal (Orig. + Modification):                                                   $1,000,000.00\n \n1.2. Reason other procurement processes are not used:  \nThis contract was put in place as a three-year contract through the City’s Request for Proposal process.  This is the first of two planned modifications to add funding to the contract.  Another procurement process is not needed.\n \n1.3. How cost of modification was determined:\nThe cost of the modification was determined based upon existing rates and allowable expenses already established in the contract.\n \n2. ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT:  \nThe performance of this project’s activities to provide engineering and technical services for CIPs and FEMs at DPU facilities will help them maintain peak operational performance. If left unperformed, the required work could become larger and more expensive and that could produce a major impact to the budget. No community outreach is considered for this project.\n3. CONTRACT COMPLIANCE INFORMATION:  \nWade Trim, Inc.’s contract compliance number is CC040053 and expires 11/13/27.\n  \nAs part of their proposal, Wade Trim, Inc. has proposed the following three subcontractors to perform contract work:\n \nCompany Name                                            City/State                                     ODI Certification Status\nDLZ Ohio, Inc.                                                                 Columbus, Ohio                                                                         MBE\nAdvanced Engineering Consultants, Ltd.               Columbus, Ohio                                                                                 MBE\nResource International, Inc.                                Columbus, Ohio                                                                                WBE\n \nThe certification of Wade Trim, Inc. and the above companies was in good standing at the time of the contract modification.\n \n4.  FISCAL IMPACT\nFunds are available, appropriated, and budgeted for project 650260-100500 within the Sanitary Bond Fund, Fund 6109.  \n \nTitle\nTo authorize the Director of the Department of Public Utilities to modify and increase the contract with Wade Trim, Inc., for the General Engineering Consulting Services #6 Project; and to authorize an expenditure of up to $500,000.00 within the Sanitary Bond Fund to pay for the contract modification.  ($500,000.00)\n \nBody\nWHEREAS, the Department of Public Utilities is engaged in the General Engineering Consulting Services #6 Project; and\n \nWHEREAS, Contract No. PO466922 was authorized by Ordinance No. 2041-2024, for the General Engineering Consulting Services #6 Project; and\n \nWHEREAS, a planned contract modification is needed to fund continued engineering services; and\n \nWHEREAS, it is necessary for Council to authorize the Director of Public Utilities to modify the professional engineering services agreement with Wade Trim, Inc., for the General Engineering Consulting Services #6 Project to continue services performed under the contract; and\n \nWHEREAS, it has become necessary in the usual daily operation to expend funds from the Sanitary Bond Fund, Fund 6109, to pay for the contract modification; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Utilities is hereby authorized to modify and increase the general engineering services contract with Wade Trim, Inc., 100 E. Campus View Blvd. Suite 250, Columbus, OH 43235; for the General Engineering Consulting Services #6 project, in an amount up to $500,000.00.\n \nSECTION 2.  That an expenditure of $500,000.00, or so much thereof as may be needed, is hereby authorized from the Sanitary Bond Fund, Fund 6109, to pay for this contract modification per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  Funds are hereby deemed appropriated and expenditures authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 6.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 164,
    "meeting_date": "2025-12-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}