{
  "success": true,
  "vote": {
    "id": 13950,
    "item_number": "CA-83",
    "title": "To authorize the Director of the Department of Development to enter into a Housing Development Agreement (HDA) with D.R. Horton-Indiana LLC for the Lansdowne Farm and Orchard Lakes Development Projects; to repeal Ordinance No. 0423-2025. ($0.00)",
    "description": "Explanation\n \nBackground \nThis legislation authorizes the Director of the Department of Development to enter into a Housing Development Agreement (HDA) with D.R. Horton-Indiana LLC (“D.R. Horton”) for the Landsdowne Farm and Orchard Lakes Development Projects. \nCity Council authorized the Director of the Department of Development to enter into a Housing Development Agreement with D.R. Horton-Indiana LLC for the Landsdowne Farm project by passage of Ordinance No. 0423-2025, passed March 3, 2025. That ordinance acknowledged the waiver of certain requirements under Chapter 4565 as authorized by Section 4565.13 of the Columbus City Codes. Under the original authorizing ordinance, D.R. Horton committed to providing 209 affordable units out of a total development 596 single family units in the Landsdowne Farm Project. In the intervening time period, D.R. Horton-Indiana LLC has filed an additional waiver application pursuant to Section 4565.13 to expand the project to include Orchard Lakes Development in the same general area as the Landsdowne Farm Project. \nDR Horton is now proposing an 852 single family development on the Southeast side of Columbus. The 3 and 4 bedrooms homes will range from $315,000 to $412,000 with the average home around $380,000. There is a need in the City for all types of housing construction to support housing diversity in the region. Single family homeownership is a key to building stability and generational wealth. \nThe City, through the Department of Development as authorized by Section 4565.13 of the Columbus City Codes, is committing to waive the affordability requirements regarding the Initial Pricing of owner-occupied Affordable Housing Units. The Director of the Department of Development has determined that the Landsdowne Farm and Orchard Lakes Development Projects meets the criteria under Section 4565.13(a) and a waiver of said requirements is justified to extend the residential CRA program to apply to the entire Landsdowne Farm and Orchard Lakes Development Projects. Specifically, the Director has determined that granting the application of the Landsdowne Farm and Orchard Lakes Development Projects for a waiver satisfies the overall goals of Chapter 4565 of the Columbus City Codes with regard to increasing the number of affordable housing units within the City and is in the best interests of the City. \nDR Horton is committing to setting aside 35% of the units to be affordable and sold to residents at 120% AMI or below for a total of 299 units. In addition, Landsdowne Farm and Orchard Lakes will be constructed in four phases beginning in 2025 with an estimated total build out completion in 2030. Each phase will consist of 130-170 homes. Development of the first 2 phases will be expedited to help support the urgent need for housing stock in the City. In addition to the commitment of setting aside 299 homes to be affordable and sold to homeowners at or below 120% AMI and expediting the first 2 phases of development, there will be a $60,000 per unit penalty, should DR Horton fall short of the 299-unit set aside commitment. \nDevelopment of all housing types at all price points is needed to adequately address the housing needs facing the community. Housing options that can accommodate families and create opportunities for wealth building and homeownership has been a challenge for the market to deliver. This is an important tool that will not only deliver the housing needed but also to include affordability in a new single family development which historically hasn’t included affordability. \nFISCAL IMPACT: No funding is needed.\n \n \nTitle\n \nTo authorize the Director of the Department of Development to enter into a Housing Development Agreement (HDA) with D.R. Horton-Indiana LLC for the Lansdowne Farm and Orchard Lakes Development Projects; to repeal Ordinance No. 0423-2025. ($0.00) \n \n \nBody\n \nWHEREAS, City Council authorized the Director of the Department of Development to enter into a Housing Development Agreement with D.R. Horton-Indiana LLC for the Landsdowne Farm project by passage of Ordinance NO. 0423-2025, passed March 3, 2025; and \nWHEREAS, in the intervening time period, D.R. Horton-Indiana LLC has filed an additional waiver application pursuant to Section 4565.13 to expand the project to include Orchard Lakes Development in the same general area as the Landsdowne Farm Project; and \nWHEREAS, the Director of Development seeks to enter into a Housing Development Agreement (HDA) with D.R. Horton-Indiana LLC for the Landsdowne Farm and Orchard Lakes Development Projects; and \nWHEREAS, DR Horton is proposing an 852 single family development on the Southeast side of Columbus; and \nWHEREAS, the City, through the Department of Development as authorized by Section 4565.13 of the Columbus City Codes, is committing to waive specific affordability requirements for a commitment that at least 35% of the units in the combined Development Projects will be affordable; and \nWHEREAS, the Director of the Department of Development has determined that the Landsdowne Farm and Orchard Lakes Development Projects meet the criteria under Section 4565.13(a) and a waiver of said requirements is justified; and \nWHEREAS, the Director has determined that granting the application of the Landsdowne Farm and Orchard Lakes Development Projects for a waiver satisfies the overall goals of Chapter 4565 of the Columbus City Codes with regard to increasing the number of affordable housing units within the City and is in the best interests of the City; and \nWHEREAS, DR Horton is committing to setting aside 35% of the units to be affordable and sold to residents at 120% AMI or below for a total of 299 units; and \nWHEREAS, in addition to the commitment of setting aside 299 homes to be affordable and sold to homeowners at or below 120% AMI and expediting the first 2 phases of development, there will be a $60,000 per unit penalty, should DR Horton fall short of the 299-unit set aside commitment; and \nWHEREAS, there is a need in the City for all types of housing construction to support housing diversity in the region. Single family homeownership is a key to building stability and generational wealth; and \nWHEREAS, it has become necessary in the usual daily operation this is an important tool that will not only deliver the housing needed but also to include affordability in a new single family development which historically hasn’t included affordability; NOW, THEREFORE, \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS: \nSECTION 1. That Director of the Department of Development is authorized to enter into a Housing Development Agreement (HDA) with D.R. Horton-Indiana, LLC for the Landsdowne Farm and Orchard Lakes Development Projects. \nSECTION 2. That Ordinance No. 0423-2025 is hereby repealed. \nSECTION 3. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 164,
    "meeting_date": "2025-12-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Housing"
    ]
  }
}