{
  "success": true,
  "vote": {
    "id": 1395,
    "item_number": "SR-1",
    "title": "To authorize the Director of Finance and Management, on behalf of the Fleet Management Division, to enter into contract with AssetWorks LLC, a subsidiary of Trapeze Software Group, Inc., for fleet management software, hardware and related services; to authorize the expenditure of $829,400.00 from the Fleet Management Operating Fund; to authorize a waiver of relevant provisions of Chapter 320 of the Columbus City Codes; and to declare an emergency. ($829,400.00)",
    "description": "Explanation\n \nBackground:   This ordinance authorizes the Director of Finance and Management, on behalf of the Fleet Management Division (herein referred to as “City”), to enter into contract with AssetWorks LLC, a subsidiary of Trapeze Software Group, Inc., (herein referred to as “Contractor”) for fleet management software, hardware and related services.  The City currently uses Contractor’s FleetFocus System which integrates with the Verizon Networkfleet Telematics solution, and the Parties wish to restate the terms and conditions applicable to the provision of AssetWorks’ proprietary products including Software as a Service (“SaaS”), hardware, and third party GPS/telematics equipment and associated, recurring hosting, maintenance, and subscription services (together “Services”).\nThe Contractor has the necessary experience and expertise to provide said service.  The previous agreement, entered on May 29, 1997, was most recently renewed by authority of ordinance 1110-2020, passed June 15, 2020; expiring on June 30, 2021. This contract renews the current services, while updating the terms and conditions to reflect upgrades in the services provided, to streamline the various components of the contract, and to include disentanglement language.\nThis contract will provide for annual software maintenance and support, as well as GPS/AVL service costs, vendor hosting fees, hardware installs, and software upgrades.  The term of this Contract shall be from July 1st, 2021 to June 30th, 2022, with the ability for the City to renew for successive one-year terms.  The first year of the contract will be for at a total cost of $829,400.00. The City has published a Best Value Procurement to contract for these services, with an estimated start date of July 1, 2023.\n \nAssetWorks LLC, a subsidiary of Trapeze Software Group, Inc., is the vendor who currently provides a software platform for Fleet, Fuel and GPS databases, which are interfaced with each other to provide comprehensive management, analysis, and tracking functionality.  AssetWorks also provides professional services to support system upgrades and training and they are PCI compliant and manage the retail compressed natural gas (CNG) fuel transactions through the fuel application.  \n \nThe FleetFocus module/application provides a management system utilized by the Fleet Management Division to bill, manage, monitor and analyze all fleet maintenance related data.  Also, FleetFocus provides software accountability by tracking city-owned fleet equipment such as refuse trucks, fire apparatus, compost graders and various on road vehicles to support daily operational requirements.  The system also allows for the collection and management of fleet maintenance and usage data on a citywide basis.\n \nDue to the critical nature of the fleet software platform required by the Division of Fleet Management, we respectfully request that the competitive bidding provisions of the Columbus City Codes be waived to continue this relationship with the existing provider while the City competitively selects a fleet software provider through a Best Value Procurement currently in process.  In addition, to ensuring continuity of Fleet operations, this contract contains cost savings, updated terms and conditions to reflect upgrades in services, and disentanglement language.\n \nEmergency action is requested to ensure that services can continue without interruption.\n \nFiscal Impact: This legislation authorizes an expenditure of $829,400.00 from the Fleet Management Operating Fund with AssetWorks LLC, a subsidiary of Trapeze Software Group, Inc. for the enterprise software platform for Fleet, Fuel and GPS databases. The Fleet Management Division budgeted $900,000.00 within the Fleet Operating Fund for this service in 2020.  In 2019, $944,283.75 was expended for this software program. In 2018, $916,593.00 was expended for these services.\n \nTitle\n \nTo authorize the Director of Finance and Management, on behalf of the Fleet Management Division, to enter into contract with AssetWorks LLC, a subsidiary of Trapeze Software Group, Inc., for fleet management software, hardware and related services; to authorize the expenditure of $829,400.00 from the Fleet Management Operating Fund; to authorize a waiver of relevant provisions of Chapter 320 of the Columbus City Codes; and to declare an emergency. ($829,400.00)\n \nBody\n \n \nWHEREAS, this ordinance authorizes the Director of Finance and Management, on behalf of the Fleet Management Division, to enter into contract with AssetWorks LLC, a subsidiary of Trapeze Software Group, Inc., for fleet management software, hardware and related services; and\n \nWHEREAS, AssetWorks and its enterprise suite of FleetFocus applications provides a management system utilized by the Fleet Management Division to bill, manage, monitor and analyze all fleet maintenance related data, in addition to the ability to provide accountability with tracking an unlimited number of city-owned fleet equipment vehicles to support the daily operational requirements of city government; and\n \nWHEREAS, the Fleet Management Division respectfully requests that the competitive bidding provisions of the Columbus City Codes be waived to ensure the continuity of Fleet operations while the City competitively selects a fleet software provider; and\n \nWHEREAS, it is necessary to authorize the expenditure of $829,400.00 from the Fleet Management Operating Fund; and \nWHEREAS, an emergency exists in the usual daily operation of the Department of Finance and Management, Fleet Management Division, in that it is immediately necessary to authorize the Director to enter into contract with AssetWorks LLC, a subsidiary of Trapeze Software Group, Inc., so that fleet management software, hardware and related services can continue without interruption, thereby preserving the public health, peace, property, safety, and welfare; NOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n  \nSECTION 1:                     That the Director of Finance and Management, on behalf of the Fleet Management Division, is hereby authorized to enter into contract with AssetWorks LLC, a subsidiary of Trapeze Software Group, Inc., for fleet management software, hardware and related services, for a period of one year with annual renewal options.\n    \nSECTION 2:                     That the expenditure of $829,400.00, or so much thereof as may be necessary in regard to the action authorized in Section 1, be and is hereby authorized in the Fleet Management Operating Fund 5200, Subfund 520001 in Object Class 03, per the accounting codes in the attachment to this ordinance.\n \nSee Attached File: Ord 1538-2021 Legislation Template.xls\n \nSECTION 3.                     That the monies in the foregoing Sections shall be paid upon order of the Director of Finance and Management and that no order shall be drawn or money paid except by voucher, the form of which shall be approved by the City Auditor.\nSECTION 4.                     That the relevant sections of Columbus City Code Section 329 are hereby waived.\nSECTION 5.                     That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 6.                     That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 7.                     That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared an emergency measure and shall take effect and be enforced from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 20,
    "meeting_date": "2021-07-12",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}