{
  "success": true,
  "vote": {
    "id": 13988,
    "item_number": "SR-5",
    "title": "To authorize an amendment to the City’s allocation of the share of the Casino Tax Revenues from the State of Ohio for 2026 and each year thereafter. ($0.00)",
    "description": "Explanation\n \nBackground: On September 10, 2012, Columbus City Council passed Ordinance No. 1960-2012 to authorize the City Auditor to allocate the City’s share of the Casino Tax Revenues received from the State of Ohio for 2012, 2013, and each year thereafter. The purpose of this ordinance is to authorize an amendment to the City’s allocation of Casino Tax Revenues received from the State of Ohio for 2026 and each year thereafter.\nMONIES AFTER 2025\nMonies received in 2026, and each year thereafter, will be deposited in the Casino Fund (Fund 2275) and the General Fund (Fund 1000) in priority order as follows:\nPriority 1: Fund 2275 Subfund 227502 - Casino - Arena: Deposits as follows:\n\n\n\nCalendar Year\n\nPercentage of Total Casino Tax Receipts Received\n\n\n\n2026 and thereafter\n\n35% 32%\n\n\n\n2027\n\n40%\n\n\n\n2028\n\n45%\n\n\n\n2029 and thereafter\n\n50%\n\n\n \nThese This agreed upon percentages may be subject to reduction after retirement of all of the existing or future Franklin County Convention Facilities Authority’s Bonds and State Loans supporting Nationwide Arena.\nThe timing and percentages correspond (i) with lease payments related to the Lease Agreement and Sublease Agreement dated February 1, 2012 between the City of Columbus, Franklin County and the Franklin County Convention Facilities Authority (“CFA”) and (ii) with the contribution related to the Operating and Maintenance Agreement between the City of Columbus, Franklin County, and the CFA.  Pursuant to Ordinance No. 1596-2011, the City and County entered into the aforesaid lease and sublease arrangement with the CFA that allowed the CFA to purchase, operate, and maintain Nationwide Arena.  The City is submitting additional legislation for City Council consideration to allow the City and County to further enter into subsequent an operating and maintenance contribution agreement that allows the CFA to fund ongoing maintenance and capital investments in Nationwide Arena.\nPriority 2 - Casino - Arena Renovations: Deposits as follows:\n\n\n\nTax Year\n\nPercentage of Total Casino Tax Receipts Received\n\n\n\n2026\n\n3%\n\n\n\n2027\n\n8%\n\n\n\n2028\n\n13%\n\n\n\n2029-2055\n\n18%\n\n\n\n2056 and thereafter\n\n0%\n\n\n \nPriority 2 3. Fund 2275 Subfund 227501 - Casino-Debt Service: Deposited amounts in the years 2013 through 2023 varied per year per the debt service schedule. Ordinance No. 1113-2011 authorized the issuance of up to $15,000,000.00 for public roadway improvements in the casino area and environmental remediation of the casino site. The principal and interest payments for 2026-2032 total $6,330,450.00 $5,328,589.90.\nPriority 3 4. Fund 275 Subfund 227599 - Casino-Other: Monies deposited into this subfund will represent the balance available from Casino Tax Revenue after obligations set forth for the Arena and Debt Service are met. These funds are to be transferred to the General Fund, Fund 1000, and will be available for general government purposes. The City Auditor in conjunction with the Director of Finance and Management will establish when such transfers to the General Fund will take place.\nFiscal Impact: The City’s share of the Casino Tax Revenues from the State of Ohio is being reallocated with a greater percentage allocated to Nationwide Arena starting in 2026.\n \nTitle\n \nTo authorize an amendment to the City’s allocation of the share of the Casino Tax Revenues from the State of Ohio for 2026 and each year thereafter. ($0.00)\nBody\n \nWHEREAS, the State of Ohio is and will be making Casino Tax Revenue quarterly distribution payments to Ohio municipalities from the operations of casinos in Cleveland, Toledo, Cincinnati and Columbus; and\nWHEREAS, each casino is and will be required to file and remit taxes to the State of Ohio daily where the revenue is then accumulated in the State’s Casino Tax Revenue Fund; and \nWHEREAS, by the fifteenth day of the end of a calendar quarter, defined percentages of monies are then transferred from the Ohio Casino Tax Revenue Fund to: the Gross Casino Revenue County Fund (51 percent), Gross Casino Revenue County Student Fund (34 percent), Gross Casino Revenue Host City Fund (5 percent), Casino Control Commission Fund (3 percent), Ohio State Racing Commission Fund (3 percent), Law Enforcement Training Fund (2 percent), and the Problem Casino Gambling and Addictions Fund (2 percent); and \nWHEREAS, these monies then will be distributed to municipalities based on various formulas no later than the last day of the month following the end of the quarter; and\nWHEREAS, the City of Columbus receives its share of Casino Tax Revenues each year to be deposited into the City’s Casino Fund, Fund 2275, and the General Fund, Fund 1000, for various purposes; and\nWHEREAS, pursuant to Ordinance No. 1596-2011, a portion of these monies will be used to fulfill a Lease Agreement and Sublease Agreement dated February 1, 2012 between the City of Columbus, Franklin County, and the Franklin County Convention Facilities Authority (“CFA”), as the same may be amended and supplemented from time to time, or any successor agreement or agreements thereto; and \nWHEREAS, the City and Franklin County entered into the aforesaid lease and sublease arrangement with the CFA that allowed the CFA to purchase, operate, and maintain Nationwide Arena; and \nWHEREAS, the City is will be submitting legislation for City Council consideration to allow the City and Franklin County to enter into the Operating and Maintenance a Contribution Agreement with the CFA (the “Operating and Maintenance Contribution Agreement”) to enable ongoing maintenance needs and additional capital investments necessary for the operation of Nationwide Arena; and\nWHEREAS, a portion of these monies will be used to fulfill the earlier described Operating and Maintenance Contribution Agreement; and\nWHEREAS, the agreed upon percentages of these monies allocated to Nationwide Arena under those two agreements may be subject to reduction after retirement of all of the existing or future CFA’s Bonds and State Loans supporting Nationwide Arena; and\nWHEREAS, a portion of these monies will be used to reimburse the Special Income Tax Debt Retirement Fund, Fund 4430, or the General Fund, Fund 1000, Income Tax Set Aside Subfund (100099), when necessary, for debt service costs and bond issuance costs associated with the up to $15,000,000 of general obligation bonds issued in July 2011 pursuant to Ordinance No. 1113-2011 for reimbursing CD Gaming Ventures, LLC for public roadway improvements in the casino area and environmental remediation of the casino site; and\nWHEREAS, any remaining monies in Fund 2275 after fulfilling obligations set forth for the Arena and Debt Service will be allocated to Casino - Other Subfund, and thereafter are to be transferred to the General Fund, Fund 1000 to be available for general government purposes. \nWHEREAS, it has become necessary in the usual daily operation of the City Auditor, in conjunction with the Director of Finance and Management, will to establish when such transfers to the General Fund will take place; NOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSection 1. That Casino Tax Revenues received in calendar year 2026 that are attributable to tax year 2025 shall continue to be allocated pursuant to the allocation percentages in effect for tax year 2025 pursuant to Ordinance No. 1960-2012. The changes implemented by this Ordinance apply only to Casino Tax Revenues attributable to tax year 2026 and each tax year thereafter. tThe City Auditor is hereby authorized to allocate the City’s share of the Casino Tax Revenues received from the State of Ohio attributable to for fiscal year 2026 and each year thereafter in the priority order to the Casino Fund, Fund 2275, and the General Fund, Fund 1000, as follows:\nPriority One: Fund 2275 Subfund 227502 - Casino - Arena:\n\n\n\nCalendar Fiscal Year\n\nPercentage of Total Casino Tax Receipts Received\n\n\n\n2026 and thereafter\n\n35% 32%\n\n\n\n2027\n\n40%\n\n\n\n2028\n\n45%\n\n\n\n2029 and thereafter\n\n50%\n\n\n \nThese agreed upon percentages may be subject to reduction after retirement of all of the existing or future Franklin County Convention Facilities Authority’s Bonds and State Loans supporting Nationwide Arena. The timing and percentages correspond with (i) lease payments related to the Lease Agreement and Sublease Agreement dated February 1, 2012, authorized by Ordinance 1596-2011, between the City of Columbus, Franklin County and the CFA and as (ii) with the City contribution related to the Operating and Maintenance Agreement between the City of Columbus, Franklin County, and the CFA, as each agreement may be amended and supplemented from time to time, or any successor agreement or agreements thereto.\nPriority Two - Fund 2275 Subfund 227504 - Casino - Arena Renovations\n\n\n\nTax Year\n\nPercentage of Total Casino Tax Receipts Received\n\n\n\n2026\n\n3%\n\n\n\n2027\n\n8%\n\n\n\n2028\n\n13%\n\n\n\n2029-2055\n\n18%\n\n\n\n2056 and thereafter\n\n0%\n\n\n \nThese agreed upon percentages may be subject to reduction after retirement of all of the existing or future Franklin County Convention Facilities Authority’s Bonds and State Loans supporting Nationwide Arena. The timing and percentages correspond with the City contribution related to a subsequent Contribution Agreement between the City of Columbus, Franklin County, and the CFA, as may be amended and supplemented from time to time, or any successor agreement or agreements thereto. Notwithstanding the preceding, if the City, County, or CFA has not been awarded funds for sports facilities from the State of Ohio prior to the end of 2027, the percentages of total Casino Tax Revenue received by the City and allocated pursuant to this Priority Two for the Contribution Agreement shall thereafter be transferred and/or deposited into Fund 2275, Subfund 227559 - Casino - Other for the purposes described under Priority Four herein.\nPriority Two Three - Fund 2275 Subfund 227501 - Debt Service: \nAllocation for the years 2026 through 2032 as follows:\n2026 -   $1,016,175.00 $874,292.45\n2027 -   $979,650.00 $833,856.25\n2028 -   $943,125.00 $798,299.80\n2029 -   $906,600.00 $762,631.00\n2030 -   $867,450.00 $726,433.60\n2031 -   $828,300.00 $684,814.40\n2032 -   $789,150.00 $648,262.40\nThese monies will be used to reimburse the Special Income Tax Debt Retirement Fund, Fund 4430, or the General Fund, Fund 1000, Income Tax Set Aside Subfund (100099), when necessary, for debt service payments associated with the up to $15,000,000 issued, pursuant to Ordinance No. 1113-2011, for public roadway improvements in the casino area and environmental remediation of the casino site.\nPriority Three Four - Fund 2275 Subfund 227599 - Casino - Other: \nMonies deposited into this subfund will represent the balance available from Casino Tax Revenue after obligations set forth for the Nationwide Arena and Debt Service are met. These funds are to be transferred to the General Fund, Fund 1000, and will be available for general government purposes. The City Auditor in conjunction with the Director of Finance and Management will establish when such transfers to the General Fund will take place.\nSection 2. That all monies necessary to carry out the purpose of this Ordinance are hereby approved.\nSection 3. That the City Auditor is authorized to make any accounting changes to revise the allocation of revenues and transfers associated with this Ordinance.\nSection 4.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\nSection 5.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\nSection 6. That the City Auditor is hereby authorized to establish a subfund within the Casino Fund, Fund 2275, titled Arena Renovations, in order to properly track and account for the fiscal activities.\nSection 7. That the distribution of funds shall only occur after the Director of the Department of Development certifies to the Auditor and the City Clerk that the following conditions have been met:\n•                     That the City, County, or Franklin County Convention Facilities Authority has been awarded funds for sports facilities from the State of Ohio; and\n•                     That the Franklin County Convention Facilities Authority has entered into a community benefits agreement with the Columbus/Central Ohio Building and Construction Trades Council before construction commences. Scope of work exemptions shall be permitted, subject to mutual agreement between these parties; and\n•                     That the Franklin County Convention Facilities Authority has outlined in that community benefits agreement, or in an agreement to which the city is a party, other commitments pertaining to sustainability, the use of regional businesses in design and construction, the inclusion of public art creation in the renovation plan, and plans for youth programming and engagement. \nSection 6 8. That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 164,
    "meeting_date": "2025-12-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance"
    ]
  }
}