{
  "success": true,
  "vote": {
    "id": 13985,
    "item_number": "LA",
    "title": "To authorize a capital budget reservation for renovations and improvements in City Hall; to authorize an expenditure within the Construction Management Capital Improvement Bond Fund; and to declare an emergency. ($350,000.00)",
    "description": "Explanation\nThis ordinance establishes a capital budget reservation for renovations and improvements in City Hall.\n \nWith the 2024 Council expansion, City Council has continued to repurpose office space within City Hall to accommodate additional staff and to renovate spaces requiring updates and improvements, including the replacement of furniture that is beyond its useful life. The City Hall 3rd floor has required extensive modifications to achieve functionality for Council’s needs, and it is anticipated that an additional slate of renovations will conclude Council’s construction needs for the foreseeable future.\n \nThis capital budget reservation will be used to contract with one or more vendors under universal term contract to perform small scale renovations and furniture acquisition for space needs.\n \nFiscal Impact: Funding is available within the Construction Management Capital Improvement Bond Fund.\n \nEmergency action is requested in order to initiate renovations within the next several weeks.\n \nTitle\nTo authorize a capital budget reservation for renovations and improvements in City Hall; to authorize an expenditure within the Construction Management Capital Improvement Bond Fund; and to declare an emergency. ($350,000.00)\n \nBody\nWHEREAS, City Council has continued to repurpose office space within City Hall to accommodate additional staff and to renovate spaces requiring updates and improvements; and\n \nWHEREAS, City Hall 3rd floor has required extensive modifications to achieve functionality for Council’s needs; and\n \nWHEREAS, this capital budget reservation will be used to contract with one or more vendors under universal term contract to perform small scale renovations and furniture acquisition for space needs; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Finance and Management Department in that it is immediately necessary to authorize a capital budget reservation so that renovations to City Hall can begin without delay occasioned by the City's budget schedule; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the City Auditor is authorized and directed to establish an auditor’s certificate in the amount of $350,000.00 for expenditures associated with renovations and improvements to City Hall.\n \nSECTION 2. That per the action authorized in Section 1 of this ordinance, the expenditure of $350,000.00 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Construction Management Capital Improvement Bond Fund 7733 in object class 06 Capital Outlay per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That this Council hereby recognizes that this ordinance does not identify specific contractors or vendors for the expenditure purposes authorized herein and hereby delegates sole and final contracting decisions relative to the determination of lowest, best, most responsive and most responsible vendor(s) to the Director of Finance and Management. All contracts will be entered into in compliance with the relevant procurement provisions of the Columbus City Codes Chapter 329.\n \nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 6. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, the ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 164,
    "meeting_date": "2025-12-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services"
    ]
  }
}