{
  "success": true,
  "vote": {
    "id": 13991,
    "item_number": "SR-8",
    "title": "To authorize the Director of the Department of Public Service to execute those documents necessary for the City to grant encroachment to legally allow the installation of the pedestrian bridge to extend over the public rights-of-way of the 20-foot Alley located at the first alley west of North High Street, and to declare an emergency. ($0.00)",
    "description": "Explanation\n1.                     Background\nThe City of Columbus, Department of Public Service, received a request from the site owner, ACC OP (LANE & HIGH) LLC, asking that the City allow the installation of a pedestrian bridge over a 20-foot Alley, located at the first alley west of North High Street and just south of Norwich Avenue, within the public right-of-way. The proposed bridge will extend on either side of the 20-foot alley right-of-way. The development is proposed student housing of two buildings with approximately 198 residential units. During the design phase of the proposed buildings, it was determined that for safety reasons the pedestrian bridge was warranted.\n \nThe following legislation authorizes the Director of the Department of Public Service to execute those documents necessary for the City to grant this aerial encroachment and legally allow the installation of the pedestrian bridges to extend over the public rights-of-way of the 20-foot Alley.  A value of $500.00 for the encroachment easement was established.\n \n2.                     Fiscal Impact\nThe City will receive a total of $500.00, to be deposited in Fund 7748, Project P537650, for granting the requested encroachment.\n \nEmergency Designation: To permit the development project to move forward and obtain a building permit per Jeffrey L. Brown. \n \nTitle\nTo authorize the Director of the Department of Public Service to execute those documents necessary for the City to grant encroachment to legally allow the installation of the pedestrian bridge to extend over the public rights-of-way of the 20-foot Alley located at the first alley west of North High Street, and to declare an emergency. ($0.00)\n \n \nBody\nWHEREAS, the City of Columbus, Department of Public Service, received a request from the property owner, ACC OP (LANE & HIGH) LLC, asking that the City allow the above proposed bridge, located at the first alley west of North High Street and just south of Norwich Avenue, to encroach over the public right-of-way; and\n \nWHEREAS, the proposed bridge will extend on either side of the 20-foot alley right-of-way. The development is proposed student housing of two buildings with approximately 198 residential units. During the design phase of the proposed buildings, it was determined that for safety reasons the pedestrian bridge was warranted. The encroachment will be located over the right-of-way as indicated above and as described below and shown on the attached exhibit; and\n \nWHEREAS, a value of $500.00 was established for the encroachment easement to be deposited into fund 7748, Project P537650; and\n \nWHEREAS, it has become necessary in the usual daily operation for the City to accept  the requested encroachment easement which will allow installation of the above mentioned pedestrian bridge without unnecessary delay; NOW, THEREFORE, and\n \nWHEREAS, an emergency exists in the usual daily operation in the City of Columbus in that it is immediately necessary to pass this ordinance to permit the development project to move forward and obtain a building permit per Jeffrey L. Brown for the immediate preservation of the public peace, property, health and safety; now, therefore:\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSection 1.  That the Director of the Department of Public Service is hereby authorized to execute those documents necessary for the City to grant the aerial encroachment and legally allow them to extend into the public rights-of-way, site owner, ACC OP (LANE & HIGH) LLC, and attached exhibit; to-wit:\n \nAERIAL ENCROACHMENT EASEMENT\nBETWEEN 796.5’ TO 868.0’ ELEVATION (NAD83)\n0.009 ACRES (FOOTPRINT)\n400 SQUARE FEET (FOOTPRINT)\n28,600 CUBIC FEET (VOLUME)\n \nSituated in the city of Columbus, County of Franklin, State of Ohio; also being a part of a 20’ alley as dedicated in C.M. Williams’ Subdivision of Outlots Nos. 7, 12 And 13 of Chaffee’s Subdivision as recorded in Plat Book 4 Page 424, being a 3-dimensional easement stating 20 feet above the existing pavement at elevation 796.5’ (NAVD88) and extending upward for 71.5’ to elevation 868.0’ (NAVD88), the footprint of said easement being more particularly described as follows:\nCommencing at the intersection of the westerly right-of-way line of said alley and the southerly right-of-way line of Norwich Avenue (50’ right-of-way), said point being the northeasterly corner of Lot 9 of said C.M. Williams’ Subdivision, said point also being the northeasterly corner of lands conveyed to The University Baptist Church of Columbus, Ohio as described in Deed Book 2671 Page 470; thence, Along the westerly right-of-way line of said alley and the easterly line of said Lot 9, South 08° 13’ 41” East for a distance of 47.59’ to a point, said point being the TRUE POINT OF BEGINNING, and from said beginning point running thence: Along a line through said alley, perpendicular to the westerly right-of-way line of said alley, North 81° 46’ 19” East for a distance of 20.00’ to a point along the easterly right-of-way line of said alley, said point also being along the westerly line of Lot 4 of said C.M. Williams’ Subdivision, said point also being along the westerly line of lands conveyed to FIMOK, LLC as described in Instrument No. 200502040022201; thence, Along the easterly right-of-way line of said alley, also being along a portion of the westerly lines of Lot 4 and Lot 5 of said C.M. Williams’ Subdivision, South 08° 13’ 41” East for a distance of 20.00’ to a point; thence, Along a line through said alley, perpendicular to the easterly right-of-way line of said alley, South 81° 46’ 19” West for a distance of 20.00’ to a point along the westerly right-of-way line of said alley and along the easterly line of said Lot 9; thence, Along the westerly right-of-way line of said alley and the easterly line of said Lot 9, North 08° 13’ 41” West for a distance of 20.00’ to the point of beginning, containing 0.009 acres of land (400 square feet), and a volume of 28,600 cubic feet, more or less. Basis of bearings is the State Plane Coordinate System, Ohio South Zone (NAD83-2011), with a portion of the westerly right-of-way line of the above-referenced alley being South 08° 13’ 41” East as determined by a GPS survey utilizing CORS Station “COLB”.\n \nSection 2.  That the City Attorney is required to approve all instrument(s) associated with this ordinance prior to the director of the Department of Public Service executing and acknowledging any of those instrument(s).\n \nSECTION 3. That the City will receive a total of $500.00 for granting the encroachment easements, to be deposited into Fund 7748, Project P537650.\n \nSECTION 4.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.\n \nSECTION 4. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or 10 days after its passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 164,
    "meeting_date": "2025-12-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services",
      "Grants",
      "Public Works"
    ]
  }
}