{
  "success": true,
  "vote": {
    "id": 14029,
    "item_number": "SR-46",
    "title": "To repeal and replace various sections of the Columbus City Codes to clarify that City of Columbus officials, agencies, departments, agents, and contractors are not required to obtain a certificate of appropriateness (“COA”) from any historic architectural review commission or other commission with COA authority when performing work in the right-of-way, in response to the contrary interpretation of the Columbus City Codes as detailed in the Magistrate’s Decision filed September 22, 2025 and Entry Adopting Magistrate’s and Granting Preliminary Injunction filed September 29, 2025 in the case German Village Society, Inc., et al. v. City of Columbus, et al. (Franklin County Court of Common Pleas Case No. 25CV7368)",
    "description": "Explanation\nBackground \n \nThe City of Columbus, Department of Public Service, has a construction program to install curb ramps that are compliant with the Americans with Disabilities Act (“ADA”) throughout the City, including within the City’s several historic and design-review districts. One of those historic districts is the German Village Historic District, which was established by Columbus City Council and is described in Section 3119.25 of the Columbus City Codes. \n \nStandard ADA curb ramps are installed with plastic detectable warning strips, concrete surrounding the warning strips, and concrete curbs.  These standard curb ramps are installed in the City’s non-historic neighborhoods, including Linden, the Hilltop, Clintonville, East Broad Street, Morse Road, Northwest Columbus, the University District, and in most neighborhoods of the City. The German Village Society (the “Society”) has requested curb ramps and sidewalks that are anywhere from four to six times more expensive than the standard City curb ramps due to the material involved and the engineering design work required to craft a custom-made curb ramp for each individual curb within the German Village Historic District. Namely, the Society has requested brick inlays leading to the detectable warning strips, as well as sandstone curbs. Brick is more expensive than concrete. Sandstone, meanwhile, is a scarce resource available only from a limited number of quarries in the country. Further, sandstone is not a malleable material like concrete. Because of this fact, sandstone requires a skilled mason to fabricate the sandstone into the exact dimensions for each individual curb. The Department of Public Service is currently under contract for the construction of 55 curb ramps in the German Village Historic District\n \nThe Department and the German Village Society engaged in discussions to attempt to arrive at a compromise solution for the installation of the 55 curb ramps. Although progress was made during these discussions, the Department and Society were ultimately unable to come to a resolution. \n \nOn August 29, 2025, the German Village Society and several named plaintiffs initiated a lawsuit against the City in the Franklin County Court of Common Pleas in German Village Society, et al. v. City of Columbus, et al. (Case No. 25CV7368) (the “Lawsuit”). On September 2, 2025, the Court issued a temporary restraining order against the City prohibiting the City and its officials from performing work in the sidewalks and curbs within the German Village Historic District. On September 11, 2025, the parties participated in a preliminary injunction hearing before a magistrate judge. The City argued that Section 3119.05(G) provides that the German Village Commission is an advisory body only with respect to City-owned right-of-way, and that, accordingly, neither the Commission, nor the Plaintiffs, had the authority to require the City to seek a COA from a City-established commission before performing work in the right-of-way.\n \nOn September 22, 2025, the magistrate judge disagreed with the City’s arguments and issued a decision recommending the granting of a preliminary injunction. On September 29, 2025, the Court adopted the magistrate judge’s recommendation and issued a preliminary injunction against the City, ordering specifically as follows: \n \n“The City of Columbus, Ohio and its officials, agencies, departments, agents, and contractors are hereby enjoined from causing, allowing, permitting, assisting, promoting, or accommodating the demolition or alteration of any sidewalks or curbs within the German Village Historic District, whether by an affirmative act or an omission, unless and until a certificate appropriateness had been obtained from the German Village Commission for the specific demolition or alteration. This preliminary injunction will remain in effect until the Court issues a final appealable order in this case.”\n \nIn reaching its conclusion, the Court interpreted the requirement under C.C. 3116.04 that “no person shall construct, reconstruct, alter, change the exterior of or demolish any listed property or architectural feature thereof or any structure or architectural feature now or hereafter in a district or make site improvements thereon without first applying for a certificate of appropriateness therefor and obtaining either such certificate of appropriateness or a clearance” to require that the City of Columbus and its officials, agents, and contractors obtain a certificate of appropriateness to perform work in the public right-of-way, including on sidewalks and curbs. The Court relied on a similar provision located at C.C. 3119.47 in reaching its conclusion.  However, the Court’s interpretation is incorrect in that City Council never intended that the City of Columbus, its officials, agents, or contractors be required to obtain a certificate of appropriateness from the German Village Commission or any other historic architectural review commission to perform work in the right-of-way. City Council now wishes to correct the Court’s misinterpretation.\n \nThe breadth of the preliminary injunction prohibits the City from performing routine and urgent work in the public right-of-way in the German Village Historic District without first obtaining a certificate of appropriateness for said work. Obtaining a COA from the German Village Commission, however, will increase the time required to complete work in the public right-of-way and has the potential to dramatically increase the costs of such work if the German Village Commission follows the suit of the Society and demands that sandstone curb be replaced with sandstone curb. \n \nIn addition, although the City’s other historic districts and design-review districts are not the direct subjects of the Lawsuit, they are implicated. Namely, the Court’s reasoning in the preliminary injunction order may be interpreted to apply in equal measure to the Brewery District, Downtown, East Franklinton, Italian Village, the University District, Victorian Village, and properties under the jurisdiction of the Historic Resources Commission. Accordingly, it is necessary to clarify various provisions of the Columbus City Codes to erase any doubt that the City and its officials, agencies, departments, agents, and contractors are not required to obtain a certificate of appropriateness or certificate of approval when performing work in the right-of-way. Further, in light of the positions and arguments advanced by the Plaintiffs in the Lawsuit, it is necessary also to clarify that neither the Department of Public Utilities dba Columbus Water and Power nor its officials, agents, or contractors are required to obtain a COA when performing work on, maintaining, or installing utility meters (including, water, sewer, electric, and gas). Finally, it is also necessary to clarify that City officials, agents, employees, and contractors are not required to obtain a certificate of appropriateness or approval prior to installing or repairing traffic control devices and fire suppression systems. \n \n \nTitle\nTo repeal and replace various sections of the Columbus City Codes to clarify that City of Columbus officials, agencies, departments, agents, and contractors are not required to obtain a certificate of appropriateness (“COA”) from any historic architectural review commission or other commission with COA authority when performing work in the right-of-way, in response to the contrary interpretation of the Columbus City Codes as detailed in the Magistrate’s Decision filed September 22, 2025 and Entry Adopting Magistrate’s and Granting Preliminary Injunction filed September 29, 2025 in the case German Village Society, Inc., et al. v. City of Columbus, et al. (Franklin County Court of Common Pleas Case No. 25CV7368) \n \nBody\nWHEREAS, the City regularly engages contractors to perform work in the public right-of-way, including for the installation of ADA-compliant curb ramps; and \n \nWHEREAS, the City’s standing practice is to engage community stakeholders throughout the design and construction of improvements in the right of way, which is expected to continue as the City’s standard protocol notwithstanding the clarification authorized by this ordinance; and\n \nWHEREAS, the German Village Society and several individually named Plaintiffs filed suit in German Village Society, Inc., et al. v. City of Columbus, et al. (Franklin County Court of Common Pleas Case No. 25CV7368) (the “Lawsuit”) against the City seeking to enjoin the City from installing ADA-compliant curb ramps in the German Village Historic District without first obtaining a certificate of appropriateness from the German Village Commission; and \n \nWHEREAS, on September 29, 2025, the Court issued a preliminary injunction against the City, enjoining the City, its officials, agencies, departments, agents, contractors from causing, allowing, permitting, assisting, promoting, or accommodating the demolition or alteration of any sidewalks or curbs within the German Village Historic District, whether by an affirmative act or an omission, unless and until a certificate appropriateness had been obtained from the German Village Commission for the specific demolition or alteration during the pendency of the Lawsuit; and\n \nWHEREAS, the Court relied upon various sections of Chapters 3116 and 3119 of the Columbus City Codes to arrive at the conclusion that the City is likely required to obtain a certificate of appropriateness from the German Village Commission to perform work in the rights-of-way; and \n \nWHEREAS, this interpretation of the Columbus City Codes is incorrect in that City Council did not intend for the City or its officials, agents, or contractors to be required to obtain a certificate of appropriateness from the German Village Commission or any other historic architectural review commission to perform work in the right-of-way; and \n \nWHEREAS, the City Council, upon adhering to the procedural requirements under the City Charter, has the authority to change the Codes at any time; and \n \nWHEREAS, the City Council now wishes to correct the Court’s misinterpretation of the City Codes; and \n \nWHEREAS, it has become necessary in the usual daily operation of the City to repeal and replace various sections of the Columbus City Code to clarify that City of Columbus officials, agencies, departments, agents, and contractors are not required to obtain a certificate of appropriateness when performing work in the right-of-way; NOW, THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS: \n \nSECTION 1. That Sections 903.01, 904.04, 912.03, 1103.03, 1103.04, 1105.038, 1119.07, 1133.07, 1143.01, 1163.025, 1165.01, 2106.02, 2509.01, 3116.017, 3116.04, 3116.23, 3119.05, 3119.47, 3303.18, 3323.11, 3325.111, 3359.07, and 34.A.10.040 (2024 Zoning Code) of the Columbus City Codes are hereby amended as described in the attached Exhibit A, which is hereby incorporated by reference as if fully rewritten herein. \n \nSECTION 2. That existing Sections 903.01, 904.04, 912.03, 1103.03, 1103.04, 1105.038, 1119.07, 1133.07, 1143.01, 1163.025, 1165.01, 2106.02, 2509.01, 3116.017, 3116.04, 3116.23, 3119.05, 3119.47, 3303.18, 3323.11, 3325.111, 3359.07, and 34.A.10.040 (2024 Zoning Code) of the Columbus City Codes are hereby repealed.\n \nSECTION 3. That City Council hereby finds and determines that facilitating access to the City’s built environment for individuals with physical disabilities within the City’s various historic and design-review districts is a more compelling interest than maintaining the historic aesthetics of the public right-of-way within each historic and design-review district. \n \nSECTION 4. That the City Clerk is hereby authorized and directed to submit a certified copy of this ordinance to the City Attorney’s Office at the earliest opportunity. \n \nSECTION 5. That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 164,
    "meeting_date": "2025-12-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Economic Development"
    ]
  }
}