{
  "success": true,
  "vote": {
    "id": 14032,
    "item_number": "SR-49",
    "title": "To amend a section of the City’s drinking water code, which is Chapter 1105 of the Columbus City Codes, to add clarifying language regarding the scope of the authority of the Director of Public Utilities over water metering systems and to make clerical revisions throughout the section. ($0.00)",
    "description": "Explanation\n \nThis ordinance amends Section 1105.038, of Chapter 1105, Water Rate and Charges, of the Columbus City Codes, which provides the Director of Public Utilities with the Director's authority over water metering systems and outlines City and customer responsibilities for these systems.  The amended language clarifies that the authority over the water metering system is applicable to the water service lines including fire service lines.\nFISCAL IMPACT: No fiscal impact.\n \nTitle\n \nTo amend a section of the City’s drinking water code, which is Chapter 1105 of the Columbus City Codes, to add clarifying language regarding the scope of the authority of the Director of Public Utilities over water metering systems and to make clerical revisions throughout the section. ($0.00)\n \nBody\n \nWHEREAS, the City of Columbus, Department of Public Utilities, Division of Water installs, reads, maintains, and replaces metering systems in its public water system; and\n \nWHEREAS, it is necessary to amend City Code Section 1105.038 to clarify that the authority that the Director of Public Utilities has over the water metering system is applicable to the water service lines including fire service lines; and \nWHEREAS, it is necessary to amend City Code Section 1105.038 to make clerical revisions; and \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities to amend the section listed above for the public health, safety and welfare; NOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1.  That existing Section 1105.038 of the Columbus City Codes is hereby amended as follows:\n1105.038 Water metering systems.\nA.                     The Director of Public Utilities is hereby authorized to install, read, maintain, and replace metering systems tofor any and all water service lines, including but not limited to fire service lines, for properties served with water by the Division of Water. \nB.                     The Director of Public Utilities or the director's appointed agents are authorized to enter all properties served with water by the Division of Water for the purpose of installing, reading, maintaining, and replacing the metering systems. \nC.                     Water service may be terminated for failure of a customer to provide access to the property for the purpose of installing, reading, maintaining, or replacing the metering systems pursuant to the provisions of city code Section 1101.03. Service charges will continue to be charged during the period water service is terminated pursuant to Section 1105.23. \nD.                     The property owner shall pay the appropriate service termination and resumption charges as specified in Section 1105.09 for denying access to the Director of Public Utilities or the director's agents for the purpose of installing, reading, maintaining, and replacing the metering system. \nE.                     The customer is responsible for damage to the metering system resulting from negligence, vandalism, freezing or hot water and shall be charged for said damages to the meter according to Section 1105.09, Part E, except that said charge shall not be imposed when to the satisfaction of the director it is shown that the damage is the result of conditions beyond the control of the customer. \nF.                     If the customer causes the obstruction of thea metering system after its installation, or requests that the metering system be relocated, and the Division of Water agrees to perform such relocation, the customer shall be responsible for the relocation trip charge as specified in Section 1105.09, plus the actual costs of relocating any part of the metering system. \nG.                     The Director of Public Utilities will determine the type of metering system to be installed for each water service linecustomer and, thatif in the director's opinion an existing system is inadequate to meet the intent of Section 1105.038, the director shall cause it to be replaced with a system meeting said intent. \nSECTION 2.  That existing Section 1105.038 of the Columbus City Codes is hereby repealed.\nSECTION 3.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 164,
    "meeting_date": "2025-12-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 9,
        "full_name": "Otto Beatty III",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services",
      "Infrastructure"
    ]
  }
}