{
  "success": true,
  "vote": {
    "id": 1419,
    "item_number": "SR-25",
    "title": "To amend the 2020 Capital Improvement Budget; to authorize the transfer of funds and appropriation within the Streets and Highways Bond Fund; to authorize the Director of Public Service to enter into contract with Columbus Asphalt Paving, Inc. for the Operation Safewalks - School Sidewalks - Sycamore (Carpenter to Champion) project; to authorize the expenditure of up to $652,218.68 from the Streets and Highways Bonds Fund for the Operation Safewalks - School Sidewalks - Sycamore (Carpenter to Champion) Project; and to declare an emergency. ($652,218.68)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Service to enter into contract with Columbus Asphalt Paving, Inc. for the Operation Safewalks - School Sidewalks - Sycamore (Carpenter to Champion) project and to provide payment for construction, construction administration and inspection services.  \n \nThis contract includes the construction of sidewalks along the south side of Sycamore Street from Carpenter Street to Champion Avenue and along the north side from Champion Avenue to the existing curb ramp just west of Oakwood Avenue.  Sidewalk installation will include curb ramps, drive approaches, concrete curb, modular retaining walls, curb walls, lead walks, stairs, and other such work as may be necessary to complete the contract, in accordance with the drawings, technical specifications, plans at 3577 Drawer E and City of Columbus Construction and Material specifications set forth in the Invitation For Bid (IFB).\n \nThe estimated Notice to Proceed date is August 16, 2021.  The project was let by the Office of Support Services through Vendor Services and Bid Express.  Five bids were received on June 15, 2021, (All majority) and tabulated as follows:   \n      \nCompany Name                                 Bid Amount               City/State                                                Majority/MBE/FBE     \nColumbus Asphalt Paving, Inc.                          $592,926.07                     Gahanna, OH                                                                 Majority\nNewcomer Concrete Services, Inc.    $602,559.21                         Norwalk, OH                                                                                            Majority     \nDecker Construction Company                              $632,037.52                         Columbus, OH                                                                                           Majority      \nG & G Concrete Const., LLC            $637,551.53                         Columbus, OH                                                                                          Majority      \nShelly & Sands, Inc.                                                   $814,983.40                       Columbus, OH                                                                                           Majority                     \n \nAward is to be made to Columbus Asphalt Paving, Inc. as the lowest responsive and responsible and best bidder for their bid of $592,926.07.  The amount of construction administration and inspection services will be $59,292.61.  The total legislated amount is $652,218.68. \n \nSearches in the System for Award Management (Federal) and the Findings for Recovery list (State) produced no findings against Columbus Asphalt Paving, Inc.\n \n2. CONTRACT COMPLIANCE INFORMATION\nThe contract compliance number for Columbus Asphalt Paving, Inc. is CC004394 and expires 11/4/21.\n \n3. PRE-QUALIFICATION STATUS\nColumbus Asphalt Paving, Inc. and all proposed subcontractors have met code requirements with respect to pre-qualification, pursuant to relevant sections of Columbus City Code Chapter 329.\n \n4.  FISCAL IMPACT\nThis is a budgeted expense within the 2020 Capital Improvements Budget and is available within the Streets and Highways Bond Fund, Fund 7704.  An amendment to the 2020 Capital Improvement Budget and a transfer of cash and appropriation is necessary to align spending with the proper project.  Funds are appropriated.\n5. EMERGENCY DESIGNATION\nEmergency action is requested in order to complete needed improvements at the earliest possible time to ensure the safety of the travelling public.\nTitle\nTo amend the 2020 Capital Improvement Budget; to authorize the transfer of funds and appropriation within the Streets and Highways Bond Fund; to authorize the Director of Public Service to enter into contract with Columbus Asphalt Paving, Inc. for the Operation Safewalks - School Sidewalks - Sycamore (Carpenter to Champion) project; to authorize the expenditure of up to $652,218.68 from the Streets and Highways Bonds Fund for the Operation Safewalks - School Sidewalks - Sycamore (Carpenter to Champion) Project; and to declare an emergency. ($652,218.68)\n \nBody\nWHEREAS, the Department of Public Service is engaged in the Operation Safewalks - School Sidewalks - Sycamore (Carpenter to Champion) project; and  \n \nWHEREAS, the work for this project consists of the construction of sidewalks along the south side of Sycamore Street from Carpenter Street to Champion Avenue and along the north side from Champion Avenue to the existing curb ramp just west of Oakwood Avenue.  Sidewalk installation will include curb ramps, drive approaches, concrete curb, modular retaining walls, curb walls, lead walks, stairs, and other such work as may be necessary to complete the contract, in accordance with the drawings, technical specifications, plans at 3577 Drawer E and City of Columbus Construction and Material specifications set forth in the Invitation For Bid (IFB); and\n \nWHEREAS, Columbus Asphalt Paving, Inc. will be awarded the contract for the Operation Safewalks - School Sidewalks - Sycamore (Carpenter to Champion)  project; and \n \nWHEREAS, the Department of Public Service requires funding to be available for the Operation Safewalks - School Sidewalks - Sycamore (Carpenter to Champion)  project for construction expense along with construction administration and inspection services; and\n \nWHEREAS, it is necessary for Council to authorize a transfer of funds within Fund 7704, the Streets and Highways Bond Fund, to establish sufficient cash to pay for the project; and\n \nWHEREAS, it is necessary to amend the 2020 Capital Improvement Budget to establish authority within the correct project; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to authorize the Director enter into contract with Columbus Asphalt Paving, Inc. to ensure the safety of the traveling public, thereby preserving the public health, peace, property, safety and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2020 Capital Improvements Budget authorized by ordinance 2521-2020 be amended as follows to establish sufficient authority for this project:\n \nFund / Project / Project Name / Current / Change / C.I.B. as Amended\n7704 / P530103-100068 / ASR-Hudson St-I-71 to Cleveland Ave (Voted 2019 SIT Supported) / $3,700,000.00 / ($500,000.00) / $3,200,000.00\n7704 / P531034-100000 / Roadway - Sullivant Avenue - Hague to I70 (Voted 2019 SIT Supported) / $10,000,000.00 / ($82,219.00) / $9,917,781.00\n7704 / P590955-100036 / Operation Safewalks - School Sidewalk - Sycamore Street (Carpenter St to Champion Av)(Voted 2019 Debt SIT Supported) / $70,000.00 / ($70,000.00) / $0.00\n \n7704 / 590955-910057 / Operation Safewalks - School Sidewalks - Sycamore (Carpenter to Champion) (Voted 2019 SIT Supported) / $0.00 / $652,219.00 / $652,219.00\n \nSECTION 2.  That the transfer of $500,000.00, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5912 (Design and Construction), Project P530103-100068 (ASR Hudson St.-I71 to Cleveland Ave), Object Class 06 (Capital Outlay) to Dept-Div 5912 (Design and Construction), Project P590955-910057 (Operation Safewalks - School Sidewalks - Sycamore (Carpenter to Champion)), Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That the transfer of $82,218.68, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5912 (Design and Construction), Project P531034-100000 (Roadway-Sullivant Avenue-Hague to I70), Object Class 06 (Capital Outlay) to Dept-Div 5912 (Design and Construction), Project P590955-910057 (Operation Safewalks - School Sidewalks - Sycamore (Carpenter to Champion)), Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\n \nSECTION 4.  That the Director of Public Service be and is hereby authorized to enter into a construction services contract with Columbus Asphalt Paving, Inc., 1196 Technology Drive, Gahanna, Ohio 43230, for the Operation Safewalks - School Sidewalks - Sycamore (Carpenter to Champion) project in the amount of up to $592,926.07 in accordance with the specifications and plans on file in the Office of Support Services, which are hereby approved; and to pay for necessary construction administration and inspection costs associated with the project up to a maximum of $59,292.61.\n \nSECTION 5.  That the expenditure of $652,218.68, or so much thereof as may be needed, is hereby authorized in Fund 7704 (Streets and Highways Bond Fund), Dept-Div 5912 (Design and Construction), Project P590955-910057 (Operation Safewalks - School Sidewalks - Sycamore (Carpenter to Champion)) per the accounting codes in the attachment to this ordinance.\n \nSECTION 6.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 7.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 8.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 9.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 20,
    "meeting_date": "2021-07-12",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}