{
  "success": true,
  "vote": {
    "id": 1429,
    "item_number": "SR-35",
    "title": "To accept the recommendation of and to authorize and direct the Special Counsel, through the City Attorney, to vote to approve the Bankruptcy Settlement pertaining to the Chapter 11 Plan of Reorganization of Purdue Pharma L.P. in the United States Bankruptcy Court for the Southern District of New York, Case No. 19-23649; to authorize the City Attorney to take all steps necessary to resolve these matters in accordance with the terms of the Bankruptcy Settlement; to authorize the City Attorney to settle any remaining future claims arising out of IN RE:  NATIONAL PRESCRIPTION OPIATE LITIGATION in the United States District Court for the Northern District of Ohio, MDL Case No. 1:17-md-02804-DAP; and to declare an emergency.",
    "description": "Explanation\n \nPurdue Pharma, the company which developed and aggressively marketed Oxycontin, a powerful and addictive opioid painkiller, filed for bankruptcy in September 2019 after being named as a defendant in thousands of civil lawsuits, including one filed by the City of Columbus, seeking damages for asserted opioid-related injuries. There is now a plan that seeks to resolve the bankruptcy cases by settlement.\n \nThat settlement is now before the bankruptcy court for final confirmation. As part of the process, all creditors who filed a “proof of claim” against the bankruptcy estate are being asked to vote on the proposed restructuring plan that emerged from the settlement negotiations. The City of Columbus filed such a proof of claim and, as such, is now being asked to vote on the proposed Bankruptcy Settlement.\n \nIn 2017, the City of Columbus, through the Office of the City Attorney, obtained outside special counsel to represent the City in what would become the Multi-District Opiate Litigation (“the MDL”)  - IN RE:  NATIONAL PRESCRIPTION OPIATE LITIGATION in the United States District Court for the Northern District of Ohio, MDL Case No. 1:17-md-02804-DAP.  Purdue Pharma’s Bankruptcy is a direct outgrowth of the response to this filed litigation and the reason for the City having filed a proof of claim in that Bankruptcy action.  Special Counsel is now recommending that the City vote in favor of the Bankruptcy Settlement which, if accepted, will ultimately lead to a resolution of claims against Purdue Pharma with approximately 4.35% of the total settlement to inure to the State of Ohio to then be divided among the municipalities, including the City of Columbus.  Further, it is anticipated that more such settlements may be occurring in a similar manner by virtue of declarations of bankruptcy or through the normal course of the MDL, necessitating flexibility in settlement procedures.\n \nTitle\n \nTo accept the recommendation of and to authorize and direct the Special Counsel, through the City Attorney, to vote to approve the Bankruptcy Settlement pertaining to the Chapter 11 Plan of Reorganization of Purdue Pharma L.P. in the United States Bankruptcy Court for the Southern District of New York, Case No. 19-23649; to authorize the City Attorney to take all steps necessary to resolve these matters in accordance with the terms of the Bankruptcy Settlement; to authorize the City Attorney to settle any remaining future claims arising out of IN RE:  NATIONAL PRESCRIPTION OPIATE LITIGATION in the United States District Court for the Northern District of Ohio, MDL Case No. 1:17-md-02804-DAP; and to declare an emergency.\n \n \nBody\n \nWHEREAS, the City filed a proof of claim in the Chapter 11 Plan of Reorganization of Purdue Pharma L.P. in the United States Bankruptcy Court for the Southern District of New York, Case No. 19-23649 (the “Bankruptcy”) pertaining to distribution of opioids by Purdue Pharma that was a significant cause of the national opioid crisis that lead to mass addiction and overdose deaths that affected both the State of Ohio and the City of Columbus; and\n \nWHEREAS, a mediated settlement proposal was reached with the Creditor constituencies in the Bankruptcy including public and private Creditors; and\n \nWHEREAS, the City Attorney and the Special Counsel recommend that Council vote to approve the Fifth Amended Joint Chapter 11 Plan of Reorganization of Purdue Pharma (“Bankruptcy Settlement”) as reflected in the Master Ballot in the Bankruptcy and incorporated by reference herein; and\n \nWHEREAS, the Bankruptcy Settlement addressed herein is a direct result of the pending action entitled  IN RE: NATIONAL PRESCRIPTION OPIATE LITIGATION (“Opiate Litigation”) in the United States District Court for the Northern District of Ohio, MDL Case No. 1:17-md-02804-DAP of which the City of Columbus is a member of the plaintiff’s group; and\n \nWHEREAS, the Opiate Litigation has a high number of both plaintiffs and defendants, is continuously evolving and is likely to result in many such related settlements either in bankruptcy or through operation of the MDL, it is in the best interest of the City that the City Attorney be granted the authority to settle attendant claims, thereby allowing greater flexibility to address these matters; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Office of the City Attorney, in that it is necessary for this ordinance to be effective immediately in order to allow for the vote to occur before the July 14, 2021 in the Bankruptcy Court; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1:                     That City Council hereby accepts the recommendation of the City Attorney and the Special Counsel and authorizes approval of the Bankruptcy Settlement on behalf of the City on or before the July 14, 2021 deadline.\n \nSECTION 2:                     That City Council hereby authorizes and directs the Special Counsel, through the City Attorney, to vote to approve the Bankruptcy Settlement on behalf of the City on or before the July 14, 2021 deadline.\n \nSECTION 3:                     That the City Attorney is hereby authorized to take all steps necessary to resolve these matters in accordance with the terms of the Bankruptcy Settlement.\n \nSECTION 4:                     That the City Attorney is hereby authorized to make all future settlement decisions and take all future steps necessary to settle any and all remaining claims arising out of or associated with IN RE: NATIONAL PRESCRIPTION OPIATE LITIGATION in the United States District Court for the Northern District of Ohio, MDL Case No. 1:17-md-02804-DAP.\n \nSECTION 5:                     That for the reasons stated in the preamble hereto, which is made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force after passage and approval by the Mayor, or 10 days after passage if the Mayor neither vetoes nor approves the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 20,
    "meeting_date": "2021-07-12",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services"
    ]
  }
}