{
  "success": true,
  "vote": {
    "id": 1430,
    "item_number": "SR-36",
    "title": "To authorize and direct the City Clerk to accept a $107,027.50 grant on behalf of the City of Columbus from The Ohio State University Alliance for the American Dream, a collaboration with Schmidt Futures; to authorize an appropriation within the Neighborhood Initiatives subfund; to authorize a transfer of cash between the Neighborhood Initiatives subfund and the general government grants fund; to authorize the appropriation of up to $321,082.50 from the unappropriated balance of the general government grants fund; to authorize the Director of the Department of Technology to enter into contract with Smart Columbus, LLC; and to waive the competitive bidding provisions of City Code.  ($321,082.50)",
    "description": "Explanation\nColumbus City Council, through the office of Councilmember Rob Dorans, has been awarded an additional $107,027.50 grant from The Ohio State University, in partnership with the Alliance for the American Dream, in support of Columbus City Council’s effort to simplify the record sealing application process and expand access to legal support services for Columbus residents with a criminal record. A $25,000.00 grant award (Ordinance 3294-2019), a $50,000.00 grant award (Ordinance 1484-2020), and $500,000.00 grant award (Ordinance 0165-2021) were previously accepted, bringing the total grant award from The Ohio State University, in partnership with the Alliance for the American Dream, to $682,027.50.\n \nThe $107,027.50 grant award is made available through December 31, 2022. The funds will be used to develop and launch the Opportunity Port platform based on the project presented by Opportunity Port in response to the Second Community Challenge issued by The Ohio State University, in partnership with the Alliance for the American Dream. These funds will be used exclusively for the purpose of developing and launching the project and will be allocated to support legitimate project costs, including the expenses associated with the identification and convening of collaborative partners, co-development of actionable ideas or policies addressing Alliance for the American Dream goals, vetting ideas with key stakeholders/subject matter experts, and managing, developing, testing, and evaluating the Opportunity Port platform. \n \nSmart Columbus, LLC will serve as the administrator for this grant. A waiver of competitive bidding is requested, as Smart Columbus, LLC has been integrally involved in the development process up to this point. It is in the city's best interest and it would be manifestly impractical to bid for administration given the timeline required for expenditure and scope of the project presented by Opportunity Port.\n \nFISCAL IMPACT:  An additional grant award of $107,027.50 from The Ohio State University, in partnership with the Alliance for the American Dream, is being awarded to Columbus City Council, through the office of Councilmember Rob Dorans. An acceptance and appropriation of said grant is required. Should expenses post to the grant that are not reimbursed, a transfer of funding from another source will be necessary.\n \n \nTitle\nTo authorize and direct the City Clerk to accept a $107,027.50 grant on behalf of the City of Columbus from The Ohio State University Alliance for the American Dream, a collaboration with Schmidt Futures; to authorize an appropriation within the Neighborhood Initiatives subfund; to authorize a transfer of cash between the Neighborhood Initiatives subfund and the general government grants fund; to authorize the appropriation of up to $321,082.50 from the unappropriated balance of the general government grants fund; to authorize the Director of the Department of Technology to enter into contract with Smart Columbus, LLC; and to waive the competitive bidding provisions of City Code.  ($321,082.50)\n \n \nBody\nWHEREAS, the existence of criminal records hinders the equitable growth and success of Columbus as a whole; and\n \nWHEREAS, according to the Ohio Justice and Policy Center, 1.3 million Ohio jobs are either completely or partially off limits to Ohioans with previous criminal convictions; and\n \nWHEREAS, Ohio Revised Code 2953.32 “Sealing of conviction record or bail forfeiture record,” allows eligible offenders to apply to the sentencing court if convicted in this state, or to a court of common pleas if convicted in another state or in a federal court, for the sealing of the record of the case that pertains to the conviction; and\n \nWHEREAS, according to the Bureau of Justice Statistics, approximately 1 in 3 American adults has a criminal record; and\n \nWHEREAS, according to the same study, among all individuals with criminal records, communities of color are most affected by incarceration and most disadvantaged by their criminal histories when seeking future employment; and\n \nWHEREAS, the goal of this grant is to fully develop the Opportunity Port project, including the expenses associated with the identification and convening of collaborative partners, co-development of actionable ideas or policies addressing Alliance for the American Dream goals, vetting ideas with key stakeholders/subject matter experts, and managing, developing, testing, and evaluating the Opportunity Port platform; and\n \nWHEREAS, the Franklin County Municipal Court Self Help Resource Center is a project partner, helping to expand access to record sealing through the use of Opportunity Port to connect with more prospective applicants; and\n \nWHEREAS, Alliance for the American Dream is a network of communities, each anchored by a public research university, that provides access to capital and access to market for new ideas to support distressed communities locally; and\n \nWHEREAS, The Ohio State University, in partnership with the Alliance for the American Dream, aims to generate innovative ideas to increase economic opportunities for local families; and\n \nWHEREAS, $107,027.50 in grant funds have been made available through The Ohio State University in partnership with the Alliance for the American Dream, in support of City Council’s effort to simplify the record sealing application process and expand access to legal support services for Columbus residents with a criminal record for a period through December 31, 2022; and\n \nWHEREAS, it is in the City's best interest to waive the competitive bidding provisions of City Code to allow the Director of the Department of Technology to contract with Smart Columbus, LLC, who will serve as the administrator for this grant. Smart Columbus, LLC has been integrally involved in the grant process up to this point, and it would be manifestly impractical to bid for administration given the timeline required for expenditure; and\n \nWHEREAS, it is necessary to accept and appropriate these funds from The Ohio State University, in partnership with the Alliance for the American Dream; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the City Clerk is hereby authorized and directed to accept a grant award of $107,027.50 from The Ohio State University Alliance for the American Dream, a collaboration with Schmidt Futures, in support of the city’s efforts to simplify the record sealing application process and expand access to legal support services for Columbus residents with a criminal record for a period through December 30, 2022.\n \nSECTION 2. That the Auditor is hereby authorized and directed to appropriate $214,055.00 within the Neighborhood Initiatives subfund to Columbus City Council per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That the City Auditor is hereby authorized and directed to transfer  $214,055.00 from the Neighborhoods Initiatives fund 1000, subfund 100018, to the general government grants fund, fund 2220, per the accounting codes in the attachment to this ordinance.\n \nSECTION 4. That the transfer of $75,000.00 from Department 20, Grant G20-2000, Object Class 3, Fund No. 2220 is hereby authorized to the Franklin County Municipal Court in support of Self Help Resource Center record sealing application assistance services, per the attachment.\n \nSECTION 5. That the monies transferred in the foregoing Section 4 shall be paid upon the order of the Administrative and Presiding Judge of the Franklin County Municipal Court and that no order shall be drawn or money paid except by voucher, the form of which shall be approved by the City Auditor.\n \nSECTION 6.  That from the unappropriated monies in the general government grants fund, Fund No. 2220, and from all monies estimated to come into said fund from any and all sources during the grant period, the sum of $321,082.50 is hereby appropriated upon receipt of an executed grant agreement in Fund No, 2220, Dept-Div 47-01, Grant G20-2000, Object Class 03 to Department of Technology, per the attachment to this ordinance.\n \nSECTION 7. That the Director of the Department of Technology is hereby authorized and directed to enter into contract with Smart Columbus LLC, to serve as administrator of the grant.\n \nSECTION 8. That the competitive bidding provisions of Section 329 of Columbus City Codes are hereby waived.\n \nSECTION 9. That in regards to the action authorized in Section 6 of this ordinance, the expenditure of $331,132.50, or so much thereof as is necessary, is hereby authorized per the accounting codes in the attachment to this ordinance.\n \nSECTION 10. That the monies appropriated in the foregoing Section 6 shall be paid upon the order of the Director of the Department of Technology and that no order shall be drawn or money paid except upon voucher, the form of which shall be approved by the City Auditor.\n \nSECTION 11.  That at the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused city match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements.\n \nSECTION 12.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated upon receipt of a signed agreement between the parties, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 13.  That this ordinance shall take effect at the earliest date allowable under law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 20,
    "meeting_date": "2021-07-12",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Grants"
    ]
  }
}