{
  "success": true,
  "vote": {
    "id": 1437,
    "item_number": "SR-43",
    "title": "To amend various sections of Chapter 598 of the Columbus City Codes to strengthen enforcement provisions related to Short-Term Rentals by clarifying definitions, providing additional grounds for denial, suspension, or revocation, and including an appeal process; and to declare an emergency.",
    "description": "Explanation\nIn July of 2018, Columbus City Council passed ordinance 2145-2018 amending Chapter 598 of the Columbus City Codes in order to establish regulations for short-term rental operations and hosting platforms in the City of Columbus. In February of 2019, an amendment (ordinance 0352-2019) requiring a BCI background check for all short-term rental hosts was made due to the concerns and interest of community members. Ordinance 0362-2019 was also passed in February 2019 in order to establish a regulatory tax framework for short-term rentals and to standardize the levying, collection, and allocation of all short-term rental related taxes. Given the rapid growth and dynamic nature of short-term rentals, it was written into the original ordinance that a thorough review and assessment of the regulations for short-term rentals would occur two years from the January 1, 2019 implementation date. \n \nThat review, in addition to feedback from the community, has contributed to these amendments to various sections of Chapter 598 to strengthen enforcement provisions related to short-term rentals by clarifying definitions, providing additional grounds for denial, suspension, or revocation, and including an appeal process.\n \nFISCAL IMPACT:  No funding is required for this legislation.\n \nEmergency Justification:  Emergency action is requested to ensure that amendments to Chapter 598, pertaining to the strengthening of enforcement provisions related to Short-Term Rentals, definition clarifications, the inclusion of additional grounds for denial, suspension, or revocation, and the inclusion of an appeal process, is in effect as soon as possible.\n \nTitle\nTo amend various sections of Chapter 598 of the Columbus City Codes to strengthen enforcement provisions related to Short-Term Rentals by clarifying definitions, providing additional grounds for denial, suspension, or revocation, and including an appeal process; and to declare an emergency. \nBody\nWHEREAS, in July of 2018, City Council passed Ordinance 2145-2018, amending Columbus City Codes Chapter 598 in order to establish regulations for short-term rental operations and hosting platforms; and\n \nWHEREAS, feedback from the community has contributed to these amendments to various sections of Chapter 598 to strengthen enforcement provisions related to Short-Term Rentals by clarifying definitions, providing additional grounds for denial, suspension, or revocation, and including an appeal process; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That Chapter 598 of the Columbus City Codes is hereby amended as follows:\n \nChapter 598 - HOTEL/MOTEL AND SHORT-TERM RENTAL OPERATIONS\n \n598.01 - Definitions. \n \nNotwithstanding any same or similar provisions of the Columbus City Codes (“C.C.C.”), the definitions applicable to this Hotel/Motel and Short-Term Rental Operations Chapter shall be as follows:\n \n(A)                     “Applicant” means the owner or permanent occupant who submits an application for a new permit or a renewal permit to the License Section with information as required by C.C.C. 598.03.\n(B)                     “Applicant’s Dwelling” means any and all dwellings intended to be used as a short-term rental(s) for which the applicant has submitted to the License Section as required by C.C.C. 598.03 for consideration to grant a new or renew a valid short-term rental permit.\n(A)                     (C)  \"Booking Service\" means any mechanism for a reservation and/or payment service provided by a hosting platform that provides for or facilitates a short-term rental transaction between a short-term rental host and a prospective potential short-term rental guest for the purpose of reserving or renting a guestroom for a fee, and for which the a hosting platform collects or receives, directly or indirectly through an agent or intermediary, a fee(s) any compensation in connection with the reservation. and/or payment services provided for the short-term rental transaction. Such compensation may be remitted to the short-term rental host or the hosting platform.\n(B) (D)                     \"Calls for Service Ratio\" means the number of calls for service divided by the number of rooms in service at the hotel/motel or short-term rental. \n(C) (E)                     \"Calls for Service\" means any and all calls, including but not limited to those to law enforcement and/or the fire department, when those calls: \n(1) result in a representative being dispatched or directed to the hotel/motel or short-term rental; \n(2) allege evidence of criminal activity; \n(3) result in an arrest, charge or citation; or \n(4) find an imminent threat to safety of person(s) or property; or\n(5) allege a sanitation,/refuse or noise issue at a short-term rental property in violation of the Columbus City Codes, \n \nCalls for service shall not include calls to notify the radio/dispatch made by employees of the hotel/motel or short-term rental property itself acting as officers, calls made by law enforcement officers or firefighters to indicate room of their location, or calls made by any person listed on a short-term rental application. commonly associated with Columbus Division of Police Directive 3.17 (IV)(A)(1)(a)(3). \n \n(D) (F)                     \"Director\" means the dDirector of pPublic sSafety or the dDirector's authorized designee. \n(E) (G)                     \"Dwelling\" means any building, structure, or unit, on the same tax parcel, sharing the same mailing address, which is occupied or intended for occupancy in whole or in part as a home, residence or sleeping place for one (1) or more persons.\n(F) (H)                     \"Employee\" means any person who earns qualifying wages, commissions or other type of compensation from the hotel/motel. \n(I)                     “Entity” means a corporation for profit or not for profit, partnership, limited partnership, joint venture, unincorporated association, estate, trust, or any other commercial organization. Entity does not include an organization created by a governmental agency for execution of a governmental program.\n(G) (J)                     \"Guestroom\" means a room offered to the public for a fee that contains, at a minimum, provisions for sleeping. \n(H) (K)                     \"Hosting Platform\" means an person or entity that participates in the short-term rental business/industry by providing for or facilitating and collecting or receiving a fee(s) for a booking services through a website whereby which a short-term rental host may offer, list, advertise, or market a short-term rental to a potential short-term rental guest. Hosting platforms usually, though not necessarily, provide booking services through an on line platform that allows a short-term rental host to advertise the short-term rental through a website provided by the hosting platform and the hosting platform conducts a transaction by which potential short-term rental guest reserve a guestroom(s) and arrange payment, whether the short-term rental guest pays rent directly to the short-term rental host or to the hosting platform. \n(I) \"Hotel/Motel Operation\" means the occupancy of any guestroom or use of any hotel/motel facility. \n(J) (L)                     \"Hotel/Motel\" means any structure consisting of one or more buildings, with more than five sleeping guestrooms, that is kept, used, maintained, advertised, or held out to the public to be a place where sleeping accommodations are offered for pay to guests, including, but not limited to, such a structure denoted as a hotel, motel, motor hotel, lodge, motor lodge, bed and breakfast, or inn. For the purpose of this Chapter, an individual guestroom in a hotel/motel shall not be considered to be a separate mailing address.\n(K) (M) \"Interception device\" as used in this chapter refers to the definition found in RC Chapter 2933.51(D) of Revised Code. \n(N)                     “License Section” shall mean the City of Columbus License Section under the Division of Support Services, Department of Public Safety.\n(L) (O)                     \"Manager\" means the general manager, shift manager, or any person in any supervisory position at the hotel/motel. \n(M) (P)                     \"Operator\" means any person who works at a hotel/motel in a capacity to facilitate the offering of guestrooms to guests, including, but not limited to, front desk workers. \n(N) (Q) \"Owner\" means the owner(s) of record as shown on the current tax list of the county auditor or a mortgagee(s) in possession. If an Owner is a \"Owner\" means a person or business entity, such as a corporation, firm, partnership, association, organization and any other group acting as a unit, or a person who has legal title to any structure or premises with or without accompanying actual possession thereof, and such business entity shall include the duly authorized agent. or attorney, a purchaser, devisee, fiduciary and any person having a vested or contingent interest in the premises in question. \n(O) (R)                     \"Permanent Occupants\" means a persons who resides in a dwelling more than 51% of the time during a calendar year, and the such dwelling in which a persons resides shall be referred to as their primary residence.\n(S)                     “Person” means every natural person and does not include any corporation, firm, partnership, association, or any other group acting as a unit. \n(P) (T)                     \"Primary Residence\" means a dwelling(s) which is the usual place of return for housing as documented by at least two of the following: motor vehicle registration, driver's license, tax documents, lease copy or a utility bill. An owner or permanent occupant can only have one primary residence. \n(U)                     “Property Manager” means any person charged with or responsible for a supervisory or caretaking position for the short-term rental and who has passed a BCI background check as required by C.C.C. 598.03(B)(10).\n(Q) (V)                     \"Short-Term Rental Guests\" means a persons who reserves a guestroom, wholly or partly, renting temporary lodging from a short-term rental host for a compensatory fee, or through a hosting platform on behalf of the short-term rental host, for less than thirty (30) consecutive days. \n(R) (W) \"Short-Term Rental Host\" means the owner or permanent occupant of a short-term rental who offers, lists, markets, or advertises a the short-term rental on a hosting platform and receives a fee as compensation. for temporary lodging. \n(S)                      \"Short-Term Rental Operation\" means the occupancy of any room or dwelling of any short-term rental. \n(T) (X)                     \"Short-Term Rental\" means any dwelling with five guestrooms or less that is reserved/rented wholly or partly for a compensatory fee for less than thirty (30) consecutive days by a short-term rental guest persons other than the permanent occupant or owner from which the permanent occupant or owner receive monetary compensation. \n(U) (Y)                     \"Transient Guests\" mean a persons occupying a hotel/motel guest room or rooms for sleeping accommodations for less than thirty (30) consecutive days. \n \n598.02 - Permit Required\n \n(A)  \n                     (1) No person or entity including but not limited to an owner, operator, manager, or employee shall engage in, conduct, or carry on, or permit to be engaged in, conducted or carried on, in or upon any premises in the city of Columbus, the operation of a hotel/motel without obtaining a permit in accordance with this Chapter. It shall be prima facie evidence of a hotel/motel operation if a transient guest is found to be occupying a hotel/motel guest room or if any person is found to be using a hotel/motel facility. \n(2) No short-term rental host person or entity shall engage in, conduct, or carry on, or permit to be engaged in, conducted or carried on, in or upon any premises in the city of Columbus, the offering, listing, advertisement or marketing of a dwelling with five guestrooms or less on an entity’s website for the purpose of offering to reserve or rent the dwelling, in whole or in part, to any other person, for a period of less than thirty (30) consecutive days, fshort-term rental, without obtaining a valid  permit in accordance with this Chapter. It shall be prima facie evidence of a short-term rental operation if a short-term rental guest is found to be occupying or using a short-term rental. This section shall not apply if such entity, via its website, does not receive compensation or a fee for the short-term reservation/rental. \n(B)                     An application for a new permit may be submitted at any time to the Director. If the application is approved and a valid permit is issued, the permit shall take effect on the day of issuance, and shall expire one calendar year from the day of issuance. If a valid permit is issued in conjunction with and contingent upon an explicit and consensual term lease agreement, as contemplated in section 598.04, the permit shall take effect on the day of issuance and shall expire upon the last day of the applicant's leasehold term or at the end of one calendar year from the day of issuance, whichever occurs first. \n(C)  A permit to operate a hotel/motel or short-term rental shall be renewed by the applicant prior to the expiration date. The renewed permit shall take effect on the day of issuance and shall expire upon the last day of the applicant's leasehold term or at the end of one calendar year from the day of issuance, whichever occurs first. \n \n598.03 - Application for Hotel/Motel or Short-Term Rental Permit, New and Renewal\n \n(A) An Aapplication for a new hotel/motel or short-term rental permit, and/or for renewal of a permit, shall be made to the Director, upon an approved forms, executed provided by the License Section. The Director shall establish associated permit fees and costs, with a portion of the short-term rental permit fees supporting affordable housing and home-ownership opportunities in the city of Columbus. \n(B) The application for a permit to operate a hotel/motel or short-term rental shall contain the following information: \n(1) Name of the applicant, including mailing address, telephone number, and email address. If the applicant is an entity, a corporation, firm, partnership, association, organization or other group acting as a unit, the applicant shall provide the name of the entity set forth exactly as shown on is its articles of incorporation, mailing address, telephone number, and email address of an individual who is the statutory agent, president, or managing individual, the state in which the company is incorporated or registered, and the entity or corporation number;. The short-term rental applicant shall provide to the Director one form of proof of identity, and two pieces of evidence that the applicant’s dwelling is the short-term rental applicant’s primary residence as defined in C.C.C. 598.01(T), and/or the short-term rental applicant is the owner of the dwelling, and/or the applicant is the permanent occupant.  If applicable, The short-term rental host the applicant shall provide sufficient documentation information to demonstrate compliance with the the primary residencey requirement as outlined in section C.C.C. 598.01(PT); \n(2) Name of hotel/motel or description of the dwelling short-term rental, including property address, and, where applicable, a registered telephone number for the property location; \n(3) Name of the The legal owner or owners of the dwelling or the property, including mailing address, telephone number, and email address. If an entity is the owner of  dwelling or the property the property owner is a corporation, firm, partnership, association, organization or other group acting as a unit, the applicant shall provide the name of the entity set forth exactly as shown on is its articles of incorporation as well as the mailing address, telephone number, and email address of an individual who is the statutory agent, president, or managing individual, the state in which the company entity is incorporated or registered, and the entity or corporation number; \n(4) If an owner of the property or dwelling has executed a land contract, lease agreement, management agreement, or any other agreement separating the owner from control over the property and/or the hotel/motel or dwelling short-term rental, the applicant shall include a copy of said document agreement along with the application. In order to receive a permit, such documentation must explicitly provide consent for a dwelling to be used as a short-term rental. short-term rental operations. Absent Absence of such a clause or evidence of a prohibition of a short-term rental operations shall be grounds for a denial of a short-term rental permit; \n(5) The names and addresses addresses and/or names of any other hotel/motel(s) or short-term rental(s) located in the city of Columbus that the applicant or property owner has any interest in, including, but not limited to, ownership, licensure, or management. If applicable, the duly authorized agent shall list the applicant’s aforementioned interest(s); \n(6) Name of the hotel/motel manager operator or short-term rental host, including mailing address, telephone number, and email address; \n(7) The number of guestrooms in service in at the hotel/motel or offered, listed, advertised, or marketed in the short-term rental; \n(8) The names of all hosting platforms on which the applicant has successfully been registered to offer, list, advertise, or market a short-term rental, and documentation confirming hosting platform registration(s), and proof of general liability insurance for the each short-term rental as required by section C. C. 598.04(F); \n(9)                     An short-term rental host's permit application for a short-term rental permit shall be notarized and the applicant shall to affirm that he/she/it and the dwelling the short-term rental host and short-term rental are in compliance with all applicable local, state, and federal laws and regulations. \n(10) In the instance where no hosting platform is used or the hosting platform does not complete a background check, then the results of an Ohio statewide background check performed by a BCI approved background check provider. Such background check will be at applicant's personal expense. A new background check will be required to renew any short-term rental permit. At the time of application for a new permit or renewal of a hotel/motel or short-term rental permit, all of the following persons are required to provide the results of a fingerprint-based background check performed by a provider approved by the Ohio Bureau of Criminal Investigation:  \na.                      The applicant,\n                                          b.                      The short-term rental host, if different than the applicant,\nc.                      The 24-hour local emergency contact person for the property as required by C.C.C. 598.04(C),\nd.                      The short-term rental property manager, if applicable\ne.                      If the applicant is a domestic business entity other than a general partnership, then the applicant must provide a copy of the entity’s articles of incorporation, articles of organization, statement of partnership authority, certificate of limited partnership, or statement of domestic qualification filed with the Ohio Secretary of State.  \nf.                      If the applicant is a foreign business entity other than a foreign general partnership, then the applicant must provide a copy of the foreign business entity’s license, registration, or qualification filed with the Ohio Secretary of State authorizing it to do business in Ohio.  \ng.                      For all business entity applicants, an individual who is either the statutory agent, a partner, the president, or in the case of an LLC, a managing individual who is also a member, must submit to and provide the results of a BCI background check.\n(C)                     A short-term rental applicant may submit an application for a new short-term rental permit at any time to the Director. If the application is approved by the License Section and a new short-term rental permit is issued, the permit shall take effect on the date of issuance and shall expire one calendar year from the date of issuance. If the permit is issued in conjunction with and contingent upon an explicit and consensual term lease agreement, as contemplated in C.C.C. 598.03(B)(4), the permit shall take effect on the date of issuance and shall expire upon the last day of the applicant's leasehold term or at the end of one calendar year from the date of issuance, whichever occurs first. Proof of a lease agreement, as defined in C.C.C. 598.03(B)(4), indicating the leasehold term length, shall be required where applicable.\n(D)                     A short-term rental applicant may submit an application for a short-term rental renewal permit prior to the permit expiration date. If approved, the short-term rental renewal permit shall take effect upon the expiration of the previous permit. The renewal permit shall expire one calendar year from the effective date. If the permit is renewed in conjunction with and contingent upon an explicit and consensual term lease agreement, as contemplated in C.C.C. 598.03(B)(4), the renewal permit shall take effect upon the expiration of the previous permit and shall expire upon the last day of the applicant's leasehold term or at the end of one calendar year from the effective date, whichever occurs first. Proof of a lease agreement, as defined in C.C.C. 598.03(B)(4), indicating the forthcoming leasehold term length, shall be required where applicable. \n(E)                     A hotel/motel applicant may submit an application for a new hotel/motel permit at any time to the Director. If the application is approved by the License Section and the new hotel/motel permit is issued, the permit shall take effect on the date of issuance and shall expire on December 31 of the same calendar year. A hotel/motel applicant shall submit an application for a renewal permit to the Director no earlier than sixty (60) days prior to the expiration of the permit. If the application is approved by the License Section and the renewal hotel/motel permit is issued, the permit shall take effect on January 1st of the following year and shall expire on December 31.\n(C) (F)                     The applicant shall must notify the License Section Director of any change in information contained in the permit application within ten (10) calendar days of the change on a form provided by the License Section. \n(D) (G) Any transfer in ownership of a hotel/motel shall void any hotel/motel permits held in that owner’s name. Any transfer in ownership of a dwelling shall void any short-term rental permit held in that owner’s name and in connection with the specific dwelling’s property address. Such aforementioned transfers of ownership shall require submission of a new permit application in consideration of and for the issuance of a new hotel/motel or short-term rental permit. \nAny change in ownership of the hotel, the building, the dwelling or the business, change in hotel operator, or change in name of the hotel, or short-term rental host shall void the current permit and shall require submission of a new application and the issuance of a new valid permit.\n(E) (H)                     If approved, as a short-term rental by the License Section, a dwelling shall be assigned an individual permit account number that the applicant short-term rental host shall list with the dwelling short-term rental on any hosting platform. Only a valid permit which has been assigned to the dwelling being offered, listed, advertised, or marketed as a short-term rental shall be listed on a hosting platform. Upon a valid permit's expiration, no person or entity shall offer, list, advertise or market a dwelling in violation of C.C.C. 598.02(A)(2)a short-term rental host shall immediately remove the short-term rental from being listed on any hosting platform and shall not engage in any short-term rental operations. Any person or entity found engaging in or to have engaged in conduct in violation of C.C.C. 598.02(A)(2) with an expired permit is subject to the penalties as provided for in C.C.C. 598.20.Those found to be operating with an expired permit are in violation of section 598.02(A)(2) and are subject to the penalties as provided for in section 598.15.\n(I)                     The License Section shall have the authority to deny a new or a renewal permit if any of the information required under this Section is reasonably determined to be insufficient.  \n(J)                     For purposes of this chapter, a hotel/motel or a short-term rental shall not be considered as a rooming house as defined under Chapter 4561, and vice versa. Any licensed hotel/motel or short-term rental shall not be issued a rooming house license, and vice versa. \n \n598.04 - Short-Term Rental Hosts and Hosting Platforms- Requirements \n \n(A) The short-term rental host shall provide to the Director one form of proof of identity, and two pieces of evidence that the dwelling is the host's primary residence and/or or two pieces of evidence the host is the owner of the dwelling.\n(B) (A) A valid One short-term rental permit shall be required for each dwelling approved as a short-term rental. \n(C) (B) A short-term rental host shall be either an owner or a permanent occupant. If a short-term rental host is not the property owner, but a permanent occupant of the dwelling, the host shall obtain permission from the property owner of the dwelling to register the dwelling on any hosting platform for use as a short-term rental. \n(D) (C) A Sshort-term rental hosts shall provide written notice to a the short-term rental guest(s) of any known, non-obvious, or concealed condition, whether man-made or artificial, which may present a danger to the short-term rental guest(s), and shall designate a local 24-hour emergency contact person for the short-term rental property. \n(E) (D) A Sshort-term rental hosts must comply with Section RC 2933.52 of the Revised Code. Such compliance shall also include known, non-obvious or concealed surveillance equipment, including, but not limited to, digital video cameras/recorders/monitors, streaming video security cameras, audio recorders/monitors, or any other electronic means of secretly watching, listening, or recording. In the event a short-term rental host utilizes an indoor and/or outdoor interception device(s), or any specific or similar aforementioned device, the short-term rental host shall notify the short-term rental guest. In the event the short-term rental guest does not consent to the short-term rental host utilizing an indoor interception device(s), or any specific or similar aforementioned device, for the duration of the short-term rental period, the short-term rental host shall immediately deactivate the indoor interception device(s) and shall not intercept, listen, monitor, record, or like thereof, any activity inside the short-term rental dwelling. \n(F) (E)                     A Sshort-term rental hosts shall comply with the city of Columbus short-term rental excise taxes as required by C.C.C. Chapter 371 of the Columbus City Code. \n(G)                     (1) A Rrentals for thirty (30) or more consecutive days by the same person(s) guest(s) are not subject to short-term rental regulations or short-term rental excise taxes. \n(H) All short-term rental hosts shall obtain liability insurance for each short-term rental. Each short-term rental shall at all times maintain the following insurance coverage meeting all of the following requirements: \n(1)A general liability insurance policy or certificate that shall provide the minimum coverage;\na.  Not less than three hundred thousand dollars ($300,000). Such policy or certificate must be issued by an insurance company that is admitted to do business in the state of Ohio or by an eligible surplus lines company or risk retention group. \nb. The policy or certificate shall provide notice of cancellation of insurance to the Director at least ten (10) days prior to cancellation.\nc. Any cancellation of insurance required by this section shall result in an automatic revocation of the respective short-term rental permit.\n(2) In the event that a hosting platform provides liability insurance to a host, such insurance would be deemed acceptable for submission provided the insurance meets the requirements of paragraph (1)(a) above. \n(I) (F) No person or entity short-term rental host shall offer, list, advertise or market a dwelling with five guestrooms or less, located within the city of Columbus, on an entity’s website, for which such entity is compensated for facilitating or providing for a mechanism for a transaction, to rent or reserve the dwelling, in whole or in part, for less than thirty (30) days, to another person ,engage in a short-term rental operation located within the city of Columbus without registering, listing, or accompanying the a valid short-term rental permit number, issued in accordance with this chapter and associated with the dwelling. short-term rental on any medium used by the short-term rental host to advertise the short-term rental. \n(J) (G)                     No entity, via the entity’s website, shall provide for or facilitate a mechanism for and collect a fee for, a transaction between an owner or permanent occupant and another person to rent or reserve, in whole or in part, booking services in connection with any a dwelling with five guestrooms or less,  short-term rental operation located within the city of Columbus, unless the owner or permanent occupant short-term rental host has registered or otherwise provided to the entity website a valid permit number, issued in accordance with this chapter and associated with the dwelling. \n \n(K) (H) Records required. \n(1) A Sshort-term rental hosts who engages in, conducts, or carries on a in short-term rentals, and a hosting platforms that engage provides for or facilitates a in booking services, shall maintain and provide, when requested, records documenting the following information: \n(a) a.  The short-term rental physical address; \n(b) b. The name of the person or entity who registered the short-term rental on the hosting platform or who listed the short-term rental using any medium on the hosting platform; and \n(c) c.  For each short-term rental guest, Tthe dates and duration of stay in a short-term rental, the number of persons who were scheduled to stay each night, and the daily rate charged for each short-term rental guest. \n(2) A Hhosting platforms and a short-term rental hosts shall retain records for a period of at least four (4) years. \n(3) In order to determine whether an applicant, short-term rental host or hosting platform is in compliance with the requirements of this Chapter, the Director may request that any records relevant to or of assistance in a compliance investigation, be provided for inspection. If such request is denied, the Director may seek an administrative search warrant from a court of competent jurisdiction authorizing said inspection. \n(L) (I) Nothing in this section shall be construed as permitting any person or entity to obtain a permit or offer, list, advertise, or market a short-term rental, where prohibited by any other provision of law. \n \n598.05 - Grounds for Denial, Revocation, or Suspension\n \n(A)  The Director shall issue a new permit, or grant the renewal of an existing permit, except as provided in divisions (B) or (C) of this section. \n(B) (A)                     The Director shall deny any application for a new permit or renewal of permit, or revoke or suspend a permit, if any of the following are shown to have occurred during the time of application or at the hotel/motel, or short-term rental address, property, or applicant’s dwelling: \n(1) The applicant makes a material misrepresentation of fact on the application or submits fraudulent, counterfeit, or false documentation; \n(2) The applicant or any owner of the hotel/motel or short-term rental has been convicted of violating sections 598.02(A)(1), 598.02(A)(2) or 598.08(B) of this chapter; \n(3) (2) Any applicant, owner, applicant, operator, or manager, of the hotel/motel or short-term rental host or property manager is shown to have been convicted of the act of prostitution or soliciting for prostitution, or an act that would constitute a violation of the Ohio Revised Code RC Chapters 2925 or 3719, on the premises of the hotel/motel or short-term rental in question, the applicant’s dwelling, or any hotel/motel, or short-term rental, or dwelling in which the applicant, owner, or short-term rental host that individual has any interest in, including, but not limited to, ownership, licensure, or management; \n(4) (3) The applicant or owner of the hotel/motel does not have a valid State of Ohio license as defined in Ohio Revised Code Section RC 3731.03; \n(5) (4) Applicant’s dwelling or Tthe property on which the hotel/motel or short-term rental is located is not in good standing with the City of Columbus Income Tax Division; \n(6) (5) The applicant or Tthe short-term rental host is not in good standing with the City of Columbus Income Tax Division. \n(C)(B)                     The Director may deny any application for a new permit, or renewal of permit, revoke or suspend a permit, if any of the following are shown to have occurred during the time of application or at the hotel/motel, or short-term rental, or applicant’s dwelling: \n(1) The applicant has been convicted of violating C.C.C. 598.02(A)(1) or C.C.C. 598.02(A)(2).\n(1) (2) The hotel/motel, or short-term rental, or applicant’s dwelling has outstanding orders from the Columbus Division of Fire that have not been corrected; \n(2) (3) A Ppattern of felony drug related activity; \n(3) (4) A Ppattern of prostitution related activity or evidence of human trafficking; \n(4)(5) A Ppattern of gang related activity as defined in Ohio Revised Code Section RC 2923.41; \n(6) A documented history or pattern at the hotel/motel, short-term rental, or applicant’s dwelling of repeated offenses of violence as defined in RC 2901.01;\n(7) The short-term rental host has a documented history of repeated offenses of violence as defined in RC 2901.01;\n(5) (8) The hotel/motel has a Ccalls for service ratio greater than 1.2 during a consecutive twelve-month period where at least one of the twelve months occurs within the calendar year in which an objection to the permit is lodged; \n(6)  The hotel/motel or short-term rental has a documented history of repeated offenses of violence as defined in Ohio Revised Code Section 2901.01; \n(9) The short-term rental or applicant’s dwelling has three (3) or more calls for service during a consecutive twelve-months where at least one of the twelve months occurs within the calendar year in which an objection to the permit is lodged;\n(7) (10) The applicant, Tthe owner, applicant, operator, or manager, or short-term rental host, or property manager has not made a good faith effort to correct violations of sections C.C.C. 598.05 or C.C.C. 598.1611 of this chapter, or has obstructed or interfered with correction of the violations; \n(8) (11) Any applicant, owner, applicant, operator, or manager, short-term rental host or property manager of the hotel/motel, or short-term rental host is shown to have engaged in the act of prostitution or soliciting for prostitution, or an act that would constitute a violation of the Ohio Revised Code RC Chapters 2925 or 3719, on the premises of the hotel/motel or short-term rental in question, the applicant’s dwelling, or any hotel/motel, or short-term rental, or dwelling in which the applicant, owner or short-term rental host that individual has any interest in, including, but not limited to, ownership, licensure, or management. \n(9) (12) An owner, manager, or operator of the hotel/motel, a short-term rental host, or a property manager, or applicant The applicant or any owner of the hotel/motel or short-term rental has hindered or prevented any inspection of the hotel/motel, or short-term rental, or applicant’s dwelling as authorized by C.C.C. 598.13; Chapter 501 of the Columbus City Code; \n(10)(13) The short-term rental or applicant’s dwelling has a documented history or of repeated conduct that endangers neighborhood safety or diminishes resident’s quality of life. This subdivision shall not apply to a hotel/motel. \n(14) Applicant’s dwelling or the short-term rental has a calls for service in relation to an allegation of a criminal violation of the C.C.C. or the RC \n(15) Applicant or the short-term rental host has been found guilty of maintaining a public nuisance under Title 47 or RC Chapter 3767 by a court of competent jurisdiction. \n(16) Applicant’s dwelling or the short-term rental has been declared a public nuisance under Title 47 or RC Chapter 3767 by a court of competent jurisdiction.\n(17) Applicant or the short-term rental host has not abated the public nuisance or complied with a notice of violations under Title 47. \n \n(D) (C) Evidence of conduct under divisions (BA) and (CB) of C.C.C. 598.05 this section need only be that of de facto violation of law, evidence of conviction is not a prerequisite for denial unless specifically indicated. \n \n598.06 - Objection to New or Renewal, Revocation and Suspension of Hotel/Motel or Short-Term Rental Permit \n \n(A)                     At any time during the calendar year, Tthe License Section may shall submit an objection to the Director with regards to a new permit application or a renewal application if it is determined that any ground activities set forth in divisions (B) or (C) of section C.C.C. 598.05(A) is are found or shown to have occurred and where at least one of the grounds occurred within the previous twelve months. at the hotel/motel or short-term rental. \n(B)                     At any time during the calendar year, the License Section may submit an objection to the Director with regards to a new permit application or a renewal application if it is determined that any ground set forth in C.C.C. 598.05(B) is found or shown to have occurred where at least one of the grounds occurred within the previous twelve months.\n(B) (C) At any time during the calendar year, Tthe License Section shall revoke and/or suspend a hotel/motel or short-term rental permit if it is determined that any ground activities set forth in divisions (BA) of section C.C.C. 598.05 is found or shown to have occurred where at least one of the grounds occurred after the permit’s issue date but before the permit’s expiration date. Prior to any action of suspension or revocation under C.C.C. 598.06(C), the License Section shall submit a Notice of Suspension or Notice of Revocation to the Director. at the hotel/motel or short-term rental. For short-term rentals, suspension, revocation and/or other penalties may occur if a unit is listed on a hosting platform without the required permit account number as required under section 598.03(E). \n(D) At any time during the calendar year, Tthe License Section may revoke and/or suspend a hotel/motel or short-term rental permit if it is determined that any ground activities set forth in divisions (B) of section C.C.C. 598.05 is found or shown to have occurred where at least one of the grounds occurred after the permit’s issue date but before the permit’s expiration date. Prior to any action of suspension or revocation under C.C.C. 598.06(D), the License Section shall submit a Notice of Suspension or Notice of Revocation to the Director.\n \n598.07 - Hearing, Appeals and Remedy Process \n \n(A)  Any person who has been denied, suspended, or refused a license or renewal of a license under this chapter may appeal such decision as provided in Chapter 505 of the City Code. \n(B)  Action to issue, revoke, suspend or renew a permit may be stayed should the property take specific steps to remediate problems outlined in the notice of revocation and suspension that include but are not limited to some of the following actions: \n(1)  Completion of approved safety and security training, and/or training to identify criminal activity such as human trafficking \n(2)  24 hour presence of special duty uniformed police or qualified security \n(3)  Installation of safety and security measures such as fencing, lighting, public space surveillance, etc. \n(4)  Voluntary sharing of guest information with law enforcement \n(5)  Voluntary participation in right-of-entry programs with law enforcement agencies \n(6)  Implementation of minimum age of 21 for check-in for lodging properties \n(7)  Requirement of use of valid credit card at check in \n(8)  And/or additional remediation actions as approved by the Director \n(C)  All potential remedies outlined in division () of this section must be approved by the Director. \n \n598.07 Notice of Denial, Revocation, or Suspension of Hotel/Motel or Short-Term Rental Permit\n \n(A)                     If the License Section denies a new or renewal permit under C.C.C. 598.03(I), the License Section shall provide a Notice of Denial to the applicant which shall list any and all grounds for such denial. Such Notice of Denial shall be provided no later than seven (7) calendar days from the date of denial.  \n(B)                     If a permit is automatically revoked under C.C.C. 598.14(C), the License Section shall provide a Notice of Revocation to the owner and the grounds for such revocation. The Notice of Revocation shall be provided within seven (7) calendar days from the date of a name change or notice to the License Section, whichever occurs earlier in date.\n(C)                     If the License Section denies a new or renewal permit under divisions (A) or (B) of C.C.C. 598.05, the License Section shall provide a Notice of Denial to the applicant which shall list any and all grounds for such denial. Such Notice of Denial shall be provided no later than seven (7) calendar days from the date of denial.\n(D)                     At a minimum of seven (7) calendar days prior to such action of revocation or suspension under C.C.C. 598.06(C) or (D), the License Section shall provide a Notice of Revocation or a Notice of Suspension to the hotel/motel manager or short-term rental host. The Notice of Revocation or Notice of Suspension shall list all grounds for which the permit is being revoked or suspended. \n(E)                     The Director shall make every reasonable effort to personally serve the hotel/motel manager or short-term rental host with any Notice of Revocation or Notice of Suspension.\n \n598.08 Emergency Revocation or Suspension of Short-Term Rental Permit\n \n(A)                     Whenever the Director determines that an emergency exists which requires immediate action of a revocation or suspension of a short-term rental permit to protect the public health and safety, the Director shall issue a written order to the short-term rental owner, short-term rental host, and/or permanent occupant, reciting the existence of such an emergency and requiring such action as the Director deems necessary be taken to meet the emergency.\n(B)                     Notwithstanding other provisions of this chapter, such order shall be effective immediately and shall be complied with immediately.\n(C)                     Additionally the Director shall make every reasonable effort to personally serve the short-term rental host with the written order.\n \n598.09 - Appeal Procedure and Stay Order\n \n(A) All persons aggrieved by an order of the Director or License Section denying the issuance or renewal of a permit or revoking or suspending a permit who wish to appeal such order, may appeal such order to the Board of Licensing Appeals and shall do so pursuant to the provisions of Chapter 505.\n(B)  All appeals shall be perfected in the following manner:\n(1)                     The appellant must file a written notice of appeal to the License Section on a form approved by the Board of Licensing Appeals within twenty (20) calendar days after receipt of the order from which the appellant appeals.\n(2)                     The appellant must deposit with the License Section a fee of thirty dollars ($30.00), which sum shall be refunded to the appellant only if the Board of Licensing Appeals renders a decision in appellant’s favor. Otherwise, the deposit shall be forfeited and placed into the general fund of the city.\n(3)                     Within five (5) days after receipt by the License Section of the notice of appeal, the License Section shall cause a true copy of the notice of appeal to be docketed with the chairperson of the Board of Licensing Appeals. \n(4)                     Within twenty (20) days after receipt by the chairperson of the notice of appeal or, if a stay order is issued pursuant to C.C.C. 505.07, then within sixty (60) days from the date of issuance of the stay order, the chairperson shall cause a meeting of the Board of Licensing Appeals to be convened for the purpose of hearing the appeal.\n(5)                     In the event an expedited appeal is required pursuant to an emergency revocation or suspension cited under C.C.C. 598.08(A), the chairperson shall cause a meeting of the Board of Licensing Appeals to be convened for the purpose of hearing the appeal to conform with the time limits therein.\na.                       The burden is on the appellee to prove by clear and convincing evidence that an emergency existed which required immediate action on the part of the Director. Appellant has no burden to prove there was not an emergency. \n(C) An appeal does not automatically operate as a stay of a revocation or suspension order by the Director or the License Section. If an appellant desires a stay of such order pending the outcome of the hearing, appellant must first apply in writing to the chairperson setting forth reasons for the stay. The chairperson may request the License Section to render, in writing, its views regarding the stay request. Within five (5) days after the receipt by the chairperson of the request for a stay, the chairperson shall render a decision on the request. If the chairperson determines that undue hardship to the appellant will result by not issuing a stay and no apparent harm will be caused to the citizens of the city by issuing a stay, a stay order, not to exceed sixty (60) days and pending the outcome of the hearing, will be granted.\n(D) In addition to the general review standards for a stay described in C.C.C. 598.09(C), an action to revoke or suspend a hotel/motel permit may be stayed should the property owner/operator take specific steps to remediate problems outlined in the notice of revocation or suspension that include, but are not limited to, some of the following actions: \n(1) Completion of approved safety and security training, and/or training to identify criminal activity such as human trafficking \n(2) 24 hour presence of special duty uniformed police or qualified security \n(3) Installation of safety and security measures such as fencing, lighting, public space surveillance, etc. \n(4) Voluntary sharing of guest information with law enforcement \n(5) Voluntary participation in right-of-entry programs with law enforcement agencies \n(6) Implementation of minimum age of 21 for check-in for lodging properties \n(7) Requirement of use of valid credit card at check in \n(8) And/or additional remediation actions as approved by the Director \n \n598.10 Hearing Process\n \n(A) All hearings shall proceed as in a trial of a civil action with the License Section having the burden of going forward. The License Section shall be limited to evidence relating to the reasons set forth in its order unless the Board of Licensing Appeals determines that justice to the citizens of the city requires other evidence to be admitted. \n(B) In all hearings, the Board of Licensing Appeals shall not be strictly bound by the rules of evidence. \n(C) All testimony shall be given under oath, to be administered by an officer authorized to administer oaths, and shall be recorded by a stenographer at a cost to the License Section. \n(D) All parties shall have the right to appear and be heard in person, or by legal counsel, to present their case. \n(E) All parties shall have the right to: \n(1)                     Offer and examine witnesses and present evidence in support of their case; and \n(2)                     Cross-examine adverse witnesses and offer evidence to refute evidence offered in opposition; and \n(3)                     Proffer evidence into the record if its admission has been denied.  \n \n598.11 Judicial Review\n \nThe appellant and the License Section may appeal from a decision of the Board of Licensing Appeals by perfecting such as provided in RC Chapter 2506. The cost of acquiring a transcript for such appeal shall be borne by the party seeking to appeal.\n \n598.1208 - Authority to Conduct Inspections \n \n(A) Upon display of the proper credentials, sworn officers excluded, any employee of the division of police, division of fire, department of building and zoning services, code enforcement division, or Columbus Public Health may be permitted to inspect the hotel/motel premises, or short-term rental, or applicant’s dwelling unit to ensure compliance with this cChapter. \n(B) If the request for inspection described in division (A) of this section is denied, any sworn officer or employee of the division of police, division of fire, department of building and zoning services, code enforcement division, or Columbus Public Health may seek an administrative search warrant from a court of competent jurisdiction authorizing said inspection. \n \n598.1309 - Transfer of Hotel/Motel or Short-Term Rental Permit Not Permitted \n \n(A) No permit issued under this cChapter shall be transferable or assignable to another person or entity., corporation, firm, partnership, association, organization or other group acting as a unit. \n(B) No permit issued under this cChapter shall be transferable or assignable to another hotel/motel name or franchise, or hotel/motel location or building, or short-term rental operation. \n(C) Any person or entity found to have transferred, assigned, or attempted to transfer or assign, a valid permit to another person or entity shall be subject to the penalty under C.C.C. 598.20(E). Such transfer or assignment shall cause the associated permit to be automatically revoked. \n \n \n598.140 - Discrimination Prohibited \n \n(A) An owner, permanent occupant, short-term rental host, or operator No person or entity shall not: \n(1) Decline a potential transient guest, transient guest, potential short-term rental guest, or short-term rental guest based on race, sex, sexual orientation, gender identity or expression, color, religion, ancestry, national origin, age, disability, familial status or military status;\n(2)  Impose any different terms or conditions based on race, sex, sexual orientation, gender identity or expression, color, religion, ancestry, national origin, age, disability, familial status or military status; \n(2) (3) Post any listing or make any statement that discourages or indicates a preference for or against any potential transient guest, transient guest, potential short-term rental guest, or short-term rental guest on account of race, sex, sexual orientation, gender identity or expression, color, religion, ancestry, national origin, age, disability, familial status or military status. \n \n598.151 - Display of Hotel/Motel or Short-Term Rental Permit \n \n(A) The hotel/motel manager or short-term rental shall maintain the valid permit on the hotel/motel premises. \n(B) The short-term rental host or property manager shall maintain and display the valid permit at the short-term rental.\n \n598.172 - Rules and Regulations \n \n(A) The Director may promulgate and enforce reasonable rules and regulations to carry out the intent of this cChapter in accordance with sections C.C.C. 501.05 and C.C.C. 501.06. of the Columbus City Codes. \n \n598.183 - Severability \n \n(A) In the event any section or provision of this cChapter shall be declared by a court of competent jurisdiction to be invalid or unconstitutional, such decision shall not affect the validity of this cChapter as a whole or any part thereof other than the part so declared to be invalid or unconstitutional. \n \n598.194 - Hotel/Motel Penalty\n \n(A) Whoever violates Any person or entity who engages in, conducts, or carries on, or permits to be engaged in, conducted, or carried on, in or upon any premises in the city of Columbus, the operation of a hotel/motel without obtaining a permit in violation of section C.C.C. 598.02(A)(1) of this chapter shall be guilty of a misdemeanor of the first degree. Anyone who has previously been convicted of or pleaded guilty to an offense under this section shall be guilty of a misdemeanor of the first degree, and shall serve no less than 30 days in jail. This is a strict liability offense. Any entity convicted under this section shall be subject to organizational criminal liability as contemplated by C.C.C. 2301.23. \n(B) Any person or entity who violates C.C.C. 598.16(A) shall be guilty of a minor misdemeanor. This is a strict liability offense. Any entity convicted under this section shall be subject to organizational criminal liability as contemplated by C.C.C. 2301.23.Whoever violates section 598.11(A) of this chapter shall be guilty of a minor misdemeanor. \n \n598.2015 - Short-Term Rental Penalty \n \n(A) Any person or entity who violates C.C.C. 598.04(F), shall be guilty of an unclassified misdemeanor and shall be fined not more than two hundred fifty dollars ($250.00). An offender who has been previously convicted of or pleaded guilty to a violation of C.C.C. 598.04(F) is guilty of a misdemeanor of the third degree.  Where a violation of C.C.C. 598.04(F) occurs in multiple listings, each listing shall constitute a separate offense. This is a strict liability offense. Any entity convicted under this section shall be subject to organizational criminal liability as contemplated by C.C.C. 2301.23. \n(B) Any entity that violates C.C.C. 598.04(G), without first correcting or remedying the violation in a reasonable and timely manner, shall be guilty of an unclassified misdemeanor and shall be fined not more than two hundred fifty dollars ($250.00). An offender who has been previously convicted of or pleaded guilty to a violation of C.C.C. 598.04(G) is guilty of a misdemeanor of the third degree.  Where a violation of C.C.C. 598.04(G) occurs in multiple short-term rentals, each violation shall constitute a separate offense. Any entity convicted under this section shall be subject to organizational criminal liability as contemplated by C.C.C. 2301.23.\n(C) Any person or entity who violates C.C.C. 598.02(A)(2) shall be guilty of an unclassified misdemeanor and shall be fined not more than two hundred fifty dollars ($250.00). An offender who has been previously convicted of or pleaded guilty to a violation of C.C.C. 598.02(A)(2) is guilty of a misdemeanor of the third degree.   In addition, all gross revenue or compensation from a reservation(s) or rental(s) that is obtained in violation of C.C.C. 598.02(A)(2) shall be remitted to the city of Columbus, subject to local and state laws governing forfeiture. This is a strict liability offense. Any entity convicted under this section shall be subject to organizational criminal liability as contemplated by C.C.C. 2301.23. \n(D) Any person or entity who violates C.C.C. 598.16(B) shall be guilty of a minor misdemeanor. This is a strict liability offense. Any entity convicted under this section shall be subject to organizational criminal liability as contemplated by C.C.C. 2301.23. \n(E) Any person or entity who violates C.C.C. 598.14(C) shall be guilty of a minor misdemeanor. This is a strict liability offense. Any entity convicted under this section shall be subject to organizational criminal liability as contemplated by C.C.C. 2301.23. \n \n \n(A) Any short-term rental host who rents a short-term rental for a short-term rental operation in violation of section 598.04(I), or any hosting platform that provides a booking service for short-term rental operations in violation of section 598.04(J), without correcting or remedying the violation in a reasonable and timely manner, shall be guilty of an unclassified minor misdemeanor and shall be fined not more than two hundred fifty dollars ($250.00). Upon subsequent conviction, the penalty shall be a misdemeanor of the third degree and a fine of not more than five hundred dollars ($500.00) or imprisonment for not more than sixty (60) days, or both, in addition to any other penalties as imposed by this chapter. Each dwelling rented for short-term rental operations shall constitute a separate offense. \n(B)  Any short-term rental host who rents a short-term rental for a short-term rental operation in violation of section 598.02(A)(2), without correcting or remedying the violation in a reasonable and timely manner, shall be guilty of an unclassified minor misdemeanor and shall be fined not more than two hundred fifty dollars ($250.00). In addition, all gross revenue from short-term rental transactions that are illegally obtained in violation of section 598.02(A)(2) shall be remitted to the city of Columbus, subject to local and state laws governing forfeiture. \n(C)  Whoever violates section 598.11(A) shall be guilty of a minor misdemeanor. \n \n598.21 Reserved\n \nSECTION 2. That the existing Chapter 598 is hereby repealed.\n \nSECTION 3.  That, for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage or approval by the Mayor or ten days after its passage if the Mayor neither approves nor vetoes the same",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 20,
    "meeting_date": "2021-07-12",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services",
      "Housing"
    ]
  }
}