{
  "success": true,
  "vote": {
    "id": 1453,
    "item_number": "CA-7",
    "title": "To authorize the Director of Finance and Management to execute a release of the 52-year ground lease, with the Franklin County Convention Facilities Authority; to execute a quit claim deed generally providing for the transfer of all of the City’s interest in the .572 acre parcel subject to a reservation of a reversionary interest in the event the property is no longer used as a hotel in connection to the Greater Columbus Convention Center and the reservation of an easement for existing public utilities, and easements, conditions, restrictions, and other matters of record, to the Franklin County Convention Facilities Authority; to enter into and execute other documents pertinent to such conveyance; to the extent applicable, to waive the requirements of Chapter 329.32 of Columbus City Code relating to the sale of city-owned real property; and to declare an emergency. ($0.00)",
    "description": "Explanation\n \nBackground: The following legislation authorizes the Director of Finance and Management to execute a termination of the 52-year ground lease, and to execute a quit claim deed to the Franklin County Convention Facilities Authority conveying title to the Hilton 2.0 Parcel, subject to the reservation of a reversionary interest in the event the property is no longer used as a hotel in connection to the Greater Columbus Convention Center and the reservation of an easement for existing public utilities; and to execute other pertinent documents.  It is in the City’s best interest to waive the requirements of Chapter 329.32 of the Columbus City Code relating to the sale of city-owned real property.\n \nFiscal Impact: No expenditure of funds by the City is required.\n \nEmergency Justification: Emergency legislation is requested to expedite development of the Hilton Columbus Downtown.\n \nTitle\n \nTo authorize the Director of Finance and Management to execute a release of the 52-year ground lease, with the Franklin County Convention Facilities Authority; to execute a quit claim deed generally providing for the transfer of all of the City’s interest in the .572 acre parcel subject to a reservation of a reversionary interest in the event the property is no longer used as a hotel in connection to the Greater Columbus Convention Center and the reservation of an easement for existing public utilities, and easements, conditions, restrictions, and other matters of record, to the Franklin County Convention Facilities Authority; to enter into and execute other documents pertinent to such conveyance; to the extent applicable, to waive the requirements of Chapter 329.32 of Columbus City Code relating to the sale of city-owned real property; and to declare an emergency. ($0.00)\n \nBody\n \nWHEREAS, the City owns fee interest in the 0.572-acre parcel of the real property identified as Franklin County Tax Parcel No. 010-300577, of record pursuant to Instrument No. 201912310175860, Franklin County Recorder’s Office (the “Hilton 2.0 Parcel”), and has previously ground leased such Hilton 2.0 Parcel to the Franklin County Convention Facilities Authority (“FCCFA”) for a term of 52-years; and\n \nWHEREAS, the FCCFA owns fee title in the adjacent real property parcel upon which the existing Hilton Columbus Downtown Hotel is constructed; and\n \nWHEREAS, to facilitate development of the Hilton 2.0 Parcel, to ensure unity of ownership between the existing Hilton Columbus Downtown Hotel and the Hilton Columbus Downtown Hotel expansion, and to permit future bond issuances related to capital improvement projects located on the Hilton 2.0 Parcel, the City desires to terminate the ground lease of the Hilton 2.0 to the FCCFA, and quit claim the City’s fee interest in the Hilton 2.0 Parcel to the FCCFA, subject to reservation of a reversionary interest in the event the property is no longer used as a hotel in connection to the Greater Columbus Convention Center and the reservation of an easement for existing public utilities, and easements, conditions, restrictions, and other matters of record; and\n \nWHEREAS, it is in the City’s best interest to waive City Code Chapter 329.32 relating to the sale of City-owned real property; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Finance and Management in that it is immediately necessary to authorize the Director to execute such documents in order to expedite the termination of the ground lease of the Hilton 2.0 Parcel to the FCCFA and quit claim the Hilton 2.0 Parcel to the FCCFA, all for the immediate preservation of the public health, peace, property, safety and welfare; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Finance and Management be, and hereby is, authorized to execute a termination of the 52-year ground lease with the Franklin County Convention Facilities Authority for the Hilton 2.0 Parcel, and any other agreement or document between the Franklin County Convention Facilities Authority or others that may be required or helpful in clearing title.\n \nSECTION 2.  That the Director of Finance and Management be and hereby is authorized to execute a quit claim deed and other necessary documents, as approved by the Department of Law, Real Estate Division, and providing generally for the quit claim of the City’s fee interest in the Hilton 2.0 Parcel, subject to a reservation of a reversionary interest in the event the property is no longer used as a hotel in connection to the Greater Columbus Convention Center and the reservation of an easement for existing public utilities, and easements, conditions, restrictions, and other matters of record.\n \nSECTION 3.                     That this Council has determined that it is in the best interest of the City to waive, and does hereby waive, the requirements of Columbus City Code Chapter 329.32 relating to the sale of City-owned real property to the extent that they may apply to this transaction and this Ordinance only.\n \nSECTION 4.                     That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves not vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 21,
    "meeting_date": "2021-07-19",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services",
      "Infrastructure",
      "Property & Real Estate"
    ]
  }
}