{
  "success": true,
  "vote": {
    "id": 1461,
    "item_number": "CA-15",
    "title": "To authorize the Director of Finance and Management to enter into a contract, on behalf of the Department of Public Safety, for the purchase of Conducted Electrical Weapons (CEWs) and supplies with Vance's Outdoors Inc. for the Division of Police from a State of Ohio Term Contract; and to authorize the expenditure of $162,600.07 from the General Fund. ($162,600.07)",
    "description": "Explanation\n \nBACKGROUND:  This ordinance authorizes a contract for the purchase of Conducted Electrical Weapons (CEWs) and supplies from Vance's Outdoor Inc., for the Division of Police in the amount of $162,600.07. The Department of Public Safety, Division of Police needs to establish a contract for the purchase of replacement Conducted Electrical Weapons (CEWs) and supplies.  The Division will be spending $77,390.50 on supplies and $85,209.57 on replacement CEWs and warranties. The CEWs will be purchased for replacements for SWAT personnel and for the K-9 unit personnel.  The Division of Police believes that only the Conducted Electrical Weapons manufactured by Taser International Inc., are acceptable due to public safety use, training, certification, and re-certification required for all police officers. There is only one supplier in the Ohio area authorized to sell Conducted Electrical Weapons (CEWs), cartridges, warranties, and accessories.  Taser International has stated that the only authorized dealer in Ohio is Vance's Outdoors Inc. This purchase by the City of Columbus is from a State of Ohio contract which is authorized by Ordinance 582-87 that allows for the cooperative purchasing between the State of Ohio Department of Administrative Services Cooperative Contracts and other government entities.\n \nThis company is not debarred according to the Federal excluded parties listing or prohibited from being awarded a contract according to the Auditor of State unresolved findings for recovery certified search.\n \nBid Information: A State of Ohio Term Contract exists for this purchase, Index #STS847 Contract #800551\n \n \nContract Compliance Number: CC009245 expires 04/22/2023\n \nFISCAL IMPACT:   This ordinance authorizes an expenditure of $162,600.07 from the General Fund for the purchase of Conducted Electrical Weapons (CEWs) and supplies from Vance's Outdoors Inc, which is budgeted and available within the 2021 Police General Fund.  $319,401.72 was encumbered/spent in 2019 for this purpose, $271,419.96 was encumbered/spent in 2018, and $213,745.95 was encumbered/spent in 2017.  \n \nTitle\n \nTo authorize the Director of Finance and Management to enter into a contract, on behalf of the Department of Public Safety, for the purchase of Conducted Electrical Weapons (CEWs) and supplies with Vance's Outdoors Inc. for the Division of Police from a State of Ohio Term Contract; and to authorize the expenditure of $162,600.07 from the General Fund. ($162,600.07)\n \nBody\n \nWHEREAS, the Division of Police needs to purchase Conducted Electrical Weapons (CEWs) and supplies; and,\n \nWHEREAS, Vance's Outdoors Inc. is the only authorized dealer in Ohio for Taser International; and,\n \nWHEREAS, a State of Ohio Term Contract established by the State of Ohio, Department of Administrative Services Purchasing Office exists for these purchases; \n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Safety to authorize the Finance and Management Director to enter into contract with Vance's Outdoors, Inc. for the purchase of Conducted Electrical Weapons (CEW's) and supplies in order to maintain sufficient inventory levels; now, therefore:\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Finance and Management Director, on behalf of the Department of Public Safety, be and is hereby authorized to enter into a contract with Vance's Outdoors Inc. for the option to purchase Conducted Electrical Weapons (CEWs) and supplies in accordance with the existing State of Ohio Term Contract established by the State of Ohio Purchasing Office with Vance’s Outdoors, the purchase from which was authorized by Ordinance 582-87.\n \nSECTION 2. That the expenditure of $162,600.07 or so much thereof as may be needed, is hereby authorized in the General Fund in Object Class 02 Supplies and Materials per the accounting codes in the spreadsheets attached to this ordinance.\n \nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance and to make any accounting changes necessary to ensure that this contract is properly accounted for and recorded accurately on the City's financial records.\n \nSECTION 4.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 21,
    "meeting_date": "2021-07-19",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}