{
  "success": true,
  "vote": {
    "id": 1481,
    "item_number": "CA-35",
    "title": "To authorize the Director of Public Utilities to enter into a professional engineering agreement with American Structurepoint Inc. for the Alum Creek Trunk - South (Phase 2) Rehabilitation Project; to amend the 2020 CIB and to authorize an expenditure of up to $869,024.86 from the Sanitary General Obligation Bond Fund. ($869,024.86 )",
    "description": "Explanation\n \nBACKGROUND: This project will provide for the rehabilitation of 8,918 lineal feet of 96” and 102” diameter reinforced concrete pipe and associated manholes via shotcrete rehabilitation methods.  The sewer to be rehabilitated is located approximately along the alignment of Alum Creek between Watkins Road and I-70.\n \nThe Community Planning Area is 64- Far South\n \nPROCUREMENT: The Department of Public Utilities advertised a Request for Proposals (RFP’s) for Alum Creek Trunk - South (Phase 2) Rehabilitation CIP #650725-100020 on the Vendor Services and Bonfire websites from April 26, 2021 to May 21, 2021.  The city received three (3) responses from the following firms:  American Structurepoint, DLZ, and Stantec.  All proposals were evaluated in accordance with Columbus City Code Title 3, Chapter 329.28, and were scored according to competence to perform, past performance, and understanding of the project approach.\n                \nMULTI-YEAR CONTRACT: The Department anticipates requesting additional future renewals to this contract. \n \nPROJECT TIMELINE: This contract is planned for renewals and will span multiple years, concluding in 2025. \n \nContract Compliance No.:  35-1127317 | MAJ | 7/16/2021| Vendor#: 007019\n \nEmergency Designation:  Emergency legislation is not requested at this time. \n \nEconomic Impact: This project will reduce the overall risk to the sanitary sewer collection system by rehabilitating one of the Division of Sewerage & Drainage’s most critical assets.  \n \nFiscal Impact: This contract requires an expenditure of up to $869,024.86 from the Sanitary General Obligation Bond Fund 6109 and amends the 2020 Capital Improvement Budget.\n \n \nTitle\n \nTo authorize the Director of Public Utilities to enter into a professional engineering agreement with American Structurepoint Inc. for the Alum Creek Trunk - South (Phase 2) Rehabilitation Project; to amend the 2020 CIB and to authorize an expenditure of up to $869,024.86 from the Sanitary General Obligation Bond Fund. ($869,024.86 )\n \nBody\n \nWHEREAS, the Department of Public Utilities advertised for Requests for Proposals for the Alum Creek Trunk - South (Phase 2) Rehabilitation Project; and\n \nWHEREAS, the Department of Public Utilities received three (3) proposals, American Structurepoint Inc., DLZ, and Stantec; and\n \nWHEREAS, all three proposals were evaluated and American Structurepoint, Inc. was determined to best meet the needs of the Department; and\n \nWHEREAS, it is necessary for the City to enter into a professional engineering agreement with American Structurepoint Inc. for the Alum Creek Trunk - South (Phase 2) Rehabilitation Project; and\n \nWHEREAS, it is necessary to authorize the expenditure of up to $869,024.86 from the Sanitary Sewer General Obligation Bond Fund 6109; and\nWHEREAS, it is necessary to amend the 2020 Capital Improvement Budget to align the authority with the expenditure; and\nWHEREAS, it has become necessary in the usual daily operation of the Division of Sewerage and Drainage, Department of Public Utilities, to authorize the Director to enter into a professional engineering agreement with American Structurepoint, Inc. for the Alum Creek Trunk - South (Phase 2) Rehabilitation Project, for the preservation of the public health, peace, property, safety and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Utilities is hereby authorized to enter into a professional engineering agreement with American Structurepoint, Inc. 2550 Corporate Exchange Drive, Suite 300 Columbus, Ohio 43231, in accordance with the terms and conditions as shown in the contract modification on file in the office of the Division of Sewerage and Drainage.\n \nSECTION 2. That the City Auditor is hereby authorized to expend up to $869,024.86 from the Sanitary General Obligation Bond Fund 6109, per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That the 2020 Capital Improvement Budget is hereby amended per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That said firm, American Structurepoint, Inc., shall conduct the work to the satisfaction of the Director of Public Utilities and the Administrator of the Division of Sewerage and Drainage.\n \nSECTION 5.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6. That the City Auditor is hereby authorized and directed to transfer any unencumbered balance in the project account to the unallocated balance within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies no longer required for said project; except that no transfer shall be made from a project account by monies from more than one source.\n \nSECTION 7. That the City Auditor is authorized to establish proper project accounting numbers as appropriate.\n \nSECTION 8.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this Ordinance.\n \nSECTION 9.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 21,
    "meeting_date": "2021-07-19",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}