{
  "success": true,
  "vote": {
    "id": 1497,
    "item_number": "CA-51",
    "title": "To appropriate funds within the Community Development Act Fund; to authorize the Director of Public Service to enter into a professional services contract with Woolpert, Inc. for the Columbus Housing Initiatives - Wheatland Avenue Improvements project; to authorize the expenditure of up to $550,000.00 from the Community Development Act Fund to pay for this contract; and to declare an emergency. ($550,000.00)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Service to enter into professional services contracts with Woolpert, Inc. in the amount of up to $550,000.00 for the Columbus Housing Initiatives - Wheatland Avenue Improvements project.\n \nThe intent of this project is to provide the City of Columbus, Department of Public Service, additional engineering and related services necessary to produce construction plans and associated deliverables for improvements to North Wheatland Avenue from Broad Street to Glenview Boulevard. Improvements will generally consist of converting the roadway to two-way traffic and needed widening to provide for a parking lane on the west side. Improvements will consist of new curbs, sidewalks, storm sewer, electric distribution relocation, and street lighting.\n \nThe Community Development Block Grant (CDBG) Entitlement Program provides annual grants on a formula basis to entitled cities and counties to develop viable urban communities by providing decent housing and a suitable living environment, and by expanding economic opportunities, principally for low- and moderate-income persons.  The amount budgeted for this project has increased past the twenty percent threshold, therefore, the City of Columbus will hold a 30 day public comment period and will submit a Substantial Amendment to the U.S. Department of Housing and Urban Development in order to increase the funding amount budgeted in City’s 2021 Action Plan for the FY 2021 Community Development Block Grant Wheatland Avenue Street Improvements Design Activity and Wheatland Farm Complex Project.\nThe Department of Public Service, Office of Support Services, solicited Requests for Proposals for the Columbus Housing Initiatives - Wheatland Avenue Improvements contract.  The project was formally advertised on the Vendor Services and Bonfire web sites from April 27, 2021, to May 18, 2021.  The City received three (3) responses.  All proposals were deemed responsive and were fully evaluated when the Evaluation Committee met on May 26, 2021.  The responding firms were:  \nCompany Name                                                      City/State            Majority/MBE/MBR/F1/AS1/PHC\nWoolpert, Inc.                                                                                                         Columbus, OH                                                                MAJ\nCrawford, Murphy & Tilly                                                               Columbus, OH                                                                MAJ\nDynotec                                                                                                         Columbus, OH                                                               MBE\n \nWoolpert, Inc. received the highest score by the evaluation committee and will be awarded the Columbus Housing Initiatives - Wheatland Avenue Improvements contract.  \n \nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against Woolpert, Inc.\n \n2.  CONTRACT COMPLIANCE\nWoolpert, Inc.’s contract compliance number is CC001040 and expires 04/15/2023.  \n \n3.  FISCAL IMPACT\nA reimbursable grant in the Community Development Act Fund, Fund 2248, provided by the U.S. Department of Housing and Urban Development (HUD), is available for this project. Funds will need to be appropriated.\n \n4. EMERGENCY DESIGNATION\nEmergency action is requested to expedite this contract to complete the project in a timely manner, to ensure the safety of the travelling public.\n \nTitle\nTo appropriate funds within the Community Development Act Fund; to authorize the Director of Public Service to enter into a professional services contract with Woolpert, Inc. for the Columbus Housing Initiatives - Wheatland Avenue Improvements project; to authorize the expenditure of up to $550,000.00 from the Community Development Act Fund to pay for this contract; and to declare an emergency. ($550,000.00)\n \nBody\n \nWHEREAS, there is a need to enter into a professional services contract to provide for engineering and related services necessary to produce construction plans and associated deliverables for improvements to North Wheatland Avenue from Broad Street to Glenview Boulevard; and\n \nWHEREAS, the Department of Public Service, Office of Support Services, solicited Requests for Proposals for the Columbus Housing Initiatives - Wheatland Avenue Improvements project; and\n \nWHEREAS, Woolpert, Inc. submitted the best overall proposal for this project; and\n \nWHEREAS, it is necessary to enter into a contract with Woolpert, Inc. for the provision of professional engineering consulting services described above in the amount of up to $550,000.00; and\n \nWHEREAS, funding is available for this project through a reimbursable grant in Fund 2248, the Community Development Act Fund, provided by the United States Department of Housing and Urban Development; and\n \nWHEREAS, a 30 day public comment period will be held and a Substantial Amendment to the U.S. Department of Housing and Urban Development will be submitted in order to increase the funding amount budgeted in City’s 2021 Action Plan for the FY 2021 Community Development Block Grant Wheatland Avenue Street Improvements Design Activity and Wheatland Farm Complex Project; and\n \nWHEREAS, funds must be appropriated within the Community Development Act Fund, Fund 2248; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to authorize the Director of Public Service to enter into contract with Woolpert, Inc. in order to provide funding for the Columbus Housing Initiatives - Wheatland Avenue Improvements so that upcoming construction projects may be governed by updated standards, policies, and practices as soon as possible, to ensure the safety of the travelling public thereby preserving the public health, peace, property, safety and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2021, the sum of $550,000.00 is appropriated in Fund 2248 (Community Development Act Fund), Dept-Div 5912 (Design and Construction), in Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\nSECTION 2.  That the Director of Public Service be, and hereby is, authorized to enter into a professional services contract with Woolpert, Inc. located at One Easton Oval, Suite 400, Columbus, Ohio  43219, for the Columbus Housing Initiatives - Wheatland Avenue Improvements project in an amount up to $550,000.00.\n \nSECTION 3.  That the expenditure of $550,000.00, or so much thereof as may be needed, is hereby authorized in Fund 2248 (Community Development Act Fund), Dept-Div 5912 (Design and Construction), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 7.  That, at the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements.\n \nSECTION 8.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 21,
    "meeting_date": "2021-07-19",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}