{
  "success": true,
  "vote": {
    "id": 1511,
    "item_number": "CA-65",
    "title": "To authorize the Director of the Department of Development to amend the Enterprise Zone Agreement for Assignment and Assumption with Montwards, LLC, to remove Montwards, LLC as ENTERPRISE and party to the AGREEMENT and to be replaced with MI-Columbus Owner, LLC as ENTERPRISE and party to the AGREEMENT; and to declare an emergency.",
    "description": "Explanation\nBACKGROUND: Columbus City Council (“COUNCIL”), by Ordinance No. 1650-2019, passed July 22, 2019, authorized the City of Columbus (“CITY”) to enter into an Enterprise Zone Agreement (the “AGREEMENT”) with Montwards, LLC (the “ENTERPRISE”) for a tax abatement of seventy-five percent (75%) for a period of ten (10) consecutive years in consideration of a proposed total capital investment of roughly $12,000,000 in real property improvements and the creation of four (4) net new permanent full-time positions with an associated annual payroll of approximately $124,800 related to the construction of a new 300,000-square foot speculative distribution and warehouse facility (the “PROJECT”) located at 510 Sunbury Road, Columbus Ohio 43219 (formerly known as 525 N. Nelson Road), parcel number 010-190006 (the “PROJECT SITE”), within the City of Columbus Enterprise Zone.  The AGREEMENT was made and entered into effective October 31, 2019 (Zone #023-19-12) with this PROJECT expected to begin December 2019 with all real property improvements expected to be completed by December 2021, with the abatement to begin no later than 2022 nor extend beyond 2031.  \n \nIn a letter received by the CITY on behalf of the ENTERPRISE dated June 15, 2021 and through ensuing correspondence, it was confirmed that MI-Columbus Owner, LLC had acquired ownership of the PROJECT SITE from Montwards, LLC on June 1, 2021, and the transfer of ownership is in the process of being recorded by the County Auditor.  Due diligence has been undertaken by the CITY in that MI-Columbus Owner, LLC has agreed to fully assume the terms and commitments of the ENTERPRISE pursuant to the AGREEMENT, has submitted an updated Economic Development Incentive Application and that this application and all other pertinent information has been reviewed and vetted.\n \nFollowing the recorded transfer of ownership, this legislation is to authorize the Director of the Department of Development to amend the AGREEMENT for the first time for Assignment & Assumption to remove Montwards, LLC as ENTERPRISE and party to the AGREEMENT and to be replaced with MI-Columbus Owner, LLC as ENTERPRISE and party to the AGREEMENT, whereby MI-Columbus Owner, LLC will assume the terms and commitments of the AGREEMENT.\n \nThis legislation is being presented as an emergency measure in order for this amendment to be legislated in as expedient a manner as possible so that this amendment to the AGREEMENT might be fully executed with the current property owner, which will allow the ENTERPRISE to remain in compliance and receive any future tax savings from the proposed abatement.\n \nFISCAL IMPACT: No funding is required for this legislation.\n \nTitle\nTo authorize the Director of the Department of Development to amend the Enterprise Zone Agreement for Assignment and Assumption with Montwards, LLC, to remove Montwards, LLC as ENTERPRISE and party to the AGREEMENT and to be replaced with MI-Columbus Owner, LLC as ENTERPRISE and party to the AGREEMENT; and to declare an emergency.\n \nBody\nWHEREAS, the City of Columbus (“CITY”) entered into an Enterprise Zone Agreement (the “AGREEMENT”) with Montwards, LLC and was approved by Columbus City Council (“COUNCIL”) on July 22, 2019 by Ordinance No. 1650-2019 with this AGREEMENT made and entered into effective October 31, 2019; and\n \nWHEREAS, the AGREEMENT granted a 75%/10-Year tax abatement on real property improvements; and\n \nWHEREAS, the incentive was granted in consideration of a total capital investment of approximately $12,000,000 in real property improvements and the creation of four (4) net new full-time permanent positions with an annual payroll of approximately $124,800 related to the construction of a new 300,000-square-foot speculative distribution and warehouse facility (the “PROJECT”) located at 510 Sunbury Road, Columbus, Ohio 43219 (formerly known as 525 N. Nelson Road), parcel number 010-190006 (the “PROJECT SITE”), within the City of Columbus Enterprise Zone.  The AGREEMENT was made and entered into effective October 31, 2019 (Agreement #023-19-12) with this PROJECT expected to begin December 2019 with all real property improvements expected to be completed by December 2021, with the abatement to begin no later than 2022 nor extend beyond 2031; and  \n \nWHEREAS, in a letter received by the CITY on behalf of the ENTERPRISE dated June 15, 2021 and through ensuing correspondence, it was confirmed that MI-Columbus Owner, LLC had acquired ownership of the PROJECT SITE from Montwards, LLC on June 1, 2021; and\n \nWHEREAS, due diligence has been undertaken by the CITY in that MI-Columbus Owner, LLC has agreed to fully assume the terms and commitments of the ENTERPRISE pursuant to the AGREEMENT, has submitted an updated Economic Development Incentive Application and that this application and all other pertinent information has been reviewed and vetted; and\n \nWHEREAS, an amendment for Assignment and Assumption is needed to remove Montwards, LLC as ENTERPRISE and party to the AGREEMENT and to be replaced with MI-Columbus Owner, LLC as ENTERPRISE and party to the AGREEMENT; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Columbus Department of Development in that it is immediately necessary to seek an Amendment for Assignment and Assumption to the AGREEMENT with Montwards, LLC for the purpose of removing Montwards, LLC as ENTERPRISE and party to the AGREEMENT to be replaced by MI-Columbus Owner, LLC as ENTERPRISE and party to the AGREEMENT; thereby preserving the public health, peace, property and safety, NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSection 1.                     That following the recorded transfer of ownership, the Director of the Department of Development is hereby authorized to amend the Enterprise Zone Agreement for Assignment and Assumption with Montwards, LLC to remove Montwards, LLC as ENTERPRISE and party to the AGREEMENT to be replaced by MI-Columbus Owner, LLC as ENTERPRISE and party to the AGREEMENT, MI-Columbus Owner, LLC will assume the terms and commitments of the AGREEMENT.\n \nSection 2.                     That this FIRST AMENDMENT for Assignment and Assumption to the City of Columbus Enterprise Zone Agreement be signed by MI-Columbus Owner, LLC within ninety (90) days of passage of this ordinance, or this ordinance and the incentive authorized herein shall be null and void.\n \nSection 3.                     That for reasons stated in the preamble hereto, which is hereby made a part hereof, the ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after the passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 21,
    "meeting_date": "2021-07-19",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Economic Development",
      "Emergency Services"
    ]
  }
}