{
  "success": true,
  "vote": {
    "id": 1518,
    "item_number": "CA-72",
    "title": "To accept Memorandum of Understanding (MOU) #2021-01 and MOU #2021-02 executed between representatives of the City and Fraternal Order of Police, Ohio Labor Council Inc., which temporarily adds one additional Personal Business Day for the year 2021 and adds Juneteenth (June 19) as an observed holiday beginning in 2022; and to declare an emergency.",
    "description": "Explanation\n \nThe Collective Bargaining Contract dated June 16, 2017 through June 15, 2020, extended by mutual agreement through August 31, 2021, between the City and the Fraternal Order of Police, Ohio Labor Council Inc. (OLC), requires that any modifications to the Contract be agreed to in writing by the parties.  Memorandum of Understanding (MOU) #2021-01 and MOU #2021-02 have been executed by the parties. MOU #2021-01 amends Article 22 of the Agreement by temporarily adding one additional Personal Business Day to use in the year 2021, which will expire in January of 2022. MOU #2021-02 amends Article 18 of the Contract by adding Juneteenth (June 19) as an observed holiday beginning in 2022.  \n \nThe passage of this ordinance indicates City Council’s acceptance of MOU #2021-01 and MOU #2021-02, copies of which are attached hereto.\n \nEmergency action is recommended in order to allow for expedient implementation.\n \n \nTitle\n \nTo accept Memorandum of Understanding (MOU) #2021-01 and MOU #2021-02 executed between representatives of the City and Fraternal Order of Police, Ohio Labor Council Inc., which temporarily adds one additional Personal Business Day for the year 2021 and adds Juneteenth (June 19) as an observed holiday beginning in 2022; and to declare an emergency.\n \n \nBody\n \nWHEREAS, representatives of the City and the OLC entered into Memorandum of Understanding (MOU) #2021-01 and MOU #2021-02, copies of which are attached hereto, which amend the Contract between the City and the Fraternal Order of Police, Ohio Labor Council, Inc., dated June 16, 2017 through June 15, 2020, extended by mutual agreement through August 31, 2021, by temporarily adding one additional Personal Business Day to use in the year 2021 that will expire in January of 2022 and establishing Juneteenth (June 19) as an observed holiday beginning in 2022; and\n \nWHEREAS, emergency action is recommended in order to implement the terms of the MOUs in a timely manner; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Human Resources in that it is immediately necessary to amend the Contract between the City and the OLC by accepting MOU #2021-01 and MOU #2021-02; thereby preserving the public peace, property, health, safety, and welfare; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That Memorandum of Understanding (MOU) #2021-01 and MOU #2021-02 amends the Contract between the City and the OLC, June 16, 2017 through June 15, 2020, extended by mutual agreement through August 31, 2021.\n \nSECTION 2.  That City Council, in the best interests of the City, hereby, recognizes and accepts MOU #2021-01 and MOU #2021-02, copies of which are attached hereto, executed between representatives of the City and the OLC.\n \nSECTION 3.   That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure, and shall take effect and be in force from and after its passage and approval by the Mayor, or ten (10) days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 21,
    "meeting_date": "2021-07-19",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}