{
  "success": true,
  "vote": {
    "id": 1531,
    "item_number": "SR-5",
    "title": "To authorize the Director of Public Utilities to enter into a construction contract with Elite Excavating Co. of Ohio, Inc. for the Old Beechwold Area Stormwater System Improvements Blueprint Integrated Solutions, Water Line & Roadway Improvements Project in an amount up to $6,948,336.60; to authorize the appropriation and transfer of $3,605,295.54 from the Storm Sewer Reserve Fund - Fund No. 6207 to the OWDA Storm Sewer Loan Fund - Fund No. 6211; to authorize the appropriation and transfer of $2,459,011.92 from the Water System Reserve Fund - Fund No. 6003 to the Water Supply Revolving Loan Account Fund - Fund No. 6011; to authorize the appropriation and expenditure of $3,605,295.54 from the OWDA Storm Sewer Loan Fund - Fund No. 6211; to authorize the appropriation and expenditure of $2,459,011.92 from the Water Supply Revolving Loan Account Fund - Fund No. 6011; to authorize an expenditure up to $1,000.00 within the Stormwater General Obligations Voted Bonds Fund - Fund No. 6204; to authorize an expenditure up to $1,000.00 within the Water General Obligations Voted Bonds Fund - Fund No. 6006; to authorize the transfer of cash and appropriation between projects within the Streets and Highways Bond Fund - Fund No. 7704; to authorize the expenditure of up $884,029.14 within the Streets and Highways Bond Fund - Fund No. 7704; and to amend the 2020 Capital Improvements Budget.  ($6,950,336.60)",
    "description": "Explanation\n \nBACKGROUND:  This legislation authorizes the Director of Public Utilities to enter into a construction contract with Elite Excavating Co. of Ohio, Inc. for the Old Beechwold Area Stormwater System Improvements Blueprint Integrated Solutions, Water Line & Roadway Improvements Project, CIP No’s 610804-100001, 690236-100140, and 530282-100017, in an amount up to $6,948,336.60.  This is a joint project between the Departments of Public Utilities and Public Service.\n \nWork consists of constructing approximately 9200 LF of 12” to 30” storm sewer and appurtenances, 2 bioretention basins, approximately 9400 LF of 6”-8” water main and appurtenances, roadway improvements, and other such work as may be necessary to complete the contract, in accordance with the drawings.\n \nThe Community Planning Area is “39 - Clintonville”.\n \nThis project has been approved for below market-rate loan financing through the Ohio Environmental Protection Agency’s Water Pollution Control Loan Fund (WPCLF) and Water Supply Revolving Loan Account (WSRLA) Fund which are administered by the Ohio Water Development Authority (OWDA).  The loan award is expected in July 2021.  Federal Davis-Bacon Wage Rates and Requirements will apply.\n \nFunds in the amount of $2,000.00 will also be encumbered for prevailing wage services from the Department of Public Service.\n \nTHE PROJECT TIMELINE: All work except the Period of Establishment Season 1 and Season 2 shall be substantially completed in a manner acceptable to the City within 12 months after the date of the Notice to Proceed.\n \nCONSTRUCTION CONTRACT AWARD:  The Director of Public Utilities publicly opened six (6) bids on May 12, 2021 from Elite Excavating Co. of Ohio, Underground Utilities, Complete General Construction Co., Shelly & Sands, Conie Construction Co., and John Eramo & Sons.\n \nElite Excavating’s bid was deemed the lowest, best, most responsive and responsible bid in the amount of $6,948,336.60.  Their Contract Compliance Number is 20-1643186 (expires 2/4/22, Majority) and their DAX Vendor No. is 1064.  Additional information regarding all bidders, description of work, contract time frame, and detailed amounts can be found on the attached Information form.\n \nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against Elite Excavating Co. of Ohio, Inc.\n \nPRE-QUALIFICATION STATUS: Elite Excavating Co. of Ohio and all proposed subcontractors have met code requirements with respect to pre-qualification, pursuant to relevant sections of Columbus City Code Chapter 329.  \n \nECONOMIC/ENVIRONMENTAL IMPACT:  \nThis project will install storm infrastructure to mitigate street and yard flooding that occurs in the Old Beechwold Historic Neighborhood located within Clintonville planning area.  Two regional biobasins will be constructed to capture and treat non-point source stormwater runoff to improve water quality within the receiving streams. \n \nThe project will also replace existing 6-inch and 8-inch water lines that have a high break frequency.  Replacement of these water lines will improve water service, decrease burden on water maintenance operations, and reduce water loss.  \n \nStreets within the project area will be repaved as part of the project.  \n \nSeveral meetings were held with the Old Beechwold Association to solicit input during project design.\n \nFISCAL IMPACT: Funding for this project will come from the OWDA Storm Sewer Loan Fund - Fund No. 6211 and Water OWDA (WSRLA) Loan Funds, the Stormwater and Water G.O. Bonds Funds, and the Streets and Highways Bond Fund, Fund 7704.\n \nAn appropriation and transfer of funds from the Storm Sewer Reserve Fund - Fund No. 6207 to the OWDA Storm Sewer Loan Fund - Fund No. 6211 will be needed.  \n \nAn appropriation and transfer of funds from the Water System Reserve Fund - Fund No. 6003 to the Water Supply Revolving Loan Account Fund - Fund No. 6011 will be needed.  \n \nThese are temporary transactions that are required until the Division is able to execute OWDA Loan Funds and reimburse the Storm Sewer and Water System Reserve Funds.  The loans are expected to be approved in July 2021.  \n \nThere is sufficient cash and budgetary authority within the Water G.O. Bonds Fund - Fund No. 6006 and within the Water Supply Revolving Loan Account Fund - Fund No. 6011.\n \nThere is sufficient cash and budgetary authority within the Storm Sewer G.O. Bonds Fund - Fund No. 6204.\n \nThere is sufficient cash and budgetary authority within the Streets and Highways Bond Fund, Fund 7704, for this expenditure.  It is necessary to amend the 2020 Capital Improvements Budget to align budget authority with the proper project.  A transfer of cash and appropriation between projects within the Streets and Highways Bond Fund is also needed to move cash and appropriation to the correct project.  \n \nAn amendment to the 2020 Capital Improvements Budget for the OWDA Storm Sewer Loan Fund - Fund No. 6211 will be necessary.\n \n \nTitle\n \nTo authorize the Director of Public Utilities to enter into a construction contract with Elite Excavating Co. of Ohio, Inc. for the Old Beechwold Area Stormwater System Improvements Blueprint Integrated Solutions, Water Line & Roadway Improvements Project in an amount up to $6,948,336.60; to authorize the appropriation and transfer of $3,605,295.54 from the Storm Sewer Reserve Fund - Fund No. 6207 to the OWDA Storm Sewer Loan Fund - Fund No. 6211; to authorize the appropriation and transfer of $2,459,011.92 from the Water System Reserve Fund - Fund No. 6003 to the Water Supply Revolving Loan Account Fund - Fund No. 6011; to authorize the appropriation and expenditure of $3,605,295.54 from the OWDA Storm Sewer Loan Fund - Fund No. 6211; to authorize the appropriation and expenditure of $2,459,011.92 from the Water Supply Revolving Loan Account Fund - Fund No. 6011; to authorize an expenditure up to $1,000.00 within the Stormwater General Obligations Voted Bonds Fund - Fund No. 6204; to authorize an expenditure up to $1,000.00 within the Water General Obligations Voted Bonds Fund - Fund No. 6006; to authorize the transfer of cash and appropriation between projects within the Streets and Highways Bond Fund - Fund No. 7704; to authorize the expenditure of up $884,029.14 within the Streets and Highways Bond Fund - Fund No. 7704; and to amend the 2020 Capital Improvements Budget.  ($6,950,336.60)\n \nBody\n \nWHEREAS, six (6) bids for the Old Beechwold Area Stormwater System Improvements Blueprint Integrated Solutions, Water Line & Roadway Improvements Project were received and publicly opened in the offices of the Director of Public Utilities on May 12, 2021; and\n \nWHEREAS, the lowest, best, most responsive and responsible bid was from Elite Excavating Co. of Ohio, Inc. in the amount of $6,948,336.60; and\n \nWHEREAS, it is necessary to authorize the Director of the Department of Public Utilities to award and execute a construction contract with Elite Excavating Co. of Ohio, Inc. and to encumber and expend funds to provide for payment of construction inspection and prevailing wage charges for the Division of Sewerage and Drainage’s Old Beechwold Area Stormwater System Improvements Blueprint Integrated Solutions, Water Line & Roadway Improvements Project; and \n \nWHEREAS, it is necessary to appropriate funds from the Storm Sewer Reserve Fund - Fund No. 6207 and to authorize the transfer of said funds to the OWDA Storm Sewer Loan Fund - Fund No. 6211 in order to temporarily fund this expenditure until such time as the City receives loan proceeds for the above stated purpose and reimburse the Storm Sewer Reserve Fund - Fund No. 6207; and\n \nWHEREAS, it is necessary to appropriate funds from the Water System Reserve Fund - Fund 6003 and to authorize the transfer of said funds to the Water Supply Revolving Loan Account Fund - Fund No. 6011 in order to temporarily fund this expenditure until such time as the City receives loan proceeds for the above stated purpose and reimburse the Water System Reserve Fund - Fund No. 6003; and\n \nWHEREAS, the City anticipates incurring certain Original Expenditures as defined in Section 1.150-2(c) of the Treasury Regulations (the “Treasury Regulations” promulgated pursuant to the Internal Revenue Code of 1986, as amended) with respect to the construction of the Project described in this Ordinance (collectively, the “Project”); and\n \nWHEREAS, it is necessary to authorize expenditures within the OWDA Storm Sewer Loan Fund - Fund No. 6211 and the Storm Sewer G.O. Voted Bonds Fund - Fund No. 6204; and\n \nWHEREAS, it is necessary to authorize expenditures within the Water Supply Revolving Loan Account Fund - Fund No. 6011 and the Water G.O. Voted Bonds Fund - Fund No. 6006; and  \n \nWHEREAS, it is necessary to transfer cash and appropriation between projects within the Streets and Highways Bond Fund, Fund 7704; and\n \nWHEREAS, it is necessary to authorize expenditures within the Streets and Highways Bond Fund - Fund 7704; and\n \nWHEREAS, it is necessary to authorize an amendment to the 2020 Capital Improvements Budget for the purpose of providing sufficient spending authority for the aforementioned project expenditures; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities, Division of Sewerage and Drainage, to authorize the Director of Public Utilities to enter into a construction contract with Elite Excavating Co. of Ohio, Inc. for the Old Beechwold Area Stormwater System Improvements Blueprint Integrated Solutions, Water Line & Roadway Improvements Project; for the preservation of the public health, peace, property, safety; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Utilities is hereby authorized to enter into a construction contract with Elite Excavating Co. of Ohio, Inc., 4500 Snodgrass Rd., Mansfield, OH 44903; for the Old Beechwold Area Stormwater System Improvements Blueprint Integrated Solutions, Water Line & Roadway Improvements Project, in accordance with the terms and conditions as shown in the agreement on file in the office of the Division of Sewerage and Drainage in an amount up to $6,948,336.60; and to obtain the necessary prevailing wage services from the Department of Public Services up to a maximum amount of $2,000.00.\n \nSECTION 2.  That from the unappropriated monies in the Storm Sewer Reserve Fund - Fund No. 6207 and from all monies estimated to come into said fund from any and all sources, and unappropriated for any other purpose during the fiscal year ending December 31, 2021, the sum of $3,605,295.54 is appropriated in Fund 6207, per the account codes in the funding attachment to this ordinance.\n \nSECTION 3.  That from the unappropriated monies in the Water System Reserve Fund - Fund No. 6003 and from all monies estimated to come into said fund from any and all sources, and unappropriated for any other purpose during the fiscal year ending December 31, 2021, the sum of $2,459,011.92 is appropriated in Fund 6003, per the account codes in the funding attachment to this ordinance.\n \nSECTION 4. That the transfer of $3,605,295.54 or so much thereof as may be needed, is hereby authorized between the Storm Sewer Reserve Fund - Fund No. 6207 and the OWDA Storm Sewer Loan Fund - Fund No. 6211, per the accounting codes in the attachment to this ordinance. \n \nSECTION 5.  That the transfer of $2,459,011.92 or so much thereof as may be needed, is hereby authorized within the Water System Reserve Fund - Fund No. 6003 and the Water Supply Revolving Loan Account Fund - Fund No. 6011, per the accounting codes in the attachment to this ordinance.\n \nSECTION 6.  That the transfer of $884,029.14, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5912 (Design and Construction), Project P530161-100151 (Roadway Improvements - Scioto Peninsula), Object Class 06 (Capital Outlay) to Dept-Div 5911 (Infrastructure Management), Project P530282-100119 (Resurfacing - Olde Beechwold Area), Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\n \nSECTION 7.  That the expenditure of $884,029.14, or so much thereof as may be needed, is hereby authorized in Fund 7704 (Streets and Highways Bond Fund), Dept-Div 5911 (Infrastructure Management), Project P530282-100119 (Resurfacing - Olde Beechwold Area), Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 8. That the expenditure up to $6,950,336.60, or so much thereof as may be needed, is hereby authorized per the accounting codes in the attachment to this ordinance.\n \nSECTION 9.  That the 2020 Capital Improvements Budget is hereby amended, per the accounting codes in the attachment to this ordinance.\n \nSECTION 10. That the said company, Elite Excavating Co. of Ohio, Inc., shall perform the work to the satisfaction of the Directors of Public Utilities and Public Service and the Administrators of the Divisions of Sewerage and Drainage and Water.\n \nSECTION 11.   That the City Auditor is hereby authorized to transfer any unencumbered balance in the project account to the unallocated balance within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project; except that no transfer shall be made from a project by monies from more than one source. \n \nSECTION 12.   That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 13.   That the City Auditor is authorized to establish proper project accounting numbers as appropriate.\n \nSECTION 14.   That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 15. That upon obtaining other funds for the purpose of funding Stormwater system capital improvement work, the City Auditor is hereby authorized to repay the Storm Sewer Reserve Fund - Fund No. 6207 the amount transferred under Section 4, and said funds are hereby deemed appropriated for such purposes.\n \nSECTION 16. That upon obtaining other funds for the purpose of funding Water system capital improvement work, the City Auditor is hereby authorized to repay the Water System Reserve Fund - Fund No. 6003 the amount transferred under Section 5, and said funds are hereby deemed appropriated for such purposes.\n \nSECTION 17.  That the City intends that this Ordinance constitute an \"official intent\" for purposes of Section 1.150-2(e) of the Treasury Regulations, and that the City reasonably expects to reimburse itself for certain Original Expenditures incurred with respect to the Project from the proceeds of obligations to be issued by the City in a principal amount currently estimated to be $6,064,307.46 (the \"Obligations\").\n \nThe City intends to make a reimbursement allocation on its books for the Original Expenditures not later than eighteen months following the later to occur of the date of the Original Expenditure to be reimbursed or the date the Project for which such Original Expenditures were made is \"placed in service\" within the meaning of Treasury Regulations Section 1.150-2(c).  Upon the issuance of the Obligations, the proceeds of such Obligations shall be used to reimburse the Storm Sewer Reserve Fund - Fund No. 6207 and the Water System Reserve Fund - Fund No. 6003, which are the funds from which the advance for costs of the Project will be made.\n \nSECTION 18.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 21,
    "meeting_date": "2021-07-19",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}