{
  "success": true,
  "vote": {
    "id": 1542,
    "item_number": "SR-16",
    "title": "To authorize the Director of Public Utilities to enter into a planned modification with Ohio Mulch Supply, Inc. for services in connection with the Deep Row Hybrid Poplar program for the Division of Sewerage and Drainage; and to authorize the expenditure of $1,550,000.00 from the Sewer Operating Sanitary Fund.  ($1,550,000.00)",
    "description": "Explanation\n \nThis legislation authorizes the Director of Public Utilities to modify the contract with Ohio Mulch Supply, Inc. for the purpose of providing a biosolids beneficial reuse program called Deep Row Hybrid Poplar (DRHP) program for the Division of Sewerage and Drainage (DOSD) and for the establishment of a new rate of pay per wet ton.\n \nThis contract modification No. 9 is for the continuation of the DRHP program on the 1,012 acre New Lexington Tree Farm, LLC (NLTF), located in Perry Township, Perry County, Ohio, and owned by Ohio Mulch Supply, Inc. under Plan-C detailed below.  \n \nThis contract originally authorized Ohio Mulch Supply, Inc. to remove a minimum of 27,000 and up to a maximum of 30,000 wet tons of biosolids annually from the DOSD’s Wastewater Treatment Facilities (WWTFs) and reuse the biosolids in their DRHP program.  With modification No. 3 Ohio Much Supply, Inc. was authorized to remove 0-30,000 wet tons annually at an increased rate of $40.00 per wet ton, and for volumes of 30,001 or more wet tons annually at a reduced rate of $35.00 per wet ton.  With this modification No. 9 Ohio Mulch Supply, Inc. will be authorized to remove 0-30,000 wet tons annually at an increased rate of $46.97 per wet ton, and for volumes of 30,001 or more wet tons annually at an increased rate of $41.10 per wet ton.  This price increase is in accordance with Article 4D of the original contract.  \n \nAll biosolids removed from the WWTFs will be Class B dewatered biosolids, originating from both Southerly and Jackson Pike Wastewater Treatment Plants.  The biosolids will be utilized as a nitrogen source to grow hybrid poplar trees which will later be harvested for mulch.  In addition, the biosolids will add valuable organic material to the old abandoned mine site that is now repurposed as the New Lexington Tree Farm.  Approximately 30 acres will be utilized per year at the New Lexington Tree Farm site with trees being harvested every 6 to 8 years. \n \nThe Director of Public Utilities received the Ohio Mulch, Inc. proposal on April 15, 2011 in response to the DOSD Request for Proposals for Innovative Reuse of Biosolids and it was the only proposal received with the DRHP concept.  Other proposals received included three mechanized dryer processes that would dry and pelletize biosolids for commercial wholesale and two biosolids-cake land application proposals.  Of all proposals submitted under the Innovative Reuse of Biosolids RFP, the selection committee deemed the DRHP as the best fit for the DOSD Biosolids Program.  \n \nThe terms for the award contract and modification No. 3 were as follows:\n \n1.                     Award contract was for approximately 6 months at $35 per wet ton and authorized Ohio Mulch Supply, Inc. to remove up to 15,000 wet tons of Class B biosolids.\n2.                     Modification No. 1 extended the contract an additional 12 months at $35 per wet ton and authorized Ohio Mulch Supply, Inc. to remove up to 30,000 wet tons of Class B biosolids.\n3.                     Modification No. 2 extended the contract an additional 12 months at $35 per wet ton and authorized Ohio Mulch Supply, Inc. to remove up to 30,000 wet tons of Class B biosolids.\n \nAt the end of contract modification No. 2, 30 months would have elapsed from the contract and the DOSD and Ohio Mulch Supply, Inc. were to choose to continue this contract by modification(s) according to Plan-A or Plan-B as follows:\n \nPlan-A:  accounting for the award contract and all modifications, Plan-A’s total contract duration was to be 5 years.\n \nPlan-B:  accounting for the award contract and all modifications, Plan-B’s total contract duration was to be 10 years. \n \nDue to unexpected transportation and operational costs associated with the project a New Plan-C had been agreed upon between the City of Columbus and Ohio Mulch Supply, Inc.\n \nPlan-C:  accounting for the award contract and all modifications, Plan-C’s total contract duration is 10 years as follows:\n4.  Modification No. 3 will extend the contract for 12 months at $40 per wet ton for 0-30,000 wet tons annually and $35.00 per wet ton for volumes of 30,001 or more wet tons per year.\n5.  Modification No. 4 will extend the contract for 12 months at $40 per wet ton for 0-30,000 wet tons annually and $35.00 per wet ton for volumes of 30,001 or more wet tons per year.\n6.  Modification No. 5 will extend the contract for 12 months at $40 per wet ton for 0-30,000 wet tons annually and $35.00 per wet ton for volumes of 30,001 or more wet tons per year.\n7.  Modification No. 6 will extend the contract for 12 months at $40 per wet ton for 0-30,000 wet tons annually and $35.00 per wet ton for volumes of 30,001 or more wet tons per year.\n8.  Modification No. 7 will extend the contract for 12 months at $40 per wet ton for 0-30,000 wet tons annually and $35.00 per wet ton for volumes of 30,001 or more wet tons per year.\n9.  Modification No. 8 will extend the contract for 12 months at $40 per wet ton for 0-30,000 wet tons annually and $35.00 per wet ton for volumes of 30,001 or more wet tons per year.\n10.  Modification No. 9 will extend the contract for 18 months at $40 per wet ton for 0-30,000 wet tons annually and $35.00 per wet ton for volumes of 30,001 or more wet tons per year.\n \nThis Plan-C represented a modification of the original contract due to current pricing not being sufficient to fund the operations as bid under the original contract terms.  Additionally, to provide reliable and consistent hauling of biosolids, Ohio Mulch Supply, Inc. was required to construct a biosolids storage facility at the NLTF capable of storing 1,000 wet tons of biosolids by January 1, 2016.  Although the structure was not complete as of that date, it has since been completed.\n \nThis Modification #9 will extend the contract for 18 months at an increased rate of $46.97 per wet ton for 0-30,000 wet tons annually, and for volumes of 30,001 or more wet tons annually at an increased rate of $41.10 per wet ton.  Funding under this Modification No. 9 will be extended through Jan. 1, 2023.\n \nThis ordinance is being submitted in accordance with the relevant provisions of Chapter 329 of the City Code relating to contract modifications and renewals.\n \nSUPPLIER:  Ohio Mulch Supply, Inc. (31-1120540), (DAX #004715), Expires 1/6/2022\nOhio Mulch does not hold MBE/FBE status.\n \nThe company is not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.\n \n1.                        Amount of additional funds:  Total amount of additional funds needed for this contract modification No. 9 is $1,550,000.00.  Total contract amount including this modification is $12,950,000.00.\n2.                     Reason additional funds were not foreseen:  The need for additional funds was known at the time of the initial contract, as this is an annual expenditure.  However, the contract modification Plan-C was a change from the originally anticipated cost.  Pricing under the proposed modification No. 3 was increased to $40/wet ton for 0-30,000 wet tons per year and $35/wet ton for volumes of 30,001or more wet tons per year.  \n \nThis legislation for modification No. 9 is to encumber the funds budgeted for fiscal year 2021 for the Division of Sewerage and Drainage, and prices will increase to $46.97/wet ton for volumes of 0-30,000 wet tons per year, and $41.10/wet ton for volumes of 30,001 or more wet tons per year.\n3.                     Reason other procurement processes were not used:  Work under this modification is a continuation of services included in the scope of the original bid contract.  \n4.                     How was cost determined:  The cost, terms and conditions of the modification was negotiated as part of the contract extension.  \n \nFISCAL IMPACT:  $1,550,000.00 is needed and budgeted for this contract modification No. 9.  \n \nAward Contract for 6 months   = $   525,000.00                     \nModification 1 for 12 months   = $1,050,000.00\nModification 2 for 12 months   = $1,050,000.00\n \nPlan-C Modification 3 for 12 months = $1,375,000.00\nPlan-C Modification 4 for 12 months = $1,375,000.00\nPlan-C Modification 5 for 12 months = $1,375,000.00\nPlan-C Modification 6 for 12 months = $1,550,000.00\nPlan-C Modification 7 for 12 months = $1,550,000.00\nPlan-C Modification 8 for 12 months = $1,550,000.00\nPlan-C Modification 9 for 18 months = $1,550,000.00 end of Plan-C\n \n$1,200,805.40 was spent in 2020\n$1,244,400.00 was spent in 2019\n \n \nTitle\n \nTo authorize the Director of Public Utilities to enter into a planned modification with Ohio Mulch Supply, Inc. for services in connection with the Deep Row Hybrid Poplar program for the Division of Sewerage and Drainage; and to authorize the expenditure of $1,550,000.00 from the Sewer Operating Sanitary Fund.  ($1,550,000.00)\n \n \nBody\n \nWHEREAS, the Division of Sewerage and Drainage entered into a contract with Ohio Mulch Supply, Inc. for the purpose of providing a biosolids beneficial reuse program called Deep Row Hybrid Poplar (DRHP) program, and\n \nWHEREAS, all biosolids removed from the Wastewater Treatment Plants will be Class B dewatered biosolids, with the majority of biosolids originating from both Southerly and Jackson Pike Wastewater Treatment Plants, and\n \nWHEREAS, the biosolids will be utilized as a nitrogen source to grow hybrid poplar trees which will later be harvested for mulch.  In addition, the biosolids will add valuable organic material to the old abandoned mine site that is now repurposed as the New Lexington Tree Farm.  Approximately 30 acres will be utilized per year at the New Lexington Tree Farm site with trees being harvested every 6 to 8 years, and\n \nWHEREAS, the procurement was conducted in accordance with the Request For Proposals (RFP) process set forth in the relevant provisions of Chapter 329  of City Code, and the Division's Evaluation Committee recommended Ohio Mulch Supply, Inc., for further consideration, and \n \nWHEREAS, the Director of Public Utilities received proposals on April 15, 2011 in response to the Division of Sewerage and Drainage Request For Proposals for Innovative Reuse of Biosolids and Ohio Mulch Supply, Inc. was awarded the contract, and\n \nWHEREAS, the original contract was for a period of six (6) months through July 1, 2013 and upon mutual agreement and approval by the Columbus City Council, this contract could be extended for two (2) additional years on a year to year basis and funds availability, and\n \nWHEREAS, at the end of contract modification No. 2, 30 months was to have elapsed from the contract and the Division of Sewerage and Drainage and Ohio Mulch were to choose to continue this contract by modifications(s) according to Plan-A or Plan-B, and\n \nWHEREAS, due to unexpected transportation and operational costs associated with the project a New Plan-C was agreed upon between the City of Columbus and Ohio Mulch Supply, Inc., and made a part of Modification No. 3, and\n \nWHEREAS, this Plan-C represented a modification of the existing contract due to pricing not being sufficient to fund the operations as bid under the original contract terms.  Additionally, under Plan-C, in order to provide reliable and consistent hauling of biosolids, Ohio Mulch Supply, Inc. was required to construct a biosolids storage facility at the New Lexington Tree Farm capable of storing 1,000 wet tons of biosolids by January 1, 2016.  Although the structure was not complete as of that date, it has since been completed.  Funding under this Modification No. 9 will be through Jan. 1, 2023, and \n \nWHEREAS, the increased pricing became effective immediately upon Modification No. 3 being fully executed by the City of Columbus, and\n \nWHEREAS, the Division of Sewerage and Drainage wishes to modify, extend and increase the current contract for eighteen (18) additional months with a new extension date of Jan. 1, 2023, and\n \nWHEREAS, this legislation for modification No. 9 is to encumber the funds budgeted for fiscal year 2021 for the Division of Sewerage and Drainage, and to allow for the increase of prices to $46.97/wet ton for volumes of 0-30,000 wet tons per year, and $41.10/wet ton for volumes of 30,001 or more wet tons per year in accordance with the terms of the contract, and\n \nWHEREAS, the increased pricing will become effective immediately upon Modification No. 9 being fully executed by the City of Columbus, and\n \nWHEREAS, this ordinance is in accordance with the relevant provisions of Chapter 329 of City Code relating to contract modifications, and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities, Division of Sewerage and Drainage, to authorize the Director of Public Utilities to modify, increase and extend the current contract and to increase the per wet ton prices for the Deep Row Hybrid Poplar program with Ohio Mulch Supply, Inc. to provide reliable and consistent hauling of biosolids for the preservation of the public health, peace, property, safety and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Utilities be, and hereby is, authorized to enter into a planned modification of EL013611 with Ohio Mulch Supply, Inc., 1600 Universal Road, Columbus, Ohio 43207, for the continuation of the Deep Row Hybrid Poplar program, in accordance with the modified terms and conditions that allowed for the addition of Plan-C as shown in the agreement on file in the office of the Division of Sewerage and Drainage.  This modification will include an increase of the per wet ton prices as allowed for within the contract.  Total amount of modification No. 9 is $1,550,000.00.  Total contract amount including this modification is $12,950,000.00.\n \nSECTION 2.  That this ordinance is in accordance with the relevant provisions of Chapter 329 of City Code relating to contract modifications.\n \nSECTION 3.  That the expenditure of $1,550,000.00 or so much thereof as may be needed, is hereby authorized in Fund 6100 Sewer Operating Sanitary Fund in object class 03 Services per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 21,
    "meeting_date": "2021-07-19",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Health & Safety",
      "Infrastructure"
    ]
  }
}