{
  "success": true,
  "vote": {
    "id": 1557,
    "item_number": "SR-31",
    "title": "To amend chapter 1912 of the Columbus City Codes, establishing standards for the use of warrants by the Columbus Division of Police; to repeal existing chapter 1912; and to declare an emergency.",
    "description": "Explanation\n \nThe purpose of this ordinance is to amend Chapter 1912 of the Columbus City Codes, pertaining to the use of search warrants by the Columbus Division of Police.  \n \nIn the interest of promoting public safety and accountability, City Council amended Title 19 of the Columbus City Codes to include new Chapter 1912, pertaining to search warrants.  This was done through Ordinance 1808-2020, which passed on July 27, 2020 and amended through ordinance 2138-2021, which passed on September 21, 2020.  Upon additional feedback from the Division of Police and the Columbus City Attorney’s office, Council now proposes to amend Chapter 1912 to reflect operational necessities and concerns for the Police.  These include:  \n \n • Ensuring officers are able to serve on Federal taskforces without violating the Columbus City Code.\n • Ensuring that officers are given exemptions that are needed when working an assignment  to a\n   federal or state law enforcement taskforce with which the Division of Police has a\n   memorandum of understanding.   \n \nEMERGENCY DESIGNATION:  Emergency action is requested in order to ensure that the Division of Police has appropriate standards set as soon as possible for the execution of no-knock, and other warrants, to protect public safety and the welfare of residents.\n \nTitle\n \nTo amend chapter 1912 of the Columbus City Codes, establishing standards for the use of warrants by the Columbus Division of Police; to repeal existing chapter 1912; and to declare an emergency.\n \n \nBody\n \nWHEREAS, chapter 1912 pertains to the use of warrants by the Columbus Division of Police; and \n \nWHEREAS, Columbus City Council created new chapter 1912 of the Columbus City Codes to limit the use of no-knock warrants, as well as to establish guidelines for the serving of warrants and requiring body-worn cameras for all officers who execute warrants; and\n \nWHEREAS, upon additional feedback from the Division of Police and the Columbus City Attorney’s office, Council now proposes to amend chapter 1912 to reflect operational necessities and concerns for the Police; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Safety, in that it is necessary to ensure that the Division of Police has the appropriate standards set as soon as possible for the execution of no-knock, and other warrants, for the immediate preservation of the public health, peace, property, safety, and welfare; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That chapter 1912 of the Columbus City Codes is hereby amended, to read as follows:\n \nChapter 1912 - SEARCH WARRANTS \n \n1912.01 - Use of no-knock search warrants limited.\n \n(A) No division of police officer, or any other employee of the department of public safety, shall seek, execute, or participate in the execution of a no-knock warrant at any location within the Columbus corporate boundary for reasons of suspecting the commission of a fourth degree felony or lesser offense, or for any suspected possession of marihuana.\n \n(B) No division of police officer, or any other employee of the department of public safety, shall seek, execute, or participate in the execution of a no-knock warrant at any location where there is intelligence indicating or suspicion of the presence of minors within the premises.  This subsection does not apply to no knock warrants issued in connection with arrest warrants for violent felonies for minors fifteen (15) years of age or older.\n \n(C) A division of police officer, or any other employee of the department of public safety, may seek, execute, or participate in the execution of a no-knock warrant only with the prior approval of the chief of police or their designee.  \n \n(D) Absent exigent circumstances, the execution of any no-knock warrant must be preceded by no less than two (2) hours of surveillance of the exterior of the address sought in the warrant immediately prior to the execution of the warrant.\n \n(E) The division of police, or the department of public safety, shall permit the involvement of other law enforcement agencies in the execution of no-knock warrants within the Columbus corporate boundary only if those agencies adhere to the restrictions outlined in this section.\n \n(F)  This section does not apply when a division of police officer is working an assignment to a federal or state law enforcement taskforce with which the Division of Police has a memorandum of understanding.\n \n1912.02 - Execution of search warrants by City employees\n \n(A) Any division of police officer, or any other employee of the department of public safety, charged with the execution of any search warrant on an occupied structure shall be accompanied only by such other division of police officers, or employees of the department of public safety, as may be reasonably necessary for the successful execution of the warrant with all practicable safety.\n \n(B) In executing any search warrant, other than a no-knock warrant, on an occupied structure, before any officer as identified in subsection (A) enters the premises, the lead officer shall:\n \n(1) Physically knock on an entry door to the premises, or when executing a warrant by calling out the occupants, give clear audible signal through electronic means, in a manner and duration as to be heard by the occupants;\n \n(2) Clearly and verbally announce as law enforcement having a search warrant in a manner as to be heard by the occupants; and,\n \n(3) Absent exigent circumstances, wait no fewer than fifteen (15) seconds, or for a reasonable amount of time, for occupants to respond before entering the premises.\n \n(C) This section does not apply when a division of police officer is working an assignment to a federal or state law enforcement taskforce with which the Division of Police has a memorandum of understanding.\n \n1912.03 -- Use of body-worn cameras in the execution of search warrants\n \n(A) All division of police officers involved in the execution of any search warrant served during a tactical operation on an occupied structure, or involved in any arrest warrant; shall be equipped with an operating body-worn camera.\n \n(B) Prior to the execution of all search warrants referenced in 1912.03(A), each officer on the premises must activate their body-worn camera recording equipment and may not deactivate the equipment any sooner than the completion of the execution of the warrant until after any enforcement actions are completed and the premises is secure.\n \n(C) All recorded data must be retained per the record retention schedule established by the department of public safety regarding body-worn camera footage.\n \n(D)  This section shall not preempt any other local, state, or federal law.\n \n(E) This section does not apply when a division of police officer is working an assignment to a federal or state law enforcement taskforce with which the Division of Police has a memorandum of understanding.\n \n1912.04 - Penalty\n \nAny division of police officer, or any employee of the department of public safety, that violates any section of this chapter may be subject to disciplinary action as provided by the division of police, department of public safety, or any applicable collective bargaining agreement.\n \nSECTION 2.  That current chapter 1912 of the Columbus City Codes is hereby repealed.\n \nSECTION 3.  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 21,
    "meeting_date": "2021-07-19",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services"
    ]
  }
}