{
  "success": true,
  "vote": {
    "id": 162,
    "item_number": "CA-24",
    "title": "To authorize the Director of Development to modify a contract with the Arch City Development, LLC to extend the contract term and authorize reimbursement for expenses incurred since February 29, 2020; and to declare an emergency.",
    "description": "Explanation\nBACKGROUND: This legislation authorizes the Director of Development to modify a contract with the Arch City Development LLC in order to extend the contract term and allow reimbursement for expenses incurred since February 29, 2020.  No additional funds are being added.\n \nOn July 22, 2019, Columbus City Council approved Ordinance 1739-2019 in an amount up to $50,000.00 to provide a commercial market analysis of the SR-161 corridor. Arch City Development LLC was awarded the contract and tasked with reviewing and evaluating current business and business expansion opportunities along the corridor, evaluating the land use patterns relative to the study’s findings, and provide detailed recommendations that address market constraints, real estate development opportunities and potential programming to assist businesses in the corridor. \n \nThis ordinance seeks to extend the contract term from February 29, 2020 to December 31, 2021 for the purpose of allowing Arch City Development LLC to continue to provide professional consultancy services and to allow reimbursement of expenses incurred since February 29, 2020. \n \nOriginal Contract                     $ 50,000.00                                          Ord. 1739-2019                                          PO187049\nModification 1                                          $          0.00                                           \nTotal contract amount                     $ 50,000.00\n \n \nEmergency action is requested to modify the contract in order to provide for uninterrupted services.\n \nFISCAL IMPACT:  None\n \nCONTRACT COMPLIANCE:  The vendor’s vendor compliance number is 019970 and expires 3/1/2021.\n \nTitle\nTo authorize the Director of Development to modify a contract with the Arch City Development, LLC to extend the contract term and authorize reimbursement for expenses incurred since February 29, 2020; and to declare an emergency.\n \nBody\nWHEREAS, Columbus City Council approved Ordinance 1739-2019 in an amount up to $50,000.00 to provide a commercial market analysis of the SR-161 corridor; and \n \nWHEREAS, Arch City Development, LLC was awarded the contract and tasked with reviewing and evaluating current business and business expansion opportunities along the corridor, evaluating the land use patterns relative to the study’s findings, and provide detailed recommendations that address market constraints, real estate development opportunities and potential programming to assist businesses in the corridor; and\n \nWHEREAS, a modification is needed for the purpose of allowing Arch City Development, LLC to continue to provide professional consultancy services; and  \n \nWHEREAS, this ordinance allows for the extension of the contract term to December 31, 2021, and allows reimbursement for expenses incurred since February 29, 2020; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to authorize the Director to enter into a modification with Arch  City Development, LLC to extend the term in order to provide for uninterrupted services, thereby preserving the public health, peace, property, safety and welfare; Now, Therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     That the Director of the Department of Development is authorized to modify a contract with Arch City Development, LLC to allow for the extension of the contract term to December 31, 2021, and authorize reimbursement for expenses incurred since February 29, 2020.\n \nSECTION 2.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 3,
    "meeting_date": "2021-02-08",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}