{
  "success": true,
  "vote": {
    "id": 1623,
    "item_number": "CA-45",
    "title": "To authorize the Director of Development to execute a grant agreement with Alpha Kappa Alpha Sorority, Inc., in an amount up to $10,000.00. to support the Achieving Standards of Excellence Foundation; to authorize an appropriation and expenditure of $10,000.00 from the General Fund, Neighborhood Initiatives subfund; and to declare an emergency. ($10,000.00) (AMENDED BY 2438-2021; PASSED 10/11/2021)",
    "description": "Explanation\nBACKGROUND: \nThis ordinance authorizes the Director of Development to execute a grant agreement with Alpha Kappa Alpha Sorority, Inc. (AKA), in an amount up to $10,000.00, to support the Achieving Standards of Excellence Foundation.\nAKA supports youth, and specifically young girls of color, by focusing on building strong neighborhoods through leadership development.  They strive to provide access to leadership development opportunities not afforded to many Central Ohio minority youths.  Their goal is to impact the lives of youth by providing them an opportunity to excel and expose them to examples of black leaders that demonstrate what black excellence looks like within their very own community. \nThe Achieving Standards of Excellence Foundation (ASOEF) has two mentorship programs for young ladies which include the ASO Leaders in Training for Excellence grades 6-8 and the AKAdettes grades 9-12.  These programs foster and develop leadership qualities in young ladies during their pivotal years as middle school and high school students.  This funding will support both of these mentoring programs and will reach 50 young ladies for the 2021-2022 school year.  \nThe youth leadership development will cause students to affect positive change within their schools, communities, and the world at large.  The programs will provide interactive workshops, community forums, and a yearly conference that will foster leadership opportunities, community awareness, and positive self-awareness. \nEmergency action is necessary to ensure program services continues without interruption.\n \nFISCAL IMPACT: Funding is available in the General Fund, Neighborhood Initiatives subfund.\n \nCONTRACT COMPLIANCE:  the vendor number is 032389 and contract compliance is pending.\n \nTitle\nTo authorize the Director of Development to execute a grant agreement with Alpha Kappa Alpha Sorority, Inc., in an amount up to $10,000.00. to support the Achieving Standards of Excellence Foundation; to authorize an appropriation and expenditure of $10,000.00 from the General Fund, Neighborhood Initiatives subfund; and to declare an emergency. ($10,000.00) (AMENDED BY 2438-2021; PASSED 10/11/2021)\n \nBody\nWHEREAS, the Alpha Kappa Alpha Sorority, Inc. supports youth, and specifically young girls of color, by focusing on building strong neighborhoods through leadership development; and  \nWHEREAS, the goal of AKA is to impact the lives of youth by providing them an opportunity to excel and expose them to examples of black leaders that demonstrate what black excellence looks like within their very own community; and\nWHEREAS, the Achieving Standards of Excellence Foundation (ASOEF), a chapter of the Alpha Kappa Alpha Sorority, Inc., has two mentorship programs for young ladies which include the ASO Leaders In Training for Excellence grades 6-8 and the AKAdettes grades 9-12; and  \nWHEREAS, these programs foster and develop leadership qualities in young ladies during their pivotal years as middle school and high school students; and  \nWHEREAS, this funding will support two mentoring programs and will reach 50 young ladies between for the 2021-2022 school year; and  \nWHEREAS, the youth leadership development will cause students to affect positive change within their schools, communities, and the world at large; and \nWHEREAS, the programs will provide interactive workshops, community forums, and a yearly conference that will foster leadership opportunities, community awareness, and positive self-awareness; and\nWHEREAS, the Director of the Department of Development desires to enter into a grant agreement with Alpha Kappa Alpha Sorority, Inc. to support the Achieving Standards of Excellence Foundation; and \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to authorize the Director to execute a contract with Alpha Kappa Alpha Sorority, Inc. and to make the funds available to ensure program services continue without interruption thereby preserving the public health, peace, property, safety and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2021, the sum of $10,000.00 is appropriated in Fund 1000 (General Fund), Subfund 100018, Dept-Div 44-01 (Administration), in object class 03 (Services) per the account codes in the attachment to this ordinance.\n \nSECTION 2. That the Director of the Department of Development is hereby authorized to enter into a grant agreement with Alpha Kappa Alpha Sorority, Inc. to support the Achieving Standards of Excellence Foundation in an amount up to $10,000.00.\n \nSECTION 3. That the expenditure of $10,000.00 or so much thereof as may be needed is hereby authorized in Fund 1000 (General Fund), subfund 100018, Dept-Div 4401 (Administration) Object Class 03 (Services), per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 22,
    "meeting_date": "2021-07-26",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}