{
  "success": true,
  "vote": {
    "id": 1651,
    "item_number": "LA",
    "title": "To authorize the Mayor, or his designee(s), to issue one-time hazard payments to frontline city employees in an amount up to $1,000.00 per employee; to authorize the Auditor to transfer appropriations within the Recovery Fund in order to issue payments; and to declare an emergency. ($7,100,000.00)",
    "description": "Explanation\nThis ordinance authorizes the issuance of one-time hazard payments to full-time city workers who served the residents of Columbus as our frontline in working through the COVID-19 pandemic.\nThe City of Columbus employs more than 9,000 full-time employees, thousands of whom experienced significant personal, financial, or physical hardship as a function of the COVID-19 pandemic. Since the start of the pandemic, our essential workers faced new child care expenses, worked through unusual and demanding circumstances, and faced a higher risk of exposure to COVID-19 by virtue of their necessary and ongoing service to the community.\nThe City of Columbus, through the American Rescue Plan, received significant federal resources intended to enhance our economic recovery, stability, and resiliency. Part of that recovery includes the recognition of our frontline workers who placed themselves, and often their families, at greater risk through their public service.\nFiscal Impact: Funding is available within the Recovery Fund, fund 2209.\n \nEmergency action is requested in order to avoid any delay in providing payments to those employees who served at an increased risk and exposure to COVID-19 over the course of the pandemic.\n \nTitle\nTo authorize the Mayor, or his designee(s), to issue one-time hazard payments to frontline city employees in an amount up to $1,000.00 per employee; to authorize the Auditor to transfer appropriations within the Recovery Fund in order to issue payments; and to declare an emergency. ($7,100,000.00)\n \nBody\nWHEREAS, during the course of the COVID-19 pandemic, thousands of City of Columbus employees experienced financial, social, and physical hardship because of the nature of their service to the city; and\n \nWHEREAS, the work of those employees, especially those deemed essential by city leadership, has contributed to the resiliency and the recovery of our city in immeasurable ways; and\n \nWHEREAS, it is the belief of this Council that the recognition of the service of those employees and their contribution to the city’s recovery is paramount; and\n \nWHEREAS, it is further the belief of this Council that the issuance of one-time hazard payments is a necessary component of that recognition, and\n \nWHEREAS, an emergency exists in that it is immediately necessary to initiate a process by which hazard payments may be issued to relieve any financial hardship that city employees are experiencing because of their service, for the immediate preservation of the public health or safety and to avoid any delay in recognizing the commitment of frontline workers to the residents of this city; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That for the purposes of this ordinance, “frontline worker” shall mean an employee who meets the following criteria:\n(1)                     A full-time employee of the City of Columbus whose employment start date was on or before 180 days prior to the effective date of this ordinance, and who maintains full-time service with the city as of the date of payment authorized by Section 3 of this ordinance; and\n(2)                     A member of the IAFF, AFSCME, CWA, OLC, or FOP bargaining units with whom the City of Columbus maintains contractual employment agreements; and\n(3) Who is either:\n                     (a)                     An employee deemed \"essential\" by their appointing authority for the purposes of sustaining city services during the COVID-19 pandemic; or\n                     (b)                     An employee whose regular course of work duties, during the course of the pandemic, entailed consistent and ongoing contact and interaction with residents of the city, as                      determined by the employee's appointing authority.\n \nSECTION 2. That the Mayor, or his designee(s), shall determine the employees meeting the definition of “frontline worker,” as defined in Section 1 of this ordinance, on or before September 17, 2021, and shall forthwith provide to this Council, the City Auditor, and the members of the bargaining units listed in Section 1(b) of this ordinance, a report listing the employees and job classifications of said employees in accordance with current collective bargaining agreements.\n \nSECTION 3. That subject to and contingent upon subsequent memoranda of understanding executed following negotiations with the aforementioned bargaining units if deemed appropriate by the Mayor or the Mayor's departmental designee, on or before October 22, 2021, the Mayor, or the Mayor’s departmental designee, is hereby authorized to issue a one-time hazard payment of up to $1,000.00 to the employees determined by the action authorized in Section 2 of this ordinance and who otherwise meet the definition of “frontline worker” as defined in Section 1 of this ordinance.\n \nSECTION 4. That the City Auditor is hereby authorized and directed to transfer appropriations to various city departments within fund 2209, subfund 220901, in Object Class 01-Personal Service in an amount of up to $7,100,000.00, or so much thereof as may be necessary, in order to provide sufficient appropriations to issue payments as authorized in Section 3 of this ordinance.\n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 22,
    "meeting_date": "2021-07-26",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services"
    ]
  }
}