{
  "success": true,
  "vote": {
    "id": 1653,
    "item_number": "SR-18",
    "title": "To authorize the Director of Development to execute a contract with Venture Suite LLC, in an amount up to $400,000.00, to support the development of a safe space for underrepresented founders and freelancers to share open office space; to waive the competitive bidding requirements of Columbus City Code Chapter 329; to authorize a transfer within the General Fund in an amount up to $400,000.00; to authorize an expenditure of $400,000.00 from the General Fund; and to declare an emergency. ($400,000.00)",
    "description": "Explanation\nBACKGROUND: \nThis ordinance authorizes the Director of Development to to waive the request for proposal requirements of Columbus City Code Chapter 329 and execute a contract with Venture Suite LLC, in an amount up to $400,000.00, to support the development of a safe space for underrepresented founders and freelancers to share open office space. \n \nVenture Suite is dedicated to ensuring all citizens have equal access to computer science and information technology programs, skills, and resources that enhance learning and prepare them for college and careers.  VS’s approach is an innovative method of broad-based neighborhood revitalization by building strong neighborhoods and reskilling our communities for sustainable careers and good-paying jobs. The communities which are the focus are at significant economic and social mobility risk. However, by taking an intentional, systemic approach to inclusive growth and innovation, cities like Columbus and neighborhoods like King-Lincoln-Bronzeville can lead the way forward as national models of urban inclusive economic development.\n \nThe vision of VS is to catalyze urban communities by deploying a professional workspace through the shared office business model to bring the community together. Co-working for minorities will give these underserved free-lancers and entrepreneurs a safe, productive space to innovate and collaborate in places recognized as innovation deserts, as well as open doors to technology careers for individuals from often overlooked communities.\n \nThe overarching goal of this project is to develop a safe space for underrepresented founders and freelancers to share open office space. This space builds upon a thriving community eager to be innovative and launch new careers and business endeavors. City of Columbus residents, particularly the underserved, will be provided with a bevy of workshops and classes to drive jobs in IT and create new enterprises, moving the community from an innovation desert to one where economic development activity and entrepreneurship is fostered.\n \nAs the program and contract are developed, and if it is determined that this program is eligible to be funded by federal American Rescue Plan Act (ARPA) funds, the funding source will be changed and the program and contract shall be in alignment with federal guidelines.\n \nEmergency action is necessary to avoid causing interruptions in the delivery of program services.\n \nWaiver of Request for Proposal Requirements:  A waiver of the request for proposal requirements outlined in Columbus City Code Chapter 329 is being requested as Venture Suite LLC is Columbus' only technology focused small business incubator serving the focused geographical location. Located on the Near East Side, Venture Suite is the sole organization situated to provide residents within their geography with a bevy of workshops and classes to drive jobs in IT and create new enterprises, moving the community from an innovation desert to one where economic development activity and entrepreneurship is fostered.\n \nFISCAL IMPACT: Fund will be transferred from the General Fund Citywide Account to the Department of Development General Fund budget.\n \nCONTRACT COMPLIANCE:  contract compliance is pending.\n \nTitle\nTo authorize the Director of Development to execute a contract with Venture Suite LLC, in an amount up to $400,000.00, to support the development of a safe space for underrepresented founders and freelancers to share open office space; to waive the competitive bidding requirements of Columbus City Code Chapter 329; to authorize a transfer within the General Fund in an amount up to $400,000.00; to authorize an expenditure of $400,000.00 from the General Fund; and to declare an emergency. ($400,000.00)\n \nBody\nWHEREAS, it is a top priority of Columbus City Council to support efforts that enhance regional job creation, small business development, and technology training; and\n \nWHEREAS, Venture Suite LLC is dedicated to ensuring all citizens have equal access to computer science and information technology programs, skills, and resources that enhance learning and prepare them for college and careers; and \n \nWHEREAS, Venture Suite LLC is Columbus' only technology focused small business incubator serving the focused geographical location, therefore, it is in the City's best interests to waive the competitive bidding provisions of City Code to enter into this contract; and\n \nWHEREAS, the Director of Development desires to enter into a contract with Venture Suite LLC to support the development of a safe space for underrepresented founders and freelancers to share open office space; and \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to authorize the Director to enter into a contract with Venture Suite LLC to avoid causing interruptions in the delivery of program services, thereby preserving the public health, peace, property, safety and welfare; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the transfer of $400,000.00 or so much thereof as may be needed, is hereby authorized within Fund 1000 (General Fund), from Dept-Div 4501, object class 10 to Dept-Div 4401 (Administration), object class 03 (Services) per the account codes in the attachment to this ordinance.\n \nSECTION 2. That the Director of the Department of Development is hereby authorized to enter into a contract with Venture Suite LLC, in an amount up to $400,000.00, to support the development of a safe space for underrepresented founders and freelancers to share open office space.\n \nSECTION 3.  That this Council finds that is in the best interest of the City to waive the competitive bidding provisions of Chapter 329 of Columbus City Code to enter into this contract.\n \nSECTION 4. That the expenditure of $400,000.00 or so much thereof as may be needed is hereby authorized in Fund 1000 (General Fund), Dept-Div 4401 (Administration), Object Class 03 (Services), per the accounting codes in the attachment to this ordinance.\n \nSECTION 5.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 7. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 22,
    "meeting_date": "2021-07-26",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}