{
  "success": true,
  "vote": {
    "id": 1662,
    "item_number": "SR-27",
    "title": "To amend various sections and enact new sections of Chapter 329 of the Columbus City Codes in to order to modify the City of Columbus construction prequalification requirements; implement policy recommendations from the 2019 Disparity Study; provide for additional due process protections for business entities facing debarment; and to declare an emergency.($0.00)",
    "description": "Explanation\nBACKGROUND: In 2016, the Office of Diversity and Inclusion advertised and solicited formal bids for an independent disparity study to determine whether statistical disparities exist between the City’s procurement with businesses owned by minority groups or women and white male businesses. Specifically, the study evaluated if there is a disparity between the availability of minority and women-owned business enterprises and the City's utilization of those businesses. The City’s previous disparity study was conducted over a decade ago, over which time Columbus has seen tremendous economic growth. \nMason Tillman Associates, LTD was selected as the contract vendor for the City’s 2019 Disparity Study. Mason Tillman is a nationally recognized African American owned consulting firm that has conducted disparity studies for numerous cities throughout the country. Mason Tillman Associates has conducted more than 140 disparity studies for municipalities across the nation.\nThe 2019 Disparity Study was completed in July 2019 and found that statistically significant disparities exist in the City of Columbus’ utilization of businesses owned and operated by specified minority groups and women in comparison to their availability for purchasing and contracting in all categories examined. Council accepted the findings and conclusions of the Disparity Study in 2019 (Resolution #0220X-2019). Over the past two years, the Office of Diversity and Inclusion has worked with both internal and external stakeholders to advance the implementation of the 2019 Disparity Study recommendations.\nIn 2012, Columbus City Council amended chapter 329 of city code to implement the construction prequalification program. As a part of the Disparity Study’s qualitative research, Mason Tillman discovered that numerous firms found the prequalification process to be a barrier to construction contracts. In addition to implementing small and local business enterprise policies, this ordinance amends the prequalification code to better serve minority and women-owned business enterprises as well as workers on large construction projects.\nOn July 12th, 2021 Council passed ordinance 1749-2021 to authorize the Director of the Office of Diversity and Inclusion to establish and implement race and gender neutral and conscious program policies based on the findings of the 2019 Disparity Study.\nCouncil is simultaneously advancing ordinance 2026-2021 to repeal and replace Title 39 of the Columbus City Codes. This new Title empowers the Office of Diversity and Inclusion with new capabilities and responsibilities.\nThe Minority and Women Business Enterprise (MBE/WBE) and Small Local Business Enterprise (SLBE) policies seek to foster participation by local, small and minority businesses in construction, architectural and engineering, professional services and non-professional services contracting and procurement opportunities at the City of Columbus by increasing the capacities of such firms to perform as prime vendors and subcontractors and as suppliers. The policies shall allow the City of Columbus to more effectively target small and minority business participation and create opportunities relating to the City's contracting and procurement.\nThe policies seek to promote full and fair opportunities for MBE/WBE and SLBE companies certified by the City of Columbus, and whose place of business is located in the City's relevant market service area.\nThe purposes of the policies are:\n1.                     To ensure nondiscrimination in the award and administration of contracts;\n2.                     To create a level playing field on which diverse suppliers can compete fairly for contracts; \n3.                     To ensure that the Office of Diversity and Inclusion’s Minority and Women Business Enterprise and Small Local Business Enterprise Programs are narrowly tailored in accordance with applicable law; \n4.                     To ensure that only business entities that fully meet eligibility standards are permitted to participate as diverse suppliers; \n5.                     To help remove barriers to the participation of diverse suppliers in contracts; and.\n6.                     To provide opportunity for Small Local Business Enterprises located in the City to participate in a sheltered market as prime contractors on City construction, professional services, and goods and services contracts.\nThis ordinance amends city code where applicable to implement elements of the aforementioned policies and recommendations from the 2019 Disparity Study.  Additionally, in order to assure that those business entities facing debarment for significant performance failures are afforded notice and the ability to be fairly heard, due process protections for actions in debarment have been strengthened.\nEmergency action is necessary to provide a date certain by which the policy changes supported by the Disparity Study will be implemented in order to afford the Department to and the Office of Diversity and Inclusion time to provide training on new procurement and contracting processes and to immediately provide for increased due process protections for those businesses facing debarment\nFiscal Impact: This code change has no fiscal impact.\nTitle\nTo amend various sections and enact new sections of Chapter 329 of the Columbus City Codes in to order to modify the City of Columbus construction prequalification requirements; implement policy recommendations from the 2019 Disparity Study; provide for additional due process protections for business entities facing debarment; and to declare an emergency.($0.00)\nBody\nWHEREAS, in 2016, the Office of Diversity and Inclusion advertised and solicited formal bids for an independent disparity study to determine whether statistical disparities exist between the City’s procurement with businesses owned by minority groups or women and white male businesses; and\nWHEREAS, Mason Tillman Associates, LTD was selected as the contract vendor for the City’s 2019 Disparity Study; and\nWHEREAS, the 2019 Disparity Study was completed in July 2019 and found that statistically significant disparities exist in the City of Columbus’ utilization of businesses owned and operated by specified minority groups and women in comparison to their availability for purchasing and contracting in all categories examined; and\nWHEREAS, on July 12th, 2021 Council passed ordinance 1749-2021 to authorize the Director of the Office of Diversity and Inclusion to establish and implement race and gender neutral and conscious program policies based on the findings of the 2019 Disparity Study; and\nWHEREAS, the Minority and Women Business Enterprise (MBE/WBE) and Small Local Business Enterprise (SLBE) Policies seeks to foster participation by local, small and minority businesses in construction, architectural and engineering, professional services and non-professional services contracting and procurement opportunities at the City of Columbus by increasing the capacities of such firms to perform as prime vendors and subcontractors and as suppliers; and\nWHEREAS, this ordinance amends Chapter 329 of the Columbus City Codes in an effort to implement the aforementioned policies but also allows for a period of training and education on new procurement and contracting processes prior to full implementation; and\nWHEREAS, business entities facing debarment for significant performance failures are entitled to strengthened notice and the ability to be fairly heard; and \nWHEREAS, an emergency exists in the usual daily operations of the Department of Finance and Management in that it is immediately necessary to provide a date certain by which the policy changes supported by the Disparity Study will be implemented in order to afford the Department to and the Office of Diversity and Inclusion time to provide training on new procurement and contracting processes and to immediately provide for increased due process protections for those businesses facing debarment; NOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1. That Chapter 329 of the Columbus City Codes is hereby amended by the enactment of new Sections 329.191, 329.192, 329.201, and 329.212 to read as follows per the attached word document:\n                     Ordinance 2074-2021 Revisions to Chapter 329 Attachment\nSECTION 2. That Sections 329.01, 329.04, 329.14, 329.17, 329.18, 329.19, 329.20, 329.21, 329.211, 329.22, 329.23, 329.27, 329.28, and 329.32 are hereby amended to read as follows per the attached word document:\n                     Ordinance 2074-2021 Revisions to Chapter 329 Attachment\nSECTION 3. That existing Sections 329.01, 329.04, 329.14, 329.17, 329.18, 329.19, 329.20, 329.21, 329.211, 329.22, 329.23, 329.27, 329.28, and 329.32 are hereby repealed.\nSECTION 4. That Section 329.16 is hereby amended, to read as follows:\n329.16 Authority to debar or suspend.\n(a) After consulting with the city attorney, the director of finance and management or designee is authorized to suspend an individual or entity from consideration for the award of city contracts if there is probable cause to believe that the individual or entity has engaged in any activity, as identified in this section, or in Section 377.01(a), which might lead to debarment. The suspension shall be for a period not to exceed three (3) months ninety (90) days. The director of finance and management or designee shall issue a written decision to suspend and shall send a copy of the decision to the suspended individual or entity. The decision shall state the reasons for the action taken and inform the suspended individual or entity involved of available administrative review.\n(b) During the period of suspension, the suspended individual or entity may appeal the suspension in writing on a form approved by the director to the finance and management director. If a suspended individual or entity does so appeal in writing, the finance and management director shall provide an opportunity for the suspended individual or entity to be heard. Notification of the opportunity to be heard shall be given at least ten (10) days prior to the hearing. After reasonable notice to the individual or entity involved and reasonable opportunity for that individual or entity to be heard, the director of finance and management or designee, Subsequent to said hearing, or after failure to appeal by the suspended individual or entity, and after consulting with the city attorney, the finance and management director is authorized to debar a person or entity from consideration of award of city contracts. The debarment shall be for a period of not more than three (3) years. The finance and management director shall issue a written decision to debar and shall send a copy of the decision to the debarred individual or entity, informing the debarred individual or entity of the available review by an independent hearing officer as outlined in division (d).  \n(c) The causes for debarment include the following: \n(1)                     Conviction for commission of a criminal offense as an incident to obtaining or attempting to obtain a public or private contract or subcontract, or in the performance of such contract or subcontract. \n(2)                     Conviction under state or federal statutes of embezzlement, theft, forgery, bribery, falsification or destruction of records, receiving stolen property, or any other offense indicating a lack of business integrity or business honesty which significantly affects responsibility as a contractor. \n(3)                     Conviction under state or federal antitrust statutes arising out of the submission of bids or proposals. \n(4)                     Violation of contract provisions of a serious character including deliberate failure without good cause to perform in accordance with the specifications or within the time limit provided in a contract, and/or a recent record of failure to perform or of unsatisfactory performance in accordance with the terms of one (1) or more contracts, provided that failure to perform or unsatisfactory performance caused by acts beyond the control of the contractor shall not be a basis for debarment. \n(5)                     Violation of provisions of Title 39 of a serious character including deliberate failure without good cause to perform in accordance with the provisions of Title 39.  \n(5)(6)                     Any other cause which the director of finance and management or designee determines to be so serious and compelling as to affect responsibility as a contractor, including debarment by another governmental entity for any cause listed in this section. \nThe director of finance and management or designee shall issue a written decision to debar or suspend and shall send a copy of the decision to the debarred or suspended individual or entity. The decision shall state the reasons for the action taken and inform the debarred or suspended individual or entity involved of any available judicial or administrative review. \n(d) (1) Within ten days, an individual or entity may appeal, in writing on a form determined by the director, a determination of debarment exercised by the director of finance and management under division (c) to an independent hearing officer appointed by the finance and management director. A failure by an individual or entity to exercise this right to appeal shall constitute a waiver of such right.  \n(2)  The independent hearing officer shall hear all recommendations that include one or more grounds for debarment and/or suspension. Notification of the opportunity to be heard shall be given at least ten (10) days prior to the hearing. \n(3)   The independent hearing officer shall determine by a preponderance of the evidence whether there are sufficient grounds for debarment and the length of time of the debarment. Based on the evidence presented by all parties, the independent hearing officer may increase, decrease, or accept the director of finance and management’s recommendation regarding the length of debarment.  \n(4)   The independent hearing officer decision on debarment shall be in writing. \n(5)  The failure of an individual or entity recommended for debarment to appear at a debarment hearing after notice may constitute a waiver of that person's right to contest the debarment recommendation. If the independent hearing officer determines that the person has waived the right to contest the debarment under this division the director of finance and management’s recommendation shall become final.\nSECTION 5. That existing Section 329.16 is hereby repealed.\nSECTION 6. That to allow the Department of Finance and Management, Office of Diversity and Inclusion, and the business community sufficient opportunity to adopt new processes and provide education and training on the same, SECTIONS 1, 2, and 3 shall take effect and be in full force from and after January 1, 2022.\nSECTION 7. That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is declared to be an emergency measure and the remaining sections of this ordinance shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 22,
    "meeting_date": "2021-07-26",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services"
    ]
  }
}