{
  "success": true,
  "vote": {
    "id": 1663,
    "item_number": "0",
    "title": "To require the wearing of face coverings in indoor public spaces in the City of Columbus to reduce and prevent the spread of COVID-19; to allow for enforcement and assessment of a civil penalty for a violation of said mandate; and to declare an emergency. (REPEALED BY ORD. 0683-2022; PASSED 3/7/2022)",
    "description": "Explanation\nDue to the ongoing health crisis and public health emergency and to reduce and prevent the spread of COVID-19, there exists a need for a face covering (mask) requirement in the City of Columbus.\n \nFiscal Impact: No funding is required for this legislation.\n \nTitle\nTo require the wearing of face coverings in indoor public spaces in the City of Columbus to reduce and prevent the spread of COVID-19; to allow for enforcement and assessment of a civil penalty for a violation of said mandate; and to declare an emergency. (REPEALED BY ORD. 0683-2022; PASSED 3/7/2022)\n \nBody\nWHEREAS, COVID-19 is a respiratory disease that can result in serious illness or death, caused by the SARS-CoV-2 virus, which is a strain of coronavirus that can easily spread from person to person. The virus is spread between individuals through respiratory droplets produced when an infected person coughs or sneezes. It may be possible that individuals can get COVID-19 by touching a surface or object that has the virus on it and then touching their own mouth, nose, or eyes; and\nWHEREAS, on January 30, 2020, the International Health Regulations Emergency Committee of the World Health Organization declared COVID-19 a public health emergency of international concern; and\nWHEREAS, on March 13, 2020, the Columbus Board of Health declared a Public Health Emergency due to this imminent threat of an acutely hazardous disease, posing a high probability of widespread exposure to an infectious agent that poses a significant risk of substantial harm to a large number of people, a large number of serious or long-term disabilities, or a large number of deaths, and said Public Health Emergency has subsequently been renewed multiple times and is currently in effect; and\nWHEREAS, since early March 2020, the City of Columbus has faced a pandemic that has resulted in extraordinary illness, long-term debilitating effects and loss of life, infecting over 100,000 and causing the death of more than 1,000 Columbus residents; and\nWHEREAS, in the City of Columbus there is a current threat of an acutely hazardous disease, illness, or health condition; specifically, COVID-19, and Franklin County, where Columbus is located, has been designated by the Center for Disease Control and Prevention as currently having high community transmission levels, characterized by more than 100 new cases per 100,000 persons in the past seven days, and more than 10 percent of positive nucleic acid amplification tests (NAATs) tests during the past seven days; and\nWHEREAS, the Centers for Disease Control and Prevention (CDC) estimates the Delta variant of the coronavirus now accounts for more than 90 percent of all sequenced coronavirus cases in the U.S.; and\nWHEREAS, Columbus Public Health (CPH) has determined the Delta variant is currently the most dominant strain of COVID-19 locally, has spread quickly among unvaccinated people of all ages, and has shown the ability to infect fully vaccinated individuals, cause symptomatic illness and be spread to others; and\nWHEREAS, the Delta variant is more aggressive and more transmissible than previously circulating strains and poses significant new risks in the ongoing effort to stop and slow the spread of the virus; and\nWHEREAS, central Ohio hospital systems are experiencing increased numbers of COVID-19 cases and increased numbers of hospital beds and ICU beds utilized by COVID-19 patients; and\nWHEREAS, staffing levels in central Ohio hospital systems are alarmingly low, taxing the ability of hospitals to provide COVID-19 care while tending to the community’s other critical healthcare needs; and\nWHEREAS, COVID-19 cases for 5 to 11-year-olds and 12 to 17-year-olds have increased dramatically over the past month, and slowing the spread is critical to the health and wellbeing of young people and to continuing safe, in-person learning in central Ohio school districts; and\nWHEREAS, the CDC has recognized vaccination as the leading public health prevention strategy to end the COVID-19 pandemic, and vaccines are safe, effective and widely available to any eligible resident; and\nWHEREAS, while over 738,353 Franklin County residents have been fully vaccinated against COVID-19, additional steps are necessary in order to protect against the rapid spread of the Delta variant; additional steps are necessary to ensure that the number of vaccinated residents continues to increase; and\nWHEREAS, face coverings and other public health precautions have proved to be critical in slowing and stopping the spread of COVID-19; and\nWHEREAS, face coverings can decrease the spread of respiratory droplets from people, and evidence has grown, as shown in numerous recent studies, that the use of face coverings decreases the spread of COVID-19 within populations; and\nWHEREAS, the CDC has issued guidance recommending wearing a mask indoors in public in most circumstances, even for fully vaccinated people, as well as where required by federal, state, local, tribal, or territorial laws, rules, and regulations, including local business and workplace guidance; and\nWHEREAS, some people have medical or behavioral health issues, disabilities, or other physical reasons that necessitate that they be exempted from wearing a face covering; and\nWHEREAS, the spread of COVID-19 continues to threaten the lives of the citizens of the City of Columbus and to substantially impair the functioning of city government and its ability to protect the lives and property of the citizens of the City of Columbus; and\n \nWHEREAS, an emergency exists in the City of Columbus as fully articulated in the preamble hereof such that enactment of this ordinance is necessary for the immediate preservation of the public peace, property, health, or safety; NOW THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. For the purposes of this ordinance, \"face covering\" means a piece of cloth, fabric, or other material that fully covers the mouth and nose and that is secured with ear straps or otherwise tied so as to prevent slipping. A face covering shall be worn so as to cover the mouth and nose in compliance with the CDC's guidance on wearing face coverings. A face covering may be factory-made, sewn by hand, or improvised from household materials and can be made of a variety of synthetic and natural fabrics, including cotton, silk, or linen. Ideally, a face covering has two (2) or more layers. Face coverings include, but are not limited to, bandanas, scarves, medical masks, and cloth masks. N95 masks, or other personal protective equipment that provides a higher level of protection than a face covering as defined in this Section are also included within this definition.\n \nSECTION 2. For purposes of this ordinance, “surgical mask” means American Society for Testing and Materials (ASTM) Level 1, 2, or 3 approved procedural and surgical masks, to include an N95 respirator approved by the National Institute for Occupational Safety and Health (NIOSH) or a respirator from another country allowed by the Occupational Safety & Health Administration (OSHA), the Food & Drug Administration (FDA), or the Centers for Disease Control (CDC).\n \nSECTION 3. For purposes of this Ordinance, \"place of business\" means any office, facility, building, or structure operated by or for a for-profit business or non-profit enterprise and which is engaged in the sale or other transaction of any kind for anything of value in exchange for goods, commodities, services, or temporary lodging and that is open to the general public or by appointment, and includes, but is not limited to, grocery stores, retail stores, pharmacies, health care facilities, restaurants and bars, banquet and catering facilities, personal care, grooming, and tattoo facilities, child care, day camp, and overnight camp facilities, hotels and motels (excluding a rented room or suite), gyms and similar facilities; but excluding religious facilities.\n \nSECTION 4. For purposes of this Ordinance, “indoor areas” or “inside” means all space closed in by a roof or other overhead covering of any kind and walls or other side coverings of any kind on at least three sides with appropriate openings for ingress and egress.\n \nSECTION 5. All individuals within the City of Columbus shall wear a face covering over the individual’s nose and mouth in indoor areas accessible to the public and within the confines of public or private transportation regulated by the City of Columbus, unless otherwise exempted, as follows:\n \na. While inside a place of business as to the areas within the place of business that are accessible to, and are intended for the use of, the public;\n \nb. While inside a City of Columbus operated building or facility as to the areas within such facility that are accessible to, and are intended for the use of, the public;\n \nc. In any public transportation such as a bus or other public transit vehicle regulated by the City of Columbus, as well as all Columbus airports, bus and train stations. This includes, but is not limited to, a taxi or any other vehicle for hire, even if the vehicle is privately owned; however, this provision does not apply to people traveling alone or with household members or friends in their personal vehicles;\n \nd. In certain high-density occupational settings where social distancing is difficult, such as manufacturing, construction, and agriculture and to include businesses or operations within North American Industry Classification System (NAICS) sectors 311 to 339 (manufacturing), 236 to 238 (construction), and 111, 112, 1151, and 1152 (agriculture);\n \ne. Workers in long term care facilities (LTC), including skilled nursing facilities (SNF), adult care homes (ACH), family care homes (FCH), mental health group homes, and intermediate care facilities for individuals with intellectual disabilities (ICF-IID) shall wear a surgical mask;\n \nf. Health care facilities other than LTC facilities must follow the face covering requirements in the CDC Infection Control Guidance for Healthcare Professionals about Coronavirus (COVID-19);\n \nSECTION 6. All places of business are hereby encouraged to post clear information, in visible locations, advising those entering a facility of the mask requirement contained in this Ordinance.  \n \nPlaces of business shall require all employees, contractors, volunteers, and any other individuals that interact with the public to wear a face covering, and places of business shall only sell or otherwise enter into any transaction of any kind for anything of value in exchange for goods, commodities, services, or provide temporary lodging to those who comply with this ordinance. Any manager, owner, or person in charge of a place of business who recklessly fails or refuses to comply with the requirements of this ordinance may be found to be in violation of this ordinance. Anyone who declines to wear a Face Covering for any of the reasons which constitute an exemption should not be required to produce documentation or any other proof of a condition to a place of business.\n \nSECTION 7.  The requirement to wear a face covering through this Ordinance does not apply in the following situations:\n \na. Any individual who should not wear a face covering because of a medical condition, mental health condition or developmental disability, or who is unable to remove the face covering without assistance, and any individual who should not wear face coverings under the CDC guidance. \n                      \nb. Individuals under 3 years old;\n \nc. An individual that is actively eating or drinking. \n \nd. When seeking to communicate with someone who is hearing-impaired in a way that requires the mouth to be visible;\n \ne. When giving a speech or performance for a broadcast or to an audience, including but not limited to plays, musical performances, wedding officiants and wedding participants;\n \nf. Working at home or while in a personal vehicle;\n \ng. When temporarily removing a face covering to secure government or medical services or for identification purposes;\n \nh. Individuals who would be at risk from wearing a Face Covering at work, as determined by local, state, or federal regulations or workplace safety guidelines;\n \ni. When wearing a face covering is impeding visibility to operate equipment or a vehicle;\n \nj. A child whose parent, guardian, or responsible person has been unable to place the face covering safely on the child’s face;\n \nk. School individuals (including students, administrators, and teachers) on or in school or school district facilities, so that schools and school districts may follow the regulations and guidelines promulgated by their governing bodies and the Ohio Department of Education. For this Ordinance, \"school or school districts\" means any public, private, or charter school or institution that provides education for any or all of the following grades or education: kindergarten through twelfth grade; or a university, college, or similar post-secondary institution;\n \nl. In settings where it is not practicable or feasible to wear a face covering such as when receiving dental services, medical treatments, while swimming, or while acting as an on-duty lifeguard;\n \nm. When actively engaged in exercise, sport, coaching, or officiating in a training, recreational, or competitive capacity;\n \nn. When inside a personal or commercial vehicle either parked or moving that is not a vehicle described in Section 5(c);\n \no. Law enforcement officers, firefighters, EMTs and other first responders, while encouraged to wear Face Coverings, are specifically exempt from this order while engaged in the exercise of their duties outside of an office or business-type setting;\n \np. Individuals complying with the directions of public safety employees or emergency responders;\n \nq. Individuals inside religious facilities or other facilities used for religious ceremony, leading or actively participating in religious services, funerals or wedding ceremonies, or otherwise engaged in First Amendment protected activity;\n \nr. Facilities owned and operated by the Federal and State Government are exempt from this order.\n \nSECTION 8. Columbus Public Health shall have the authority to investigate and is directed to enforce the provisions of this ordinance.\n \nSECTION 9. Citations to places of business under this Ordinance shall be written only to those places of business that recklessly fail to enforce the requirements of this Ordinance. Places of business are entitled to rely on their customers’ or patrons’ statements about whether or not they are exempted from the Face Covering requirements, and businesses and organizations do not violate this Ordinance if they rely upon such statements.  Further, the posting of clear information, in visible locations, advising customers and patrons entering a facility of the mask requirements contained in this Ordinance shall be prima facie evidence of enforcement by a place of business as to customers and patrons.\n \nIf Columbus Public Health observes a violation of this Ordinance, a civil citation may issue and the following schedule of civil penalties may be imposed upon a place of business and/or a manager, owner, or person in charge of a place of business who recklessly fails or refuses to comply with the requirements of this ordinance:  \n \na. For a first violation, a warning of violation shall be issued;\n \nb. For a second violation, a fine of $500.00 shall be issued;\n \nc. For a third violation and for each subsequent violation, a fine of $1,000.00 shall be issued.\n \nSECTION 10. If Columbus Public Health observes a violation of this Ordinance, a civil citation may issue and the following schedule of civil penalties may be imposed upon an individual who recklessly fails or refuses to comply with the requirements of this ordinance:\n \na. For a first violation, a warning of violation shall be issued;\n \nb. For a second violation, a fine of $100.00 shall be issued.\n \nc. For a third violation and for each subsequent violation, a fine of $250.00 shall be issued.\n \nLaw enforcement personnel are not authorized to criminally enforce the Face Covering requirements of this Ordinance against individual workers, customers, or patrons.  However, if a place of business does not allow entry to a worker, customer, or patron because that person refuses to wear a Face Covering, and if that worker, customer, or patron enters the premises or refuses to leave the premises, law enforcement personnel may enforce existing trespassing laws and any other laws that the worker, customer, or patron may violate.\n \nSECTION 11. Violators have the right to appeal civil penalties pursuant to and in accordance with Columbus City Health Code Section 203.08.\n \nSECTION 12. Columbus Public Health, through its Commissioner or designee, is hereby instructed to provide ongoing reports to City Council, no less than every 30 days, on the current status of the COVID-19 public health emergency and the ongoing community response for so long as this Ordinance remains in effect.\n \nSECTION 13. This ordinance is hereby declared to be an emergency measure and upon signature by the Mayor shall take full force and effect at 8:00am on Tuesday September 14, 2021.  This Ordinance shall remain in effect so long as the Mayoral proclamation of emergency issued September 10, 2021 remains in effect or until further act of Council.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 23,
    "meeting_date": "2021-09-13",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services"
    ]
  }
}