{
  "success": true,
  "vote": {
    "id": 1698,
    "item_number": "CA-30",
    "title": "To authorize the Director of Recreation and Parks enter into two lease agreements with Columbus City Schools (CCS) for two community playgrounds located at John Burroughs Elementary School and Linden Park; and to declare an emergency. ($0.00)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Director of Recreation and Parks to enter into two lease agreements with Columbus City Schools (CCS) for two community playgrounds. The lease agreements will allow further partnership with Columbus City Schools as well as the West Side and Linden Communities. The lease agreements will involve two (2) separate projects. \n \nThe lease for the John Burroughs Elementary School, located at 551 S. Richardson Ave., Columbus, Ohio 43204, will be established for 2021 through 2031. The City of Columbus will be the lessee of this property owned by CCS. The City of Columbus will maintain the City assets, including the playground and shelter. This lease will facilitate the replacement of the existing playground and shelter that the City installed in 1998, with a 10 year lease agreement, which expired in 2008.  The new lease agreement will allow for removal of older damaged equipment and replace with new equipment.  The community, in attendance with meetings with community members and Civic Associations, have expressed concern for the lack of recreation within the community. The lease agreement will allow for the project to be successful.  \n \nThe lease for the new playground installation at Linden Park and Community Center, located at 1350 Briarwood Ave, Columbus, Ohio 43211, will also be established. The City of Columbus will be the lessor of this lease, as the City of Columbus owns the Linden Park and Community Center. This will be a new playground to support the Linden Community Center, the CCS’s Columbus Early Learning Center, and the Linden Community. Currently, the Columbus Early Learning Center does not have outdoor play equipment. This lease agreement will allow CCS to lease the playground and maintain the playground for use by The Columbus Early Learning Center. CCS will maintain the playground and associated fencing. \n \nPrincipal Parties: \nColumbus City Schools\n270 East State Street\nColumbus, OH  43215                                                      \nRobert Mickley, (380) 997-7470\n \nEmergency Justification: Emergency action is requested so that the leases can be executed immediately, allowing the new play equipment to be installed and used by the community as soon as possible. \n \nBenefits to the Public: These two lease agreements will allow the partnership with CCS, providing the community new play equipment and recreational opportunities.  \n \nCommunity Input/Issues: There were several meetings with the Greater Hilltop and West Side community groups and Civic Association about the John Burroughs play equipment and shelter. The community is pushing for the amenities. Similarly, we continue to meet with the Linden community groups on the new Linden Community Center and Park, including the implementation of the new playgrounds and the continued support for the Columbus Early Learning Center.  \n \nArea(s) Affected: North Linden (40), Greater Hilltop (53)\n \nMaster Plan Relation: This project will support the Recreation and Parks Master Plan by expanding recreational amenities. It also maximizes the use of partnerships to improve programming and community offerings.\n \nFiscal Impact: No fiscal action is required at this time. \nTitle\n \nTo authorize the Director of Recreation and Parks enter into two lease agreements with Columbus City Schools (CCS) for two community playgrounds located at John Burroughs Elementary School and Linden Park; and to declare an emergency. ($0.00)\n \nBody\n \nWHEREAS, it is necessary to authorize the Director of Recreation and Parks to enter into two lease agreements with Columbus City Schools (CCS) for two community playgrounds located at John Burroughs Elementary School and Linden Park; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Recreation and Parks Department in that it is immediately necessary to authorize the Director enter into these agreements so that the leases can be executed immediately, allowing the new play equipment to be installed and used by the community as soon as possible, all for the preservation of public health, peace, property, safety, and welfare; NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Recreation and Parks is hereby authorized enter into two lease agreements with Columbus City Schools (CCS) for two community playgrounds located at John Burroughs Elementary School and Linden Park. \n \nSECTION 2. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 23,
    "meeting_date": "2021-09-13",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Emergency Services",
      "Parks & Recreation"
    ]
  }
}