{
  "success": true,
  "vote": {
    "id": 1718,
    "item_number": "CA-50",
    "title": "To authorize the Director of Public Service to submit applications for the Local Transportation Improvement Program and State Capital Improvement Program and to execute project agreements for approved projects; to authorize the Director of Public Service and the Director of Finance and Management to submit loan documents and borrow money from the Ohio Public Works Commission for projects as awarded under the State Capital Improvement Program; to authorize the Director of Finance and Management and City Auditor, as appropriate, to sign for funding use certification, local match availability, and to certify loan portion repayment; and to declare an emergency.  ($0.00)",
    "description": "Explanation\n1.  BACKGROUND\nThe Mid-Ohio Regional Planning Commission (MORPC) is accepting Ohio Public Works Commission (OPWC) Round 36 applications for the Local Transportation Improvement Program (LTIP) and State Capital Improvement Program (SCIP). MORPC serves in a staff support capacity to the District Three (Franklin County) Public Works Integrating Committee (PWIC).\n \nOPWC requires that a designated official be authorized to submit said applications and execute project agreements for approved projects.  Additionally, OPWC is required to award a minimum of 10% of the SCIP funding as a no interest loan; in order to make City applications more favorable, some of the applications may include a request for a no interest loan. Therefore, the applications and ensuing agreements may also require a signature from the Director of Finance and Management and City Auditor, as appropriate, to sign for funding use certification, local match availability, and to certify loan portion repayment.\n \nThis ordinance will authorize the Director of Public Service to submit applications and to execute project agreements for approved projects. The ordinance will also authorize the Director of Finance and Management and City Auditor, as appropriate, to sign for funding use certification, local match availability, and to certify loan portion repayment.\n \n2.  EXPECTED PROJECTS\nThe Department of Public Service plans to submit applications for the following projects:\n \n440005-102221 - Bridge Rehab - UIRF - Milo Grogan Second Avenue Improvements - This project will improve Second Avenue, from 6th Street to St. Claire Avenue.  These improvements will include new sidewalks, permeable paver parking, curbs, curb extensions, street trees, lighting, new cast in place retaining walls and retaining wall repairs. The total project cost is approximately $7,509,220.\n \n530161-100035 - Roadway Improvements - Front Street and Marconi Boulevard - This project will convert both Front Street and Marconi Boulevard from one-way operation to two-way operation, from Broad Street to Hickory Street.  Improvements also include installing improved street lighting, replacing existing traffic signals, enhanced pedestrian crossings, and reconfiguring the intersection of Front Street and Hickory Street.  The total project cost is approximately $10,082,515.\n \n531034-100005 Roadway - Sullivant Ave - I-70 EB Entrance Ramp - To improve pedestrian safety and mobility along Sullivant Avenue, this project will reconfigure the Sullivant Avenue entrance ramp to eastbound I-70 by eliminating the eastbound slip ramp from Sullivant and creating an eastbound right-turn lane at the existing intersection of Sullivant Avenue with the ramp from Sullivant Avenue westbound. Curb, sidewalk, street lighting, and other incidentals will be adjusted accordingly. The total project cost is approximately $520,894.\n \n538005-100000 - Intersection - Broad St at James Rd - This project will improve the intersection of Broad Street and James Road.  Project improvements including constructing medians along James Road, constructing additional turn lanes, providing new turn phasing, reconstructing existing traffic signals and installing backplates, modifying signal timing, and improving street signage.  The total project cost is approximately $7,086,937.\n \n545012-100000 - Signals - Summit Street - Warren St to E 7th Ave - This project will replace and improve existing traffic signals at the following intersections on Summit Street: Warren Street; E. 1st Avenue; E. 2nd Avenue; E. 5th Avenue; E. 7th Avenue.  The existing traffic signals at these intersections will be completely replaced, including new poles and equipment, to meet current design and technology standards. New fiber optic cable will be installed within the limits of each intersection to connect the signals and tie into the existing Columbus Traffic Signal System (CTSS) network. Additionally, the northwest corner curb line at the intersection of Summit Street/N 3rd Street and Warren Street will be reconfigured to accommodate the southbound right turn movement for a school bus within the roadway without over-tracking the curb and sidewalk. The project will also replace or upgrade curb ramps, sidewalk, roadway pavement, roadway drainage, signs, and pavement markings within areas specifically impacted by the traffic signal reconstruction. The total project cost is approximately $3,974,506.\n \nThis project listing is meant to be illustrative and is believed to be accurate and complete; however, last minute project additions and substitutions are permitted at the discretion of the Director of Public Service.\n \n 3.  FISCAL IMPACT\nApproval of this legislation will provide an opportunity to secure funds for various projects.  The preliminary allocation for the District Three Public Works Integrating Committee is approximately $27,351,000, and it is to be awarded in the form of grants and loans.  As a part of the application for grant funds, the City may apply for a maximum of $3,000,000 in loans as necessary to make the applications more favorable to OPWC and the City.\n \nNo financial participation is required at this time.  City funds will be approved in the form of design contracts and/or construction contracts that will be or have been submitted for Council's approval.\n \n4.  EMERGENCY DESIGNATION\nThe Department of Public Service requests emergency action to submit applications for grant and loan funding to OPWC before the application deadline.\n \nTitle\nTo authorize the Director of Public Service to submit applications for the Local Transportation Improvement Program and State Capital Improvement Program and to execute project agreements for approved projects; to authorize the Director of Public Service and the Director of Finance and Management to submit loan documents and borrow money from the Ohio Public Works Commission for projects as awarded under the State Capital Improvement Program; to authorize the Director of Finance and Management and City Auditor, as appropriate, to sign for funding use certification, local match availability, and to certify loan portion repayment; and to declare an emergency.  ($0.00)\n \nBody\nWHEREAS, the Ohio Public Works Commission requires that the City of Columbus designate and authorize officials to submit Round 36 applications, execute project agreements, sign for funding use certification and local match availability, and to certify loan portion repayment for Local Transportation Improvement and State Capital Improvement Programs; and\n \nWHEREAS, application amounts are approximate depending upon OPWC scoring criteria; and\n \nWHEREAS, approved applications will require execution within 45 days of notification by the Ohio Public Works Commission; now, therefore\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to authorize the Director of Public Service to submit applications for grant and loan funding to OPWC before the application deadline, thereby preserving the public health, peace, property, safety, and welfare; now, therefore \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Service be and is hereby authorized to submit applications and execute project agreements with the Ohio Public Works Commission on behalf of the City of Columbus for the Local Transportation Improvement Program and State Capital Improvement Program projects.\n \nSECTION 2.  That the Director of Public Service and Director of Finance and Management be and are hereby authorized to submit loan documents and borrow money from the Ohio Public Works Commission on behalf of the City of Columbus for projects as awarded under the State Capital Improvement Program.\n \nSECTION 3.  The Director of Finance and Management and City Auditor, as appropriate, are authorized to sign any consequential promissory notes for a grand total of no more than $3,000,000 to certify Round 36 OPWC funding for the City's SCIP loan portion of any project that is awarded a no interest loan. \n \nSECTION 4.  At the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements.\n \nSECTION 5.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or 10 days after its passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 23,
    "meeting_date": "2021-09-13",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Economic Development"
    ]
  }
}