{
  "success": true,
  "vote": {
    "id": 1721,
    "item_number": "CA-53",
    "title": "To authorize the Director of Finance and Management to establish a contract with HYO Inc. for the installation of snow and safety equipment for the Division of Infrastructure Management; to authorize the expenditure of $119,265.00 from the Street Construction Maintenance and Repair Fund; and to declare an emergency. ($119,265.00).",
    "description": "Explanation                     \n1. BACKGROUND:  \nTo authorize the Director of Finance and Management to enter into a contract with HYO Inc. dba Pengwyn for the installation of snow and safety equipment on five (5) city supplied trucks.  This equipment will be used by the Division of Infrastructure Management in public right of way. \n \nThe Purchasing Office advertised and solicited competitive bids in accordance with the relevant provisions of City Code Chapter 329 relating to competitive bidding (RFQ019380). Registered vendors were solicited and three (3) bids were received. After reviewing the bids, the Division of Infrastructure recommends an award be made to HYO Inc. in the amount of $119,265.00 as the responsive, responsible and best bidder. The lowest bidder did not provide the required clutch pump that would allow our equipment to be interchangeable with our existing trucks and therefore did not meet the division's required specifications.  \nCompany Name                                                                           Bid Amount                            City/State                          Majority/MBE/FBE\nAce Truck Body Inc.                                                              $74,975.00                          Grove City/ OH                                          Majority\nHYO Inc.                                                                                         $119,265.00                         Columbus/ OH                                           Majority\nQuality Truck Body and Equipment Co.       $147,200.00                         Youngstown/OH                                   FBE\n \nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against HYO Inc.\n \n2.  CONTRACT COMPLIANCE:\nHYO Inc. contract compliance number is CC004832 and expires 3/16/23.  \n \n3. FISCAL IMPACT:  Funding for this purchase was budgeted and is available with the Street Construction Maintenance and Repair Fund (2265).\n4.  EMERGENCY DESIGNATION\nThe department requests emergency designation for this legislation so that the equipment can be built and be available for winter operations as quickly as possible.   \nTitle\n \nTo authorize the Director of Finance and Management to establish a contract with HYO Inc. for the installation of snow and safety equipment for the Division of Infrastructure Management; to authorize the expenditure of $119,265.00 from the Street Construction Maintenance and Repair Fund; and to declare an emergency. ($119,265.00). \nBody\n \nWHEREAS, the Purchasing Office advertised and solicited competitive bids in accordance with the relevant provisions of City Code Chapter 329 relating to competitive bidding (RFQ019380); and\n \nWHEREAS, the Division of Infrastructure Management recommends an award be made to the responsive, responsible and best bidder, HYO Inc. and \n \nWHEREAS, it is necessary to authorize the Director of Finance and Management to enter into a contract with HYO Inc. for the installation of snow and safety equipment in the amount of up to $119,265.00; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Department of Public Service in that it is immediately necessary to authorize the Director of Finance and Management to enter into a contract with HYO Inc. in accordance with the terms, conditions and specifications of Solicitation Number RFQ019380 on file in the Purchasing Office, so that the equipment can be built and be available for winter operations thereby preserving the public health, peace, property, safety, and welfare; NOW, THEREFORE.\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Finance and Management be and is hereby authorized to establish a contract with HYO Inc. for the installation of snow and safety equipment for the Division of Infrastructure Management in accordance with RFQ019380 specifications on file in the Purchasing Office.\n \nSECTION 2.  That the expenditure of $119,265.00, or as much thereof as may be needed, is hereby authorized in Fund 2265, the Street Construction Maintenance and Repair Fund, Dept-Div 5911 (Division of Infrastructure Management) in Object Class 03 (Services) per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\nSECTION 5. That for reasons stated in the preamble hereto, where is hereby made a part hereof, this ordinance is hereby declared an emergency measure, which shall take effect and be in force from and after its passage and approved by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 23,
    "meeting_date": "2021-09-13",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}