{
  "success": true,
  "vote": {
    "id": 1833,
    "item_number": "CA-53",
    "title": "To accept the application (AN21-002) of Tucker Bear Capital LLC for the annexation of certain territory containing 7.7± acres in Mifflin Township.",
    "description": "Explanation\nAN21-002\nBACKGROUND:\nThis ordinance approves the acceptance of certain territory (AN21-002) by the city of Columbus. The Ohio Revised Code stipulates that to be effective, City acceptance must take place a minimum of 60 days from the receipt by the City Clerk of the approval notice from the county. If City Council does not accept the ordinance within 120 days of its first consideration, the annexation will be considered rejected. This petition was filed with Franklin County on February 23, 2021. City Council approved a service ordinance addressing the site on March 8, 2021. Franklin County approved the annexation on April 27, 2021 and the City Clerk received notice on June 2, 2021. \nFISCAL IMPACT: \nProvision of municipal services does represent cost to the City; however, the annexation of land also has the potential to create revenue to the City.\n \nTitle\nTo accept the application (AN21-002) of Tucker Bear Capital LLC for the annexation of certain territory containing 7.7± acres in Mifflin Township.\n \nBody\nWHEREAS, a petition for the annexation of certain territory in Mifflin Township was filed on behalf of Tucker Bear Capital LLC on February 23, 2021; and\nWHEREAS, the petition was considered and approved by the Franklin County Board of Commissioners at a hearing on April 27, 2021; and\nWHEREAS, on June 2, 2021, the City Clerk received from Franklin County a certified copy of the resolution addressing the petition; and\nWHEREAS, sixty days have now elapsed since receipt of the resolution in accordance with the provisions of the Ohio Revised Code; and \nWHEREAS, it is in the best interest of the city of Columbus to accept the annexation of the territory addressed by the petition; now, therefore, \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS\nSECTION 1. That the annexation proposed by Tucker Bear Capital LLC in a petition filed with the Franklin County Board of Commissioners on February 23, 2021 and subsequently approved by the Board on April 27, 2021 is hereby accepted and said territory is hereby annexed to the city of Columbus. Said territory is described as follows:\nSituated in the State of Ohio, County of Franklin, Township of Mifflin, Quarter Township 3, Township I, Range 17, United States Military Lands, being a 7.7± acre tract, said 7.7± acre tract being part of an Original 2.707 acre tract of land (APN: 191-002667) conveyed to Tucker Bear Capital LLC of record in Instrument Number 202011060176332, being part of a second Original 2.707 acre tract of land (APN: 191-002668) conveyed to Tucker Bear Capital LLC of record in Instrument Number 202010220164982 and part of a third Original 2.707 acre tract of land (APN: 191-002678) conveyed to Tucker Bear Capital LLC of record in Instrument Number 202010190161557, and being more particularly described as follows:\nBeginning at a point in the northerly line of said first Original 2.707 acre tract (APN: 191-002667), being the southeasterly comer of an Original 5 acre tract of land conveyed to Trustees Agler Rd Parcel #3 of record in Instrument Number 201008190106494, being the southwesterly comer of an Original 4.07 acre tract of land conveyed to Niarn Stelzer Road LLC of record in Instrument Number 201704.190052755 and being at a comer of a City of Columbus Corporation Line (Case No. 199, Ord. No. 1066-64, MR 137-331); \nThence S 86° 34' 49\" E, along the northerly line of said first Original 2.707 acre tract (APN: 191-002667), along the southerly line of said Original 4.07 acre tract, and leaving said City of Columbus Corporation Line, 890.38± feet to a common comer thereof, to a southwesterly comer of a 0.082 acre tract of land described as Parcel 53WD and conveyed to Franklin County Commissioners of record in Instrument Number 200411180264457, being at the northwesterly comer of a 0.133 acre tract of land described as Parcel 52WD and conveyed to Franklin County Commissioners of record in Instrument Number 200408120188054, being in the westerly right-of-way line of Stelzer Road and being in a City of Columbus Corporation Line (Case No. 22-06, Ord. No. 0043-2007, 1.N. 200705150084538 & I.N. 200705150084542 (Plat));\nThence S 03° 32' 52\" W, along the easterly line of all three Original 2.707 acre tracts, along the westerly line of said Parcel 52WD, along the westerly line of a 0.133 acre tract of land described as Parcel 51WD and conveyed to Franklin County Commissioners of record in Instrument Number 200407210169351, along the westerly line of a 0.133 acre tract of land described as 50WD and conveyed Jo Franklin County Commissioners of record in Instrument Number 200407230171147, along said right-of-way line and along said City of Columbus Corporation Line, 299.77± feet to the southeasterly comer of said third Original 2.707 acre tract (APN: 191- 002678), to the southwesterly comer of said Parcel 50WD, to the northwesterly comer of a 0.133 acre tract of land described as 49WD and conveyed to Franklin County Commissioners of record in Instrument Number 200407210169321, to the current northeasterly comer of a fourth Original 2.707 acre tract of land (APN: 010-212112) conveyed to Tucker Bear Capital LLC of record in Instrument Number 202010220164984 and being in a City of Columbus Corporation Line (Case NO. 61-87, Ord. No. 923-88, O.R. 11615A0I); \nThence N 86° 43' 15\" W, along the southerly line of said third Original 2.707 acre tract (APN: 191-002678), along the northerly line of said fourth Original 2.707 acre tract (APN: 010-212112) and along said City of Columbus Corporation Line, 1120.58± feet to a common comer thereof, being in the easterly line of a 10.321 acre tract conveyed to Trustees Agler Rd Parcel #2 of record in Instrument Number 201008230108139 and in a City of Columbus Corporation Line (Case No. 199, Ord. No. 1066-64, MR 137-331);\nThence N 03° 35' 40\" E, along the westerly line of said first three Original 2.707 acre tracts, along said 10.321 acre tract and along said City of Columbus Corporation Line, 302.52± feet to a northwesterly comer of said first Original 2.707 acre tract and to the southwesterly comer of said Original 5 acre tract; \nThence S 86° 34' 40\" E, along the northerly line of said first Original 2.707 acre tract, along the southerly line of said Original 5 acre tract and along said City of Columbus Corporation Line, 229.51± feet to the True Point of Beginning, and containing 7. 7± acres, more or less. \nSECTION 2. That the City Clerk is hereby authorized and directed to make three copies of this ordinance to each of which shall be attached a copy of the map accompanying the petition for annexation, a copy of the transcript of proceedings of the Board of County Commissioners relating thereto, and a certificate as to the correctness thereof, the City Clerk shall then forthwith deliver one copy to the County Auditor, one copy to the Board of Elections thereof and do such other things as may be required by law.\nSECTION 3. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 24,
    "meeting_date": "2021-09-20",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "General"
    ]
  }
}