{
  "success": true,
  "vote": {
    "id": 1838,
    "item_number": "CA-58",
    "title": "To accept the application (AN21-012) of Jeffrey D and Rose M Lyons for the annexation of certain territory containing 1.12± acres in Perry Township and to authorize the submission of a petition to the Board of Commissioners of Franklin County, Ohio, requesting a change in the boundary lines of Montgomery Township so as to make them identical with the corporate boundaries of the city of Columbus for this annexation.",
    "description": "Explanation\nAN21-012\n \nBACKGROUND:\nThis ordinance approves the acceptance of certain territory (AN21-012) by the city of Columbus and authorizes its transfer from Perry Township to Montgomery Township per an annexation agreement between the City and the Township. The Ohio Revised Code stipulates that to be effective, City acceptance must take place a minimum of 60 days from the receipt by the City Clerk of the approval notice from the county. If City Council does not accept the ordinance within 120 days of its first consideration, the annexation will be considered rejected. This petition was filed with Franklin County on May 24, 2021. Franklin County approved the annexation on June 15, 2021 and the City Clerk received notice on June 29, 2021. No service ordinance was required because this annexation was filed as a Type 1 application as defined by the ORC. Although not required, a service statement reflecting the City’s ability to provide services for this site upon annexation is attached.\n \nThe use of a Type 1 annexation application is stipulated in the annexation agreement between the City and Perry Township.  The annexation agreement also requires that territory annexed to the City of Columbus from Perry Township be transferred to Montgomery Township. This ordinance authorizes the submission of a petition to the Board of County Commissioners of Franklin County, Ohio, requesting that the boundary lines of Montgomery Township be changed to make them identical with the corporate limits of the City of Columbus for this annexation. The petition will be filed in accordance with Section 503.07 of the Ohio Revised Code.  \n \nFISCAL IMPACT: \nProvision of municipal services does represent cost to the City; however, the annexation of land also has the potential to create revenue to the City. \n \nTitle\nTo accept the application (AN21-012) of Jeffrey D and Rose M Lyons for the annexation of certain territory containing 1.12± acres in Perry Township and to authorize the submission of a petition to the Board of Commissioners of Franklin County, Ohio, requesting a change in the boundary lines of Montgomery Township so as to make them identical with the corporate boundaries of the city of Columbus for this annexation.\n \nBody\nWHEREAS, a petition for the annexation of certain territory in Perry Township was filed on behalf of Jeffrey D and Rose M Lyons on May 24, 2021; and\n \nWHEREAS, the petition was considered and approved by the Franklin County Board of Commissioners at a hearing on June 15, 2021; and\n \nWHEREAS, on June 29, 2021, the City Clerk received from Franklin County a certified copy of the resolution addressing the petition; and\n \nWHEREAS, sixty days have now elapsed since receipt of the resolution in accordance with the provisions of the Ohio Revised Code; and \n \nWHEREAS, it is in the best interest of the city of Columbus to accept the annexation of the territory addressed by the petition; and \n \nWHEREAS, the annexation agreement between Perry Township and the City of Columbus requires the City to transfer territory annexed from Perry Township to the city of Columbus and to conform the boundaries of Montgomery Township to make them identical with the corporate limits of the city; now, therefore, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS\n \nSECTION 1. That the annexation proposed on behalf of Jeffrey D and Rose M Lyons in a petition filed with the Franklin County Board of Commissioners on May 24, 2021 and subsequently approved by the Board on June 15, 2021 is hereby accepted and said territory is hereby annexed to the city of Columbus. Said territory is described as follows:\n \nSITUATED in the State of Ohio, County of Franklin, Township of Perry, being a part of Section 1 Township 2 Range 19 U.S. Military Lands, and being all of Lot 18 and the west half of Lot 17 of Skyline Addition No. 2, Plat Book (P.B.) 27, pg. 22, conveyed to Jeffrey D. and Rose M. Lyons in Instrument (Instr.) No. 200012110249188, Franklin County Recorders' Office; \n \nBEGINNING at a comer of an annexation to the City of Columbus, City Ordinance (Ord.) No. 643-1989, Official Record (O.R.) 13292 B-11, being the southwest comer of the said Lot 18, the southeast comer of Lot 19 of the said Skyline Addition No. 2, the northeast corner of Lot 22 of Skyline Addition No. 4, P.B. 25, pg. 59, and the northwest comer of Lot 21 of the said Skyline Addition No. 4;\n \nTHENCE in a northerly direction, a distance of approximately 282 feet, along the west line of the said Lot 18 and the east line of the said Lot 19, and an east line of the annexation in City Ord. No. 643-1989, to a point, being the northwest comer of the said Lot 18, the northeast corner of the said Lot 19, a corner of the said annexation in City Ord. No. 643-1989, and being a point in the south right of way line of Snouffer Rd. (width variable, P.B. 27, pg. 22); \n \nTHENCE in a easterly direction, a distance of approximately 172 feet, along the north line the said Lots 18 and 1 7, the south right of way line of the said Snouffer Rd., a line of the annexation in City Ord. No. 643-1989, and a south line of an annexation to the City of Columbus, City Ord. No. 1949-1987, O.R. 10572 B-19, to a point, being the northeast comer of the said Lyons tract and the northwest corner of a tract conveyed to Dale Harris in Instr. No. 200403100052337, being the midpoint of the north line of the said Lot 17; \n \nTHENCE in a southerly direction, a distance of approximately 282 feet, along the east line of the said Lyons tract and the west line of the said Harris tract, to a point in the south line of the said Lot 17, in the north line of Lot 20 of the said Skyline Addition No. 4, and in a north line of the said annexation in City Ord. No. 643-1989, being the southeast comer of the said Lyons tract and the southwest of the said Harris tract; \n \nTHENCE in a westerly direction, a distance of approximately 172 feet, along the south lines of the said Lot 17 and 18, the north lines of the said Lots 20 and 21, and a north line of the said annexation in City Ord. No. 643-1989, to the point of beginning, having an area of 48,645 square feet or 1.117 acres to be annexed, all out of the said Lyon tract (PID 212-000813), and the P.R. 0. is zero;\n \nSECTION 2. That the City Clerk is hereby authorized and directed to make three copies of this ordinance to each of which shall be attached a copy of the map accompanying the petition for annexation, a copy of the transcript of proceedings of the Board of County Commissioners relating thereto, and a certificate as to the correctness thereof, the City Clerk shall then forthwith deliver one copy to the County Auditor, one copy to the Board of Elections thereof and do such other things as may be required by law.\n \nSECTION 3.  That pursuant to the provisions of Section 503.07 of the Ohio Revised Code the Director of the Department of Development be and is hereby authorized and directed on behalf of the City of Columbus to present to the Board of Commissioners of Franklin County, Ohio, a petition requesting such changes in and extensions of the boundary lines of Montgomery Township as may be necessary so that said township may include therein that portion of Perry Township, which by the order of the Board of County Commissioners of Franklin County, Ohio, on June 15, 2021 was approved for annexation to the city of Columbus, so as to make the boundaries of Montgomery Township co-extensive with the corporate limits of the said city of Columbus in accordance with the maps attached to said petition.\n \nSECTION 4. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 24,
    "meeting_date": "2021-09-20",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "General"
    ]
  }
}