{
  "success": true,
  "vote": {
    "id": 1841,
    "item_number": "CA-61",
    "title": "To authorize and direct the Board of Health to modify by increasing existing contract with Propio LS LLC, to continue to provide interpretation/translation services for Columbus Public Health, through March 31, 2022; and to declare an emergency. ($80,000.00)",
    "description": "Explanation\n \nOrdinance 1465-2020, approved by City Council on July 6, 2020, authorized the Board of Health to modify and increase the contract for interpretation services with Vocalink Inc. by $100,000.00 for an amount not to exceed $130,000.00, through December 30, 2020. Ordinance 2438-2020 authorized the Board of Health to modify and increase the contract for interpretation services with Vocalink Inc. by $110,000.00 for an amount not to exceed $240,000.00 through December 30, 2020. Ordinance 0811-2021, approved by City Council on April 19, 2021, authorized the Board of Health to modify by extending Vocalink contracts PO250852 and PO250896. Ordinance 2120-2021, authorized the Board of Health to accept name and Federal Identification number change of Vocalink Inc. and the assignment of all their present and future contracts with the City of Columbus to Propio LS LLC. \n \nThis ordinance is needed to modify, by increasing, the contract with Propio LS LLC in the amount of $80,000.00 for a total contract amount not to exceed $320,000.00, for a time period ending March 31, 2022. This modification is needed to continue Interpretation Services to CPH clients. \n \nColumbus Public Health provides interpretation services for persons with limited English proficiency who receive public health services from Columbus Public Health. These services will be provided at Columbus Public Health’s facility located at 240 Parsons Avenue, and throughout the City of Columbus in conjunction with public health services when required. The COVID-19 pandemic has also resulted in an increased need for telephone and document interpretation services.\n \nEmergency action is requested for this contract modification in order to ensure Columbus has interpretation/translation services, and to continue to save lives.\n \nFISCAL IMPACT:  The funds needed to modify this contract with Propio LS LLC are budgeted within the Health Department Special Revenue Fund;\n \nTitle\n \nTo authorize and direct the Board of Health to modify by increasing existing contract with Propio LS LLC, to continue to provide interpretation/translation services for Columbus Public Health, through March 31, 2022; and to declare an emergency. ($80,000.00)\n  \nBody\n \nWHEREAS, it is necessary to modify by increasing Propio LS LLC contract PO220721 for a period through March 31, 2022; and\n \nWHEREAS, this ordinance is being submitted as an emergency measure so that timely services can proceed without interruption; and\n \nWHEREAS, an emergency exists in the usual daily operation of Columbus Public Health in that it is immediately necessary to authorize the Board of Health to modify the contract with Propio LS LLC PO220721, by an increase in the amount of $80,000, for the immediate preservation of the public health, peace, property, safety and welfare;  Now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Board of Health is hereby authorized to modify, by increasing, Propio LS LLC contract PO220721, for a period through March 31, 2022 by $80,000.00, for a total contract amount not to exceed $320,000.00. \n \n \nSECTION 2. That to pay the cost of said contract modification; the expenditure of $80,000.00 is hereby authorized from the Health Special Revenue Fund, Fund No. 2250, Department of Health, Department No. 50, Division No. 5001 per the accounting codes attached to this ordinance.\n \nSECTION 3.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5. That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 24,
    "meeting_date": "2021-09-20",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Emergency Services",
      "Health & Safety"
    ]
  }
}