{
  "success": true,
  "vote": {
    "id": 1857,
    "item_number": "SR-14",
    "title": "To authorize the Administrative and Presiding Judge of the Franklin County Municipal Court to enter into contract with Alvis, Inc. for assessment specialist services; to authorize an appropriation and expenditure within the Public Safety Initiatives subfund; and to declare an emergency. ($150,000.00)",
    "description": "Explanation\nThis ordinance authorizes the Administrative and Presiding Judge of the Franklin County Municipal Court to enter into contract with Alvis, Inc., a non-profit entity, for assessment specialist services.\n \nIn 2015, the Department of Probation Services (DOPS) committed to becoming an evidence-based organization, and to employing the Risk, Needs, Responsivity (RNR) Principle through a differential, risk-based supervision structure. Two major hurdles were identified in the planning phase: how to manage the high volume of new cases that the DOPS receives (approx. 500/month) while keeping caseloads manageable; and how to allow placement, duration and programming decisions to be guided by the assessment without access to the information prior to sentencing. In a significant demonstration of commitment to this project, the judges agreed that they would allow these decisions to be made post-sentence, by the DOPS.\n \nDefendants sentenced to a period of probation report to the DOPS for intake and screening by the DOPS Support Unit. If screened as moderate or high risk, or eligible for one of the specialized caseloads, defendants are assigned to the corresponding unit where she/he will receive a full assessment(s). Defendants may be transferred to another supervision level if the screening and assessment risk levels differ. It is not uncommon for cases to be transferred between officers as part of this post-screening and assessment process. Due to significant caseload sizes it takes officers several weeks to complete the assessment process. This delay can have a negative impact on the success of the defendant and increase their risk of re-offending if their criminogenic needs are not identified early in their supervision.\n \nThe FCMC DOPS will partner with Alvis for contracted assessment services, specifically the ORAS CST and MAT and the IDA, for defendants who screen as moderate or high-risk or who are eligible for the department’s special programs (excluding domestic violence). These assessments will take place either prior to sentencing at the request of the Court, during the intake process at the FCMC DOPS, or shortly after intake. Reducing the number of assessments that need to be completed by the FCMC DOPS’ moderate and high-risk officers will allow them to schedule the remaining assessments in a timelier manner, and will allow them to engage in case planning and interventions much earlier in the supervision process. This project will more swiftly and accurately inform the initial placement and reduce the need to transfer defendants between officers.  Contracting for assessment services will also allow the Probation Department time to gather data to better understand and prioritize staffing needs as they further develop the EBP paradigm.\n \nTitle\nTo authorize the Administrative and Presiding Judge of the Franklin County Municipal Court to enter into contract with Alvis, Inc. for assessment specialist services; to authorize an appropriation and expenditure within the Public Safety Initiatives subfund; and to declare an emergency. ($150,000.00)\n \nBody\nWHEREAS, it is in the city's best interest that the Franklin County Municipal Court receive support for an enhanced probationary service for offenders; and\n \nWHEREAS, contracting for assessment services with Alvis, Inc. will allow the Probation Department time to gather data to better understand and prioritize staffing needs; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Franklin County Municipal Court Judges in that it is immediately necessary to authorize the Administrative and Presiding Judge to enter into contract and associated expenditures with the Alvis, Inc. in order to assure the start of the assessments in a timely manner, thereby preserving the public peace, property, health, safety, and welfare; NOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Administrative and Presiding Judge of the Franklin County Municipal Court is hereby authorized to enter into contract with Alvis, Inc. for assessment specialist services.\n \nSECTION 2. That the Auditor is hereby authorized and directed to appropriate $150,000.00 within the Public Safety Initiatives subfund, fund 1000, subfund 100016, in 03-Services per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That per the action authorized in Section 1 of this ordinance, the expenditure of $150,000.00 in the Public Safety Initiatives subfund is hereby authorized per the accounting codes in the attachment to this ordinance.\n \nSECTION 4. That this contract is awarded in accordance with the relevant provisions of Columbus City Code Chapter 329 relating to awarding not-for-profit service contracts exceeding fifty thousand dollars ($50,000.00).\n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6. That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 1,
    "absent": 0,
    "meeting_id": 24,
    "meeting_date": "2021-09-20",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "ABSTAIN"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}