{
  "success": true,
  "vote": {
    "id": 1870,
    "item_number": "CA-1",
    "title": "To Recognize and Honor the life of Frank D. Duff, and expresses our sincere condolences to his family and loved ones",
    "description": "Title\n \nTo Recognize and Honor the life of Frank D. Duff, and expresses our sincere condolences to his family and loved ones \n \nBody\n \nWHEREAS, Columbus Fire Fighter Frank D. Duff passed away Sunday, September 19, 2021 at the age of 66 after a month long battle with COVID-19, which he contracted while in the line of duty; and\n \nWHEREAS, Duff began his career with the Division of Fire in 1994, earning his paramedic certificate in 1998. He spent the majority of his career working at Fire Station 17 on Columbus’s Westside; and\n \nWHEREAS, Firefighter Duff’s passing underscores the sacrifices made by men and women of the Columbus Division of Fire to preserve life and protect our community. His resolve is a testament to service above self; and                      \n  \nWHEREAS, Firefighter Duff was known for his calm and kind demeanor with everyone he came into contact with. He treated everyone he met like family and was the living example of what it means to have a servant’s heart; and                      \n \nWHERAS, Our thoughts and prayers are with the Duff family and the members of the Division of Fire that lost one of their own. We pray that they find comfort in one another; now, therefore\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nThat this Council does hereby recognize and honor the life of Columbus Firefighter Frank D. Duff, and expresses our sincere condolences to his family and loved ones.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 25,
    "meeting_date": "2021-09-27",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}