{
  "success": true,
  "vote": {
    "id": 192,
    "item_number": "SR-16",
    "title": "To authorize the Director of Human Resources Department to enter into contract with Mount Carmel Health Systems for testing services for the Divisions of Police and Fire for the provision of health and physical fitness programs; to authorize the expenditure of $1,154,948.00 from the general fund; and to declare an emergency. ($1,154,948.00)",
    "description": "Explanation\nBackground Information:  This legislation authorizes the Director of Human Resources to enter into contract with Mount Carmel Health Systems for health and physical fitness testing services for the Divisions of Police and Fire in the amount of $1,154,948; the Division of Police portion totals $224,000 and the Division of Fire portion totals $930,948.  This ordinance represents the fifth of a five year contract, from March 1, 2021 to February 28, 2022.  Following the fifth year, the contract allows for three one year extensions if all parties are in agreement.  Every year the contract renewal is subject to available appropriation and funding.    This contract was last bid in September, 2016 (RFQ 002701); the committee unanimously recommended the contract be awarded to Mount Carmel Health Systems / Occupational Health.   The health and physical fitness program is part of the current collective bargaining agreement between the City of Columbus and Fraternal Order of Police, Capital City Lodge #9 and the City of Columbus and the International Association of Fire Fighters (IAFF) Local #67.  The intent of the program is to ensure the overall general health and fitness of police officers and fire fighters.\n \nOriginally, this contract was entered into by the Department of Public Safety.  In 2014, the Department of Human Resources began managing the contract for both the Division of Police and the Division of Fire. \n \nContract Compliance:  Mount Carmel Health Systems contract compliance number is 31-1439334. \n \nEmergency Action Designation:  Emergency action is requested so that testing may continue pursuant to collective bargaining contracts between the City of Columbus and the Fraternal Order of Police, Capital City Lodge #9 and the City of Columbus and the IAFF Local #67 Firefighters Union.\n \nFiscal Impact:  Funding for this contract totals $1,154,948.00 and is budgeted and available from and within the 2021 Department of Human Resources' general fund budget specifically for this purpose.  As stated above, this is the fifth year of a five year contract, which allows for three one year additional extensions following the fifth year.  Every year, contract renewal is subject to available and adequate appropriation and funding. This ordinance is contingent on the passage of 2021 general fund budget, Ordinance 2502-2020.\n \n \nTitle\nTo authorize the Director of Human Resources Department to enter into contract with Mount Carmel Health Systems for testing services for the Divisions of Police and Fire for the provision of health and physical fitness programs; to authorize the expenditure of $1,154,948.00 from the general fund; and to declare an emergency. ($1,154,948.00)\n \nBody\nWHEREAS, the city is required to provide health and physical fitness testing services and related education and wellness programs to the Division of Police, pursuant to the collective bargaining contract between the city and the Fraternal Order of Police, Capital City Lodge #9; and\n \nWHEREAS,  the city is required to provide health and physical fitness testing services and related education and wellness programs to the Division of Fire, pursuant to the collective bargaining contract between the city and the IAFF, Local #67; and\n \nWHEREAS, a committee comprised of personnel from the Public Safety Department and the Human Resources Department selected Mount Carmel Health Systems, based on criteria outlined in request for proposal 002701, opened September 27, 2016, and  in accordance with relevant requirements of the Columbus City Codes, Chapter 329; and\n \nWHEREAS, the current contract is for a five year period, with three one-year extensions possible, subject to sufficient appropriation; and \n \nWHEREAS, this contract represents the fifth year of the current contract; and\n \nWHEREAS, it is in the city's best interest to procure these professional services to assist with the continued implementation of the physical fitness and health and wellness education programs for the Divisions of Police and Fire; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Human Resources in that it is immediately necessary to authorize the Director to enter into contract with Mount Carmel Health Systems / Occupational Health to allow required health and physical fitness testing for the Division of Police and the Division of Fire to continue, thereby preserving the public health, peace, property, safety and welfare; Now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS\n \nSECTION 1.  That the Director of Human Resources Department is hereby authorized to enter into contract with Mount Carmel Health Systems to provide physical fitness testing services and related health education and wellness programs for the Division of Police and the Division of Fire.\n \nSECTION 2.  That the expenditure of $1,154,948.00, or so much thereof as may be necessary, is hereby authorized to be expended from the general fund 1000 in object class 03 Services, per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 3,
    "meeting_date": "2021-02-08",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}