{
  "success": true,
  "vote": {
    "id": 1924,
    "item_number": "CA-4",
    "title": "To authorize the City Auditor to modify existing contracts with OnActuate Consulting, Microsoft Corporation, Dell Marketing LP, Ngrok and Tyler Technologies for continued support and enhancement of Dynamics 365; to authorize the expenditure of up to $363,463.97, from the Department of Technology operating fund for a total expenditure of $363,463.97; and to declare an emergency ($363,463.97).",
    "description": "Explanation\nTo authorize the City Auditor to modify existing contracts with OnActuate Consulting, Microsoft Corporation, Dell Marketing LP, Ngrok and Tyler Technologies for continued support and enhancement of Dynamics 365; to authorize the expenditure of up to $363,463.97, from the Department of Technology operating fund for a total expenditure of $363,463.97; and to declare an emergency ($363,463.97). \nContinued support and enhancement of Dynamics 365 includes OnActuate Consulting support for D365 Finance and Operations as well as Point of Sale to release 10.0.21. City of Columbus is required to update to release 10.0.21.  In addition, post go-live enhancements will be reviewed, prioritized and developed for D365.  Fire will be added as a Point of Sale customer and renewal of Tyler Technologies annual comprehensive financial report (ACFR) software will be procured. \nEmergency action is requested in order to continue services for the City's financial system, Dynamics 365, without interruption. Specifically the upgrade to 10.0.21 which requires additional resource support.\n \nFISCAL IMPACT:  Funding is available in the Info Services Operating fund, Dept of Technology Operating subfund.    \n \nTitle\nTo authorize the City Auditor to modify existing contracts with OnActuate Consulting, Microsoft Corporation, Dell Marketing LP, Ngrok and Tyler Technologies for continued support and enhancement of Dynamics 365; to authorize the expenditure of up to $363,463.97, from the Department of Technology operating fund for a total expenditure of $363,463.97; and to declare an emergency ($363,463.97). \nBody\n \nWHEREAS, it is necessary for the City Auditor to modify existing contracts with OnActuate Consulting, Microsoft Corporation, Dell Marketing LP, Ngrok, and Tyler Technologies for continued support and enhancement of Dynamics 365; and \n \nWHEREAS, it is necessary to authorize the expenditure of up to $363,463.97; and \n \nWHEREAS, an emergency exists in the usual daily operations of the City Auditor’s Office in that it is immediately necessary to authorize the City Auditor to modify existing contracts for continued support and enhancement of Dynamics 365 so there is no interruption in service,  thereby preserving the public health, peace, safety, and welfare; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the City Auditor is hereby authorized to modify existing contracts with OnActuate Consulting, Microsoft Corporation, Dell Marketing LP, Ngrok and Tyler Technologies as may be necessary for continued support and enhancement of Dynamics 365 for the City of Columbus.  \nSECTION 2. That the sum of $363,463.97 is hereby authorized to be expended from Fund 5100 and subfund 510001 Dept./Div 47-02, Object Class 03, main account 63945, program IT005. (Sheets attached)\n \nSECTION 3. That the sum of $363,463.97 is for continued support and enhancement of Dynamics 365. \n  \nSECTION  4. That the funds necessary to carry out the purpose of this ordinance are hereby authorized for expenditure and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION  5. That the City Auditor is authorized to make any accounting changes to revise the funding contract or contract associated with the expenditure of the funds. \n \nSECTION  6. That for reasons stated in the preamble hereto, which is hereby made a part hereof, this resolution is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 26,
    "meeting_date": "2021-10-11",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}