{
  "success": true,
  "vote": {
    "id": 1946,
    "item_number": "CA-26",
    "title": "To amend the 2020 Capital Improvements Budget; to authorize the transfer of cash and appropriation between projects within the Streets and Highways Bond Fund; to authorize the Director of Public Service to make payment to the Mid-Ohio Regional Planning Commission for administrative costs related to grants awarded to the City; to authorize the expenditure of up to $11,662.30 from the Streets and Highways Bond Fund; and to declare an emergency.  ($11,662.30)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Service to make payment to the Mid-Ohio Regional Planning Commission for Round 34 administrative costs of Ohio Public Works Commission infrastructure programs. \n \nThe Mid-Ohio Regional Planning Commission (MORPC) serves as staff to the District Three Public Works Integrating Committee and makes funding awards, in rounds, based on committee recommendations to the Ohio Public Works Commission concerning fund distribution for the State Capital Improvement Program and the Local Transportation Improvement Program.  MORPC prorates costs to serve as staff for each round to local jurisdictions based upon the total funds ultimately awarded to each jurisdiction.\n \nThe Department of Public Service received a total of $4,673,956.00 in FY2020 for the following Round 34 projects:  Intersection Improvements - James Road at Livingston Ave, ADA Curb Ramps - Citywide Curb Ramps, Arterial Street Rehabilitation - Hudson St-I-71 to Cleveland Ave, School Zone Flashing Beacons - Citywide School Zone Flashing Beacon Upgrades and Traffic Signal Installation - Neil Avenue Signals.  This ordinance authorizes payment to MORPC in the amount of $11,662.30 to satisfy the local share of administrative costs incurred during the administration of the aforementioned programs. \n \n2.  FISCAL IMPACT\nFunds in the amount of $11,662.30 are available and appropriated to pay this invoice in the Streets and Highways Bond Fund, Fund 7704.  An amendment to the 2020 Capital Improvement Budget and a transfer of cash and appropriation is necessary for the purpose of providing sufficient budget authority for the expenditure. \n \n3.  EMERGENCY DESIGNATION\nEmergency action is requested to facilitate payment to MORPC at the earliest time possible.\n \nTitle\nTo amend the 2020 Capital Improvements Budget; to authorize the transfer of cash and appropriation between projects within the Streets and Highways Bond Fund; to authorize the Director of Public Service to make payment to the Mid-Ohio Regional Planning Commission for administrative costs related to grants awarded to the City; to authorize the expenditure of up to $11,662.30 from the Streets and Highways Bond Fund; and to declare an emergency.  ($11,662.30)\n \nBody\nWHEREAS, Ordinance 1795-2019 authorized the Director of Public Service to submit Round 34 applications for the Local Transportation Improvement Program (LTIP) and State Capital Improvement Program (SCIP); and\n \nWHEREAS, the Department of Public Service received grant awards totaling $4,673,956.00 to support the completion of the following projects: Intersection Improvements - James Road at Livingston Ave, ADA Curb Ramps - Citywide Curb Ramps, Arterial Street Rehabilitation - Hudson St-I-71 to Cleveland Ave, School Zone Flashing Beacons - Citywide School Zone Flashing Beacon Upgrades and Traffic Signal Installation - Neil Avenue Signals; and\n \nWHEREAS, the Mid-Ohio Regional Planning Commission (MORPC) renders staff support services to the District Three Public Works Integrating Committee in connection with the award and distribution of LTIP and SCIP grant funds; and\n \nWHEREAS, as a condition of acceptance of the aforementioned grant awards, the Department of Public Service agreed to pay up to 1% of the total award amount to MORPC to subsidize administrative costs incurred in connection with the aforementioned programs; and\n \nWHEREAS, this ordinance authorizes payment to MORPC in the amount of $11,662.30 for that purpose; and\n \nWHEREAS, it is necessary to authorize an amendment to the 2020 Capital Improvements Budget for the purpose of providing sufficient budget authority for the aforementioned expenditure; and\n \nWHEREAS, a transfer of appropriation and cash is necessary; and\n \nWHEREAS, funds must be expended to pay the invoice for the administrative fees; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to authorize the Director to authorize payment of the requisite funds to facilitate payment to MORPC at the earliest time possible, thereby preserving the public health, peace, property, safety, and welfare; now, therefore:\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2020 Capital Improvements Budget authorized by ordinance 2521-2020 be amended as follows to establish sufficient budget authority for this project:\n \nFund / Project / Project Name / Current / Change / Amended\n7704 / P530086-100044 / Intersection Improvements - Safety Improvements Local Match (Voted 2019 SIT Supported) / $405,507.00 / ($3,147.00) / $402,360.00\n \n7704 / P530087-912021 / ADA Curb Ramps - Citywide Curb Ramps 2021 (Voted 2019 SIT Supported) / $0.00 / $2,495.00 / $2,495.00\n7704 / P530086 -100035 / Intersection Improvements - James Road at Livingston Avenue (Voted 2019 SIT Supported) / $0.00 / $652.00 / $652.00\n \nSECTION 2.  That the transfer of $2,494.28, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5912 (Design and Construction), Project P530086-100044 (Intersection Improvements - Safety Improvements Local Match), Object Class 06 (Capital Outlay) to Dept-Div 5912 (Design and Construction), Project P530087-912021 (ADA Curb Ramps - Citywide Curb Ramps), Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That the Director of Public Service be and hereby is authorized to make payment in the amount of $11,662.30 to the Mid-Ohio Regional Planning Commission, 111 Liberty Street, Suite 100, Columbus, Ohio, 43215, for staff support services rendered in connection with the administration of Round 34 of the State Capital Improvement Program and the Local Transportation Improvement Program.\n \nSECTION 4.  That the expenditure of $4,990.33, or so much thereof as may be needed, is hereby authorized in Fund 7704 (Streets and Highways Bond Fund), Dept-Div 5912 (Division of Design and Construction), Project P530103-100068 (Arterial Street Rehabilitation - Hudson St-I-71 to Cleveland Ave), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 5.  That the expenditure of $651.30, or so much thereof as may be needed, is hereby authorized in Fund 7704 (Streets and Highways Bond Fund), Dept-Div 5912 (Division of Design and Construction), Project P530086-100035 (Intersection Improvements - James Road at Livingston Avenue), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 6.  That the expenditure of $2,495.17, or so much thereof as may be needed, is hereby authorized in Fund 7704 (Streets and Highways Bond Fund), Dept-Div 5912 (Division of Design and Construction), Project P540007-100029 (Traffic Signal Installation - Neil Avenue Signals), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 7.  That the expenditure of $2,494.28, or so much thereof as may be needed, is hereby authorized in Fund 7704 (Streets and Highways Bond Fund), Dept-Div 5912 (Division of Design and Construction), Project P530087-912021 (ADA Curb Ramps - Citywide Curb Ramps), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 8.  That the expenditure of $1,031.22, or so much thereof as may be needed, is hereby authorized in Fund 7704 (Streets and Highways Bond Fund), Dept-Div 5912 (Division of Design and Construction), Project P530086-100044 (Intersection Improvements - Safety Improvements Local Match), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 9.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\nSECTION 10.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 11.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 12.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the mayor, or ten days after passage if the mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 26,
    "meeting_date": "2021-10-11",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services",
      "Grants"
    ]
  }
}