{
  "success": true,
  "vote": {
    "id": 1953,
    "item_number": "CA-33",
    "title": "To authorize the Director of Public Service to execute Infrastructure License and Maintenance Agreement with the City of Westerville, Ohio relative to the Polaris Parkway and Orion Drive project for the Old Worthington Road Shared Use Path, and to execute documents approved by the City Attorney, Real Estate Division, to grant to the City of Westerville, Ohio a 0.194 acre perpetual non-exclusive utility easement burdening a portion of the City’s right-of-way along Old Worthington Road; and to declare an emergency.  ($0.00)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Service to execute an infrastructure License and Maintenance agreement, (“Agreement”) with the City of Westerville (“Westerville”) for a portion of the Old Worthington Road Shared Use Path (“SUP”) and the granting of a non-exclusive utility easement (“Easement”) to Westerville for an existing electric line adjacent to the Old Worthington Road Shared Use Path.\nThe design and construction of the Polaris Parkway at Orion Place project (DEL-CR615-0.00, PID 95549, 3221-E) was the result of a City led project, with a portion of the project falling within the Westerville corporate boundary.  Westerville has expressed a willingness to undertake responsibility for the maintenance of the SUP.\nThe City and Westerville having been jointly working on a boundary adjustment as a result of the Orion Place and Old Worthington Road roundabout and roadway reconfiguration.  \nThe execution of this Agreement and Easement is a condition of an anticipated adjustment of the municipal corporation boundaries between the City and Westerville being process through the Delaware County Commissioners.\nCity ordinance 0273-2021, which passed Columbus City Council on March 1, 2021, authorized the execution of a boundary adjustment between the parties.\nWesterville ordinance 2021-09, which passed Westerville City Council on September 7, 2021, authorized the execution of a boundary adjustment between the parties.  \nAn existing Westerville underground electric line is being maintained, and will no longer be within the Westerville corporate boundary upon the completion of the boundary adjustment.  Westerville has requested the granting of a utility easement by the City for this underground electric line.\n2.  FISCAL IMPACT\nWesterville shall, at its own expense, assume and bear all costs associated with the maintenance of the SUP and electric line.  The City will have no expenses in maintaining this segment of the SUP and electric line.\n3.  EMERGENCY DESIGNATION\nEmergency action is requested so that requisite agreement authorizing the Agreement and Easement may be executed as soon as reasonably practicable. \nTitle\nTo authorize the Director of Public Service to execute Infrastructure License and Maintenance Agreement with the City of Westerville, Ohio relative to the Polaris Parkway and Orion Drive project for the Old Worthington Road Shared Use Path, and to execute documents approved by the City Attorney, Real Estate Division, to grant to the City of Westerville, Ohio a 0.194 acre perpetual non-exclusive utility easement burdening a portion of the City’s right-of-way along Old Worthington Road; and to declare an emergency.  ($0.00)\nBody\nWHEREAS, the City partnered with Westerville to design and construct the Old Worthington Road Shared Use Path, which was a part of the Polaris Parkway and Orion Place project; and    \nWHEREAS, the Department of Public Service would normally be required to maintain this segment of Shared Use Path; and \nWHEREAS, Westerville now proposes assuming responsibility for the maintenance of the Shared Use Path; and\nWHEREAS, this legislation seeks to authorize the execution of an Infrastructure License and Maintenance Agreement, between the Department of Public Service and Westerville, whereby Westerville agrees to be responsible for maintaining the Shared Use Path; and \nWHEREAS, this legislation seeks to authorize the granting of a non-exclusive perpetual utility easement to Westerville for maintaining an existing Westerville owned electric line; and \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to authorize the Director to execute the Infrastructure License and Maintenance Agreement and to grant an easement with and to the City of Westerville so that requisite agreements authorizing the maintenance responsibility for the Shared Use Path to Westerville may be executed as soon as reasonably practicable; now, therefore,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Service be and is hereby authorized to execute an Infrastructure License and Maintenance Agreement,  with the City of Westerville, Ohio to facilitate the ongoing maintenance of the Old Worthington Road Shared Use Path.\nSECTION 2.  That the Director of Public Service be and is hereby authorized to execute a non-exclusive utility easement for an existing electric line to the City of Westerville, Ohio adjacent to the Old Worthington Road Shared Use Path.\nSECTION 3. That The City Attorney’s Office, Real Estate Division is required to approve all documents and instrument(s), associated with this ordinance.  \nSection 4.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 26,
    "meeting_date": "2021-10-11",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Emergency Services",
      "Grants"
    ]
  }
}