{
  "success": true,
  "vote": {
    "id": 1959,
    "item_number": "CA-39",
    "title": "To authorize the City Auditor to cancel existing funding for the Electronic Filing System and reestablish in Fund 7748; to amend the 2020 Capital Improvement Budget; to authorize the transfer and appropriation within the General Permanent Improvement Fund; to authorize an expenditure up to $16,847.95 from the General Permanent Improvement Fund; and to declare an emergency. ($16,847.95)",
    "description": "Explanation   \nBackground:  This legislation amends the 2020 Capital Improvement Budget and authorizes the City Auditor to transfer, appropriate, and expend funds within the General Permanent Improvement Fund to reestablish the source of funding for the E-filing project.  \n \nEmergency justification:  Emergency declaration is requested to meet the IRS accounting requirements.  \nFiscal Impact: Funds are available within the General Permanent Improvement Fund. \nTitle\n \nTo authorize the City Auditor to cancel existing funding for the Electronic Filing System and reestablish in Fund 7748; to amend the 2020 Capital Improvement Budget; to authorize the transfer and appropriation within the General Permanent Improvement Fund; to authorize an expenditure up to $16,847.95 from the General Permanent Improvement Fund; and to declare an emergency. ($16,847.95)\n \nBody\n \nWHEREAS, EL015990 was established in Fund 7780 by Ord. 1443-2014 for the Municipal Court Clerk’s Electronic Filing System; and\n \nWHEREAS, it is necessary to authorize the City Auditor to cancel EL015990 and reestablish in the General Permanent Improvement Fund, Fund 7748; and\n \nWHEREAS, it is necessary to authorize the transfer, appropriation, and expenditure of up to Sixteen Thousand, eight hundred and forty seven and 95/100 U.S. Dollars ($16,847.95) from the General Permanent Improvement Fund, Fund 7748; and \n \nWHEREAS, it is necessary to amend the 2020 Capital Improvement Budget in order to align the authority with the transfer and expenditure; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Municipal Court Clerk’s Office in that it is immediately necessary to reestablish the source of funding for the E-filing project to meet the IRS accounting requirements, thereby preserving the public health, peace, property, safety, and welfare; now therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the City Auditor is authorized to cancel EL015990, which was created by Ord. 1443-2014, and reestablish in the General Permanent Improvement Fund, Fund 7748.\n \nSECTION 2.  That the 2020 Capital Improvement Budget is hereby amended as follows:\n \nProject No. | Project Name | Revised Authority | Remaining Authority | Change\nP748999-100000 | Unallocated Balance |$6,206,438 |$ 6,189,590| ($16,848)\nP780001-100005 | Electronic Filing System | $0| $16,848 | $16,848\n \nSECTION 3.   That the City Auditor is hereby authorized to transfer funds within the General Permanent Improvement Fund per the account codes in the attachment to this ordinance.\n \n \nSECTION 4.  That the sum of $16,847.95 hereby is appropriated in Fund 7748 (General Permanent Improvement Fund); Department-Division 2601 (Municipal Court Clerk); Object Class 06 (Capital Outlay); Project P780001-100005, per the accounting codes in the attachment to this ordinance.\n \nSECTION 5.  That the Municipal Court Clerk’s Office is authorized to expend up to $16,847.95 from the General Permanent Improvement Fund 7748 per the attached funding template.\n \nSECTION 6. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 7. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.   \n \nSECTION 8. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 9.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 26,
    "meeting_date": "2021-10-11",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services"
    ]
  }
}