{
  "success": true,
  "vote": {
    "id": 2006,
    "item_number": "CA-6",
    "title": "To authorize the Director of Finance and Management to enter into an Amended and Restated Service Agreement with Lease Harbor, LLC for the provision of hosted software services, support, and related services for the administration of the City's real property inventory and lease inventory portfolios; to authorize the expenditure of up to $27,000.00 from the General Fund; and declare an emergency. ($27,000.00).",
    "description": "Explanation\nBackground:  This ordinance authorizes the Director of Finance and Management to enter into an Amended and Restated Service Agreement with Lease Harbor LLC for a one-year initial term with four (4) automatic renewal terms, each renewal being one-year in length and subject to appropriation of funds by City Council and certification of funds availability by the City Auditor and authorizes the expenditure of up to $27,000.00, or as much as may be necessary for the initial term commencing December 15, 2021.  The current service agreement contract was authorized pursuant to Ordinance 2579-2015. The City, through the Department of Finance and Management, contracts with Lease Harbor, LLC for provision of secure, redundant, hosted real estate and lease management software services, support, and related services necessary for the administration of the City’s real property inventory and lease portfolios. These portfolios are currently hosted on its Harbor Flex software service. The financial reporting standards for government accounting of lease income and expense have significantly changed. The lease income and expense reporting provided as part of the Harbor Flex software cannot meet these new requirements. The Auditor’s Office must meet reporting standards for lease income and expense compliant with GASB 87 effective January 1, 2022. Working with the Auditor’s Office, it has been determined that by converting the existing portfolios now residing on the Harbor Flex software platform to the APEX software service from Lease Harbor LLC will allow for the calculation of balances at a point in time as well as production of general ledger entries compliant with the GASB 87 financial reporting standards for leases. The conversion of the portfolios and the training on APEX can be completed before the end of December, which will allow the City to have lease accounting records by 1/1/2022 in compliance with GASB 87 requirements. The conversion of the City’s real property and lease portfolios from the existing Harbor Flex software platform to the APEX software platform is most cost efficient, practical, and timely means to provide the Auditor’s Office with lease financial reporting information that is GASB 87 compliant by 1/1/2022. Therefore, it is in the City’s best interest to modify and extend the existing Service Agreement with Lease Harbor, LLC to reflect the provision of hosted real estate and lease management software services, support, and related services necessary for the administration of the City’s real property inventory and lease portfolios on its APEX software service. The annual cost of the Service Agreement for the initial term will increase by approximately $200.00 over the annual cost of the current Service Agreement.  This legislation is presented as emergency measure.\n \nLease Harbor, LLC - Contract Compliance Number 364352999, Expiration Date: 10/1/2023\n \nFiscal Impact:  This ordinance authorizes an expenditure of up to $27,000.00 from the 2021 General Fund. Funds for the initial term of the Amended and Restated Service Agreement for the period December 15, 2021 to December 14, 2022. This expenditure were budgeted and are available within the Finance and Management 2021 General Fund Budget. \n \nEmergency Action:  This legislation is presented as an emergency measure to ensure that payment can be provided and service continues uninterrupted. \n \nTitle\nTo authorize the Director of Finance and Management to enter into an Amended and Restated Service Agreement with Lease Harbor, LLC for the provision of hosted software services, support, and related services for the administration of the City's real property inventory and lease inventory portfolios; to authorize the expenditure of up to $27,000.00 from the General Fund; and declare an emergency. ($27,000.00).\n \nBody\nWHEREAS, the Department of Finance and Management through its Real Estate Management Office contracts with Lease Harbor, LLC for the provision of secure, redundant, web based hosted real estate and lease management software for the administration of the City’s real property inventory and lease portfolios; and\n \nWHEREAS, the existing contract with Lease Harbor, LCC for hosted software services, support and related services was authorized by Ordinance No. 2579-2015; and\n \nWHEREAS, the Auditor’s Office must meet reporting standards for lease income and expense compliant with GASB 87 effective January 1, 2022; and\n \nWHEREAS, the financial reporting standards for accounting of lease income and expense by governments have significantly changed under GASB 87; and\n \nWHEREAS, the lease income and expense reporting provided as part of the Harbor Flex software cannot meet these new financial reporting requirements; and\n \nWHEREAS, a conversion of the City’s real property inventory and lease inventory portfolios from the existing Harbor Flex software platform to the APEX software platform is most cost efficient, practical, and timely means to provide the Auditor’s Office with lease financial reporting compliant with GASB 87.\n \nWHEREAS, due to the ability to complete the conversion of the portfolios to APEX software and complete training of staff before the December  31, 2021, it is in the best interest of the City to modify  the service agreement with Lease Harbor LLC in accordance with the sole source procurement provisions of Columbus City Codes; and\n \nWHEREAS, this ordinance authorizes the Director of Finance and Management to enter into an Amended and Restated Service Agreement with Lease Harbor, LLC for a term commencing December 15, 2021 and expiring December 14, 2022 with four (4) one-year automatic renewal terms each subject to the appropriation of funds by City Council and certification of funds availability by the City Auditor; and\n \nWHEREAS, the funds for payment of this service agreement are budgeted and are available within the Department of Finance and Management Department, Real Estate Management Office 2021 General Fund Budget; and \n \nWHEREAS, it necessary to authorize the expenditure of up to $27,000.00 or as much as may be necessary, for the initial term of the Amended and Restated Service Agreement for the period December 15, 2021 to December 14, 2022; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Finance and Management in that it is immediately necessary to authorize the Director to the service agreement to ensure that service continues without interruption, for the immediate preservation of the public health, peace, property, and safety: and, now therefore:\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Finance and Management be and is hereby authorized to enter into an Amended and Restated Service Agreement with Lease Harbor, LLC for a term commencing December 15, 2021 and expiring December 14, 2022 with four (4) one-year automatic renewal terms each subject to the appropriation of funds by City Council and certification of funds availability by the City Auditor.\n \nSECTION 2. That the Director of Finance and Management be, and hereby is authorized to expend up to $27,000.00 for payment of fees to Lease Harbor, LLC for the period December 15, 2021 through December 14, 2022. \n \nSECTION 3.  That the expenditure of $27,000.00, or so much thereof as may be necessary in regard to the action taken in Section 1, is hereby authorized in the General Fund 1000 in Object Class 03, Communication Other, per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes necessary to ensure that this expenditure is properly accounted for and recorded accurately on the City’s financial records.\n \nSECTION 5.  That the funds necessary to carry out the purposes of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared an emergency measure and shall take effect and be in force from and after passage and approval by the Mayor, or ten (10) days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 27,
    "meeting_date": "2021-10-18",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}