{
  "success": true,
  "vote": {
    "id": 2098,
    "item_number": "CA-13",
    "title": "To authorize the Finance and Management Director, on behalf of the Fleet Management Division, to establish purchase orders from previously established Universal Term Contracts (UTCs) for the purchase and associated up-fitting of vehicles for use by the Division of Fire with Byers Ford and Parr Public Safety; to authorize the appropriation and expenditure of $682,165.08 from the Special Income Tax Fund; and to declare an emergency. ($682,165.08)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Finance and Management Director to establish purchase orders for the acquisition of automobiles and light duty trucks, as well as associated up-fitting for the Columbus Division of Fire. These purchase orders for the vehicle purchases and up-fitting will be issued from Universal Term Contracts (UTCs) that have been previously established by the City of Columbus Purchasing Office.\n \nPurchase orders will be established with George Byers Sons Inc, (PA004790 & PA004948) for the acquisition of automobiles and light duty trucks and Parr Public Safety Equipment Inc (PA005468) for the purchase of fire vehicle up-fitting.\n \nGeorge Byers Sons Inc, vendor#006008, CC# 31-4139860 exp. 12/3/2022, PA004790 & PA004948, expires 6/30/23 - ($562,245.00 estimated)\nParr Public Safety Equipment Inc, vendor#001060, CC# 201619573 exp. 8/25/2023, PA005468, expires 12/31/24 - ($119,920.08 estimated)\n \nThese vehicles are to be purchased as replacements for older, high mileage, and high maintenance vehicles currently in service and as such will reduce maintenance expenses, fuel consumption, and general upkeep costs.  \n \nThe projected quantities to be purchased by vehicle and quantity are contained in the summary attached to this ordinance. (See Ord 2715-2021 Vehicle Distribution.xls)\n \nThese companies are not debarred according to the Federal excluded parties listing or prohibited from being awarded a contract to the Auditor of State unresolved findings for recovery certified search.\n \nFiscal Impact: This ordinance authorizes the combined expenditure of $682,165.08 with George Byers Sons and Parr Public Safety for the acquisition and up-fitting for automobiles and light duty trucks for use by the Columbus Division of Fire. The funds will be expended from the Special Income Tax Fund. $7.2 million was budgeted for the 2021 Citywide Vehicle Acquisitions.\n \nEmergency action is requested due to market volatility of automobile manufactures and increased shortage of chips and other critical supply line parts to produce vehicles. It would be advantageous for the City to process these purchase orders as soon as possible in order to offset potential delays due to supply chain pressures. \n Title\n \nTo authorize the Finance and Management Director, on behalf of the Fleet Management Division, to establish purchase orders from previously established Universal Term Contracts (UTCs) for the purchase and associated up-fitting of vehicles for use by the Division of Fire with Byers Ford and Parr Public Safety; to authorize the appropriation and expenditure of $682,165.08 from the Special Income Tax Fund; and to declare an emergency. ($682,165.08)\n \nBody\n \nWHEREAS, the Division of Fire has a need to replace older high mileage and high maintenance vehicles; and\n \nWHEREAS, the replacement of these vehicles will reduce maintenance, service, and fuel-related costs associated with ongoing ownership of older vehicles; and\n \nWHEREAS, George Byers Sons Inc successfully bid and was awarded contracts PA004790 (expires 6/30/23) and PA004948 (expires 6/30/23); /and\n \nWHEREAS, Parr Public Safety Equipment successfully bid and was awarded contract PA005468 - Safety Vehicle Upfit, expires 12/31/24\n \nWHEREAS, funding for these vehicles is budgeted and available within the Special Income Tax fund; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Department of Finance & Management in that it is immediately necessary to authorize the Director to establish various purchase orders and contracts for the purchase of new vehicles for use by various City Departments to offset potential delays due to supply chain pressures, thereby preserving the public health, peace, property, safety and welfare; NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Finance and Management Director, on behalf of the Fleet Management Division, is hereby authorized to establish purchase orders from previously established Universal Term Contracts for the acquisition of vehicles for use by the Division of Fire with the following vendors:\n \nGeorge Byers Sons Inc, PA004790 & PA004948 ($562,245.00) - vehicles\nParr Public Safety Equipment Inc, PA005468 ($119,920.08) - up-fitting\n \nSECTION 2. That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ending December 31, 2021, the sum of $682,165.08 is appropriated in the Special Income Tax Fund 4430, Sub-Fund 443001 in Object Class 06, per the account codes in the attachment to this ordinance:\n \nSee Attached File: Ord 2715-2021 Legislation Template.xls\n \nSECTION 3. That the expenditure of $682,165.08, or so much thereof as may be necessary, in regard to the actions authorized in Sections 1, 2, and 3 be and is hereby authorized and approved from the Special Income Tax Fund 4430, Sub-Fund 443001 in Object Class 06 per the accounting codes in the attachment to the ordinance:\n \nSee Attached File: Ord 2715-2021 Legislation Template.xls\n \nSECTION 4. That the monies in the foregoing Sections shall be paid upon order of the Director of Finance and Management, and that no order shall be drawn or money paid except by voucher, the form of which shall be approved by the City Auditor.\n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 6. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 7. That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 28,
    "meeting_date": "2021-10-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}