{
  "success": true,
  "vote": {
    "id": 2132,
    "item_number": "CA-47",
    "title": "To authorize the Director of the Department of Development to enter into a Big Darby Development Agreement with Blauser Capital, LTD. (the “Developer”) to outline the plans and commitments of the City and the Developer for parcel 010-256886 located at 6145 West Broad Street, which is subject to the Big Darby Revenue Program requirements in the Big Darby Accord Watershed Master Plan and the rezoning ordinance (Ord. 0411-2021); and to declare an emergency.",
    "description": "Explanation\nBackground: Pursuant to the Big Darby Accord Watershed Master Plan and Resolution 0216X-2008 adopted by Columbus City Council on April 20, 2009, three revenue generation sources were identified: tax increment financing (TIF), new community authority (NCA) development charges, and per unit developer contributions (collectively the “Big Darby Revenue”) for Big Darby Accord public improvements and other regionally beneficial public improvements within the Big Darby Accord area (the “Big Darby Revenue Program”). Blauser Capital LTD. (the “Developer”) has applied for rezoning (Rezoning Application #Z18-065) and received approval from the Development Commission in May 2019 to rezone property at or near the southeast corner of the intersection of West Broad Street and Alton & Darby Creek Road within the Big Darby Accord area and generally located at 6145 West Broad Street (tax parcel ID: 010-256886, known as the “Developer Property”). The Developer owns the ±126.3 acres encompassing the Developer Property and intends for a private investment of approximately $96.2 million to construct two-hundred sixty (260) multi-family units, one-hundred ninety-one (191) single family housing units, a maximum of 150,000 square feet of commercial uses, and private improvements (the “Development”). Consistent with Ordinance 0411-2021 submitted for City Council consideration to rezone, the Developer Property is subject to the requirements of the Big Darby Revenue Program. \n \nThis legislation authorizes the Director of the Department of Development to enter into an agreement (the “Big Darby Development Agreement”) with the Developer to outline the plans and respective commitments of the City and Developer for the fulfillment of Big Darby Revenue Program requirements in relation to the Developer Property.\n \nFiscal Impact: No funding is required for this legislation.\n \nEmergency Justification: Emergency legislation is necessary to authorize the Director of Development to enter into the Big Darby Development Agreement allowing the Department of Development to submit subsequent legislation necessary to implement Big Darby Revenue Program in accordance with the Development schedule. \n \nTitle\nTo authorize the Director of the Department of Development to enter into a Big Darby Development Agreement with Blauser Capital, LTD. (the “Developer”) to outline the plans and commitments of the City and the Developer for parcel 010-256886 located at 6145 West Broad Street, which is subject to the Big Darby Revenue Program requirements in the Big Darby Accord Watershed Master Plan and the rezoning ordinance (Ord. 0411-2021); and to declare an emergency.\n \nBody\nWHEREAS, pursuant to the Big Darby Accord Watershed Master Plan and Resolution 0216X-2008 adopted by Columbus City Council on April 20, 2009, three revenue generation sources were identified: tax increment financing (TIF), new community authority (NCA) development charges, and per unit developer contributions (collectively, “the Big Darby Revenue”) for Big Darby Accord public improvements and other regionally beneficial public improvements within the Big Darby Accord area (the “Big Darby Revenue Program”); and\n \nWHEREAS, Blauser Capital, LTD. (the, “Developer”), has applied for rezoning (Rezoning Application #Z18-065) and received approval from the Development Commission in May 2019 to rezone property at or near the southeast corner of the intersection of West Broad Street and Alton & Darby Creek Road within the Big Darby Accord area and generally located at 6145 West Broad Street (tax parcel ID 010-256886, known as the “Developer Property”); and\n \nWHEREAS, the Developer owns the ±126.3 acres encompassing the Developer Property and intends for a private investment of approximately $96.2 million to construct two-hundred sixty (260) multi-family units, one-hundred ninety-one (191) single family housing units, a maximum of 150,000 square feet of commercial uses, and private improvements (the “Development”); and\n \nWHEREAS, consistent with the Big Darby Accord Watershed Master Plan and Ordinance 0411-2021 (the “Rezoning Ordinance”) submitted for Council consideration, the Developer Property is subject to the requirements of the Big Darby Revenue Program; and\n \nWHEREAS, the Rezoning Ordinance further requires the Developer to complete certain site-specific and regionally beneficial public infrastructure improvements to Alton & Darby Creek Road, Galloway Road and West Broad Street (the “Developer Regional Improvements”) as well as the Developer undertaking certain stormwater improvements (the “Developer Big Darby Accord Improvements”); and\n \nWHEREAS, the City and Developer, in accordance with and in the spirit of the Big Darby Revenue Program, will allocate portions of the Big Darby Revenue to provide financial support for the Developer Regional Improvements, the Developer Big Darby Accord Improvements, other priority regional improvements and needs of the City, and the Big Darby Accord purposes; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Department of Development in that it is necessary for the City and Developer to execute an agreement to memorialize their plans and respective commitments (the “Big Darby - Blauser Farms Development Agreement”) prior to submitting additional legislation necessary for implementing the Big Darby Revenue Program in accordance with the Development schedule, all for the preservation of the public health, peace, safety and welfare without delay; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Department of Development (the “Director”) or his or her designee on behalf of the City is hereby authorized to enter into the Big Darby - Blauser Farms Development Agreement presently on file with the Department of Development (the “Agreement”), along with any changes or amendments thereto not inconsistent with this Ordinance and not substantially adverse to the City and which shall be approved by the Director and the City Attorney, provided that the approval of such changes and amendments not being substantially adverse to the City, shall be evidenced conclusively by the execution of the Agreement to outline the plans and certain commitments of the City and the Developer relating to the proposed Development on the Developer Property (as those terms are defined herein) near the southeast corner of the intersection of West Broad Street and Alton & Darby Creek Road.\n \nSECTION 2. That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 28,
    "meeting_date": "2021-10-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}