{
  "success": true,
  "vote": {
    "id": 2154,
    "item_number": "2",
    "title": "To recognize and celebrate the 100th Anniversary of Accelerated Laboratory Logistics",
    "description": "Title\n \nTo recognize and celebrate the 100th Anniversary of Accelerated Laboratory Logistics\n \n \nBody\nWHEREAS, Accelerated Laboratory Logistics is an African-American owned and continuously operated family business founded in 1921 in Central Ohio.\n \nWHEREAS, Jacobs Transfer Company was a hauling business started by Clarence Jacobs (born October 29, 1887), and when his son started working with him, he changed the name to Jacobs & Son Moving & Storage.  In 1990, his grandson, Todd Wilson changed the name to Accelerated Moving and Storage, Inc. and now it is Accelerated Laboratory Logistics, a national leader in the relocation of research laboratories.\n \nWHEREAS, Clarence successfully operated his business through very challenging times, including The Great Depression and World War II. Despite times of high unemployment, racial tensions, financial recessions and many family changes, the business has remained continuously operating and in the Jacobs/Wilson family.\n \nWHEREAS, Today Accelerated Laboratory Logistics is recognized as a leader in providing world class laboratory relocations in the U.S., with a customer list that includes Mayo Clinic, John Hopkins University, Notre Dame, the CDC, Yale, The Ohio State University, Rush Medical Center, Cleveland Clinic, NASA, and many other prestigious businesses and institutions across the country.\n \nWHEREAS, upon this 100th Anniversary, the City of Columbus commends the Accelerated Laboratory Logistics, and the Jacobs/Wilson family for their continued success and lasting impact and contributions made to our community; now, therefore\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: That this Council does hereby recognize and celebrate the 100th Anniversary of Accelerated Laboratory Logistics.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 29,
    "meeting_date": "2021-11-01",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}