{
  "success": true,
  "vote": {
    "id": 2169,
    "item_number": "CA-14",
    "title": "To authorize the City Clerk to enter into a grant agreement with the Short North Alliance in support of Highball Halloween 2021; to authorize an appropriation and expenditure within the Neighborhood Initiatives subfund; and to declare an emergency. ($10,000.00)",
    "description": "Explanation\nThis ordinance authorizes the City Clerk to enter into a grant agreement with the Short North Alliance in support of Highball Halloween 2021 that occurred on October 23, 2021.\n \nThe Short North Alliance (SNA) is a 501(c)3 nonprofit organization serving both the property owners and business owners of the Short North Arts District. The mission of the Short North Alliance is to nurture the Short North Arts District as a vibrant, creative, and inclusive community and leading arts destination.\n \nOne of the ways the SNA raises money for its members is through festivals and community events. These events, including Highball Halloween, draw thousands of visitors from throughout the Central Ohio region to help reinforce the image of the Short North neighborhood as one of the premier economic drivers in the State of Ohio.\n \nFiscal Impact: Funding is available within the Neighborhood Initiatives subfund.\n \nEmergency action is requested in order to provide the resources necessary to the Short North Alliance in advance of the Highball Halloween event.\n \nTitle\nTo authorize the City Clerk to enter into a grant agreement with the Short North Alliance in support of Highball Halloween 2021; to authorize an appropriation and expenditure within the Neighborhood Initiatives subfund; and to declare an emergency. ($10,000.00)\n \nBody\nWHEREAS, the mission of the Short North Alliance is to nurture the Short North Arts District as a vibrant, creative, and inclusive community and leading arts destination; and\n \nWHEREAS, one of the ways the SNA raises money for its members is through festivals and community events; and\n \nWHEREAS, these events, including Highball Halloween, draw thousands of visitors from throughout the Central Ohio region to help reinforce the image of the Short North neighborhood as one of the premier economic drivers in the State of Ohio; and\n \nWHEREAS, this year Highball Halloween occurred on October 23, 2021; and\n \nWHEREAS, an emergency exists in the usual daily operation of the City Clerk's office in that it is immediately necessary to authorize the Clerk to enter into a grant agreement with the Short North Alliance in order to provide the resources necessary to the Short North Alliance in advance of the Highball Halloween event; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the City Clerk is hereby authorized to enter into a grant agreement with the Short North Alliance in support of Highball Halloween 2021 that occurred on October 23, 2021.\n \nSECTION 2. That the City Auditor is hereby authorized and directed to appropriate $10,000.00 in the Neighborhood Initiatives subfund, fund 1000, subfund 100018, to the City Clerk per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That the expenditure of $10,000.00 or so much thereof as may be needed pursuant to the action authorized in SECTION 1 of this ordinance, is hereby authorized in the Neighborhood Initiatives subfund, fund 1000, subfund 100018 per the accounting codes in the attachment to this ordinance.\n \nSECTION 4. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 29,
    "meeting_date": "2021-11-01",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}