{
  "success": true,
  "vote": {
    "id": 218,
    "item_number": "CA-6",
    "title": "To Honor and Recognize Ann B. Walker  on  Being Inducted into the City of Columbus Hall of Fame 2020",
    "description": "Title\n \nTo Honor and Recognize Ann B. Walker  on  Being Inducted into the City of Columbus Hall of Fame 2020\n \nBody\nWHEREAS, the members of Columbus City Council are proud to honor and recognize Ann B. Walker on being inducted into the City of Columbus’ Hall of Fame 2020; and\n \nWHEREAS Ann B. Walker is a woman of manty firsts: the first woman in broadcast management at WLWC-TV in Columbus, and the first African-American to cover Columbus City Hall, the very first female broadcaster to report on the Ohio legislature and the first black woman from Franklin County given a White House appointment; and.\n \nWHEREAS, Ms. Walker was inducted into the Ohio Women’s Hall of Fame as the first woman broadcaster to report on the Ohio legislature. Her career accolades would continue beyond the boundaries of Ohio. President Jimmy Carter appointed Walker as special assistant to the director of The White House Public Affairs Office in 1980. \n \n WHEREAS, Ms. Walker served as a member of the Columbus Consumer Protection Committee; became the on-air talent, producer and community services director for WLWC-TV, and would later emerge as the first female in broadcast management at the station; and    \nWHEREAS, Ms.  Walker has received numerous acknowledgments and recognition for her contributions to the local media industry and the community. She is among the “Who’s Who in Black Central Ohio” in 2000. Her work is archived in the Columbus Metropolitan Library African American history collection. Her name and image are among the honorees on the Long Street Cultural Wall in Columbus: therefore\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: that this council hereby honors and recognizes Ann B. Walker on being inducted into the City of Columbus’ Hall of Fame.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 5,
    "meeting_date": "2021-02-22",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}