{
  "success": true,
  "vote": {
    "id": 230,
    "item_number": "CA-18",
    "title": "To authorize and direct the City Auditor to establish an auditor's certificate in the amount of $829,190.00 for the purchase of equipment for the Recreation and Parks Department; to authorize and direct the Director of Finance and Management enter into various contracts for the purchase of equipment on behalf of the Recreation and Parks Department; to authorize the transfer of $579,190.00 within the Recreation and Parks Voted Bond Fund, to authorize the amendment of the 2020 Capital Improvements Budget; to authorize the expenditure of $829,190.00 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($829,190.00)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the City Auditor to establish an auditor's certificate in the amount of $829,190.00 for the purchase of equipment for the Recreation and Parks Department. These purchases will be made through the City of Columbus Purchasing Office. All bids will be obtained and contracts awarded in compliance with the relevant provisions of the Columbus City Code, Chapter 329. This ordinance will set up all of the funding required to enter into contracts with the vendors on an as-needed basis. Competitive bids will be solicited and opened by the Purchasing Office, obtained through any current universal term contract, or state term contract as authorized by ordinance number 582-87. The new equipment will replace aging equipment used by the Forestry, Golf, and Parks Maintenance Sections of the Recreation and Parks Department.  \n \nThe list below outlines the equipment expected to be purchased as soon as possible as a result of this ordinance:\n \nForestry:\nOne (1) Chipper Truck - Estimated expenditure: $101,000.00\nTwo (2) F-450 Cab and Chassis (will be upfit to complete the build of two (2) dump trucks) - Estimated expenditure: $67,290.00\nForestry Estimated Total: $168,290.00\n \nParks:\nOne (1) Terrain Pro Model Mulch Mule - Estimated expenditure: $80,000.00\nOne (1) - Trailer Mounted Power Washer (1 each) - Estimated expenditure: $10,000.00\nThree (3) - Ventrac Compact Tractor - Estimated expenditure: $150,000.00\nOne (1) - Large Mower - Estimated expenditure: $80,000.00\nParks Estimated Total: $320,000.00\n \nGolf:\nOne (1) Pro-Force Blower - Estimated expenditure: $7,700.00\nTwo (2) Greenmaster Mower - Estimated expenditure: $66,000.00\nTwo (2) Greens Kings - Estimated expenditure: $60,000.00\nOne (1) Set of Verti Cutters - Estimated expenditure: $7,500.00\nOne (1) Opticam Sewer Camera System - Estimated expenditure: $7,700.00\nOne (1) Z-Master Mower - Estimated expenditure: $15,000.00\nOne (1) Jacobsen Mower - Estimated expenditure: $55,000.00\nOne (1) Groundsmaster Mower - Estimated expenditure: $67,000.00\nOne (1) Turfco Widespin - Estimated expenditure: $20,000.00\nOne (1) Groundsmaster Sidewinder - Estimated expenditure: $35,000.00\nGolf Estimated Total: $340,900.00\n \nEmergency Justification: Emergency action is being requested in order to have this equipment delivered and available for the upcoming spring 2021 season. This ordinance is establishing the funding required for the equipment being purchased. Equipment will be ordered immediately upon the approval of this ordinance and resulting purchase orders. \n \nBenefits to the Public: Trees, parkland, and golf courses maintained by the city enhance the quality of life of our citizens. The equipment will allow for the continued maintenance and upkeep of these amenities.\n \nCommunity Input Issues: The community has expressed a desire for accessible and well-maintained parkland and golf courses. Golf customers expect the courses to be in good condition. \n \nArea(s) Affected: \nCitywide (99)\n \nMaster Plan Relation:\nThis project will support the mission of the Recreation and Parks Master Plan by helping to ensure that trees, golf courses and parks remain accessible, safe, updated, user friendly, and well maintained. \n \nFiscal Impact: $829,190.00 is budgeted and available from within the Voted Recreation and Parks Bond Funds 7702 and 7712 to meet the financial obligations of these various expenditures. Funds are contingent upon the deposit of proceeds from the 2021 Bond Sale.\n \nTitle\n \nTo authorize and direct the City Auditor to establish an auditor's certificate in the amount of $829,190.00 for the purchase of equipment for the Recreation and Parks Department; to authorize and direct the Director of Finance and Management enter into various contracts for the purchase of equipment on behalf of the Recreation and Parks Department; to authorize the transfer of $579,190.00 within the Recreation and Parks Voted Bond Fund, to authorize the amendment of the 2020 Capital Improvements Budget; to authorize the expenditure of $829,190.00 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($829,190.00)\n \nBody\n \nWHEREAS, it is necessary that the City Auditor set up a certificate in the amount of $829,190.00 for the purchase of equipment for the Recreation and Parks Department; and\n \nWHEREAS, it is necessary that the Director of Finance and Management enter into various contracts for the purchase of equipment on behalf of the Recreation and Parks Department; and\n \nWHEREAS, funding is budgeted and available from and within the Voted Recreation and Parks Bond Funds 7702 and 7712 to meet the financial obligations of these various expenditures; and\n \nWHEREAS, the Purchasing Office will solicit competitive bids to acquire various equipment for the Recreation and Parks Department in accordance with the relevant provisions of the Columbus City Code, Chapter 329 or use State Term Contracts authorized per Ordinance No. 582-87; and\n \nWHEREAS, brass tags for equipment to be replaced will be submitted to the Division of Fleet Management, and all specifications for equipment to be purchased and brass tagged will be approved by the Division of Fleet Management prior to acquisition;\n \nWHEREAS, it is necessary to authorize the transfer of $579,190.00 within the Recreation and Parks Voted Bond Funds 7702 and 7712; and\n \nWHEREAS, it is necessary to authorize the amendment of the 2020 Capital Improvements Budget Ordinance 2521-2020 in order to provide sufficient budget authority for this and future projects; and\n \nWHEREAS, it is necessary to authorize the expenditure of $829,190.00 from the Recreation and Parks Voted Bond Funds 7702 and 7712; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Recreation and Parks Department in that it is immediately necessary to authorize the purchase of this equipment so it can be delivered and available for the upcoming spring 2021 season, all for the preservation of public health, peace, property, safety, and welfare; NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the City Auditor is hereby authorized to establish an auditor's certificate in the amount of $829,190.00 for the purchase of equipment for the Recreation and Parks Department.\n \nSECTION 2. That the Director of Finance and Management is hereby authorized to enter into contracts for the purchase of equipment on behalf of the Recreation and Parks Department in accordance with the relevant provisions of the Columbus City Code Chapter 329 or using State Term Contracts authorized per ordinance number 582-87.\n \nSECTION 3. That the brass tags for equipment to be replaced will be submitted to the Division of Fleet Management, and all specifications for equipment to be purchased and brass tagged will be approved by the Division of Fleet Management prior to acquisition.\n \nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 6. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 7. That the transfer of $579,190.00 or so much thereof as may be needed, is hereby authorized between projects within the Recreation and Parks Bond Funds 7702 and 7712 per the account codes in the attachment to this ordinance.\n \nSECTION 8. That the 2020 Capital Improvements Budget Ordinance 2521-2020 is hereby amended as follows in order to provide sufficient budget authority for this ordinance and future projects.\n \nFund / Project / Project Name / Current / Change / Amended\n \nFund 7702; P510119-100000; Central Maintenance Zone Headquarters (Voted Carryover) / $821,809 / ($238,290) / $583,519\nFund 7712; P514002-100000; Program Projects (Small) - Golf Misc. (Voted Carryover) / $1,193 / ($1,193) / $0\nFund 7712; P514002-100000; Program Projects (Small) - Golf Misc. (SIT Supported) / $762,300 / ($339,707) / $422,593\n \nFund 7702; P511011-100000; Maintenance Equipment - Parks (Voted Carryover) / $0 / $70,000 / $70,000\nFund 7702; P511017-100000; Forestry Equipment (Voted Carryover) / $0 / $168,290 / $168,290\nFund 7712; P514005-100000; Golf Equipment (Voted Carryover) / $0 / $1,193 / $1,193 \nFund 7712; P514005-100000; Golf Equipment (SIT Supported) / $0 / $339,707 / $339,707\n \nSECTION 9. That the expenditure of $829,190.00 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Voted Recreation and Parks Bond Funds 7702 and 7712 in object class 06 Capital Outlay per the accounting codes in the attachment to this ordinance.\n \nSECTION 10.  That this Council hereby recognizes that this ordinance does not identify specific contractors or vendors for the expenditure purposes authorized herein and hereby delegates sole and final contracting decisions relative to the determination of lowest, best, most responsive and most responsible vendor(s) to the Director of Finance and Management and the Director of Recreation and Parks. \n \nSECTION 11.  That this ordinance is contingent upon the deposit of proceeds from the 2020 Bond Sale.\n \nSECTION 12.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 5,
    "meeting_date": "2021-02-22",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Economic Development"
    ]
  }
}