{
  "success": true,
  "vote": {
    "id": 232,
    "item_number": "CA-20",
    "title": "To authorize the Director of Recreation and Parks to modify an existing contract with Hardline Design Company for professional services associated with the improvements to the Scioto Southland Community Center, previously known as Indian Mound Community Center, to authorize the transfer of $53,482.80 within the Recreation and Parks Voted Bond Fund, to authorize the amendment of the 2020 Capital Improvements Budget; to authorize the expenditure of $53,482.80 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($53,482.80)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Director of the Recreation and Parks Department to modify an existing contract with Hardline Design Company for professional services associated with the improvements to the Scioto Southland Community Center, a recently renamed facility previously known as Indian Mound Community Center. The modification amount being authorized by this ordinance is $53,482.80.\n \nThe improvements to the former Indian Mound Community Center included updating the HVAC, plumbing, and electrical systems. Existing classrooms and the gymnasium were also improved. Additions to the facility included a new art room, ceramics room, fitness center, classrooms, game room, restrooms, kitchen, welcoming lobby and offices. The existing 10,127 square foot facility was expanded to 32,000 square feet, greatly enhancing the facility for community use. \n \nThe construction of this project finished nearly 8 months past the contractual deadline of November 2019. As a result, extended services were required of the design professional to manage the construction contract and to provide construction inspection services through the completion of the project in June 2020. The need for the additional services was a direct result of construction activities passed the contractual completion date that could not have been foreseen at when the contract was initially awarded. Due to a claim resolution process involving the construction contractor, the level of effort of the design professional was able to be determined and finalized recently.\n \nPrincipal Parties: \nHardline Design Company\n4608 Indianola Avenue, Columbus, Ohio 43214                                                      \nCharissa Durst, 614-784-8733                                                                                                      \nContract Compliance Number, Tax ID: 005794, 31-1688928\nFebruary 11, 2022\n \nEmergency Justification: Emergency action is requested since the services were already provided and owed to Hardline Design Company. Due to a claim resolution process involving the construction contractor, the level of effort of the design professional was able to be determined and finalized recently. \n \nBenefits to the Public: This project benefits the community by renovating and expanding the facility to help meet the growing recreation needs of the Far South Area.  \n \nCommunity Input/Issues: Prior to Construction, several community meetings were held to gather input. A presentation was also made to the Area Commission once a final design was agreed upon by the community.\n \nArea(s) Affected:  Far South (64)\n \nMaster Plan Relation: This project supports the departments’ Master Plan by renovating an existing facility, maximizing the use of existing recreational facilities, and enhancing programming offered to the community.\n \nFiscal Impact: The expenditure of $1,105,783.00 was legislated for the Indian Mound Improvements professional services contract by Ordinances 0111-2016, 1338-2018, and 1887-2019. This ordinance will provide funding that will modify the previously authorized amount by $53,482.80. $53,482.80 is budgeted and available from and within the Recreation and Parks Voted Bond Fund 7702 to meet the financial obligations of this contract modification. The aggregate total amount authorized, including this modification, is $1,159,265.80.   \n \nTitle\n \nTo authorize the Director of Recreation and Parks to modify an existing contract with Hardline Design Company for professional services associated with the improvements to the Scioto Southland Community Center, previously known as Indian Mound Community Center, to authorize the transfer of $53,482.80 within the Recreation and Parks Voted Bond Fund, to authorize the amendment of the 2020 Capital Improvements Budget; to authorize the expenditure of $53,482.80 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($53,482.80)\n \nBody\n \nWHEREAS, it is necessary to authorize the Director of the Recreation and Parks to modify an existing contract with Hardline Design Company for professional services associated with the improvements to the Scioto Southland Community Center, previously known as Indian Mound Community Center; and\n \nWHEREAS, it is necessary to authorize the transfer of 53,482.80 within the Recreation and Parks Voted Bond Fund 7702; and\n \nWHEREAS, it is necessary to authorize the amendment of the 2020 Capital Improvements Budget Ordinance 2521-2020 in order to provide sufficient budget authority for this and future projects; and\n \nWHEREAS, it is necessary to authorize the expenditure of $53,482.80 from the Recreation and Parks Voted Bond Fund 7702; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Recreation and Parks Department in that it is immediately necessary to authorize the Director to modify this contract since the services were already provided and owed to Hardline Design Company, all for the preservation of public health, peace, property, safety, and welfare; NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Recreation and Parks be and is hereby authorized to modify an existing contract with Hardline Design Company for professional services associated with the improvements to the Scioto Southland Community Center, previously known as Indian Mound Community Center. The amount of the modification is $53,482.80 and the aggregate total amount authorized, including this modification, is $1,159,265.80.\n \nSECTION 2. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 4. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 5. That the transfer of $53,482.80 or so much thereof as may be needed, is hereby authorized between projects within the Recreation and Parks Bond Fund 7702 per the account codes in the attachment to this ordinance.\n \nSECTION 6. That the 2020 Capital Improvements Budget Ordinance 2521-2020 is hereby amended as follows in order to provide sufficient budget authority for this ordinance and future projects.\n \nFund / Project / Project Name / Current / Change / Amended\n \nFund 7702; P510119-100000; Central Maintenance Zone Headquarters (Voted Carryover) / $583,519 / ($53,483) / $530,036\n \nFund 7702; P510126-100000; Indian Mound Improvements (Voted Carryover) / $0 / $53,483 / $53,483\n \nSECTION 7. For the purpose stated in Section 1, the expenditure of $53,482.80 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Recreation and Parks Voted Bond Fund 7702 in object class 06 Capital Outlay per the accounting codes in the attachments to this ordinance.\n \nSECTION 8. That for the reasons stated in the preamble hereto, which is hereby made a part hereof,, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 5,
    "meeting_date": "2021-02-22",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Community Services",
      "Contracts & Agreements"
    ]
  }
}