{
  "success": true,
  "vote": {
    "id": 2324,
    "item_number": "CA-15",
    "title": "To authorize the Director of Finance and Management to enter into a contract with Ecoverse Industries Limited to purchase a portable trommel drum screen for the Department of Public Utilities, Division of Sewerage and Drainage, and to authorize the expenditure of $334,400.00 from the Sewer Operating Sanitary Fund.  ($334,400.00)",
    "description": "Explanation\n \nTo authorize the Director of Finance and Management to enter into a contract with Ecoverse Industries Limited for the purchase of a portable trommel drum screen for the Division of Sewerage and Drainage (DOSD) Compost Facility, and to authorize the expenditure of $334,400 from the Sewer Operating Sanitary Fund. This specialized item is needed to replace a 2008 trommel drum screen with 21,000 hours of use time, exceeding its expected useful life of 15,000 hours, according to industry standards. Trommel drum screens are used by the Compost facility to process bulk material into a refined compost product.\n \nA formal best value proposal (BVP) was solicited for the purchase of the trommel drum screen.\n \nProposals were evaluated by a three (3) member committee based upon various criteria, including competence, quality and feasibility, past performance, ability, and environmental preference, resulting in an award recommendation to Ecoverse Industries Limited. \n \nBID INFORMATION: Request for Quote RFQ018881 was advertised on May 27, 2021 and proposals were opened July 1, 2021. Two (2) responses were received. The evaluation committee consisted of two (2) representatives from the Division of Sewerage and Drainage, one from the Compost section, one from the Fleet section; and one representative (1) from the Office of Diversity and Inclusion. Each member of the committee scored and ranked written proposals submitted by the offerors. As only two proposals were received, both companies were invited to make oral presentations. After evaluating the two offers and presentations, in compliance with City Code 329, the committee submitted final rankings. Ecoverse Industries Limited received the highest score, with 116 out of a possible 130 points. The second place bidder, Maverick Environmental Equipment, received a score of 105 points. The cost proposal from Ecoverse Industries Limited offered the best pricing. \n \nSUPPLIER:  Ecoverse Industries Limited. (45-5231110), DAX #008419, Expires April 7, 2022\nEcoverse Industries Limited does not hold MBE/FBE status.\n \nThe company is not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.\n \nFISCAL IMPACT:  $334,400.00 is budgeted and needed for this purchase.\n                     \n$0.00 was spent in 2020\n$299,970.00 was spent in 2019\n \n \nTitle\n \nTo authorize the Director of Finance and Management to enter into a contract with Ecoverse Industries Limited to purchase a portable trommel drum screen for the Department of Public Utilities, Division of Sewerage and Drainage, and to authorize the expenditure of $334,400.00 from the Sewer Operating Sanitary Fund.  ($334,400.00)\n \n \nBody\n \nWHEREAS, the Division of Sewerage and Drainage, Compost Facility utilizes trommel drum screens to process bulk material into a refined compost product; and\n \nWHEREAS, there is a need to replace a portable trommel drum screen that has exceeded its expected useful life in hours, according to industry standards; and\n \nWHEREAS, a formal best value proposal (BVP) was solicited via Request for Quote RFQ018881 and two (2) proposals were received; and  \n \nWHEREAS, the proposals were opened on July 1, 2021 and evaluated by a three (3) member multi-departmental committee, resulting in an award recommendation to Ecoverse Industries Limited, the highest scoring and lowest price vendor; and\n \nWHEREAS, this ordinance addresses the Purchasing objectives of 1) maximizing the use of City resources by obtaining optimal products/services at low prices, 2) encouraging economic development by improving access to City bid opportunities and 3) providing effective option contracts for City agencies to efficiently maintain their supply chain and service to the public; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities, Division of Sewerage and Drainage, to authorize the Director of Finance and Management to enter into a contract with Ecoverse Industries Limited for the purchase of a portable trommel drum screen; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Finance and Management be and is hereby authorized to enter into a contract with Ecoverse Industries Limited for the purchase of a portable trommel drum screen for the Division of Sewerage and Drainage, Compost Facility, in accordance with RFQ018881.\n \nSECTION 2. That the expenditure of $334,400.00 or so much thereof as may be needed, be and the same hereby is authorized from Fund 6100, Sewerage Operating Sanitary Fund, in object class 06 Capital Outlay in the amount of $334,400.00, per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4. That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 31,
    "meeting_date": "2021-11-22",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}