{
  "success": true,
  "vote": {
    "id": 2415,
    "item_number": "CA-12",
    "title": "To authorize the Director of the Recreation and Parks Department to execute and acknowledge any document(s) necessary to grant the Franklin County Commissioners a 0.016 acre non-exclusive subsurface easement burdening a portion of the City’s real property; and to declare an emergency. ($0.00)",
    "description": "Explanation\n \nBACKGROUND: The City owns real property located at 0000 Broad Meadows Boulevard, Columbus, Ohio 43214 {Franklin County Tax Parcel 010-280595} (“Property”) which is managed by the Recreation and Parks Department (“CRPD”) and is part of the Olentangy Trail. The Franklin County Commissioners, (“Franklin County”) are working on the Kanawha Rosslyn Sewer project, and as part of that project a sanitary sewer will be installed to provide sanitary service for over One Hundred Twenty (120) homes (“Improvement”). In order to accommodate the construction of the Improvement, Franklin County has requested a 0.016 acre non-exclusive subsurface easement (“Easement”) through the Property.  CRPD has reviewed the easement and has no objection to its location and to granting it for One Thousand and 00/100 Dollars ($1,000.00). The Easement is more fully described in the three (3) page attachment to this ordinance.\n \nThis ordinance authorizes the Director of CRPD, on behalf of the City, to execute and acknowledge any necessary instrument(s), as approved by the City Attorney, in order to quitclaim grant the Easement to Franklin County.\n \nCONTRACT COMPLIANCE NO.:  Not applicable.\n \nFISCAL IMPACT: The City will receive One Thousand and 00/100 Dollars ($1,000.00) in just compensation to be deposited in the Nature Preserve Waterway Subfund for the granting of this easement as the Improvement will benefit both the grantor and the City.  \n \nEMERGENCY JUSTIFICATION: Emergency action is requested to allow this Easement to be granted in a timely manner and meet Franklin County’s construction schedule which will preserve the public peace, health, property, safety and welfare.\n \nTitle\n \nTo authorize the Director of the Recreation and Parks Department to execute and acknowledge any document(s) necessary to grant the Franklin County Commissioners a 0.016 acre non-exclusive subsurface easement burdening a portion of the City’s real property; and to declare an emergency. ($0.00)\n \nBody\n \nWHEREAS, the City intends to grant the Franklin County Commissioners, (“Franklin County”) a 0.016 acre non-exclusive subsurface easement (“Easement”) burdening a portion of the City’s property to allow for installation of a sanitary sewer (“Improvement”); and \n \nWHEREAS, the City intends for the Director of the Recreation and Parks Department (“CRPD”) to execute and acknowledge any document(s) necessary to quitclaim grant the Easement to Franklin County; and\n \nWHEREAS, the City intends for the Director of CRPD to sign all document(s) associated with this ordinance; and\n \nWHEREAS, the City intends for the City Attorney to approve all instrument(s) associated with this ordinance; and \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Recreation and Parks in that it is immediately necessary authorize the Director to execute those documents necessary to grant the Easements to Franklin County at the earliest feasible date thereby allowing the construction of the Improvements to proceed in a timely manner, so as to preserve the public health, peace, property, safety, and welfare; and now, therefore: \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     That the Director of the Recreation and Parks Department (“CRPD”) is authorized to execute and acknowledge any document(s) necessary to quitclaim grant to the Franklin County Commissioners, (“Franklin County”) a 0.016 acre non-exclusive easement to burden a portion of the City’s real property located at 0000 Broad Meadows Boulevard, Columbus, Ohio 43214 {Franklin County Tax Parcel 010-280595} which is managed by the Recreation and Parks Department (“CRPD”) and is part of the Olentangy Trail.  This easement is for the purpose of installing a sanitary sewer and is further described and depicted in the three (3) page attachment, which is fully incorporated for reference as if rewritten.\n \nSECTION 2.                     That the City Attorney is required to approve all instrument(s) associated with this ordinance prior to the Director of CRPD executing and acknowledging any of those instrument(s).  \n \nSECTION 3.                     That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 32,
    "meeting_date": "2021-12-06",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services",
      "Grants",
      "Parks & Recreation"
    ]
  }
}