{
  "success": true,
  "vote": {
    "id": 2421,
    "item_number": "CA-18",
    "title": "To authorize the Director of the Department of Public Utilities, Division of Power, to enter into a Memorandum of Understanding with the Franklin County Convention Facilities Authority to meet the requirements set forth by City Code to install street lighting for Convention Center Drive in order to set forth the responsibilities of each party in regards to this project.",
    "description": "Explanation\n \nBACKGROUND:  The purpose of this ordinance is to authorize the Director of the Department of Public Utilities, Division of Power (“DOP”) to enter into a Memorandum of Understanding (MOU) with the Franklin County Convention Facilities Authority (FCCFA) pertaining to the construction of the new Hilton Hotel and pursuant to the requirements set forth by City Code 3312.19 to install street lighting for Convention Center Drive, which will be attached to the aforementioned new structure. The MOU will describe the FCCFA’s requirements for initial construction as well as set terms for continued maintenance and operation by the DOP and set agreed upon terms for said actions and responsibilities.\n \nAdditionally, the City pledged to transfer to the FCCFA up to $1.4 million from the City of Columbus Parking Meter Fund to pay debt service on the Existing Hotel in the event the FCCFA and Franklin County were unable to meet their respective obligations. To date, performance of the Existing Hotel has surpassed projections, the revenue generated from the Existing Hotel has exceeded that required to meet debt service, and significant reserve funds have accrued. As such, the $1.4 million remains on account with the City.\n \nColumbus has attracted large national and international conferences and sporting events, and continues to be a destination for business and leisure travel. To provide an adequate number of full service hotel rooms required to attract additional and larger conferences, conventions, and sporting events, the FCCFA has proposed the construction of an expansion (Hotel Expansion) to the Existing Hotel. The Hotel Expansion would add approximately 470 full service guest rooms, and an estimated 49,000 square feet of convention meeting space, restaurants, and support facilities, at an estimated cost $180 million.\n \nFunding for the Hotel Expansion will be the responsibility of the FCCFA which will issue one or more series of Hotel Expansion Bonds. The FCCFA proposes to lease the Hotel Expansion to the County and City pursuant to certain lease agreements, and to sublease the Hotel Expansion back from the County and City. The lease, sublease agreement will allow the FCCFA to reduce financing costs associated with the Hotel Expansion and lower the total cost of construction.\n \nFuture debt service payments will be the responsibility of the FCCFA utilizing revenue generated by the Hotel Expansion and paid through the FCCFA Bond Payment Fund. The FCCFA will also establish a Rental Reserve Fund. In the event the FCCFA does not have sufficient funds in either the Bond Payment Fund, the Rental Reserve Fund, or a combination of both, to pay debt service in any given year, the City and County agree to support the payment of all or a portion of the annual debt service on the Hotel Expansion Bonds in such year. \n \nThe City of Columbus owns Right of Way, on Convention Center Drive (hereinafter referred to as “ROW”), as shown on Exhibit A. where the FCCFA is the developer of property located at 402 High Street, Columbus, Ohio 43215, within the Downtown/Short North area. Here the FCCFA is building a second Hilton Hotel and was granted a non-exclusive easement within the Right of Way pursuant to Instrument number 202001240011630, Recorder’s Office, Franklin County Ohio. \n \nFCCFA as part of the development of the Hilton Hotel and submittal of the plan review process of application 19345-647 and plan 3610-E, is required by City Code 3312.19 to install street lighting for Convention Center Drive, which will attach to the new Hilton Hotel building.\n \nFCCFA Agrees to:\nAt FCCFA’s sole cost and expense install the KX7 lights, lighting controller, and knox box, and all associated lighting infrastructure (hereinafter the “Lighting”) in conformance with the 3610-E Plans, Sheet 57, as shown on Exhibit A.\nCoordinate and schedule a field walk through with DOP to demonstrate equipment access and operation of the Lighting to be maintained by DOP.\nProvide 24/7 access for DOP and/or DOP’s third party electrical companies to maintain and operate the Lighting.\nObtain any additional and necessary City of Columbus permitting or any other associated permitting associated with the Lighting and other circuits/utility infrastructure shown on Exhibit A.  \nObtain any additional permitting or communication of the project with any other community group, City, State or Federal agency.\n \nThe City of Columbus and DOP agrees to:\nOnly be responsible for operating and maintaining the Lighting (ie. KX7 lights, lighting controller, conduit and electrical wiring from the lighting controller to the KX7 lights, and Knox box) as shown on Exhibit A, upon FCCFA’s satisfactory installation of the same.   \n \nIf FCCFA and/ or its third-party electrical company fails to comply with the terms of this MOU, FCCFA will be in violation of City Code.\nFCCFA understands and agrees that no maintenance or activities to the Lighting proposed on 3610-E sheet 57 (without DOP approval), is permitted.\n \nSUPPLIER:  Kendall Electric Inc.     Vendor #030561     CC#38-2023622     expires 4/8/23     (MAJ)\n \nFISCAL IMPACT:  There are no immediate costs to the City associated with the MOU. Future legislation will be submitted to authorize such expenses if necessary. The City's commitment is contingent upon and subject to authorization by Columbus City Council, the Franklin County Board of Commissioners, and the FCCFA Board of Directors through the adoption of appropriate legislation.\n \n \nTitle\n \nTo authorize the Director of the Department of Public Utilities, Division of Power, to enter into a Memorandum of Understanding with the Franklin County Convention Facilities Authority to meet the requirements set forth by City Code to install street lighting for Convention Center Drive in order to set forth the responsibilities of each party in regards to this project.\n \nBody\n \nWHEREAS, Columbus has attracted large national and international conferences and sporting events, and continues to be a destination for business and leisure travel. To provide an adequate number of full service hotel rooms required to attract additional and larger conferences, conventions, and sporting events, the FCCFA has proposed the construction of an expansion (Hotel Expansion) to the Existing Hotel. The Hotel Expansion would add approximately 470 full service guest rooms, and an estimated 49,000 square feet of convention meeting space, restaurants, and support facilities, at an estimated cost $180 million; and\n \nWHEREAS, the City of Columbus owns Right of Way, Convention Center Drive (hereinafter referred to as ROW), as shown on Exhibit A; and\n \nWHEREAS, FCCFA is the developer of property located at 402 High Street, Columbus, Ohio 43215, within the Downtown/Short North area, upon which the FCCFA is building a second Hilton Hotel; and\n \nWHEREAS, FCCFA was granted a non-exclusive easement within the Right of Way pursuant to Instrument number 202001240011630, Recorder’s Office, Franklin County, Ohio, and\n \nWHEREAS, the parties desire to address the terms of the initial construction and the future maintenance of the lighting by the Division of Power (DOP) and hereto agree as follows:\nSECTION 1: FCCFA shall: \n \nAt FCCFA’s sole cost and expense install the KX7 lights, lighting controller, and knox box, and all associated lighting infrastructure (hereinafter the “Lighting”) in conformance with the 3610-E Plans, Sheet 57, as shown on Exhibit A.\nCoordinate and schedule a field walk through with DOP to demonstrate equipment access and operation of the Lighting to be maintained by DOP.\nProvide 24/7 access for DOP and/or DOP’s third party electrical companies to maintain and operate the Lighting.\nObtain any additional and necessary City of Columbus permitting or any other associated permitting associated with the Lighting and other circuits/utility infrastructure shown on Exhibit A.  \nObtain any additional permitting or communication of the project with any other community group, City, State or Federal agency.\n \nSECTION 2: City of Columbus and DOP shall:\n \nOnly be responsible for operating and maintaining the Lighting (ie. KX7 lights, lighting controller, conduit and electrical wiring from the lighting controller to the KX7 lights, and Knox box) as shown on Exhibit A, upon FCCFA’s satisfactory installation of the same.   \n \nSECTION 3: Miscellaneous: \n \nIf FCCFA and/ or its third-party electrical company fails to comply with the terms of this MOU, FCCFA will be in violation of City Code.\n \nFCCFA understands and agrees that no maintenance or activities to the Lighting proposed on 3610-E sheet 57 (without DOP approval), is permitted.\n \nWHEREAS, it has become necessary in the daily usual operation of the Department of Public Utilities, Division of Power,to authorize the Director of Public Utilities to enter into a Memorandum of Understanding between the City of Columbus and the Franklin County Convention Facilities Authority for the initial construction and future maintenance of street lighting along Convention Center Drive; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Public Utilities, on behalf of the Division of Power, is hereby authorized to enter into a Memorandum of Understanding with the Franklin County Convention Facilities Authority (FCCFA) to establish expectations of the FCCFA, Franklin County, and the City of Columbus necessary for the FCCFA to proceed with the construction and operation of lights on Convention Center Drive as required by City Code 3312.19. FCCFA will install, coordinate and obtain any and all permits necessary as described within the language of the MOU.  The terms of the City's support will be limited to maintenance and operation of said lighting.  Failure to follow these guidelines shall find FCCFA in breach of the MOU. \n \nSECTION 2.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 32,
    "meeting_date": "2021-12-06",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Infrastructure",
      "Public Works"
    ]
  }
}