{
  "success": true,
  "vote": {
    "id": 245,
    "item_number": "CA-33",
    "title": "To authorize the Director of Public Utilities to modify an existing professional services agreement with H.R. Gray & Associates Inc. for the Wastewater Treatment Facilities Professional Construction Management (PCM) project Mod #6; to authorize the transfer within of up to $633,490.00 and expenditure of up to $633,500.00 from the Sanitary Sewer General Obligation Fund; and to amend the 2020 Capital Improvement Budget. ($633,500.00)",
    "description": "Explanation\n \n 1.     Background: This legislation authorizes the Director of Public Utilities to modify an existing professional services agreement with H.R. Gray for the Waste Water Treatment Facilities Project Contract Management (PCM) Services for the Division of Sewerage and Drainage. The modification provides construction administration and management services including construction inspection, construction and startup coordination, reporting, budgeting, scheduling, document tracking, and related tasks associated with a multi-project program for the following construction projects:\n \n\n\n\n650243-100002\n\nJPWWTP Biosolids Land Application Improvements\n\n$633,500.00\n\n\n \n \nProject Modification Information:\n1.1 Amount of additional funds to be expended: $633.500.00\n \nOriginal Contract                                                                                                         $7,399,879.94\nModification No.1                                                                                                         $6,451,385.43\nModification No.2                                                                                                              $8,235,949.39\nModification No.3                                                                                                    $2,469,839.08\nModification No.4                                                                                              $1,122,922.21\nModification No.5                                                                                       $6,006,851.66\nModification No. 6                                                         $   633,500.00\nCURRENT PROPOSED TOTAL                                                                         $32,320,327.71         \n                                                                               \n1.2 Reasons additional goods/services could not be foreseen:  This contract modification is a planned continuation of the services included within the original contract’s scope of service and is necessary to correct an accounting error with the original contract encumbrance.  \n \n1.3 Reason other procurement processes are not used:  \n It is a planned continuation of the services originally included within the existing contract’s scope of service.\n \n1.4 How cost of modification was determined:\nA cost proposal was provided by H.R. Gray & Associates Inc. and reviewed by the Division of Sewerage and Drainage and was deemed acceptable. The cost of this contract modification is consistent with the direct labor, overhead, and profit rates established within the original proposal.\n \n2.  Project Timeline: This is a five year contract commencing in 2017 and ending with the close-out of the final project added in the final contract modification of 2021.  The original Professional Services agreement was signed on May 16, 2017.\n  \n3.  Contract Compliance No.:  31-1050479 | MAJ | Exp. 6/26/2021 | Vendor # 004640\n \n4.  Emergency Designation:  Emergency designation is not requested at this time.\n \n5.  Economic or Environmental Impact: The performance of this professional contract management services for the subject construction contracts will help to prevent or reduce a number of construction claims, and minimize charge amount of the unavoidable claims. No community outreach or environmental factors are considered for this project.\n \n6. Fiscal Impact: This ordinance authorizes the transfer within of up to $633,490.00 and expenditure of up to $633,500.00 and within the Sanitary Sewer General Obligation Fund 6109. An amendment to the 2020 Capital Improvement Budget is also necessary.  \n \nTitle\n \nTo authorize the Director of Public Utilities to modify an existing professional services agreement with H.R. Gray & Associates Inc. for the Wastewater Treatment Facilities Professional Construction Management (PCM) project Mod #6; to authorize the transfer within of up to $633,490.00 and expenditure of up to $633,500.00 from the Sanitary Sewer General Obligation Fund; and to amend the 2020 Capital Improvement Budget. ($633,500.00)\n \nBody\n \nWHEREAS, the original agreement was authorized by Ordinance 0817-2017, passed May 1, 2017; executed by the Director on May 18, 2017; approved the City Attorney May 23, 2017; and certified by the City Auditor on May 24, 2017; and\n \nWHEREAS, modification #1 was authorized by Ordinance 0699-2018, passed April 9, 2018; and\n \nWHEREAS, modification #2 was authorized by Ordinance 0925-2019, passed May 6, 2019; and\n \nWHEREAS, modification #3 was authorized by Ordinance 0828-2020, passed May 4, 2020; and\n \nWHEREAS, modification #4 was authorized by Ordinance 2139-2020, passed October 19, 2020; and\n \nWHEREAS, modification #5 was authorized by Ordinance 2547-2020, passed December 7, 2020; and\n \nWHEREAS, it is necessary to authorize the Director of Public Utilities to modify (Mod #6) the agreement with H.R. Gray & Associates Inc. for the Professional Construction Management (PCM) Services; and\n \nWHEREAS, this is a multi-year agreement with subsequent planned contract modifications; and\n \nWHEREAS, it is necessary to transfer within of up to $633,490.00 and expend up to $633,500.00 from the Sanitary Sewer General Obligation Fund 6109; and\n \nWHEREAS, it is necessary to amend the 2020 Capital Improvements Budget for purposes of providing sufficient budget authority for the aforementioned expenditures; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities, Division of Sewerage and Drainage, to authorize the Director modify (Mod #6) an existing professional services agreement with H.R. Gray & Associates Inc. for the Wastewater Treatment Facilities Professional Construction Management (PCM) project at the earliest practical date for the preservation of the public health, peace, property, safety, and welfare; NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n  \nSECTION 1. That the Director of Public Utilities is hereby authorized to modify an existing professional services agreement with H.R. Gray & Associates Inc., 3770 Ridge Mill Drive, Columbus, Ohio 43026 for the Wastewater Treatment Facilities Professional Construction Management (PCM) project; in accordance with the terms and conditions of the contract on file in the Office of the Division of Sewerage and Drainage.\n \nSECTION 2. That the City Auditor is hereby authorized to transfer within of up to $633,490.00 and expend up to $633,500.00 within the Sanitary Sewer General Obligation Bond Fund 6109 per the account codes in the attachment to this ordinance.\n \nSECTION 3. That the 2020 Capital Improvement Budget is amended per the account codes in the attachment to this ordinance.\n \nSECTION 4. That the said firm, H.R. Gray & Associates Inc. shall perform the work to the satisfaction of the Director of Public Utilities and the Administrator of the Division of Sewerage and Drainage.\n \nSECTION 5. That the City Auditor is authorized to establish proper project accounting numbers as appropriate.\n \nSECTION 6. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts and modifications associated with this ordinance.\n \nSECTION 7. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 8. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 9.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 5,
    "meeting_date": "2021-02-22",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}