{
  "success": true,
  "vote": {
    "id": 2464,
    "item_number": "CA-61",
    "title": "To authorize the appropriation and expenditure of $400,000.00 of the anticipated FY 2022 Emergency Solutions Grant (ESG) from the U.S. Department of Housing and Urban Development (HUD) for the Department of Development; to authorize the Director of Development to enter into a subrecipient agreement with the Community Shelter Board for the administration of the City's Emergency Solutions Grant monies and authorizes the payment of expenses starting January 1, 2022; and to declare an emergency. ($400,000.00) (AMENDED BY ORD 1698-2022 PASSED 7/18/2022)",
    "description": "Explanation\nBACKGROUND:  This ordinance authorizes the appropriation and expenditure of $400,000.00 of the anticipated FY 2022 Emergency Solutions Grant (ESG) from the U.S. Department of Housing and Urban Development (HUD) for the Department of Development and authorizes the Director of Development to enter into a subrecipient agreement with the Community Shelter Board for the administration of the City's Emergency Solutions Grant monies and authorizes the payment of expenses starting January 1, 2022.\n \nHistorically, the City has received an annual ESG award amount greater than $550,000 based on the federal formula and has sought authority to appropriate and expend the funds after the grant has been executed.  Starting with the 2019 grant, the Department has sought approval to appropriate and expend a portion of the grant before the grant agreement is executed and then execute a planned modification for the remaining amount after the final grant amount is known and communicated by HUD.  This change resulted from HUD's new accounting procedures.\n \nFunds will be used to meet the housing needs identified in the Consolidated Plan submitted to HUD.  The Community Shelter Board, a non-profit organization, has been selected because of their history with the City and the homeless service community in the funding and coordination of services to homeless individuals and families, as well as their established administrative procedures to effectively and efficiently implement such services.  Community Shelter Board (CSB) will enter into agreements with one or more nonprofit organizations for the provision of emergency shelter to single adult homeless individuals. CSB will provide program oversight administration. In addition, CSB will enter into agreements with one or more nonprofit organizations for the delivery of rapid re-housing program services for homeless families. CSB will administer financial assistance and provide program oversight administration.\n \nThis legislation represents a portion of the proposed ESG allocation of the proposed 2022 Action Plan, per Ordinance 2800-2021.  Passage of this ordinance is contingent upon passage of the 2022 Action Plan ordinance.\n \nEmergency legislation is in order to continue housing crisis response initiatives without interruption.\n \nFISCAL IMPACT:  Funding for this agreement in the amount of $400,000.00 is supported by the anticipated 2022 Emergency Solutions Grant (G442103) to be awarded to the City of Columbus by HUD. \n \nTitle\nTo authorize the appropriation and expenditure of $400,000.00 of the anticipated FY 2022 Emergency Solutions Grant (ESG) from the U.S. Department of Housing and Urban Development (HUD) for the Department of Development; to authorize the Director of Development to enter into a subrecipient agreement with the Community Shelter Board for the administration of the City's Emergency Solutions Grant monies and authorizes the payment of expenses starting January 1, 2022; and to declare an emergency. ($400,000.00) (AMENDED BY ORD 1698-2022 PASSED 7/18/2022) \n \nBody\nWHEREAS, the City of Columbus expects to continue as a participating jurisdiction of the U.S. Department of Housing and Urban Development for 2022; and\n \nWHEREAS, the City is the recipient of Emergency Solutions Grant funds from HUD; and\n \nWHEREAS, the Columbus City Council has approved the proposed 2022 Action Plan, per Ordinance 2800-2021, as required by HUD; and\n \nWHEREAS, this ordinance authorizes the Director of Development to enter into a subrecipient agreement with the Community Shelter Board; and\n \nWHEREAS, these programs have effectively and efficiently enabled our community to help individuals and families who are homeless resolve their housing crisis; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to enter into a subrecipient agreement with the Community Shelter Board so that necessary services for homeless families will not be interrupted, all for the preservation of the public health, peace, property, safety and welfare; NOW THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ending December 31, 2022, the sum of $400,000.00 is appropriated in Fund 2220 (General Government Grant), Dept-Div 44-10 (Housing), Project G442103, in Object Class 03 (Contractual Services) per the accounting codes in the attachment to this ordinance.\n \nSECTION 2.                     That the expenditure of $400,000.00, or so much thereof as may be necessary, is hereby authorized in Fund 2220 (General Government Grant Fund), Dept-Div 44-10 (Housing), Project G442103 in Object Class 03 Contractual Services per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  At the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements.\n \nSECTION 4.                     That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\nSECTION 6.                     That the Director of the Department of Development is hereby authorized to enter into a subrecipient agreement with the Community Shelter Board in an amount up to $400,000.00 for the purpose of effectively and efficiently enabling our community to help individuals and families who are homeless resolve their housing crisis through the Emergency Solutions Grant Program monies and authorizes the payment of expenses starting January 1, 2022.\n \nSECTION 7.                     That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 1,
    "absent": 0,
    "meeting_id": 32,
    "meeting_date": "2021-12-06",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "ABSTAIN"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}