{
  "success": true,
  "vote": {
    "id": 2488,
    "item_number": "SR-7",
    "title": "To authorize the transfer of Funds within the General Fund; to authorize and direct the City Auditor to establish an Auditor's Certificate in the amount of $4,000,000.00 for the purchase of body worn cameras, in-car cameras, and interview room cameras for the Division of Police; to authorize the expenditure of $4,000,000.00 from the General Fund; and to declare an emergency. ($4,000,000.00)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the City Auditor to establish an Auditor's Certificate to reserve budgeted funds that will be used to enter into contract with a vendor for Body Worn Cameras, In-Car Cameras and Interview Room Cameras.  A selection committee from the Department of Finance and Management and the Department of Public Safety is in the final stages of a Best Value Procurement with a final vendor expected to be selected in December 2021 and negotiations with that vendor likely ongoing through the end of the year. This ordinance will establish an Auditor's Certificate that will be used to honor the contract and avoid losing the funds at the end of the year.\n \nThis is a continuation of the Body Worn Camera Project started in 2016 to outfit all Police Officers with a video recording system that is typically utilized by law enforcement to record interactions with the public or gather video evidence at a crime scene.\n \nBid Information: The selection committee solicited proposals via RFQ019158-Body Worn Camera Best Value Procurement (BVP), which involves multiple phases of testing and evaluation.  This evaluation is ongoing with a final vendor recommendation anticipated by the end of fiscal year 2021. The Director of Finance and Management will make a separate request through legislation to enter into contract with a vendor following completion of the ongoing Best Value Procurement process.\n \nEmergency Designation: Emergency action is requested so that the funds needed can be encumbered before the end of the year to avoid any lapses.\n \nTitle\n \nTo authorize the transfer of Funds within the General Fund; to authorize and direct the City Auditor to establish an Auditor's Certificate in the amount of $4,000,000.00 for the purchase of body worn cameras, in-car cameras, and interview room cameras for the Division of Police; to authorize the expenditure of $4,000,000.00 from the General Fund; and to declare an emergency. ($4,000,000.00)\n \nBody\n \nWHEREAS, it is necessary to authorize the City Auditor to transfer funds within the General Fund, from the Finance and Management's City-wide account to the Department of Public Safety, and\n \nWHEREAS,  it is necessary to authorize the City Auditor to set up a certificate in the amount of $4,000,000.00 for the purchase of body worn cameras, in-car cameras, and interview room cameras for the Division of Police; and,\n \nWHEREAS, a selection committee made up of representatives from the Department of Finance and Management and the Department of Public Safety is in the final stages of a Best Value Procurement process to enter into contract with a vendor for the purchase of equipment and services for the various video recording cameras in accordance with the relevant provisions of the Columbus City Code, Chapter 329; and,\n \nWHEREAS, the Director of Finance and Management will make a separate request through legislation to enter into contract with a vendor following completion of the ongoing Best Value Procurement process; and\n \nWHEREAS, it is necessary to authorize the expenditure of $4,000,000.00 from the General Funds of the Division of Police; and,\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Safety, Division of Police, in that it is immediately necessary for the City Auditor to establish an Auditor's certificate for the purchase of body worn cameras, in-car cameras, and interview room cameras for the Division of Police, all for the immediate preservation of the public health, peace, property, safety, and welfare; NOW, THEREFORE:\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the City Auditor is authorized to transfer funds within the General Funds, from the Department of Finance's city-wide account to the Department of Public Safety, Division of Police per the accounting codes in the attachment to this ordinance.\n \nSECTION 2.  That the City Auditor is hereby authorized to establish an auditor's certificate in the amount of $4,000,000.00 for the purchase of body worn cameras, in-car cameras, and interview room cameras for the Division of Police.\n \nSECTION 3.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 5.  That the expenditure of $4,000,000.00 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Division of Police’s General Funds in object class 06 per the accounting codes in the attachment to this ,ordinance.\n \nSECTION 6.  That the Director of Finance and Management will make a separate request through legislation to enter into contract with a vendor following completion of the ongoing Best Value Procurement process. \n \nSECTION 7.  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 32,
    "meeting_date": "2021-12-06",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Economic Development",
      "Emergency Services"
    ]
  }
}