{
  "success": true,
  "vote": {
    "id": 2507,
    "item_number": "0",
    "title": "To enact Chapter 1117 of the Columbus City Codes to provide watershed protection on Reservoir and Land Stewardship Property through the implementation and enforcement of best management practices consistent with water quality and riparian buffer conservation standards.",
    "description": "Explanation\n \nThe purpose of this ordinance is to enact new City of Columbus City Code Chapter 1117 - Watershed Protection. \n \nThe purpose of this new chapter is to provide a safe and healthy drinking water supply and protect Reservoir and Land Stewardship Property through the implementation and enforcement of best management practices consistent with water quality and riparian buffer conservation standards.  \n \nThis chapter allows for the designation of Land Stewardship Property within specific areas of the Reservoirs and participation in the voluntary Land Stewardship Program. Property eligibility will be determined by the Columbus Recreation and Parks Department and the Columbus Department of Public Utilities. A valid Land Stewardship License Agreement will be required before any activities or improvements are authorized under the Land Stewardship Program.\n \nThis chapter allows the Director of Public Utilities to adopt rules and regulations necessary to administer and enforce the provisions of this chapter. Such rules and regulations may include the establishment of Land Stewardship Design Standards, Permit fees, and liability insurance requirements.  The City may suspend or cancel Licenses or Permits upon notification in accordance with the terms of the applicable License or Permit.  \n \nFinally, this chapter establishes the process for authorizing activities or improvements, including Private Docks, Private Stakes, Steps, Stairs, Paddlecraft Storage, or Boardwalks; as well as Overland Paths, Filtered View Corridors, Stream or Wetland crossings, embankment stabilization, or Vegetation Management on Land Stewardship Property. This chapter also includes provisions related to the abandonment and removal of structures from Land Stewardship Property. \n \n \nFISCAL IMPACT: This ordinance allows for the collection of Permit fees and any funds, damages, or other moneys received or recovered through the administration, implementation, and enforcement of the Land Stewardship Program and associated expenses of the program. \n  \nTitle\n \nTo enact Chapter 1117 of the Columbus City Codes to provide watershed protection on Reservoir and Land Stewardship Property through the implementation and enforcement of best management practices consistent with water quality and riparian buffer conservation standards.\n \nBody\n \nWHEREAS, it is necessary to maintain the City Reservoirs as a healthy and safe drinking water supply; and\n \nWHEREAS, it is necessary to enact Chapter 1117 of the Columbus City Codes to provide watershed protection on Reservoirs and Land Stewardship Property; and\n \nWHEREAS, such protection, through the implementation and enforcement of best management practices, shall be consistent with water quality and riparian buffer conservation standards; and\n \nWHEREAS, the establishment, implementation, and enforcement of the Land Stewardship Program will allow eligible Contiguous Landowners to legally access the Land Stewardship Property for the purposes of establishing and maintaining activities and improvements in accordance with the applicable Land Stewardship Design Standards; and \n \nWHEREAS, the land stewardship fund will allow for the collection of any Permit fees, and any funds, damages, or other moneys received or recovered through the administration, implementation, and enforcement of the Land Stewardship Program and associated expenses of the program; and \n \nWHEREAS, it is necessary for the Director of the Department of Public Utilities to have the authority to promulgate rules and regulations and adopt enforcement policies as necessary to administer and enforce the provisions of this chapter; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities to enact the various sections of new Chapter 1117 as listed above for the public health, safety, and welfare; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     That Chapter 1117 of the Columbus City Code is hereby enacted as follows:\n \nChapter 1117 - WATERSHED PROTECTION \n \n1117.01 - Definitions.\nAs used in this chapter:\n \n(a) “Boardwalk” shall mean an elevated footpath or walkway built to cross Wetlands providing minimal interference to natural hydrology, where the entire structure is supported by posts or screw piles driven into the bottom of the Wetland.\n \n(b) “Contiguous Landowner” shall include any landowner who owns property that shares a border with Land Stewardship Property.\n \n(c) \"Contiguous Property\" shall mean privately owned property that shares a border with Land Stewardship Property. \n \n(d) “Director” shall mean the Director of the Public Utilities Department for the City, or any representative the Director so designates.\n \n(e) “Encroachment” shall mean any unauthorized activity or unauthorized improvement, utility, or any other private structure or property that extends beyond the property line of a Contiguous Property onto Land Stewardship Property.\n \n(f) “Filtered View Corridor” shall mean gaps in vegetation that provide a view; created through invasive and noxious species removal and selected pruning, limbing, or removal of vegetation on Land Stewardship Property.\n \n(g) “Land Stewardship Design Standards” shall mean the criteria by which the City will uniformly administer the Land Stewardship Program elements including, but not limited to, an Overland Path, invasive and noxious species removal, Filtered View Corridor, Private Dock, and/or embankment stabilization.\n \n(h) “Land Stewardship License Agreement” shall mean a revocable License between the City and the eligible Contiguous Landowner that allows certain stewardship activities and improvements pursuant to the criteria set forth in the current Land Stewardship Design Standards.  The Land Stewardship License Agreement will include a land stewardship design plan that is site-specific and details the extent and location of the authorized access to the Land Stewardship Property.\n \n(i) “Land Stewardship Program” shall mean a program administered by the Department of Public Utilities that, through a Land Stewardship License Agreement, allows eligible Contiguous Landowners to legally access the Land Stewardship Property for the purposes of establishing and maintaining activities and improvements pursuant to the criteria set forth in the current Land Stewardship Design Standards.\n \n(j) “Land Stewardship Property” shall mean all city owned and controlled lands adjacent to the Reservoirs, from the dams to the furthest upstream extent of city owned and controlled shores of the incoming tributaries, that have been determined by the Department of Public Utilities and Recreation and Parks Department to be eligible for participation in the Land Stewardship Program.\n \n(k) “License” means permission to conduct certain activities on Land Stewardship Property in accordance with specified terms contained within an associated written agreement.\n \n(l) “Overland Path” shall mean a designated route across Land Stewardship Property that provides a Contiguous Landowner Land Stewardship Property access.\n \n(m) “Paddlecraft” shall mean canoes, kayaks, paddleboards, and other similar contrivances allowed by the City for use on the Reservoirs. Pedal boats, jon boats, and row boats are not included within this definition.\n \n(n) “Permit” means the written permission to maintain certain improvements or objects on Land Stewardship Property in accordance with specified terms.  \n \n(o) \"Person\" shall mean an individual, corporation, business trust, estate, trust, partnership, or association and includes any agent, trustee, executor, receiver, assignee, or other legally authorized representative thereof.\n \n(p) “Private Dock” shall mean a floating structure or platform designed to provide water access or an area to secure a Vessel, and belonging to a Contiguous Landowner.\n \n(q) “Private Stake” shall mean a wooden, metal, or alternate material post driven into the ground with the intended purpose of securing a Vessel by chain, rope, or cable.\n \n(r) \"Reservoirs\" shall mean the Hoover, Griggs, and O’Shaughnessy water supply reservoirs.\n \n(s) “Steps” shall mean relatively long treads and short risers, typically installed resting on the ground on a gradual slope.\n \n(t) “Stairs” shall mean risers and treads supported by a continuous panel called a stringer, as well as any connected landings and platforms.\n \n(u) “Streams” shall mean a water body which features a bed and bank and has surface water flowing occasionally or year-round. These include water bodies defined as ephemeral, intermittent, and perennial streams by the United States Army Corps of Engineers (USACE).\n \n(v) “Vegetation Management” shall mean the planting, removal, physical or chemical alteration of existing native or non-native vegetation.\n \n(w) \"Vessel\" shall mean every description of contrivance allowed by the City for use on the respective Reservoirs.\n \n(x) “Watershed Management Section” shall mean the personnel and work section under the City of Columbus, Department of Public Utilities, Division of Water.\n \n(y) “Wetland” shall mean, as defined by the USACE, an area that is inundated or saturated by surface or ground water at a frequency and duration sufficient to support, and that under normal circumstances does support, a prevalence of vegetation typically adapted for life in saturated soil conditions.  Wetlands generally include swamps, marshes, bogs, and similar areas.\n \n1117.02 - Purpose and Applicability.\nThe Reservoirs and Land Stewardship Property shall be managed with the primary purpose of providing a safe and healthy drinking water supply.  Activities or land uses on the Reservoirs and Land Stewardship Property which may impair Reservoir water quality or present a risk to Reservoir health are not permitted.  The Director, through their authority and responsibility to protect the water supply, will administer, implement, and enforce provisions of this chapter.  Uses and restrictions are designed to support responsible stewardship of the Reservoirs and Land Stewardship Property and best management practices consistent with water quality and riparian buffer conservation standards.  The provisions of this chapter shall be applicable to all Reservoirs and Land Stewardship Property as defined herein.\n \n1117.03 - Administration.\nExcept as otherwise provided herein, the Director or their designated agents shall administer, implement, and enforce the provisions of this chapter.\n \n1117.04 - Rules and Regulations.\nThe Director may adopt rules and regulations as necessary to administer the provisions of this chapter.  \n \n1117.05 - Land Stewardship Program.\n(A) Designation of Land Stewardship Property. \n \n1)                     The Director shall designate areas of the Reservoirs as eligible for participation in the Land Stewardship Program by a Contiguous Landowner.\n2)                     Changes to the Land Stewardship Program or eligible areas of Land Stewardship Property shall be jointly reviewed and approved by the Recreation and Parks Department and the Department of Public Utilities.\n3)                     Any Land Stewardship Property that does not have an associated valid Land Stewardship License Agreement shall not be managed, maintained, or altered in any way, per CCC 1117.05(D), by a Contiguous Landowner without prior written permission from the Director.\n4)                     A valid Land Stewardship License Agreement shall be required prior to any Permit issuance including, but not limited to, a Private Dock Permit, Private Stake Permit, Steps Permit, Stairs Permit, Paddlecraft Storage Permit, or Boardwalk Permit.\n5)                     The terms of the Land Stewardship License Agreement shall designate all permissible uses, activities, and improvements on Land Stewardship Property.  Any use, activity, or improvement that is not specifically authorized by the terms of the Land Stewardship License Agreement is prohibited, including but not limited to, alteration, cutting, mowing, trimming, gathering, collecting or taking possession of any grass, vegetation, flowers, trees or parts thereof, or other naturally occurring materials, the use of any chemical, including but not limited to, pesticides, fertilizers, or herbicides, physical harm to any natural formations, mineral deposits, historical or archeological features; construction or creation of any structures trails, paths, roads, or landscape features; alteration of any natural habitat or terrain including the deposition of waste or fill; removal, replacement, creation, or enhancement of any shore-bound or Reservoir habitats; planting or cultivation of seeds or vegetation, or any act that will pollute or otherwise harm the Reservoirs.\n \n(B) Licenses and Permits.\n \n1)                     The Director may enter into License Agreements and issue Permits as provided by this chapter and by rules and regulations adopted pursuant to this chapter.  Such License Agreements and Permits shall include, but not necessarily be limited to, a Land Stewardship License Agreement, Private Dock Permit, Private Stake Permit, Steps Permit, Stairs Permit, Paddlecraft Storage Permit, or Boardwalk Permit.\n(a)                     The Director may adopt rules and regulations to establish and collect Permit fees as the Director determines necessary for the purposes of this chapter.\n(b)                     The Director may adopt rules and regulations to establish Land Stewardship License Agreement and Permit liability insurance requirements as the Director determines necessary for the purposes of this chapter.\n2)                     The Director retains the unilateral right to decline to enter into Land Stewardship License Agreements and to decline to issue Permits.\n3)                     The Director has the unilateral right to temporarily or permanently suspend, terminate, or revoke any Land Stewardship License Agreement or Permit issued under this chapter upon providing a thirty (30) day notification.\n4)                     A violation of any term of a Land Stewardship License Agreement or Permit may result in the immediate suspension, termination, or revocation of the Land Stewardship License Agreement or Permit, as applicable. \n \n(C) Permitting of Private Docks, Private Stakes, Steps, Stairs, Paddlecraft Storage, or Boardwalks.\n \n1)                     Permits shall be issued on a form prepared by the Department for that purpose.  Permits shall be non-transferable by assignment, loan, sublease, or other means.\n(a)                     Permits may issue to allow for the following improvements:  Private Docks, Private Stakes, Steps, Stairs, Paddlecraft Storage, or Boardwalks.  The permitted improvements are to be privately constructed and maintained by the permittee, and they may extend over or on the Land Stewardship Property and/or Reservoir, whether extending from the Contiguous Property or the Land Stewardship Property.\n(b)                     Effective January 1, 2022, new Private Stakes Permits will not be issued. However, Permits for Private Stakes may be renewed by eligible Contiguous Landowners where the Contiguous Property ownership has not changed hands.  \n2)                     Any Permit granted hereunder shall be for the sole benefit of the permittee and the permittee's guests.  A Permit will only be issued to the Contiguous Landowner whose name(s) appears on the property deed of the Contiguous Property.  Land Stewardship License Agreements and Permits will automatically terminate upon a transfer of the licensee or permittee’s title ownership of the Contiguous Property.\n3)                     Permits shall be signed by the owner(s) of the Contiguous Property.  Individuals signing on behalf of a business, company, association, or corporate entity must provide satisfactory proof of authority to sign as an agent of the business, association, company, or corporate entity. \n4)                     The permittee shall, on behalf of the permittee and on behalf of permittee’s guests, agree to abide by all applicable local, state, and federal rules, laws, and regulations relative to the permittee's or guest’s conduct, their use and operation of any Vessel, use of all Reservoirs, adjacent parklands, Land Stewardship Property, and approved improvements.  Furthermore, the permittee shall agree to assume the defense of and to indemnify and save harmless the City from any and all claims, suits, loss or damage or injury to person(s) or property of any kind or nature whatsoever arising in the use or operation of any Vessel, Private Dock, Private Stake, Steps, Stairs, Paddlecraft Storage, or Boardwalk.\n5)                     Permits issued for a Private Dock, Private Stake, or Paddlecraft Storage shall be valid for a one (1) calendar year period.  These Permits must be renewed within ninety (90) days from expiration of the current Permit.\n6)                     Permits issued for Steps, Stairs, or Boardwalks shall be valid for a five (5) calendar year period.  These Permits must be renewed within ninety (90) days from expiration of the current Permit.\n7)                     Requests to install, replace, repair, or make alterations to Private Docks, Private Stakes, Steps, Stairs, Paddlecraft Storage, or Boardwalks must be submitted to the Watershed Management Section on a form prepared by the Department for that purpose.  All such improvements must comply with applicable local, state, and federal rules, laws, and regulations.  When in conflict, whichever code is more restrictive takes precedence.  The Director must approve any proposed work in writing prior to commencement of activities.\n8)                     Private Docks, Private Stakes, Steps, Stairs, Paddlecraft Storage, or Boardwalks authorized prior to January 1, 2022 that are not in conformance with current Land Stewardship Design Standards are subject to inspection and may be required to be modified prior to being issued a Permit or renewal Permit.\n9)                     Upon cancellation, termination, or expiration of the Land Stewardship License Agreement or applicable permit not related to a change in ownership, all Private Docks, Private Stakes, Steps, Stairs, Paddlecraft Storage, Boardwalks, improvements, utilities, or any other private structures or property shall be removed by the Contiguous Landowner originally granted permission to make the improvements, at their expense.  Where a change in ownership results in the termination of a Land Stewardship License Agreement and Permits, improvements may be left in place if they comply with the then-current Land Stewardship Design Standards and if the new Contiguous Landowner obtains a Land Stewardship License Agreement and any Permit that may be required.\n10)                     Any and all Encroachment-related issues must be fully resolved to the satisfaction of the City before a Land Stewardship License Agreement may be obtained and before any permission, License, or Permit may be granted.\n11)                     In addition to all other applicable Permit requirements, unless otherwise provided herein, no Vessel(s) or Paddlecraft other than those designated on the Permit shall be tied or stored at the designated Private Dock, Private Stake, or Paddlecraft storage area.  The permittee of a Private Dock, Private Stake, or Paddlecraft Storage Permit must prove ownership of a Vessel or Paddlecraft that bears a Hull Identification Number (HIN) recognized by the United States Coast Guard by presenting to the Department the current state of Ohio registration certificate or a copy thereof for the Vessel(s) to be tied or stored at the Private Dock, Private Stake or Paddlecraft Storage area.   \n(a)                     The Director may approve temporary docking or storage privileges for Private Dock, Private Stake, or Paddlecraft Storage permittees, not to exceed thirty (30) days in a boating season.\n(b)                     The Director may consider applicants using leased Vessel(s) or Paddlecraft for Private Docks, Private Stakes, or Paddlecraft Storage with proper proof of the lease agreement, current registration and ownership of the leased Vessel(s) or Paddlecraft.\n(c)                     Additional Vessel(s) or Paddlecraft registered to the same permittee may be considered. \n \n(D) Authorization to Install or Maintain Overland Paths, Filtered View Corridors, Stream or Wetland Crossings, or Vegetation Management.\n \n1)                     Overland Paths, Filtered View Corridors, Stream or Wetland Crossings, or Vegetation Management may be authorized as provided for in a valid Land Stewardship License Agreement.\n \n(E) Abandonment and Removal.\nPrivate Docks, Private Stakes, Steps, Stairs, Paddlecraft Storage, Boardwalks, or any other improvements, utilities, or any other private structures or property on Land Stewardship Property without the valid Land Stewardship License Agreement or Permit will be considered abandoned by the owner and is subject to immediate removal from Land Stewardship Property.\n \n1117.06 - Land Stewardship Fund.\nThe City Auditor has been authorized and directed to establish a special purpose subfund to be known as the \"Land Stewardship Fund\".  The Director may receive contributions which shall be deposited with the City Treasurer in the Land Stewardship Fund.\n \nAny funds, fees, civil damages, or other moneys received or recovered through the administration, implementation, and enforcement of the provisions of this chapter or by rules and regulations promulgated or policies adopted pursuant to this chapter, shall be deposited in the Land Stewardship Fund.\n \nExpenditures from the Land Stewardship Fund can be used only for the administration, implementation, or enforcement of the Land Stewardship Program, or water quality and water supply best management practices designed to protect, enhance, or expand the Reservoirs and Land Stewardship Property.  Expenditures shall be made only upon a warrant approved by the City Auditor.\n \nThe Department of Public Utilities shall keep a separate account of all receipts and expenditures of the Land Stewardship Fund.  \n \n1117.07 - Enforcement.\nThe Director may promulgate rules and regulations and adopt policies as necessary to enforce the provisions of this chapter.  Such rules and regulations or policies may include, but not necessarily be limited to, remediation, written notification of noncompliance, or temporary or permanent suspension, termination or revocation of Licenses or Permits.\n \n1117.08 - Legal Action.\nWhenever a person has violated any provision(s) of this chapter, the City may seek any and all remedies otherwise allowed by law, including seeking injunctive relief against said person, a civil action for damages, and/or, if applicable, criminal prosecution.\n \nSECTION 2. That this ordinance shall take effect and be in force from and after the earliest period provided by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 33,
    "meeting_date": "2021-12-13",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Infrastructure",
      "Property & Real Estate"
    ]
  }
}