{
  "success": true,
  "vote": {
    "id": 2528,
    "item_number": "CA-11",
    "title": "To amend the 2021 Capital Improvement Budget; to authorize the City Auditor to transfer funds within the Public Safety G.O. Bond Fund; to authorize the Director of Finance and Management, on behalf of the Department of Public Safety, to execute those documents necessary to purchase that real property containing approximately four (4) acres of land located on Sullivant Avenue at Townsend Avenue, for the construction of a new police substation; to authorize the expenditure of up to $390,000.00 from the Public Safety G. O. Bond Fund, and to declare an emergency. ($390,000.00).",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Finance and Management Director to acquire approximately 4 acres of vacant land to be lot split from Franklin County Parcel 010-066929, located at the northwest corner of Sullivant Avenue and Townsend Avenue, Columbus, as a future site for Police Substation 19.  The City’s current Precinct 19 substation, located at 2070 Sullivant Avenue, is approximately 57 years old and no longer meets the operational needs of the Division of Police. The present site is too small to allow for expansion of the building and cannot accommodate an adequate number of parking spaces to meet operational needs. \n \nThe City explored numerous properties in this service area over the past several years in an attempt to find a suitable replacement site but none proved to be viable. A suitable site has now been identified. Located on Sullivant Avenue at the Townsend Avenue intersection, the site is comprised of approximately four (4) acres of land and will accommodate construction of a modern precinct building with adequate parking to serve the operational needs of the Division of Police and to better serve the residents of the Hilltop area.\n \nThis legislation authorizes the Director of Finance and Management to execute those documents necessary to purchase that real property from the State of Ohio and to expend up to $390,000.00 for all costs associated with the acquisition of the property. All due diligence activities including surveys, appraisals, environmental site assessments and geotechnical soil testing have been completed. \n \nFiscal Impact: The Department of Finance and Management and Department of Public Safety has determined that funding for this project is available within the 2021 Public Safety G. O. Bond Fund. \n \nEmergency Justification: Emergency action is requested to allow this acquisition to proceed to closing without delay to allow for the professional design of the substation building and site improvements to proceed without delay to allow for timely construction and occupancy by the Division of Police at the earliest feasible date. \n \nTitle\n \nTo amend the 2021 Capital Improvement Budget; to authorize the City Auditor to transfer funds within the Public Safety G.O. Bond Fund; to authorize the Director of Finance and Management, on behalf of the Department of Public Safety, to execute those documents necessary to purchase that real property containing approximately four (4) acres of land located on Sullivant Avenue at Townsend Avenue, for the construction of a new police substation; to authorize the expenditure of up to $390,000.00 from the Public Safety G. O. Bond Fund, and to declare an emergency. ($390,000.00).\n \nBody\n \nWHEREAS, the City of Columbus, Department of Finance and Management, on behalf of the Department of Public Safety, desires to enter into a purchase contract by and between the City and State of Ohio for the purchase of that real property containing approximately four (4) acres of land located at the northwest corner of Sullivant Avenue and Townsend Avenue, Columbus, Ohio; and\n \nWHEREAS, the site is within the geographic service area of Precinct 19 and is of sufficient size to accommodate the construction of a modern police substation with sufficient parking to meet Division of Police operational needs and to better serve the residents of the Hilltop area; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Safety, Division of Police in that it is immediately necessary to authorize the Director of Finance and Management, on behalf of the Department of Public Safety, to execute those documents necessary to purchase that real property from State of Ohio containing approximately four acres of land, being a portion of Franklin County Tax Parcel 010-066929, to allow the professional design of the substation building and site improvements to proceed without delay thereby providing for timely construction of the project and occupancy by Division of Police at the earliest feasible date for the immediate preservation of the public health, peace, property, welfare and safety; NOW, THEREFORE:\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Finance and Management, on behalf of the Department of Public Safety be, and hereby is, authorized to execute those documents, including appurtenant easements as approved by the Department of Law, Real Estate Division, necessary for the purchase of that real property containing approximately four acres of land located at the northwest corner of Sullivant Avenue and Townsend Avenue, Columbus, Ohio, and being a portion of Franklin County Tax Parcel 010-066929.\n \nSECTION 2.  That the 2021 Capital Improvements Budget authorized by ordinance 2521-2020 be amended as follows to establish sufficient authority for this project:\n \nFund / Project / Project Name / Current / Change / C.I.B. as Amended\n7701/P340159-100000/Fire Facility-Pavement Restoration (voted carryover) /$470,000/ ($145,000)/$325,000\n7701/P330067-100000/Police and Fire Joint Wellness Center (voted carryover)/$3,000,000/ ($124,096) /$2,875,904\n7701/P330021-100000/Police Facility Renovations- Roof Maintenance (voted carryover)/$677,688/ ($120,904)/ $556,784\n7701/P330070-100000/Police Substation- Hilltop Area (voted carryover)/ $0 / $390,000/ $390,000\n \n7701/P330070-100000/Police Substation- Hilltop Area (Voted 2019)/ $5,000,000 / ($390,000)/ $4,610,000\n7701/P340159-100000/Fire Facility-Pavement Restoration (Voted 2019) /$0/ $145,000/$145,000\n7701/P330067-100000/Police and Fire Joint Wellness Center (Voted 2019)/$0/ $124,096 /$124,096\n7701/P330021-100000/Police Facility Renovations (Voted 2019)/$1,680,000/ $120,904/ $1,800,904\n \nSECTION 3.  That the transfer of $390,000.00, or so much thereof as may be needed, is hereby authorized between projects within Fund 7701 Public Safety G. O. Bond Fund per the accounting codes in the attachment to this ordinance. See attachment “Ordinance 3234-2021 Funding”.\n \nSECTION 4.  That the expenditure of $390,000.00, or so much thereof as may be necessary, be and is hereby authorized in Fund 7701 Public Safety G. O. Bond Fund in Object Class 06 Capital Outlay per the accounting codes in the attachment to this ordinance. See attachment “Ordinance 3234-2021 Funding”.\n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.  That the City Auditor is authorized to transfer the unencumbered balance in a project account to the unallocated balance account of the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 7.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 8.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 33,
    "meeting_date": "2021-12-13",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services",
      "Property & Real Estate"
    ]
  }
}