{
  "success": true,
  "vote": {
    "id": 254,
    "item_number": "CA-42",
    "title": "To amend the 2020 Capital Improvement Budget; to authorize the Chief Innovation Officer to execute a professional services contract modification with MTECH Solutions, LLC relative to the Smart Columbus - Multimodal Trip Planning Application project; to authorize the expenditure of up to $200,000.00 from the Public Service Taxable Bonds Fund to pay for the contract modification; to authorize the payment of invoices issued by MTECH starting on January 15, 2021; and to declare an emergency.  ($200,000.00)",
    "description": "Explanation\n1.  BACKGROUND\nThis legislation authorizes the Chief Innovation Officer to enter into a professional services contract modification with MTECH Solutions, hereafter referenced as MTECH, in an amount of up to $200,000.00 for integration into kiosks at Smart Mobility Hubs and continued development during deployment of the Multimodal Trip Planning Application (MMTPA) for end to end (door to door) multimodal trip execution.  \n \nThe Smart City Challenge is a U.S. Department of Transportation (USDOT) grant program seeking to “create a fully integrated, first-of-its kind city that uses data, technology and creativity to shape how people and goods move in the future.”  In 2016, the City of Columbus, acting through the Department of Public Service, applied for and won the Smart City Challenge, receiving a $40 million dollar grant from USDOT and a $10 million grant from the Paul G. Allen Family Foundation (Vulcan).  \n \nAs part of Columbus’ overall response to the Smart City Challenge, efforts were focused on how an integrated smart transportation system would encourage the use of multimodal trips.  Increasingly, citizens in urban areas view mobility as a service, and expect seamless connections as they move from mode to mode.  The MMTPA project will provide this functionality and improve upon the existing functionality currently available to users. \n \nOrdinance 1901-2017 authorized the Public Service Director to transfer signature authority to the Chief Innovation Officer or the Chief Innovation Officer's designee for all past, present and future Smart Columbus, USDOT Smart City Challenge, and Paul G Allen Family Foundation (Vulcan) contracts, documents, and projects.\n \nPursuant to Ordinance 2864-2018, the Smart City Program Management Office initiated a procurement effort that resulted in the award and execution of a professional services contract with MTECH in the amount of up to $900,000 for the purchase of a new application environment for the execution of multimodal transportation, known as the Multimodal Trip Planning Application (MMTPA) for end to end (door to door) multimodal trip execution.  Ordinance 0112-2020 authorized the Chief Innovation Officer to modify the contract in the amount of $250,000.00.  This ordinance authorizes the Chief Innovation Officer to further modify the contract in the amount of $200,000.00.\n \nThe purpose of this contract modification is to add funding to the original contract to complete integration into kiosks at Smart Mobility Hubs and continued development during deployment of the Multimodal Trip Planning Application (MMTPA) for end to end (door to door) multimodal trip execution. \n \nThis Ordinance also authorizes the payment of invoices issued by MTECH starting on January 15, 2021.  \n \nThe original contract amount:                                                                                       $900,000.00 (Ord. No. 2864-2018, PO147350)                          \nThe total of Modification No. 1:                                                                                        $250,000.00 (Ord. No. 0112-2020, PO221775)\nThe total of Modification No. 2:                                                                                    $200,000.00 (Ord. No. 0228-2021)                                                               \n \nTotal Contract amount including all modifications:       $1,350,000.00   \n \nSearches in the System for Award Management (Federal) and the Findings for Recovery list (State) produced no findings against MTECH.\n \n2.  CONTRACT COMPLIANCE\nThe contract compliance number for MTECH Solutions is WBE026781 and expires 08/30/2021.\n  \n3.  FISCAL IMPACT \nFunding in the amount of $200,000.00 is available and appropriated for this project in the Public Service Taxable Bonds Fund, Fund 7708.  An amendment to the 2020 Capital Improvement Budget is necessary for the purpose of providing sufficient spending authority in the proper project. \n \n4.  EMERGENCY DESIGNATION\nEmergency action is requested in that it is immediately necessary to authorize the Chief Innovation Officer to execute a contract with MTECH authorizing the encumbrance and expenditure of requisite engineering and design funding so as to prevent unnecessary delays in the Smart City Challenge deployment schedule.\n \nTitle\nTo amend the 2020 Capital Improvement Budget; to authorize the Chief Innovation Officer to execute a professional services contract modification with MTECH Solutions, LLC relative to the Smart Columbus - Multimodal Trip Planning Application project; to authorize the expenditure of up to $200,000.00 from the Public Service Taxable Bonds Fund to pay for the contract modification; to authorize the payment of invoices issued by MTECH starting on January 15, 2021; and to declare an emergency.  ($200,000.00)\n \nBody\nWHEREAS, in 2016 USDOT awarded the City of Columbus up to $40 million in federal funds for the Smart City Challenge to assist in implementation of the City’s proposal to demonstrate how advanced data and intelligent transportation systems (ITS) technologies and applications can be used to reduce congestion, keep travelers safe, protect the environment, respond to climate change, connect underserved communities, and support economic vitality; and\n \nWHEREAS, Ordinance 1901-2017 authorizes the Public Service Director to transfer signature authority to the Chief Innovation Officer or the Chief Innovation Officer's designee for all past, present and future Smart Columbus, USDOT Smart City Challenge, and Paul G Allen Family Foundation (Vulcan) contracts, documents, and projects; and\n \nWHEREAS, Ordinance 2864-2018 authorized the Chief Innovation Officer to enter into a professional services contract with MTECH in an amount of up to $900,000.00 for the execution of multimodal transportation, known as the Multimodal Trip Planning Application (MMTPA) for end to end (door to door) multimodal trip execution; and\n \nWHEREAS, Ordinance 0112-2020 authorized the Chief Innovation Officer to enter into a professional services contract with MTECH in an amount of up to $250,000.00 for the continued execution of multimodal transportation, known as the Multimodal Trip Planning Application (MMTPA) for end to end (door to door) multimodal trip execution; and\nWHEREAS, it is necessary to execute a second contract modification with MTECH to add additional funding for the integration into kiosks at Smart Mobility Hubs and continued development during deployment of the Multimodal Trip Planning Application (MMTPA) for end to end (door to door) multimodal trip execution; and\n \nWHEREAS, funding for this contract modification is available in Fund 7708, the Public Services Taxable Bonds Fund; and\n \nWHEREAS, it is necessary to amend the 2020 Capital Improvement Budget to establish budget authority in the proper project for this contract modification; and\n \nWHEREAS, it is necessary to expend funds to pay for work performed as part of the contract modification; and\n \nWHEREAS, this Ordinance also authorizes the payment of invoices issued by MTECH starting on January 15, 2021; and  \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service, Smart City Program Office, in that it is immediately necessary to authorize the Chief Innovation Officer to execute a contract modification with MTECH authorizing the encumbrance and expenditure of requisite engineering and design funding so as to prevent unnecessary delays in the USDOT Smart City Challenge program and to adhere to the terms and conditions of that program, thereby preserving the public health, peace, property, safety and welfare; now, therefore:\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2020 Capital Improvement Budget, authorized by Ordinance 2521-2020, be amended as follows to establish sufficient authority for this project:\n \nFund / Project / Project Name / Current / Change /Amended\n7708 / P530163-100000 / Smart City Challenge (Voted Carryover) / $419,873.00/ ($200,000.00) / $219,873.00\n7708 / P530163-100015 / Smart Columbus - Multimodal Trip Planning Application - Common Payment System(Voted Carryover) / $0.00 / $200,000.00 / $200,000.00 \n \nSECTION 2.  That the Chief Innovation Officer, on behalf of the Department of Public Service, be and is hereby authorized to execute a professional services contract modification with MTECH Solutions, LLC, 2967 Switzer Ave., Ste. D, Columbus, Ohio 43219, in an amount of up to $200,000.00 related to the Smart Columbus - Multimodal Trip Planning Application project. \n \nSECTION 3.  That the expenditure of $200,000.00, or so much thereof as may be necessary, be and is hereby authorized in Fund 7708 (Public Service Taxable Bonds Fund), Dept-Div 5912 (Division of Design and Construction), Project P530163-100015 (Smart Columbus - Multimodal Trip Planning Application - Common Payment System), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Chief Innovation Officer administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 7.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or 10 days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 5,
    "meeting_date": "2021-02-22",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}