{
  "success": true,
  "vote": {
    "id": 2562,
    "item_number": "CA-45",
    "title": "To authorize the Director of the Department of Neighborhoods to modify, by extending, existing contracts with Remember Us Urban Scouts, Africentric Personal Development Shop, and Community Development for All People through December 31, 2021 to continue offering youth engagement, employment, and the development of skills that will encourage long-term success and stability; and to declare an emergency.",
    "description": "Explanation\n \nOrdinance 1008-2021 authorized the expenditure of up to $1,371,000.00 from the Reimagine Safety Fund to foster youth engagement, employment, and the development of skills that will encourage long-term success and stability. \n \nThis ordinance is needed to modify PO275780, PO275143, and PO282668 by extending the contracts with Remember Us Urban Scouts, Africentric Personal Development Shop, and Community Development for All People respectively through December 31, 2021. This modification is needed to continue offering youth engagement, employment, and the development of skills that will encourage long-term success and stability and due to COVID administrative difficulties these organizations need their contracts extended from November 1, 2021 through December 31, 2021.\n \n \nFiscal Impact: No additional funding is required to modify contract.  \n \nEmergency Justification:  Emergency action is requested to allow for the immediate execution of this contract in order to continue youth engagement, employment, and the development of skills that will encourage long-term success and stability.\n \n \n \nTitle\n \nTo authorize the Director of the Department of Neighborhoods to modify, by extending, existing contracts with Remember Us Urban Scouts, Africentric Personal Development Shop, and Community Development for All People through December 31, 2021 to continue offering youth engagement, employment, and the development of skills that will encourage long-term success and stability; and to declare an emergency. \n \n \n \nBody\n \nWHEREAS, it is necessary to modify, by extending, contract PO275780, PO275143, and PO282668 with Remember Us Urban Scouts, Africentric Personal Development Shop, and Community Development for All People through December 31, 2021; and\n \nWHEREAS, in March of 2021, Columbus City Council announced the availability of funding to support violence intervention strategies in response to rising neighborhood violence; and\nWHEREAS, Columbus City Council’s Reimagine Safety agenda involves promoting programming that fosters youth engagement, employment, and the development of skills that will encourage long-term success and stability; and\nWHEREAS, Council has selected a number of social service agencies to work together with the Department of Neighborhoods on enacting new programming or sustaining and growing existing programming; and\nWHEREAS, due to COVID-19 related administrative difficulties, these contracts need to be extended from November 1, 2021 through December 31, 2021; and\nWHEREAS, an emergency exists in the usual daily business of the city in that it is immediately necessary to authorize the Director of Neighborhoods to enter into grant agreements with social service agencies to immediately implement or expand existing programming to address rising neighborhood violence; \n \nNOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Neighborhoods be, and hereby is, authorized to modify, by extending, contracts PO275780, PO275143, and PO282668 with Remember Us Urban Scouts, Africentric Personal Development Shop, and Community Development for All People from November 1, 2021 through December 31, 2021. There is no change to the scope of services and the original terms and conditions remain in effect.\n \nSECTION 2. That this modification is in accordance with relevant provisions of Chapter 329 of the Columbus City Code.\n \nSECTION 3.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 33,
    "meeting_date": "2021-12-13",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}