{
  "success": true,
  "vote": {
    "id": 2584,
    "item_number": "CA-67",
    "title": "To authorize the Director of Development to make a payment of $21,093 from the general fund to the Capital Crossroads Special Improvement District (SID) to continue to enable employees who work in City buildings that are within the Capital Crossroads SID boundaries but do not pay SID assessments (Non-SID Assessment Employees) to participate in the Downtown C-Pass Program (the Program); and to declare an emergency. ($21,093.00)",
    "description": "Explanation\nBACKGROUND: \nThis ordinance authorizes the Director of the Department of Development to authorize the expenditure of $21,093 ($21,093) to the Capital Crossroads Special Improvement District (SID) to continue to enable employees who work in City buildings that are within the Capital Crossroads SID boundaries but do not pay SID assessments (Non-SID Assessment Employees) to participate in the Downtown C-Pass Program (the Program); \n \nThese Non-SID Assessment Employees work in the following City buildings: 77 North Front Street, 345 South High Street, 373 South High Street, 375 South High Street, and 120 Marconi Blvd.\n \nThe City will pay $40.50 from 2022-2025 per each eligible employee (currently 92) in the 345 South High Street, 373 South High Street, and 375 South High Street Buildings at a cost of $3,726.  \n \nThe City will pay $0.06 per square foot of the entire building for the 77 North Front Street and 120 Marconi Buildings for all the employees to have access to the Program at a cost of $17,367.\n \nThe total cost for 2022 is $21,093 to cover the Program participation for Non-SID Assessment Employees. \n \nThrough Ordinance 2900-2020, The Department of Development entered into a 5 year agreement (2021-2025) with the Capital Crossroads SID to continue the City’s involvement with the Program.  The Department of Development will seek Council approval to fund participation each year in 2021, 2022, 2023, and 2024.\n \nCouncil previously supported the Program and provided Program access for Non-SID Assessment Employees in Ordinances 0817-2020, 0540-2019, and 1465-2018.\n \nThe cost to cover the remaining City employees who work within City buildings in the Capital Crossroads SID (90 West Broad Street and 111 North Front Street) will be handled through our annual Capital Crossroads SID assessments.\n \nThe Capital Crossroads SID created the Downtown C-Pass Program (the Program) for eligible employers and employees in downtown Columbus in partnership with the Central Ohio Transit Authority (COTA) and the Mid-Ohio Regional Planning Commission (MORPC) in 2018. The initial 3 year Program ended in 2020. The Capital Crossroads SID, COTA, and MORPC have agreed to extend the Program another 5 years through the end of 2025. \n \nThe Program provides unlimited access to COTA transportation services at no additional cost to eligible employees.\n \nThe Program was originally launched in 2018 by the Capital Crossroads SID (CCSID) in partnership with the Central Ohio Transit Authority (COTA) and the Mid-Ohio Regional Planning Commission (MORPC) to proactively address parking shortages, access to jobs and high employee turnover within the CCSID that threatened the further development of Downtown Columbus. Because of its success in the three-year initial program that ended in 2020, the property owners in the CCSID renewed the program for an additional five years through 2025 and doubled their contribution. \n \nPrior to the pandemic, the program was exceeding expectations. Ridership among the eligible pool more than doubled and COTA was enjoying its highest ridership in more than 30 years thanks in part to the Program. Program participants reported the Program helped them retain and recruit workers, and companies also reported that the Program helped influence their decisions to renew or sign a lease in C-pass-eligible buildings. \n \nCCSID negotiated a price reduction with COTA for both 2020 and 2021 due to the pandemic. As the community comes out of the pandemic, the importance of the Program remains.  As workers gradually return to downtown offices, many on a hybrid basis, they are rethinking commuting choices providing an opportunity of growth for C-pass and transit ridership.\n \nThe services included in this not-for-profit service contract cannot be provided by existing city employees because these services are beyond the City’s current staffing capacity to provide.\n \nEmergency action is requested in order to ensure continued participation in the Program without interruption.\n \nFISCAL IMPACT: The costs to participate in the Program are fully covered within the 2021 Operating Budget and will be included in the subsequent 2022, 2023, 2024 Operating Budgets.\n \nCONTRACT COMPLIANCE:  the vendor number is 006946 and expires on 11/8/2023.\n \nTitle\nTo authorize the Director of Development to make a payment of $21,093 from the general fund to the Capital Crossroads Special Improvement District (SID) to continue to enable employees who work in City buildings that are within the Capital Crossroads SID boundaries but do not pay SID assessments (Non-SID Assessment Employees) to participate in the Downtown C-Pass Program (the Program); and to declare an emergency. ($21,093.00)\n \nBody\nWHEREAS, this ordinance authorizes the Director of the Department of Development to Director of Development to make a payment of $21,093 from the general fund to the Capital Crossroads Special Improvement District (SID) to continue to enable employees who work in City buildings that are within the Capital Crossroads SID boundaries but do not pay SID assessments (Non-SID Assessment Employees) to participate in the Downtown C-Pass Program (the Program); and to declare an emergency; and \nWHEREAS, these Non-SID Assessment Employees work in the following City buildings: 77 North Front Street, 345 South High Street, 373 South High Street, 375 South High Street, and 120 Marconi Blvd; and\nWHEREAS, the City will pay $40.50 from 2022-2025 per each eligible employee (currently 92) in the 345 South High Street, 373 South High Street, and 375 South High Street Buildings at a cost of $3,726.  \nWHEREAS, the City will pay $0.06 per square foot of the entire building for the 77 North Front Street and 120 Marconi Buildings for all the employees to have access to the Program at a cost of $17,367; and\nWHEREAS, the total cost for 2022 is $21,093 to cover the Program participation for Non-SID Assessment Employees; and\nWHEREAS, through Ordinance 2900-2020, The Department of Development entered into a 5 year agreement (2021-2025) with the Capital Crossroads SID to continue the City’s involvement with the Program; and  \nWHEREAS, the Department of Development will seek Council approval to fund participation each year in 2021, 2022, 2023, and 2024; and\nWHEREAS, Council previously supported the Program and provided Program access for Non-SID Assessment Employees in Ordinances 0817-2020, 0540-2019, and 1465-2018; and\nWHEREAS, the cost to cover the remaining City employees who work within City buildings in the Capital Crossroads SID (90 West Broad Street and 111 North Front Street) will be handled through our annual Capital Crossroads SID assessments; and\nWHEREAS, the Capital Crossroads SID created the Downtown C-Pass Program (the Program) for eligible employers and employees in downtown Columbus in partnership with the Central Ohio Transit Authority (COTA) and the Mid-Ohio Regional Planning Commission (MORPC) in 2018; and\nWHEREAS, while the initial 3 year Program ended at the end of 2020, the Capital Crossroads SID, COTA, and MORPC have agreed to extend the Program another 5 years through 2025; and\nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to authorize the Director to pay Capital Crossroads SID in order to continue the Program without interruption, such immediate action being necessary for the preservation of the public health, peace, property and safety; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. To authorize the Director of Development to make a payment of $21,093 from the general fund to the Capital Crossroads Special Improvement District (SID) to continue to enable employees who work in City buildings that are within the Capital Crossroads SID boundaries but do not pay SID assessments (Non-SID Assessment Employees) to participate in the Downtown C-Pass Program. \nSECTION 2. That for the purpose stated in Section 1, the expenditure of $21,093, is hereby authorized in Fund 1000 (General Fund), Subfund 100010, Dept Div 4550 (Office of the Finance Director), Object Class 03 (Services) per the accounting codes in the attachment to this ordinance.\nSECTION 3. That the contract authorizing these funds was awarded in accordance with the relevant provisions of City Code Chapter 329 relating to not-for-profit service contracts.\nSECTION 4.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 33,
    "meeting_date": "2021-12-13",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services",
      "Transportation"
    ]
  }
}