{
  "success": true,
  "vote": {
    "id": 2589,
    "item_number": "CA-72",
    "title": "To amend the 2021 Capital Improvement Budget; to authorize the Director of Finance and Management to establish a purchase order with The Larson Group for purchase of two diesel-powered non-CDL rear loading refuse trucks for the Division of Refuse Collection; to authorize the expenditure of up to $331,914.00 from the Refuse Bond Fund; and to declare an emergency.  ($331,914.00) (AMENDED BY ORD. 0020-2022; PASSED 1/10/2022)",
    "description": "Explanation\n1.  BACKGROUND\nThe purpose of this ordinance is to authorize the Director of Finance and Management to enter into a purchase order with The Larson Group., in order to purchase two diesel-powered Non-CDL Rear Loading Refuse trucks, for the Department of Public Service, Division of Refuse Collection.  This purchase will assist the Division with expediting refuse collection throughout the City. \n \nThe Purchasing Office advertised a competitive bid in accordance with Section 329.06 (RFQ019560) through Vendor Services.  The City received two bids that were received and opened on September 30, 2021, as follows:  \n \nCompany Name                                               Bid Amount                                 City/State                            Majority/MBE/FBE\nThe Larson Group                                              $165,957                              Columbus, OH                                  Majority                     \n                     \nColumbus Truck &                                           $165,500                              Columbus, OH                                            Majority\nEquipment Center LLC\n \nThe award is to be made to the Larson Group., as the responsible and best bidder for all lines of its bid of $165,957.00. Columbus Truck & Equipment Center, LLC was unresponsive in Section 3.3.3.4 requiring a 3-yard hopper; offeror indicated a hopper size of 2.7 yards.\n \nSearches in the System for Award Management (Federal) and the Findings for Recovery list (State) produced no findings against The Larson Group.\n \n2.  CONTRACT COMPLIANCE INFORMATION\nThe contract compliance number for The Larson Group is CC018406 and expires 09/07/2023.  \n \n3.  FISCAL IMPACT\nFunds for this purchase are available in the Refuse Bond Fund, Fund 7703.  It is necessary to amend the 2021 Capital Improvements Budget to align budget authority with the proper project.  The funds are appropriated.  \n \n4.  EMERGENCY DESIGNATION\nEmergency action is requested to expedite delivery of the Non-CDL Rear loading refuse trucks for immediate use.\n \nTitle\nTo amend the 2021 Capital Improvement Budget; to authorize the Director of Finance and Management to establish a purchase order with The Larson Group for purchase of two diesel-powered non-CDL rear loading refuse trucks for the Division of Refuse Collection; to authorize the expenditure of up to $331,914.00 from the Refuse Bond Fund; and to declare an emergency.  ($331,914.00) (AMENDED BY ORD. 0020-2022; PASSED 1/10/2022)\n \nBody\nWHEREAS, the Purchasing Office opened an informal bid on September 30, 2021, for two  non-CDL Rear Loading refuse trucks for the Division of Refuse Collection; and\n \nWHEREAS, the Division of Refuse Collection recommends an award to be made to the responsive, responsible, and best bidder, The Larson Group; and\n \nWHEREAS, a purchase order will be issued by the Department of Finance and Management in accordance with the terms, conditions and specifications of RFQ019560 on file in the Purchasing Office; and\n \nWHEREAS, it is necessary to amend the 2021 Capital Improvements Budget to align budget authority with the proper project; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service, Division of Refuse Collection, in that it is immediately necessary to authorize the Director of Finance and Management to establish a purchase order to purchase the equipment advertised on RFQ019560 to expedite delivery of the equipment for immediate use, thereby preserving the public health, peace, property, safety and welfare; now, therefore:\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     That the 2021 Capital Improvements Budget authorized by Ordinance 2707-2021 be amended as follows to establish sufficient authority for this project:\n \nFund / Project / Project Name / Current / Change / C.I.B. as Amended\n7703 / P520001-100000 / 59-02 Mechanized Collection Equipment (Voted Carryover) / $2,267,666.00 / ($331,914.00) / $1,935,752.00\n \n7703 / P520001-100024 / 59-02 Mechanized Collection Equipment-Non CDL Rear Loader (Voted Carryover) $0.00 / $331,914.00 / $331,914.00\n \nSECTION 2.  That the Director of Finance and Management be and is hereby authorized to establish a purchase order with The Larson Group for two Non-CDL Rear Loading refuse trucks, for the Division of Refuse Collection in accordance with specifications on file in the Purchasing Office.\n \nSECTION 3.  That the expenditure of $331,914.00, or so much thereof as may be needed, is hereby authorized in Fund 7703 (Refuse Bond Fund), Dept-Div 5902 (Refuse Collection), Project P520001-100024 (Mechanized Collection - Non-CDL Rear Loader 2021) in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 7.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 33,
    "meeting_date": "2021-12-13",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}