{
  "success": true,
  "vote": {
    "id": 2605,
    "item_number": "CA-88",
    "title": "To amend Ordinance Number 3134-2021 for a contract with Nationwide Children’s Hospital for virtual teen reproductive health education by authorizing payment of expenditures incurred since the contract termination date of June 30, 2021; and to declare an emergency. ($0.00)",
    "description": "Explanation\nThis ordinance is needed to amend Ordinance 3134-2021 which authorized the Executive Director of the Office of CelebrateOne to extend a contract with Nationwide Children’s Hospital for virtual teen reproductive health education.  This amendment is needed to authorize payment of expenditures incurred since the contract termination date of June 30, 2021. This program serves teens within selected Columbus City Schools in the CelebrateOne high priority neighborhoods. \n                                                                                  \nAdditional funding of $150,000.00 from Franklin County Department of Job and Family Services was modified with Ordinance 2080-2021, ACPO006872, which passed City Council on September 16, 2021. This contract has been modified from PO189569 with Ordinance 1637-2019, Ordinance 3142-2019 which passed Council December 9, 2019 and Ordinance 1745-2020 which passed on July 27, 2020.    \n \nEmergency action is requested for this amendment in order to ensure that the work with teens on reproductive health education is not interrupted. \n \nFISCAL IMPACT:  Funding of $150,000.00  is on ACPO006872 from Ordinance 2080-2021. \n \n \nTitle\n \nTo amend Ordinance Number 3134-2021 for a contract with Nationwide Children’s Hospital for virtual teen reproductive health education by authorizing payment of expenditures incurred since the contract termination date of June 30, 2021; and to declare an emergency. ($0.00)\n  \nBody\n \nWHEREAS, it is necessary to amend Ordinance No. 3134-2021 for the contract with Nationwide Children’s Hospital to continue their work with teen reproductive health education in the CelebrateOne neighborhoods; and,\n \nWHEREAS, it is necessary to authorize payment of expenditures incurred since the contract termination date of June 30, 2021 in order to complete the teen reproductive education training; and,\n \nWHEREAS, this ordinance is being submitted as an emergency measure so that timely services can proceed without interruption; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Office of CelebrateOne in that it is immediately necessary to modify by extending a contract term date and authorize payment of incurred expenditures for the immediate preservation of the public health, peace, property, safety and welfare;  Now, therefore,\n \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That Section 1 of Ordinance No. 3134-2021 is amended to read: That the Executive Director of the Office of CelebrateOne is hereby authorized to modify by extending and authorizing payment of expenses incurred since the contract termination date of June 30, 2021 as follows: \n                                                                      \nContract                                                                                       End Date\nNationwide Children’s Hospital               ACPO006872                12/31/2021\n \nSECTION 2. That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 33,
    "meeting_date": "2021-12-13",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}