{
  "success": true,
  "vote": {
    "id": 2652,
    "item_number": "SR-26",
    "title": "To create the Innovation District TIF encompassing undeveloped or to be redeveloped parcels on OSU’s west campus within the City; to declare improvements to those parcels to be a public purpose and exempt from real property taxation; to require the owners of those parcels to make service payments in lieu of taxes; to require the distribution of the applicable portion of those service payments to the Columbus City Schools; to establish a municipal public improvement tax increment equivalent fund for the deposit of the remainder of those non-school service payments; and to declare an emergency. (Amended by ord. 3290-2025 passed on 12/15/2025 -LG)",
    "description": "Explanation\nBackground: The Ohio State University (“OSU” or the “Developer”) is in the early stages of a major expansion of its west campus within the City between the CSX railroad to the east, North Star Road to the west, Lane Avenue to the north, and the southern boundary of the parcels running along the south side of Kinnear Road (the “Innovation District”). OSU intends to make or cause to be made $3 to $4 billion in capital investments within the Innovation District over a period of twenty to thirty years.  These improvements are currently expected to include 1,500 to 2,000 residential units; 100,000 to 200,000 square feet of retail; a 180 to 220-bed hotel; up to 500,000 square feet of medical facilities; and 4 to 6 million square feet of laboratory and commercial office space. Pursuant to Ordinance 2069-2021 passed by City Council on July 26, 2021, the City and OSU were authorized to enter into a memorandum of understanding to outline the City and OSU’s anticipated commitments. OSU expects up to 12,000 jobs will be created in the Innovation District with an estimated payroll of up to $950 million annually, that 20% of the residential units will be developed as workforce housing, that OSU will use good faith efforts to employ minority and women owned business enterprises for 30 % of the work, and will collaborate with Columbus State Community College and Columbus City Schools to grow STEAMM (Science, Technology, Engineering, Art, Mathematics and Medicine) talent in the City. Upon authorization of additional legislation to be submitted to City Council for consideration, the City intends to provide a new 40% Jobs Growth Incentive (JGI) for 25 years.\n \nThis Ordinance establishes a new non-school tax incrementing financing (“TIF”) area under Ohio Revised Code Section 5709.40(B) encompassing the Innovation District and the Franklin County tax ID parcels identified in Exhibit A attached hereto (the “Innovation District TIF”). The Innovation District TIF provides for a one-hundred percent (100%) exemption from real property taxation on improvements to the parcels within the Innovation District TIF for a period of not more than thirty (30) years. Columbus City Schools will receive, in the same manner as usual, all amounts that they would have received in real property taxes had the TIF tax exemption not been granted. Annual service payments in lieu of taxes will be made by the owners of each parcel with respect to the TIF exempted improvements (unless that parcel is subject to a superior public or charitable use exemption from real property taxes). The applicable portion of those service payments will be distributed directly to Columbus City Schools by the County. The remaining non-school portion of those service payments paid to the City for deposit into the appropriate TIF fund established in this Ordinance will be used to finance public infrastructure improvements identified in Exhibit B attached hereto and directly benefiting the Innovation District TIF parcels. The City will submit subsequent legislation to City Council for the appropriation and authorized expenditure of the non-school service payments for the public infrastructure improvements in accordance with an authorized TIF reimbursement agreement between the City and the Developer.\n \nEmergency Justification: Emergency legislation is required to allow for immediate effectiveness of this Ordinance, which is necessary in order to establish the TIF prior to the assessment of any new improvements to the TIF parcels at the end of the year in order to maximize revenue available for the public infrastructure improvements.\nFiscal Impact: No funding is required for this legislation. The City is foregoing real property tax revenue that it would have received from development on the TIF parcels. Instead, the non-school portion of that revenue will be diverted to the TIF fund.\n \nTitle\nTo create the Innovation District TIF encompassing undeveloped or to be redeveloped parcels on OSU’s west campus within the City; to declare improvements to those parcels to be a public purpose and exempt from real property taxation; to require the owners of those parcels to make service payments in lieu of taxes; to require the distribution of the applicable portion of those service payments to the Columbus City Schools; to establish a municipal public improvement tax increment equivalent fund for the deposit of the remainder of those non-school service payments; and to declare an emergency. (Amended by ord. 3290-2025 passed on 12/15/2025 -LG)\n \nBody\nWHEREAS, the City and The Ohio State University (“OSU” or the “Developer”) were authorized to enter into a Memorandum of Understanding (the “MOU”) as provided by City Council Ordinance 2069-2021 passed July 26, 2021, which concerned the development of real property within the City located on OSU’s west campus between the CSX railroad to the east, North Star Road to the west, Lane Avenue to the north, and the southern boundary of the parcels running along the south side of Kinnear Road, as depicted in Exhibit A attached hereto (the “Innovation District”); and\n \nWHEREAS, pursuant to the MOU, the Developer expects approximately three to four billion dollars ($3,000,000,000 - $4,000,000,000) to be invested in the Innovation District over a period of twenty to thirty years in order to develop real property and create an innovation program area within the Innovation District, which is currently expected to include 1,500 to 2,000 residential units; 100,000 to 200,000 square feet of retail; a 180 to 220-bed hotel; up to 500,000 square feet of medical facilities; and four to six million (4,000,000 - 6,000,000) square feet of laboratories and offices (the “Project”); and\n \nWHEREAS, in order to successfully develop the Project, certain public infrastructure improvements identified in Exhibit B attached hereto (collectively, the \"Public Infrastructure Improvements\" and each a \"Public Infrastructure Improvement\") will need to be constructed for the Innovation District; and\n \nWHEREAS, the Developer has agreed to provide front-end funding for the design of new public water and sewer utilities that will connect the City’s existing water and sewer infrastructure to the boundary of the Innovation District (the “Off-Site Improvements”) as well as the design and construction costs of any Public Infrastructure Improvements within the Innovation District (the “On-Site Improvements”) with those eligible costs of those Public Infrastructure Improvements to be reimbursed from tax increment financing over time pursuant to a reimbursement agreement submitted for City Council consideration under ensuing legislation; and\n \nWHEREAS, subject to appropriation by City Council, the City will provide initial funding to construct the Off-Site Improvements with that funding also to be reimbursed over time from tax increment financing pursuant to the reimbursement agreement; and\n \nWHEREAS, Ohio Revised Code (“ORC”) Sections 5709.40, 5709.42, and 5709.43 (collectively, the “TIF Statutes”) authorize this Council, by ordinance, to declare the improvement to parcels of real property located within the City to be a public purpose and exempt from taxation, require the owner of each parcel to make service payments in lieu of taxes, provide for the distribution of the applicable portion of such service payments to the school district in which those parcels are located and to the City, establish a municipal public improvement tax increment equivalent fund for the deposit of those non-school service payments, and specify the purposes for which money in that fund will be expended; and\n \nWHEREAS, to facilitate the desired development of the Innovation District and pay costs of the Public Infrastructure Improvements, this Council has determined that it is necessary and appropriate and in the best interest of the City to establish a tax increment financing area encompassing the Innovation District (the “Innovation District TIF”) to exempt from taxation one-hundred percent (100%) of the improvements to each parcel within the Innovation District TIF (collectively the “Parcels” and each a “Parcel”) as permitted and provided in ORC Section 5709.40(B) for up to a thirty (30) year coextensive period for all Parcels and to simultaneously direct and require the current and future owners of each Parcel (each individually an “Owner” and collectively the “Owners”) to make annual payments in lieu of taxes (the “Service Payments”), in the same amount as they would have made real property tax payments but for the exemptions provided by this Ordinance; and\nWHEREAS, the City has determined that the applicable portion of the Service Payments shall be paid directly to Columbus City Schools (the “School District”) in an amount equal to the real property taxes that the School District would have been paid if the improvement to each Parcel located within the School District had not been exempt from taxation pursuant to this Ordinance; and\n \nWHEREAS, pursuant to ORC Section 5709.43(A), this Council has determined to establish a municipal public improvement tax increment equivalent fund in which there shall be deposited the appropriate remaining non-school Service Payments distributed to the City as provided herein; and\n \nWHEREAS, notice of this proposed ordinance has been delivered to the Board of Education of the School District in accordance with and within the time periods prescribed in ORC Sections 5709.40 and 5709.83, respectively; and\n \nWHEREAS, an emergency exists in the daily operations of the Department of Development such that the Innovation District TIF must be immediately established before the end of the year prior to the assessment of any new Project improvements to the Parcels to maximize the revenue available for the Public Infrastructure Improvements all for the preservation of the public health, peace, property and safety; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSection 1.                     Parcels and Creation of TIF Area. The real property subject to this Ordinance is identified and depicted in Exhibit A (the “Parcels”, with each individual parcel, a “Parcel”). and pursuant to the TIF Statutes, this Council hereby creates a new tax increment financing area (the “Innovation District”), the boundaries of which shall be coextensive with the boundary of, and shall include, the Parcels.\n \nSection 2.                     Public Infrastructure Improvements. This Council hereby designates the public infrastructure improvements described in Exhibit B (the “Public Infrastructure Improvements”) and any other public infrastructure improvements hereafter designated by ordinance as public infrastructure improvements made, to be made, or in the process of being made that directly benefit, or that once made, will directly benefit the Parcels.\n \nSection 3.                     Exemption. Pursuant to Ohio Revised Code (“ORC”) Section 5709.40(B), this Council hereby finds and determines that one-hundred percent (100%) of the increase in assessed value of each Parcel subsequent to the effective date of this Ordinance (which increase in assessed value is hereinafter referred to as the “Improvement” as defined in ORC Section 5709.40(A)) is hereby declared to be a public purpose and exempt from taxation for a coextensive period for all Parcels, which commences for all Parcels with the tax year that begins on January 1, 2026 (for service payments to be first paid and collected in 2027) and ending on the earlier of:  (a) thirty (30) years after such commencement or (b) the date on which the City can no longer require service payments in lieu of taxes, all in accordance with the requirements of the TIF Statutes (the “TIF Exemption”). The TIF Exemption provided by this Ordinance is subordinate to any exemption for a Parcel pursuant to ORC Section 140.08 (public hospitals), Section 3345.12(M) (university purposed facilities or entrepreneurial projects), Section 3345.17 (state universities), Section 5709.07(A)(4) (public colleges and academies), Sections 5709.12 and 5709.121 (public or charitable purposes), Section 5709.08 (government and public property) and 5709.081 (public recreational facility) (collectively the “Authorized Superior Exemptions”). Accordingly, and in accordance with ORC Section 5709.911(B), by this duly enacted Ordinance, Council provides its duly authorized consent to any Authorized Superior Exemptions to the Parcels applied for after the TIF Exemption.\n \nSection 4.                     Service Payments. As provided in ORC Section 5709.42, the current and future owners of each Parcel (each individually an “Owner” and collectively the “Owners”) are hereby required to make service payments in lieu of taxes with respect to the Improvement allocable to each Parcel to the Franklin County Treasurer or its designee on or before the final dates for payment of real property taxes. The service payments in lieu of taxes will be charged and collected in the same manner and in the same amount as the real property taxes that would have been charged and collected against that Improvement if it were not exempt from taxation pursuant to this Ordinance, including any penalties and interest (collectively, the “Service Payments”). The Service Payments, and any other payments with respect to each Improvement that are received in connection with the reduction required by ORC Sections 319.302, 321.24, 323.152 and 323.156, as the same may be amended from time to time, or any successor provisions thereto as the same may be amended from time to time (the “Property Tax Rollback Payments”), will be deposited and distributed in accordance with this Ordinance.\n \nSection 5.                     TIF Fund. This Council establishes, pursuant to and in accordance with the provisions of ORC Section 5709.43, the Innovation District Municipal Public Improvement Tax Increment Equivalent Fund (the “TIF Fund”) into which the appropriate Service Payments and Property Tax Rollback Payments collected with respect to the Parcels and not required pursuant to this Ordinance to be distributed to Columbus City Schools (the “School District”) will be deposited. The TIF Fund will be maintained in the custody of the City. The City may use amounts deposited into the TIF Fund only for the purposes authorized in the TIF Statutes and this Ordinance (as it may be amended). The TIF Fund will remain in existence so long as the Service Payments and Property Tax Rollback Payments are collected and used for the aforesaid purposes, after which time the TIF Fund will be dissolved and any surplus funds remaining therein transferred to the City's General Fund, all in accordance with ORC Section 5709.43.\n                     \nSection 6.                     Distributions; Payment of Costs. Pursuant to the TIF Statutes, the County Treasurer is requested to distribute the Service Payments and Property Tax Rollback Payments as follows:\n \na.                     To the School District, an amount equal to the amount the School District would otherwise receive as real property tax payments (including the applicable portion of any Property Tax Rollback Payments) derived from the Improvement to each Parcel if the Improvement had not been exempt from taxation pursuant to this Ordinance.\n \nb.                     To the City, all remaining amounts for further deposit into the TIF Fund for payment of costs of the Public Infrastructure Improvements, including, without limitation, debt charges on any notes or bonds issued to pay or reimburse finance costs or costs of those Public Infrastructure Improvements.\n \nAll distributions required under this Section are to be made at the same time and in the same manner as real property tax distributions. \n \nSection 7.                     Further Authorizations. This Council hereby authorizes the Director of Development, the City Clerk or other appropriate officers of the City to deliver a copy of this Ordinance to the Ohio Development of Development and to make such arrangements as are necessary and proper for collection of the Service Payments. This Council further authorizes the Director of Development, the City Clerk, the City Attorney or other appropriate officers of the City to prepare and sign all agreements and instruments and to take any other actions as may be appropriate to implement this Ordinance.\n \nSection 8.       TIRC. The City’s Tax Incentive Review Council (TIRC) shall review annually all exemptions from taxation resulting from the declarations set forth in this Ordinance and any other matters as may properly come before the TIRC, all in accordance with Section 5709.85 of the Ohio Revised Code.\n \nSection 9.                     Effective Date. For the reasons stated in the Preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after the passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 1,
    "absent": 0,
    "meeting_id": 33,
    "meeting_date": "2021-12-13",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSTAIN"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Economic Development",
      "Emergency Services"
    ]
  }
}