{
  "success": true,
  "vote": {
    "id": 2663,
    "item_number": "SR-37",
    "title": "To amend various sections of Title 9 of the Columbus City Codes, including Chapters 912, 913, 919, and 921, in order to transfer authority for private boat dock permitting to the Department of Public Utilities (DPU); and to codify the management of the Land Stewardship Program DPU.",
    "description": "Explanation \n \nBackground: This code package includes modifications to various sections of the following Chapters of Title 9:  912, 913, 919, and 921. These modifications are necessary in order to transfer authority for private boat dock permitting to the Department of Public Utilities (DPU) and to authorize the Land Stewardship Program to be managed by DPU.  The Land Stewardship Program is currently authorized by a joint management agreement between CRPD and DPU.  The revisions to Title 9 are contingent upon the passage of Ordinance Number 2142-2021 authorizing the creation of Chapter 1117 of the Columbus City Codes.  The changes herein shall become effective on the same date as new Code Chapter 1117.\n \nCRPD and DPU worked together on a multi-year project to amend and improve the management of City of Columbus property located between private property and Griggs, Hoover, and O’Shaughnessy Reservoirs. The recommendation of the project team was to transfer private dock permitting to DPU in order to streamline both City of Columbus internal process and customer/public service.  Currently there is duplication of responsibility which creates inefficiencies in the management of this land and the process for a neighbor to obtain a recreational boat dock requires coordination with both departments.\n \nAlso, there was agreement from the project team to codify the management of the Land Stewardship Program by DPU.  This program is currently authorized by a joint management agreement.  Adding this to code will improve program transparency. The CRPD Commission voted for and approved these modification in March of 2021.\n \nBenefits to the Public: Customer service for those neighboring the Reservoirs will greatly improve.  Obtaining a private boat dock permit will only require coordination with one department.  CRPD worked closely with DPU to update the rules and regulations and will review and approve any changes to the program.\n \nCommunity Input/Issues: A major part of the multi-year project was community outreach through open houses, review of drafts, and public comment periods.\n \nArea(s) Affected: Griggs, Hoover, and O’Shaughnessy Reservoirs\n \nMaster Plan Relation:  Promoting blueways and permitting passive use of natural areas\n \nFiscal Impact: No cost to City of Columbus.  Possibility of revenue under $2,000 annually if properties obtain a dock permit.\n \nTitle\n \nTo amend various sections of Title 9 of the Columbus City Codes, including Chapters 912, 913, 919, and 921, in order to transfer authority for private boat dock permitting to the Department of Public Utilities (DPU); and to codify the management of the Land Stewardship Program DPU.\n \nBody\n \nWHEREAS, it is necessary to amend various sections of Title 9 of the Columbus City Codes, including Chapters 912, 913, 919, and 921 in order to transfer authority for private boat dock permitting from the Recreation and Parks Department to the Department of Public Utilities (DPU) and to codify the management of the Land Stewardship Program by DPU; and \n \nWHEREAS, all other dock, stake, and mooring standards will remain in effect and be applied to all contiguous property consistently; and\n \nWHEREAS, the revisions to these Sections are contingent upon the passage of Ordinance Number 2142-2021 authorizing the creation of Chapter 1117 of the Columbus City Codes and shall become effective on the same date Chapter1117 becomes effective; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Recreation and Parks Department to amend various sections of Title 9 of Columbus City Codes; NOW, THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That Section 912.02 of the Columbus City Codes is hereby amended to read as follows: \n \n912.02 - Management and protection.\nThe department shall have charge, custody and control of trees, shrubs and evergreens planted or to be planted in or on public streets, parks and public places. The department shall have authority to plant, prune, spray, remove and otherwise maintain such trees, shrubs and evergreens in the public streets and parks or upon property owned or controlled by the city of Columbus. Such authority shall exist as long as it does not interfere with the public travel, peace, health and safety. This section shall not apply to city-owned property eligible for coverage under a Land Stewardship License Agreement entered into between the Department of Public Utilities and a private property owner pursuant to Chapter 1117 of the Columbus City Codes.\n \nSECTION 2.  That Section 913.02 of the Columbus City Codes is hereby amended to read as follows:\n \n913.02   Miscellaneous contracts. \n(A)  The director of recreation and parks is authorized, with the approval of the recreation and parks commission, to enter into the following contracts on behalf of the city of Columbus:  lease of equipment, facilities and property, under control and supervision of the recreation and parks department, to the public for recreation and park purposes; lease of space, fixtures and equipment under the control and supervision of the recreation and parks department to concessionaires for the purpose of operating concessions; contract for various services to be performed on recreation and park facilities and property whereby the city of Columbus incurs no financial obligation, contract with seasonal athletic officials, athletic scorers, and attendants in conjunction with the operation of recreation and parks programs and facilities.  \n(B)  In order to carry out the purpose of Section 913.02, the recreation and parks commission and the director of recreation and parks shall be governed by the guidelines as set forth below: \n1.  The recreation and parks director, with the approval of the recreation and parks commission, will have the authority to sign various agreements which deal with the day-to-day operations of the department of recreation and parks. Such agreements shall include: \na.  Rental of boat docks and boat stakes in accordance with Sections 921.01-7 (Application for city-owned docks, stakes, and moorings) and 921.01-8 (Permitting of private docks, stakes, and moorings) of the Columbus City Codes and in accordance with fees and charges established by the recreation and parks commission. \nb. Rental of recreation facilities on an hourly, daily or seasonal basis in accordance with the board of education (where applicable) and in accordance with fees and charges established by the recreation and parks commission.\nc. Agreements for the operation of vending machines, telephones, and other utilities within recreation and park facilities where fees and charges will be reimbursed to the recreation and parks department through a fees and charges schedule as approved by the recreation and parks commission.\nd. Special permits for the use of parklands, showmobile, shelterhouses, swimming pools, or similar recreation and park facilities or properties where a fee is required (as established by the recreation and parks commission) or a deposit is required to insure proper utilization of facilities.\ne. Rental of city-owned golf carts on a daily basis or as established by contractual agreement with a golf cart leasing company with fees and charges established by the recreation and parks commission.\nf. Permits allowing for the rental of non-motorized boats including canoes, kayaks, stand up paddleboards, paddle boats and similar watercraft, establishment of arts and crafts class fees, establishment of fees for tennis lessons, league fees for sports programs, and related programs as established by fees and charges from the recreation and parks commission, contractual agreements, or cost of program materials.\ng. Rental of city-owned residences in accordance with rental rates established by appraised values and approved as a part of the city's master salary ordinance.\n2. The recreation and parks director, with the approval of the recreation and parks commission, will have the authority to execute various license agreements, not to exceed two (2) years in length, with individuals, groups, clubs or organizations for the utilization of recreation and parks facilities and/or property which does not involve the expenditure of city of Columbus funds. Such license agreements shall include:\na. License agreements for the use of recreation and park properties for activities commensurate with the development of recreation and park opportunities within Central Ohio such as:\n(1) Lease of space for model airplane use;\n(2) Lease of White Sulphur Quarry as a ski area;\n(3) Lease of properties to boat clubs.\nb. Lease of undeveloped properties until such land is required for future development.\n3. The recreation and parks director, with the approval of the recreation and parks commission, will have the authority to execute various concession agreements in conjunction with the day-to-day operation of various recreation and parks facilities and programs. In each case, the department of recreation and parks will advertise and seek competitive bids for the operation and privilege of these concessions however, if no bids are received, the director of recreation and parks, with the approval of the recreation and parks commission, has the option to negotiate an appropriate agreement for the privilege of operating a concession for a period not to exceed two (2) years. Such agreements shall include:\na. Gas and oil concessions, bait store concessions, and similar concessions relating to the operation and utilization of the reservoir areas.\nb. Concession privileges for the sale of food, drinks, etc. at various recreation and parks facilities as a part of the day-to-day operation.\nc. Specialized concession agreements that relate to the day-to-day operation of a recreation and park facility.\nd. The length of term and procedures for execution of concession agreements shall be as follows:\n(1) The contract term shall not exceed two (2) years.\n(2) Concession agreements in excess of two (2) years shall be submitted to city council as standard legislation after appropriate approval from the recreation and parks commission.\n(3) All agreements shall be approved as to form by the city attorney.\n4. The recreation and parks director, with the approval of the recreation and parks commission will have the authority to establish a schedule of special rates for contracting with seasonal athletic officials, athletic scorers, and attendants in conjunction with the operation of recreation and parks programs and facilities, and to contract with such officials, scorers, and attendants for such purpose.\na. All such contracts shall be in accordance with the schedule of special rates established, and\nb. Such contracts may be informal on a per-game, per-match, or per-hour-of-game-or-match basis and need not be individually executed in writing.\n5. The fee policy or fee schedule for all recreation and parks facilities and programs will be established by the recreation and parks commission.\n \nSECTION 3. That Section 919.03 of the Columbus City Codes is hereby amended as follows:\n \n919.03 - Applicability Purpose and Administration \n(A)  The director, acting through the commission, shall manage the natural, cultural, developed and undeveloped resources, as well as such wildlife resources in the parks, in the public interest, providing the public with safe and healthful recreational opportunities while also protecting, enhancing and where possible, expanding these resources. \n(B)  Administration Rules. The commission may promulgate such rules and regulations pursuant to its authority under the City Charter. \n(C)  Any violation of any section of this chapter shall constitute a separate violation for each calendar day in which it occurs.\n \nSECTION 4.                     That Section 919.09 of the Columbus City Codes is hereby amended as follows:\n \n919.09 - Destruction and alteration of property. \nNo person, without privilege to do so, shall recklessly do any of the following in any park: \n(A)  Cause or attempt to cause physical harm to any park facilities, structures, vegetation, trees, natural formations, mineral deposits, historical features or archeological features. \n(B)  Construct, create or attempt to create or erect any structures, trails, paths, roads, ball fields, or landscape features. \n(C)  Cut, mow, trim, gather, collect or take possession of any vegetation, flowers, trees or parts thereof. \n(D)  Alter or rearrange any natural habitat or terrain. \n(E)  No person shall purposely cause the removal or replacement of any shorebound or waterway habitats. \n(F)  No person shall enhance or create any waterway habitat without written permission from the director. \n(G)  No person shall plant or cultivate any seed or vegetation in any area administered by the department without a permit issued by the director.\n(H) This section shall not apply to city-owned property eligible for coverage under a Land Stewardship License Agreement entered into between the Department of Public Utilities and a private property owner pursuant to Chapter 1117 of the Columbus City Codes.\n(I) Strict liability is intended to be imposed for a violation of divisions (A), (B), (C), (D), (F), and (G) of this section.\n \n \nSECTION 5. That Section 919.14 of the Columbus City Codes is hereby amended as follows: \n \n919.14 - Fishing. \nNo person shall: \n(A)  Engage in fishing in violation of Ohio R.C. Chapter 1533. \n(B)  Bowfish except on Hoover Reservoir north of the second bridge upstream from the dam. \n(C)  Use nets, buckets, or methods other than pole fishing to harvest fish from ponds which are solely contained within park boundaries, except Antrim Lake.\n(D)                     Engage in fishing from publicly accessible, city owned docks or boat ramps, except those designated by the director.\n \nSECTION 6. That Section 921.01 of the Columbus City Codes is hereby amended as follows: \n \n921.01 - Definitions. \nAs used in this chapter:\n(1)  \"Canoe\" means a narrow vessel of shallow draft, pointed at both ends and propelled by human muscular effort, and includes kayaks, racing shells, and rowing sculls. \n(2)  \"City-controlled\" includes all city-owned land, including but not limited to leases, easements and other legal agreements and all waters within the territorial limits of the city of Columbus or bounded by city-owned lands. \n(3)  \"Coast Guard approved,\" means bearing an approval number assigned by the United States Coast Guard. \n (4)  \"Contiguous property\" shall mean lands owned by persons upstream from the dams which have a common boundary line with reservoir lands but not including abutting property separated from the reservoir by a right-of-way dedicated for public use. \n(54)  \"Director, auditor, treasurer\" shall mean the duly appointed officers of the city acting in their official capacity or through their deputies or employees legally authorized to act in their stead. \n(65)  \"Diver's flag\" means a red flag not less than one (1) foot square having a diagonal white stripe extending from the masthead to the opposite lower corner that when displayed indicates that divers are in the water. \n(76)  \"Dock\" means a structure or platform designed to provide access to or an area to secure watercraft. Boat docking facility means any facility supporting watercraft and designated by the director of recreation and parks, which excludes private permitted dock structures. \n(87)  \"Idle speed\" means the slowest possible speed needed to maintain steerage or maneuverability. \n (9)  \"Immediate family\" mean those family members residing within the same household. \n(10)  \"Income taxpayer\" means a taxpayer of the Columbus City Income Tax for the year preceding the issuance of any license, slip rental permit or private dock lease. \n(118)  \"Inflatable watercraft\" means any vessel constructed of rubber, canvas, or other material that is designed to be inflated with any gaseous substance, constructed with two (2) or more air cells, and operated as a vessel. Inflatable watercraft propelled by a motor shall be classified as powercraft and shall be registered by length. Inflatable watercraft propelled by a sail shall be classified as a sailboat and shall be registered by length. Excludes any contrivances that do not bear a Hull Identification Number (HIN) recognized by the United States Coast Guard. \n(129)  \"In operation\" in reference to a vessel means that the vessel is being navigated or otherwise used on the waterways of this city. \n(1310)  \"Law enforcement vessel\" means any vessel used in law enforcement and under the command of a law enforcement officer. \n(1411)  \"Muffler\" means an acoustical suppression device or system that is designed and installed to abate the sound of exhaust gases emitted from an internal combustion engine and that prevents excessive or unusual noise. \n(1512)  \"Navigable waters,\" means waters which come under the jurisdiction of the Department of the Army of the United States and any waterways within or adjacent to this state, except inland lakes having neither a navigable inlet nor outlet. \n(1613)  \"No wake\" has the same meaning as \"idle speed.\" \n(1714)  \"Operator\" includes any person who navigates or has under the person's control a vessel, or vessel and detachable motor, on the waters of this city. \n (18)  \"Ordinary high water mark\" means the line on the shore established by the fluctuations of water and indicated by physical characteristics such as clear, natural line impressed on the bank, shelving, changes in the soil, destruction of terrestrial vegetation, the presence of litter and debris, or other appropriate means that consider the characteristics of the surrounding areas. \n(1915)  \"Owner\" includes any person who claims lawful possession of a vessel by virtue of legal title or equitable interest therein that entitled the person to that possession. \n(2016)  \"Pedal boat,\" means any watercraft designed to be propelled by pedals only through human muscular effort. \n(2117)  \"Person\" includes any legal entity defined as a person in Section 1.59 of the Revised Code and any body politic, except the United States and this state, and includes any agent, trustee, executor, receiver, assignee, or other representative thereof. \n(2218)  \"Personal watercraft\" means a vessel, less than sixteen (16) feet in length, that is propelled by machinery and designed to be operated by an individual sitting, standing, or kneeling on the vessel rather than by an individual sitting or standing inside the vessel. \n(2319)  \"Powercraft\" means any vessel propelled by machinery, fuel, rockets, or similar device. \n(2420)  \"Reservoirs\" shall mean the O'Shaughnessy, Griggs and Hoover water supply storage reservoir, and all adjacent city lands, unless specifically designated otherwise, from the dams upstream to the further most upstream extent of city owned shores of the streams feeding into the reservoirs. \n (25)  \"Resident\" shall mean a bona fide resident or registered voter of the city. \n(2621)  \"Rowboat\" means any vessel, except a canoe, that is designed to be rowed and that is propelled by human muscular effort by oars or paddles and upon which no mechanical propulsion device, electric motor, internal combustion engine, or sail has been affixed or is used for the operation of the vessel. \n(2722)  \"Sailboat\" means any vessel, equipped with mast and sails, dependent upon the wind to propel it in the normal course of operation. \n(a)  Any sailboat equipped with an inboard engine is deemed a powercraft with auxiliary sail. \n(b)  Any sailboat equipped with detachable motor is deemed a sailboat with auxiliary power. \n(c)  Any sailboat being propelled by mechanical power, whether under sail or not, is deemed a powercraft and subject to all laws and rules governing powercraft operation. \n(2823)  \"Sewage\" means human body wastes and the wastes from toilets and other receptacles intended to receive or retain body waste. \n(2924)  \"South Side Scioto River Park\" means the area bounded downstream by the spillway at Greenlawn Avenue and upstream a distance of one and one quarter (1 1/4) statute miles. \n(3025)  \"Type one personal flotation device\" means a device that is designed to turn an unconscious person floating in water from a face downward position to a vertical or slightly face upward position and that has at least nine (9) kilograms, approximately twenty (20) pounds, of buoyancy. \n(3126)  \"Type two personal flotation device\" means a device that is designed to turn an unconscious person in the water from a face downward position to a vertical or slightly face upward position and that has at least seven (7) kilograms, approximately fifteen and four tenths (15.4) pounds, of buoyancy. \n(3227)  \"Type three personal flotation device\" means a device that is designed to keep a conscious person in a vertical or slightly face upward position and that has at least seven (7) kilograms, approximately fifteen and four tenths (15.4) pounds of buoyancy. \n(3328)  \"Type four personal flotation device,\" means a device that is designed to be thrown to a person in the water and not worn and has at least seven and five tenths (7.5) kilograms, approximately sixteen and five tenths (16.5) pounds, of buoyancy. \n(3429)  \"Type five personal flotation device\" means a device that, unlike other personal flotation devices, has limitations on its approval by the United States Coast Guard, including, without limitation, all of the following: \n(a)  The approval label on the type five personal flotation device indicates that the device is approved for the activity in which the vessel is being used or as a substitute for a personal flotation device of the type required on the vessel in use; \n(b)  The personal flotation device is used in accordance with any requirements on the approval label;\n (c)  The personal flotation device is used in accordance with the requirements in its owner's manual if the approval label refers to such a manual. \n(3530)  \"Vessel\" includes every description of watercraft, including non displacement craft and seaplanes, designed to be used as a means of transportation on water. Excludes any contrivances that do not bear a Hull Identification Number (HIN) recognized by the United States Coast Guard. \n(3631)  \"Visible\" means visible on a dark night with clear atmosphere. \n(3732)  \"Watercraft\" means any of the following when used or capable of being used for transportation on the water: \n(a)  A vessel operated by machinery either permanently or temporarily affixed; \n(b)  A sailboat other than a sailboard; Board type sailboats without rigidly affixed masts; commonly referred to as \"sailboards\" are not watercraft; excludes any contrivances that do not bear a Hull Identification Number (HIN) recognized by the United States Coast Guard. \n(c)  An inflatable, manually propelled boat that is required by federal law to have a hull identification number meeting the requirement of the United States Coast Guard; \n(d)  A canoe or rowboat. \n\"Watercraft\" does not include ferries as referred to in Chapter 4583 of the Revised Code. \n\"Watercraft\" excludes any contrivances that do not bear a Hull Identification Number (HIN) recognized by the United States Coast Guard. \nWatercraft subject to Section 1547.54 of the Revised Code shall be divided into five (5) classes as follows: \nClass A: Less than sixteen (16) feet in length; \nClass 1: At least sixteen (16) feet but less than twenty six (26) feet in length; \nClass 2: At least twenty six (26) feet but less than forty (40) feet in length; \nClass 3: At least forty (40) feet but less than sixty five (65) feet in length. \nClass 4: At least sixty five (65) feet in length. \n(3833)  \"Watercraft dealer\" means any person who is regularly engaged in the business of manufacturing, selling, displaying, offering for sale, or dealing in vessels at an established place of business. \"Watercraft dealer\" does not include a person who is a marine salvage dealer or any other person who dismantles, salvages, or rebuilds vessels using used parts. \n(3934)  \"Waters of the city\" shall mean all city administered water including, but not limited to reservoirs, reservoir lands, rivers, lakes, creeks, streams, ponds and water filled quarries. Unless otherwise provided, this chapter applies to all vessels operating on waters of this city. Nothing in this chapter shall be construed in contravention of any valid federal act or regulations, but is in addition to such act or regulation where not inconsistent. \n(4035)  \"Drug of abuse\" has the same meaning as in section 4506.01 of the Revised Code.\n \n \nSECTION 7. That Section 921.01-3 of the Columbus City Codes is hereby amended as follows:\n \n921.01-3 - Vessel and operations in Griggs Reservoir \n(A) Unless otherwise authorized in this chapter, no person shall operate in Griggs Reservoir any vessel of:\n(1) Less than eight (8) feet or more than twenty-two (22) feet.\n(2) Less than thirty-six (36) inches in beam or;\n(3) Less than fifty (50) pounds in weight.\n(B) Exceptions: Canoes, kayaks, rowing shells, pedal boats and inflatable watercraft bearing a Hull Identification Number (HIN) and recognized by the United States Coast Guard as vessels and watercraft are permitted and are specifically exempted from the length, beam and weight requirements provided;\n(1) Rowing shells are permitted during the months of May through September on weekdays from one (1) hour before sunrise until sunset and on weekends and holidays from one (1) hour before sunrise until 10:00 a.m. Rowing shells are permitted at all times during the months of October through April on all days of the week. Rowing shells will be operated parallel to the shoreline at a distance no greater than one hundred (100) feet except that north of the Hayden Run Bridge rowing shells will be operated no greater than fifty (50) feet of the shoreline, except for the safe operation around a navigational hazard. Rowing shells longer than forty-five (45) feet will not be permitted north of the Hayden Run Road Bridge. There will be four (4) crossing areas and rowing shells will utilize only those areas designated for crossing.\n(2) The crossing areas will be:\n(a) The no wake zone south of buoy number one (1).\n(b) Between the north side of the Fishinger Road Bridge and buoy number three (3).\n(c) At buoy number four (4) (\"Fisher's Wall\"). Rowing shells will not stop within the open zone when crossing.\n(d) Between buoy number five (5) and the south side of the Hayden Run Road Bridge.\n(3) The rowing shell course shall be:\n(a) Northbound shells leaving the west side boathouse shall immediately assume a course on the west side of the river to the Fishinger Road Bridge. Shells launching on the east side, shall cross to the west side in the no wake zone south of buoy number one (1) to begin the course and use the same route when returning.\n(b) Northbound on the east side of the river from the Fishinger Road Bridge to the Hayden Run Road Bridge.\n(c) Northbound on the west side of the river between Hayden Run Road Bridge and the Griggs Park northern boundary line approximately two hundred (200) feet south Rt. 161.\n(d) Southbound or returning shells shall hug the west bank all the way back to the boathouse.\n(4) Canoes, kayaks, pedal boats and inflatable watercraft shall operate parallel to the shoreline at a distance no greater than fifty (50) feet from the shoreline in all areas parallel and adjacent to an open zone except for the safe operation around a navigational hazard. There will be two (2) crossing areas and canoes, kayaks, pedal boats and inflatable watercraft will utilize only those areas designated for crossing.\n(a) The crossing areas will be:\n(1) Within one hundred (100) feet either side of the Fishinger Road Bridge.\n(2) Within one hundred (100) feet either side of the Hayden Run Road Bridge.\n(b) Canoes, kayaks, rowing shells, pedal boats and inflatable watercraft will not operate on the east side of the river between buoy number six (6) and buoy number seven (7).\n(C) Operations of sailboats and sailboards are prohibited.\n(D) The waterway from the safety cables north of the dam shall be open to boating at all times.\n(E) Motorized vessel operations, zones, and their speed limits shall be:\n(1) From the safety cables north of the dam to buoy number one (1), motorized vessels shall be operated at idle speed;\n(2) From buoy number one (1) to buoy number two (2), on the eastern half of the river, motorized vessels shall be operated at idle speed, and on the western half, motorized vessels shall be operated at a speed not to exceed forty (40) miles per hour;\n(3) The speed limit from buoy number two (2) north to buoy number three (3) is idle speed;\n(4) The speed limit from buoy number three (3) north to buoy number five (5) is forty (40) miles per hour.\n(5) The speed limit from buoy number five (5) north to buoy number six (6) is idle speed.\n(6) The speed limit from buoy number six (6) north to buoy number seven (7) shall be forty (40) miles per hour, except within the eastern two-thirds ( 2/3 ) of the waterways when skiing is being conducted, no motorized vessel, which is not actively engaged in towing water-skiers shall be operated at a speed exceeding idle speed;\n(7) The speed limit from buoy number seven (7) north to two hundred (200) feet south of Rt. 161 shall be idle speed.\n(F) Water-skiing will be permitted only between buoy number three (3) to buoy number five (5) and between buoy number six (6) to buoy number seven (7).\n(G) The eastern two-thirds (2/3) of the waterway, from buoy number six (6) to buoy number seven (7) is designated as a water sports practice and tournament zone, with a ski jump area on the eastern portion thereof as well as a slalom course.\n(H) No person shall operate any motorized vessel at a speed exceeding idle speed within a distance of one hundred (100) feet of the shorelines.\n \nSECTION 8. That Section 921.01-5 of the Columbus City Codes is hereby amended to read as follows: \n \n921.01-5 - Vessel and operations in O'Shaughnessy Reservoir. \n \n(A) Unless otherwise authorized by this chapter, no person shall operate in O'Shaughnessy Reservoir any vessel of:\n(1) Less than eight (8) feet or more than twenty-two (22) feet.\n(2) Less than thirty-six (36) inches in beam or;\n(3) Less than fifty (50) pounds in weight.\n(B) Exceptions:\nCanoes, kayaks, rowing shells, pedal boats and inflatable watercraft bearing a Hull Identification Number (HIN) and recognized by the United States Coast Guard as vessels and watercraft are permitted and are specifically exempted from the length, beam and weight requirements;\n(C) The above exempted vessels are permitted provided that:\n(1) Rowing shells are permitted during the months of May through September on weekends and holidays from one (1) hour before sunrise until 10:00 a.m. Rowing shells are permitted on all other days of the year from sunrise until sunset. Rowing shells will be operated parallel to the shoreline at a distance no greater than one hundred (100) feet except that between buoy number four (4) and buoy number five (5) rowing shells will be operated no greater than fifty (50) feet from the shoreline except for the safe operation around a navigational hazard. Rowing shells will utilize only those areas designated for crossing.\n(2) Crossing areas will be:\n(a) The No Wake areas.\n(b) Just south of buoy number four (4).\n(3) Canoes, kayaks, pedal boats and inflatable watercraft shall operate parallel to the shoreline at a distance not greater than fifty (50) feet from the shoreline in all areas parallel and adjacent to an open zone, except for the safe operation around navigational hazards.\n(4) Canoes, kayaks, rowing shells, pedal boats and inflatable watercraft will not operate on the east side of the river between buoy number four (4) and buoy number five (5) \"Tournament Water-ski Zone\".\n(5) Canoes, kayaks, pedal boats and inflatable watercraft may operate anywhere within the posted no wake zones.\n(6) The designated canoe, kayak, pedal boat and inflatable watercraft crossing shall be between buoy number two (2) and buoy number three (3).\n(D) Board type sailboats without rigidly affixed masts, referred to as \"sailboards\" are permitted in the area from the safety cable at the dam north to buoy number one (1).\n(E) The waterway north of the safety cable north of the dam shall be open to boating at all times.\n(F) Vessel operations, zones, and speed limits shall be:\n(1) From the safety cable north of the dam north to buoy number one (1) is a designated sailboat area and all sailboats shall stay south of buoy number one (1) on Saturdays, Sundays and holidays.\n(a) Exception: Sailboats launching or docked south of Home Road may sail in a path as direct as possible to and from the designated sailing area south of buoy number one (1).\n(2) The speed limit in the area known as Eversole Run and Twin Lakes shall be no wake, idle speed.\n(3) The speed limit between buoy number one (1) and buoy number two (2) shall be forty (40) miles per hour and is designated as an open zone;\n(4) The speed limit between buoy number two (2) and buoy number three (3) shall be no wake, idle speed;\n(5) The speed limit between buoy number three (3) and buoy number four (4) shall be forty (40) miles per hour and is designated as an open zone;\n(6) The speed limit between buoy number four (4) and buoy number five (5) shall be forty (40) miles per hour except within the eastern two-thirds ( 2/3 ) of the waterway when skiing is being conducted, no vessel, which is not actively engaged in towing water-skiers, shall be operated at a speed greater than no wake, idle speed;\n(7) The speed limit north of buoy number five (5) shall be no wake, idle speed.\n(E) Water-skiing will be permitted only between buoy number one (1) and buoy number two (2) and between buoy number three (3) and buoy number five (5).\n(F) The eastern two-thirds (2/3) of the waterway between buoy number four (4) and buoy number five (5) is designated as a water sports practice and tournament zone with a ski jump area on the eastern portion thereof as well as a slalom course.\n(G) No person shall operate any motorized vessel at a speed exceeding idle speed within a distance of one hundred (100) feet of the shoreline.\n \n \nSECTION 9. That Section 921.01-7 of the Columbus City Codes is hereby amended to read as follows:\n \n921.01-7 - Application for city-owned docks, stakes and moorings. \n(A)  Rentals of a city boat dock, public boat stake or mooring shall be issued on a permit prepared for that purpose and on file in the office of the director of recreation and parks. The permit shall not be transferred, assigned, loaned or subleased. \n(B)  An applicant for a city dock, stake or mooring permit must prove ownership of a vessel by presenting the current state of Ohio registration certificate or similar registration or copy thereof from the state in which the vessel is registered. No vessel other than the one designated on the permit shall be tied to the designated dock, stake or mooring: \n(1)  The director may consider applicants owning vessels with current registrations from states other than Ohio provided the applicant presents a curreant state of Ohio registration certificate within ten (10) working days, failure to do so shall result in the forfeiture of the fee and revoking of the permit. \n(2)  The director may consider an applicant for any vacant city-owned docks, stakes or mooring without a current registration, provided proof of purchase is presented in writing. Within forty-five (45) calendar days the applicant must prove ownership of a vessel by presenting the state of Ohio registration certificate or copy thereof for the vessel to be placed at the dock, stake or mooring. No vessel other than the one designated on the permit shall be tied to the assigned dock, stake or mooring. Failure to comply with this section shall result in the forfeiture of the fee and revoking of the permit. \n(3)  The director may consider corporate applicants or applicants using leased vessels for docks, stakes or moorings with proper proof of vessel and corporate ownership or proper proof of the lease agreement, current registration and ownership of the leased vessel. \n(C)  Permits for the rental of a city slip or private dock, city boat-stake or mooring permit shall be signed by the same person whose name appears on the registration certificate or by the power of attorney. \n(D)  Applicants seeking a temporary boat dock or stake will also be required to present an Ohio registration certificate or similar type of registration from the state in which the boat is registered. \n(1)  Provided space is available from May 1 through October 31 of each year, temporary docking may be available on the waterways for a period of not less than one (1) day and not more than fourteen (14) consecutive days. Temporary dock permits shall be obtained from the department of recreation and parks. Boaters utilizing the temporary dock system may not store their boat trailers on park property and/or waterways. \n(2)  Short-term courtesy docks and docking stakes may be provided at each of the waterways for boaters to utilize the recreational facilities for a period of time, not to exceed two (2) hours. Such docks and/or stakes shall be designated by the director of recreation and parks, and posted accordingly. \n(E)  The applicant shall agree to abide by all the laws, rules and regulations relative to his and/or his family's conduct, his or their use and operation of watercraft and outboard motors, use of all waterways of the city, adjacent lands, boat docks, boat stakes and moorings. Further, the applicant agrees to assume the defense of and to indemnify and save harmless the city from any and all claims, suits, loss or damage or injury to person(s) or property of any kind or nature whatsoever arising in the use or operation of any vessel, outboard motor, boat dock, boat stake or moorings. \n(F)  The director of recreation and parks shall not be required to approve any permits that are not in the best interest of the city of Columbus. Any misstatement of fact on any permit shall, at the discretion of the director of recreation and parks, constitute sufficient grounds for the rejection or cancellation of any license, or rental permit issued thereunder. The director of recreation and parks shall notify any person whose permit is rejected or cancelled in writing and the reason therefore shall be stated. \n(G)  Any violation of the terms or conditions of any license, or rental permits shall be reported by a law enforcement officer to the director of recreation and parks and may result in the temporary or permanent suspension or cancellation of such license, or rental permit by the director of recreation and parks. \n(H)  The recreation and parks commission shall establish rental fees for both permanent and temporary uses of city-owned boat slips; finger slip docks, boat stakes, and sailboat moorings on the waterways. \n(I)  All moneys received from the annual slip, stake and mooring rental as provided for in this section shall be placed in the operation and extension fund for the department of recreation and parks. \n(J)  With the exception of temporary docks, all city dock permits, must be renewed between the dates of January 1 and April 15 of each year. All dock permits provided for in this section shall begin on May 1 and expire on October 31 of the calendar year. \n(K)  All public stake permits must be renewed between the dates of January 1 and March 15, inclusive, of the calendar year. All stake permits provided for in this section shall begin on April 1 and expire on October 31 of the calendar year. \n(L)  Dock, stake or moorings will revert back to the city for reissue if the permit is cancelled or not renewed within the time specified elsewhere in this chapter. \n(M)  Installation of lockers of any description is prohibited on all city-owned boat slips on all waterways of the city. No person shall in any manner alter any city-owned boat slips or to attach materials of any nature to any city-owned boat slip on any waterways of the city without the expressed written permission of the director of recreation and parks. \n(N)  Location and installation of each stake shall be under the supervision of the director of recreation and parks. One (1) boat is permitted to one (1) stake, with the exception of pontoon or \"float\" boats, which shall require two (2) stakes. Stakes will be furnished and installed by the city of Columbus, in a number and location deemed advisable by the director. \n(O)  Areas that are designated as \"sailboat,\" \"pontoon\" or \"float boat\" areas will be used exclusively for these boats. \n(P)  Upon the payment of the appropriate fee, the director of recreation and parks will issue a boat, stake or sailboat mooring permit for a designated area at a specific waterway. \n(Q)  Any vessel found unattended in any waterways of the city between the dates of November 30 of each year to April 1 of the following year, will be considered abandoned by the owner and will be impounded subject to the provisions as set forth in this chapter regarding the abandonment of vessels. \n(R)  Any vessel found in any waterways of the city in violation of this section will be impounded and will be subject to the provisions as set forth in this chapter regarding the abandonment of vessels. \n \nSECTION 10.                     That Section 921.01-8 of the Columbus City Codes is hereby amended to read as follows:\n921.01-8 - Permitting of private docks and stakes and moorings. \n(A)  Permitting for a private boat dock, or boat stake or mooring shall be issued administered by the Department of Public Utilities in accordance with the Columbus City Codes Chapter 1117 and associated Rules and Regulations. on a permit prepared for that purpose and on file in the office of the director of recreation and parks. The permit shall not be transferred, assigned, loaned or subleased; \n(1)  As used in this section, private docks refer to, and shall include, docks, platforms or any other such structure which have been privately constructed and maintained by the applicant and which extend over or on the waterways of the city and shall include all such facilities whether extending from private lands, or lands controlled by the city. \n(2)  Each contiguous property owner, applicant, may be issued not more than one (1) permit per legal address which shall include one (1) vessel. Additional vessels registered to the same property owner may be considered and the recreation and parks commission establish such fees. The department shall determine the placement of such dock, stake or mooring and reserves the right of denial to any applicant wherein such conditions as natural or navigational hazards/barriers exist or there is a determination made that the issuance of such permit shall negatively impact upon a sensitive shoreline habitat. \n(B)  The applicant shall agree to abide by all the laws, rules and regulations relative to the applicant's and/or the applicant's family's conduct, his/her or their use and operation of any vessel, use of all waterways of the city, adjacent lands, boat docks, boat stakes and moorings. Furthermore, the applicant shall agree to assume the defense of and to indemnify and save harmless the city from any and all claims, suits, loss or damage or injury to person(s) or property of any kind or nature whatsoever arising in the use or operation of any vessel, boat dock or boat stake. \n(C)  The recreation and parks commission shall establish rental fees and late charges for private docks, stakes and moorings. All dock; stake and mooring permits must be renewed between the dates of January 1 and March 15 of each year. All dock; stake and mooring permits provided for in this section shall begin April 1 and expire on November 30 of the calendar year; \n(1)  If the waterways of the city have reached the maximum safe boating carrying capacity a grace period may be given until May 1, of that year which shall include a late fee. After May 1, the director may permit the first eligible applicant, whose name appears on the official waterways waiting list, an opportunity to apply for dock, stake or mooring privileges; \n(2)  If the waterways of the city have not reached the maximum safe boating carrying capacity by the recreation and parks commission, a late fee schedule shall apply. \n(D)  Any violation of the terms or conditions of any license, or rental permits shall be reported by a city official to the director of recreation and parks and may result in the temporary or permanent suspension or cancellation of such license, or rental permit by the director of recreation and parks. \n(E)  Any permit granted to individuals hereunder shall be for the sole benefit of the permittee and the permittee's immediate family, residing in the same household. A permit will only be issued for private docks, stakes and moorings to the person or persons whose name appears on the property deed of a contiguous private residence. An applicant for a private dock, stake or mooring permit must prove ownership of a vessel by presenting the current state of Ohio registration certificate or copy thereof for the vessel(s) to be moored in the dock, stake or mooring before the permit will be issued. No vessel(s) other than those designated on the permit shall be tied to the designated dock, stake or mooring. \n(1)  The director may issue a special permit to any private dock, stake or mooring applicant not owning a vessel. \n(2)  The director may approve temporary docking privileges for contiguous private permit holders, not to exceed thirty (30) days in a boating season. \n(3)  The director may consider applicants using leased vessels for docks, stakes or moorings with proper proof of the lease agreement, current registration and ownership of the leased vessel. \n(F)  Permits for the rental of a private dock, stake or mooring shall be signed by the same person whose name appears on the registration certificate or by power of attorney. Certificates of title for vessels moored in private docks, stakes or moorings shall bear the same name as named on the private dock, stake or mooring permit and shall be shown upon request unless exempted by 921.01-8 (E)(2). No vessel other than those designated on the permit shall be tied to the designated dock, stake or mooring. No area of waterfront for private docks, stakes or moorings shall be used for any commercial purposes or for rental or loan to others. Any violation of this section shall be cause for revocation of the permit. \n(G)  All vessels must be removed from private docks and stakes between the dates of November 30 of each year to April 1 of the following year. \n(H)  Any vessel found unattended in any waterways of the city between the dates of November 30 of each year to April 1 of the following year will be considered abandoned by the owner and will be impounded subject to the provisions as set forth in this chapter regarding the abandonment of vessels. \n(I)  Any vessel in any waterways of the city in violation of this section will be impounded subject to the provisions as set forth in this chapter regarding the abandonment of vessels. \n(J)  No boathouses or other structures shall be constructed on permitted ground. Private docks may be left in the water during the winter season, November 30 of each year until the following April 1, provided they were permitted the previous season. \n(K)  No private boat dock, stake or mooring permits shall be allowed on the west side of Griggs Reservoir south of the Fishinger Road Bridge. This does not apply to existing legally maintained boat club leases with the recreation and parks department. \n(L)  Application for new private docks, stakes and moorings along the shores of the waterways will be given consideration only for those areas that are contiguous to undeveloped city property provided: \n(1)  All applicants for private dock permits must own real property adjacent to undeveloped city controlled property. The applicant's property, at a minimum, must be contiguous and parallel to undeveloped city controlled property for one hundred (100) feet. All new applicants as of January 1, 2005 must own real property contiguous and parallel to undeveloped city property within two hundred and fifty (250) feet of the ordinary high water mark. Current property owners whose real property line are greater than two hundred and fifty (250) feet away from the ordinary high water mark and have a current valid private dock permit will be permitted to renew annually until such time as the property owner fails to renew the annual permit. \n(2)  All applicants for private stake permits must own real property adjacent to undeveloped city controlled property. The applicant's property, at a minimum, must be contiguous and parallel to undeveloped city controlled property for ten (10) feet. All new applicants as of January 1, 2005 must own real property contiguous and parallel to undeveloped city property within two hundred and fifty (250) feet of the ordinary high water mark. Current property owners whose real property line are greater than two hundred and fifty (250) feet away from the ordinary high water mark and have a current valid private stake permit will be permitted to renew annually until such time as the property owner fails to renew the annual permit. \n(3)  The waterways of the city does not exceed established safe boating carrying capacity based on formulas developed by the Ohio Department of Natural Resources, and established and adopted by the recreation and parks commission. If said waterway is at maximum Safe Boating Carrying Capacity, the applicant will be placed on such official waterways waiting list and may receive the first available opening. \n (M)  Application for renewal of private boat docks and stakes that are already installed and in use on the waterways of the city as of the effective date of this section shall not be required to meet the requirements of subsection (L)(1) and (L)(2). If permittee fails to renew the permit by the annual renewal date then said application will be considered as new and must meet the provisions of subsection (L). \n(N)  The permitted area may include a five (5) foot wide path extending from the applicant's property to the water's edge, as laid out and approved by the director of recreation and parks in accordance with rules adopted by the director of recreation and parks. \n(O)  Permittees may erect a floating dock subject to the permission of and in accordance with the standards of the United States Army Corps of Engineers and city of Columbus. Plans for proposed docks must be submitted to and approved by the director. \n(1)  The recreation and parks commission may adopt administrative rules for floating boat dock construction, maintenance and other privileges pertaining to the use of undeveloped city parkland. Violation of administrative rules shall result in the temporary or permanent revocation of docking privileges and/or impoundment of vessel(s) and removal of associated structures on parkland. \n(2)  The director must approve any alteration or improvements to existing permitted structure(s) in writing. \n(P)  Private boat docks and stakes without the proper permit are prohibited and will be considered abandoned by the owner and will be removed subject to provisions as set forth in this chapter and the administrative rules. \n(Q)  Placement or storage of any private property on reservoir parkland is prohibited without written approval from the director. \n(R)  By March 31, 2001, all applicants for new or renewal of permits for private docks, stakes and moorings along the shore of the waterways of the city must have an approved land stewardship agreement on file with the division of water prior to the issuance of said permit. A land stewardship agreement shall define agreed upon water supply reservoir watershed best management practices and landscape enhancements that abutting property owners may perform on city property. \n(S)  All private docks, ramps, improved walkways, improvements, utilities or any other private structures or property shall be removed by the person or person(s) originally granted permission to make the improvements, at their expense, if at any time that person or person(s) fails to renew the annual permit or transfers the adjacent private property to a new owner. These improvements may only be left in place if a new owner advises the city of Columbus, recreation and parks department, in writing that they accept full responsibility for the maintenance and removal (if necessary) of these improvements. This acceptance must be on an approved Columbus recreation and parks department form for this purpose and must be submitted within ninety (90) days of the transfer of the adjacent real property. Any and all encroachment issues must be fully resolved to the satisfaction of the city of Columbus before permission or permits may be granted for any dock, stake, mooring or additional improvements. \n(Ord. 805-05 § 1 (part)\nSECTION 11. That current Sections 912.02, 913.02, 919.03, 919.09, 919.14, 921.01, 921.01-3, 921.01-5, 921.01-7, 921.01-8 of the Columbus City Codes are hereby repealed.  \nSECTION 12.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 33,
    "meeting_date": "2021-12-13",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Infrastructure",
      "Planning & Development"
    ]
  }
}