{
  "success": true,
  "vote": {
    "id": 2680,
    "item_number": "CA-3",
    "title": "To authorize the director of the Department of Public Service to execute and acknowledge any document(s) necessary to grant Del-Co Water Inc. an easement on a portion of the City’s real property located on Olde Worthington Road; and to declare an emergency.  ($0.00)",
    "description": "Explanation\n1.                      BACKGROUND\nThe City owns real property located on Olde Worthington Road which is a part of Farm Lot 17, Section 4, Township 3, Range 18. The property was conveyed to the Department of Public Service (DPS) in April of 2000 in conjunction with the Polaris Parkway project, (530103-100051, PID 95549).  This Ordinance will allow for the City of Columbus to grant a 0.094 acre easement to Del-Co Water Inc. for the placement of a waterline within the existing Olde Worthington Road right-of-way.  Attached to this ordinance are the legal descriptions and exhibits associated with this easement.\n \nAs part of the Polaris Parkway project, a Del-Co Water Inc. waterline that was within an existing easement on private property needed to be relocated.  Through the design, it was determined that a new waterline needed to be installed in the Olde Worthington Road right-of-way.  DPS has reviewed the plans, studied the available options and determined granting an easement to Del-Co Water Inc., at no cost for the relocation of the existing waterline, is in the best interest of the City.  DPS supports granting Del-Co Water Inc. the Easement in consideration that the Easement is non-exclusive. \n \n2.                      FISCAL IMPACT \nThere is no fiscal impact to the City to grant the easement.\n \n3.                     EMERGENCY JUSTIFICATION\nEmergency action is requested in order to allow for the easement to cover the waterline installation in the City of Columbus right-of-way so Del-Co Water Inc. may relocate the water line in a timely manner allowing the Polaris Parkway project to be completed without unnecessary delay.\n \nTitle\nTo authorize the director of the Department of Public Service to execute and acknowledge any document(s) necessary to grant Del-Co Water Inc. an easement on a portion of the City’s real property located on Olde Worthington Road; and to declare an emergency.  ($0.00)\n \nBody\nWHEREAS, the City intends to grant Del-Co Water Inc. a non-exclusive waterline easement burdening a portion of the City’s property located on Olde Worthington Road in order to construct and maintain a waterline; and \n \nWHEREAS, the City intends to grant a 0.094 acre easement to Del-Co Water Inc. at no cost to the City; and \n \nWHEREAS, the City intends for the director of the Department of Public Service to execute and acknowledge any document(s) necessary to grant the easement to Del-Co Water Inc.; and \n \nWHEREAS, an emergency exists in the usual daily operations of the Department of Public Service in that it is immediately necessary to grant this easement in order to prevent unnecessary delay in completing the Polaris Parkway project, thereby preserving the public health, peace, property, safety and welfare; now therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS\n \nSECTION 1.                     That the director of the Department of Public Service be and is hereby authorized to execute and acknowledge those document(s) necessary to grant an easement to Del-Co Water Inc., and its successors, and assigns a waterline easement to burden a 0.094 acre, more or less, to a portion of the City’s real property located at on Olde Worthington Road as described and depicted in the attachments in order for Del-Co Water Inc. to construct and maintain a waterline and associated appurtenances for the distribution, delivery, and service of water. \n \nSECTION 2.                     That the City Attorney is required to pre-approve all document(s) executed by the City pursuant to this ordinance.  \n \nSECTION 3.                     That for the reasons stated in the preamble of this ordinance, which are fully incorporated into this ordinance as if rewritten, this ordinance is declared to be an emergency measure and shall take effect and be in force from and after its adoption and approval by the Mayor or ten (10) days after its adoption if the Mayor neither approves nor vetoes this ordinance.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 35,
    "meeting_date": "2022-01-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services",
      "Grants",
      "Infrastructure"
    ]
  }
}