{
  "success": true,
  "vote": {
    "id": 2692,
    "item_number": "CA-15",
    "title": "To authorize the Director of Recreation and Parks to modify an existing contract with R.W. Setterlin Building Company for the Tuttle Park Lower Field Improvements Project; to authorize the transfer of $91,000.00 within the Recreation and Parks Voted Bond Fund, to authorize the amendment of the 2021 Capital Improvements Budget; to authorize the expenditure of $122,114.00 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($122,114.00)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Director of the Recreation and Parks Department to modify an existing contract with R.W. Setterlin Building Company for professional engineering services for the Tuttle Park Lower Field Improvements Project. The contract modification amount being authorized by this ordinance is $105,000.00. An additional $17,114.00 is being authorized for interdepartmental inspections and fees for a total of $122,114.00 being authorized by this ordinance. This project is part of the Urban Infrastructure Recovery Fund (UIRF) Program.\n \nThe amenities and sport courts within the eastern portion of the lower fields of Tuttle Park were in need for rehabilitation and improvement. The construction project, as authorized by 0596-2021, started in April 2021 and the work was substantially complete by December 2021. This ordinance is requesting an additional $105,000.00 to modify the construction contract with R.W. Setterlin Building Company to provide additional amenities to park users that were not included in the original contract work. The improvements include resurfacing the tennis and futsal courts with a full depth repair instead of a crack seal repair. The modification will also allow for the resurfacing an additional 400 feet of asphalt trail, add a concrete pad to connect the east side of the tennis and futsal courts, and add landscaping around the new skatepark. Additional contingency is included to cover any unknowns that may arise as the skatepark is finalized, such as drainage and soil issues. These additional amenities/improvements were not included in the original scope of work and were added after construction had commenced. Additional UIRF funding was available to enhance the overall improvements in Tuttle Park’s lower field. R.W. Setterlin Building Company is already mobilized on site and has established unit prices to perform the additional work. The existing contract will provide the most economical and efficient outcome for the added scope.\n \nPrincipal Parties: \nR.W. Setterlin Building Company \n560 Harmon Ave, Columbus, Ohio, 43223\nMark Setterlin, (740) 417-9195, m.setterlin@setterlin.com \nContract Compliance Number, Tax ID: 004372, 31-0836188\nContract Compliance Expiration Date: November 3, 2022\n \nEmergency Justification: Emergency action is requested so that Recreation and Parks can keep the project on schedule and complete construction as soon as possible in 2022. \n \nBenefits to the Public: This project will update and expand recreational opportunities to residents near Tuttle Park and beyond. The project also expands ADA accessibility into the park by removing a staircase and replacing it with an ADA accessible ramp. Additionally, the improvements will provide additional amenities to the lower field to encourage residents to spend more time in the area. Additional amenities include lighting, water fountain, bottle fill station, bike racks, benches, picnic tables, and an open shelter. \n \nCommunity Input/Issues: The Tuttle Park Lower Field Improvements Project is an Urban Infrastructure Recovery Fund (UIRF) project and has been presented to the Tuttle Community Recreation Commission and University Area District communities. The design of the park improvements was driven through community input and direct requests by the neighborhood. This project has been accepted by the community members as important improvements to Tuttle Park.\n \nArea(s) Affected: University District (44), All trail users and nearby residents will benefit due to the connectivity of this project\n \nMaster Plan Relation: This project supports the department’s Master Plan by updating existing park infrastructure requested by the community. It also helps improve the health and wellness of the community by providing a safe and accessible place for all ages and skill levels to play. The new park improvements will create recreational opportunities for the neighborhood and increase awareness of the value of Tuttle Park by drawing in users from the greater community.\n \nFiscal Impact: The expenditure of $1,020,236.70 was legislated for the Tuttle Park Lower Field Improvements Project by Ordinance 0596-2021. This ordinance will provide funding that will modify the previously authorized amount by $122,114.00. $122,114.00 is budgeted and available from within the Recreation and Parks Voted Bond Fund 7702 to meet the financial obligations of this contract modification. The aggregate total amount authorized, including this modification, is $1,142,350.70.\n \nTitle\n \nTo authorize the Director of Recreation and Parks to modify an existing contract with R.W. Setterlin Building Company for the Tuttle Park Lower Field Improvements Project; to authorize the transfer of $91,000.00 within the Recreation and Parks Voted Bond Fund, to authorize the amendment of the 2021 Capital Improvements Budget; to authorize the expenditure of $122,114.00 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($122,114.00)\n \nBody\n \nWHEREAS, it is necessary to authorize the Director of the Recreation and Parks to modify an existing contract with R.W. Setterlin Building Company for the Tuttle Park Lower Field Improvements Project; and\n \nWHEREAS, it is necessary to authorize the transfer of $91,000.00 within the Recreation and Parks Voted Bond Fund 7702; and\n \nWHEREAS, it is necessary to authorize the amendment of the 2021 Capital Improvements Budget Ordinance 2707-2021 in order to provide sufficient budget authority for this and future projects; and\n \nWHEREAS, it is necessary to authorize the expenditure of $122,114.00 from the Recreation and Parks Voted Bond Fund 7702; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Recreation and Parks Department in that it is immediately necessary to authorize the Director to modify this contract so that Recreation and Parks can keep the project on schedule and complete construction as soon as possible in 2022, all for the preservation of the public health, peace, property, safety, and welfare and, NOW, THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Recreation and Parks be and is hereby authorized to modify an existing contract with R.W. Setterlin Building Company for the Tuttle Park Lower Field Improvements Project.\n \nSECTION 2. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 4. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 5. That the transfer of 91,000.00 or so much thereof as may be needed, is hereby authorized between projects within the Recreation and Parks Bond Fund 7702 per the account codes in the attachment to this ordinance.\n \nSECTION 6. That the 2021 Capital Improvements Budget Ordinance 2707-2021 is hereby amended as follows in order to provide sufficient budget authority for this ordinance and future projects.\nFund / Project / Project Name / Current / Change / Amended\n \nFund 7702; P516000-100000; Emergency Replacement - Misc. (Voted Carryover) / $853,200 / ($91,000) / $762,200\n \nFund 7702; P511030-100000; Tuttle Park Lower Field Improvements (Voted Carryover) / $0 / $91,000 / $91,000\n \nSECTION 7. That, for the purpose stated in Section 1, the expenditure of $122,114.00 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Recreation and Parks Voted Bond Fund 7702 in object class 06 Capital Outlay per the accounting codes in the attachments to this ordinance.  \nSECTION 8. That for the reasons stated in the preamble hereto, which is hereby made a part hereof,, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 35,
    "meeting_date": "2022-01-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}