{
  "success": true,
  "vote": {
    "id": 2712,
    "item_number": "CA-35",
    "title": "To authorize the Human Resources Director to expend $25,000, or so much thereof as may be necessary, from the Employee Benefits Fund for the Ohio AFSCME Care Plan; and to declare an emergency. ($25,000.00)",
    "description": "Explanation\nIn 2017, the City of Columbus negotiated Memorandum of Understanding #2017-02 between the Columbus Board of Health and the Ohio Council 8, AFSCME Local 2191, Ohio Council 8, AFSCME Local 1632 and CWA to provide funding for the Ohio AFSCME Care Plan. The MOU was re-signed during the last round of negotiations. This plan provides a hearing aid benefit for these employees.  Per this agreement, payments are to be made annually in June and December.  The payment is $3.00 per covered employee.  The city assumes no other role in this plan.  To maintain this program, funding is necessary to insure continuation of services for February 1, 2022 through January 31, 2023.\n \nFiscal Impact:  Funds are currently available and budgeted in the Employee Benefits Fund, medical subfund.  This ordinance allows payments to be made in June, 2022 and December, 2022 per the negotiated agreement. This ordinance is contingent on the passage of the 2022 insurance appropriation ordinance, ordinance 0014-2022.\n \nEmergency action is respectfully requested to allow payments to be made per the city’s contractual obligation and so financial transactions are posted in the City’s accounting system as soon as possible.  Up to date financial posting promotes accurate accounting and financial management.  \n \nTitle\nTo authorize the Human Resources Director to expend $25,000, or so much thereof as may be necessary, from the Employee Benefits Fund for the Ohio AFSCME Care Plan; and to declare an emergency. ($25,000.00)\n \nBody\nWHEREAS, funds for this expenditure for AFSCME and CWA employees are currently available and designated for this purpose in the Employee Benefits Trust Fund, medical subfund; and\n \nWHEREAS, this ordinance is submitted as an emergency to allow the financial transaction to be posted in the city's accounting system as soon as possible in order to promote accurate accounting and financial management; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Human Resources Department in that it is immediately necessary to authorize the Director to expend funds to ensure continuity of service  for the hearing aid program for qualified AFSCME and CWA city employees, thereby preserving the public peace, health, safety and welfare; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the expenditure of $25,000, or so much thereof as may be necessary, for AFSCME Cares is hereby authorized to be expended as follows:  \n \nDepartment: 4602 | Fund: 5502 | Subfund: 550206 | Program: RM007 | Amount: $25,000 (Ohio AFSCME Care Plan)\n \nSECTION 2.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 3.                     That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage, if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 35,
    "meeting_date": "2022-01-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services"
    ]
  }
}