{
  "success": true,
  "vote": {
    "id": 2788,
    "item_number": "CA-22",
    "title": "To authorize the Director of Recreation and Parks to modify an existing contract with Midstates Recreation for the 2021 CDBG Playground Improvements - Phase 2 Project; to authorize the appropriation of $180,000.00 within the CDBG Fund in accordance with the 2021 Amended Annual Action Plan; to authorize the expenditure of $230,000.00 from the CDBG Fund 2248 and Recreation and Parks Special Purpose Fund 2223; and to declare an emergency. ($230,000.00)",
    "description": "Explanation\n \nBackground: This ordinance is to authorize the Director of the Recreation and Parks Department to modify an existing contract with Midstates Recreation for the 2021 CDBG Playground Improvements - Phase 2 Project. The modification amount being authorized is $230,000.00, making a new aggregate total of $790,400.00 for this project. The funding for the original contract and $180,000.00 of this modification was provided by the Community Development Block Grant (CDBG) in accordance with the 2021 Amended Annual Action Plan. $50,000.00 of this contract modification is being supported by private donations. \n \nThe 2021 CDBG Playground Improvements - Phase 2 Project includes the construction of two playgrounds at Livingston Park and Smith Road Park. The Smith Road Park playground has been completed and the proposed scope of work at Livingston Park is expanding to include the installation of a shade structure. Livingston Park playground is a universally accessible playground with rubberized safety surfacing and it is situated such that there is limited natural shade from the tree canopy in the park. Due to the park’s proximity to Nationwide Children’s Hospital, many of the playground users can be adversely affected by such exposure to the sun. The proposed shade structure would provide shade to all pieces of the play equipment and several seating areas, creating a comfortable and safe play environment for all members of the community at this highly used playground. The construction project started in September 2021 with work being substantially complete by November 2021.   \n \nThe requested $230,000.00 to modify the construction contract with Midstates Recreation is to provide additional play equipment and a shade structure for park users at Livingston Park that were not included in the original scope of work. Additional contingency is included to cover any unknowns that may arise as the playground is finalized, such as relocating underground utilities and additional site restoration. The installation of the shade structure at Livingston Park was not included in the original scope of work and was added after construction had commenced. Private donor funds expanded the scope to include additional equipment and additional CDBG funding was available to enhance the overall improvements at Livingston Park. Midstates Recreation has provided a schedule for the additional scope, is prepared to remobilize to the site, and has established pricing to perform the additional work. The existing contract will provide the most economical and efficient outcome for the added scope.\n \nPrincipal Parties: \nMidstates Recreation\n1279 Hazelton Etna Road SW, Pataskala, Ohio 43062\nBlake Hobson (614) 855-3790                                                 \nContract Compliance Number, Tax ID: 000552, 11-3732875\nContract Compliance Expiration Date: July 7, 2023\n \nEmergency Justification: Emergency action is requested to ensure the construction schedule for the project stays on schedule and is substantially complete by April 2022. \n \nBenefits to the Public: The project will provide additional play equipment and shade to the otherwise unshaded playground nearby Nationwide Children’s Hospital, where many of the users are highly susceptible to sun exposure. The project expands the playground’s ability to offer opportunities for play for residents and visitors with variable abilities and conditions. \n \nCommunity Input/Issues: There have been community requests, directly from residents, to provide more up to date equipment that allow for more physical development and socialization. Playground improvements have also been discussed at Area Commission meetings. The Livingston Park playground will be a universally accessible playground to provide more inclusive play.  \n \nArea(s) Affected: Livingston Avenue Area (62), South Side (63)\n \nMaster Plan Relation: This project supports the Recreation and Parks Departments’ Master Plan by updating existing park infrastructure requested by the community and providing one of the top needs of the community, which are improvements to neighborhood parks that provide opportunities for fitness and wellness. The new park improvements will create recreational opportunities for the neighborhood and increase awareness of the value of Livingston Park by drawing in users from the greater community. \n \nFiscal Impact: The expenditure of $560,400.00 was legislated for the 2021 CDBG Playground Improvements - Phase 2 Project by Ordinance 1951-2021. This ordinance will provide funding that will modify the previously authorized amount by $230,000.00. $230,000.00 is budgeted and available from within the CDBG Fund 2248 and Recreation and Parks Special Purpose Fund 2223 to meet the financial obligations of this contract modification. The aggregate total amount authorized, including this modification, is $790,400.00.\n \nTitle\n \nTo authorize the Director of Recreation and Parks to modify an existing contract with Midstates Recreation for the 2021 CDBG Playground Improvements - Phase 2 Project; to authorize the appropriation of $180,000.00 within the CDBG Fund in accordance with the 2021 Amended Annual Action Plan; to authorize the expenditure of $230,000.00 from the CDBG Fund 2248 and Recreation and Parks Special Purpose Fund 2223; and to declare an emergency. ($230,000.00)\n \nBody\n \nWHEREAS, it is necessary to authorize the Director of the Recreation and Parks to modify an existing contract with Midstates Recreation for the 2021 CDBG Playground Improvements - Phase 2 Project; and\n \nWHEREAS, it is necessary to authorize the appropriation of $180,000.00 within the CDBG Fund 2248 and in accordance with the 2021 Amended Annual Action Plan; and\n \nWHEREAS, it is necessary to authorize the expenditure of $230,000.00 from the CDBG Fund 2248 and Recreation and Parks Special Purpose Fund 2223; and \n \nWHEREAS, an emergency exists in the usual daily operation of the Recreation and Parks Department in that it is immediately necessary to authorize the Director to modify this contract to ensure the construction schedule for the project stays on schedule and is substantially complete by April 2022, adding to the preservation of public health, peace, property, safety, and welfare and, NOW, THEREFORE \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Recreation and Parks be and is hereby authorized to modify an existing contract with Midstates Recreation for the 2021 CDBG Playground Improvements - Phase 2 Project.\n \nSECTION 2. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 4. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 5. That the appropriation of $180,000.00 is authorized within the CDBG Fund 2248 per the accounting codes in the attachment to this ordinance and in accordance with the 2021 Amended Annual Action Plan.  \n \nSECTION 6. For the purpose stated in Section 1, the expenditure of $230,000.00 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the CDBG Fund 2248 and Recreation and Parks Special Purpose Fund 2223 Subfund 222302 in object class 06 Capital Outlay per the accounting codes in the attachments to this ordinance. \nSECTION 7. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 36,
    "meeting_date": "2022-01-31",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}