{
  "success": true,
  "vote": {
    "id": 2792,
    "item_number": "CA-26",
    "title": "To authorize the Director of Public Utilities to modify and increase the professional engineering services agreement with ms consultants, inc. for the Watershed Miscellaneous Improvements - Hoover Dam Part 1 Project; for the Division of Water; to authorize a transfer and expenditure up to $491,200.00 within the Water General Obligations Bond Fund; and to authorize an amendment to the 2019 Capital Improvements Budget.  ($491,200.00)",
    "description": "Explanation\n \n1. BACKGROUND:  This Ordinance authorizes the Director of Public Utilities to modify and increase the professional engineering services agreement with ms consultants, inc. for the Watershed Miscellaneous Improvements - Hoover Dam Part 1 Project, Capital Improvements Project No. 690411-100013, Division of Water Contract No. 2152.\n \nThe project is being executed in four phases: preliminary design (completed), detailed design (completed), and two modifications (1st modification completed) for engineering services during construction (SDC).  \n \nThe preliminary design phase (the initial contract) evaluated the condition of dam infrastructure and ancillary equipment and developed recommendations for improvements to address operational/maintenance/security needs. \n \nThe detailed design (Contract Renewal 1) developed design documents for the construction of proposed improvements that will serve all intentions of the planned operation, provide security, resiliency, flexibility and ease of operation with reasonable maintenance requirements, and extend the life of this critical asset. \n \nThe initial phase of Engineering Services During Construction (Contract Renewal 2) addressed major elements of the SDC work through the commissioning of the Hoover Dam East Water Supply Train. This scope included technical project representation (TPR) duties, construction phase engineering, shop drawing review, responding to RFIs, developing RFP's, start-up and commissioning assistance, training, and record documentation.\n \n*Project changed from Renewals to Modifications with this legislation.\n \nThis legislation (Modification #3) is a planned modification to continue Engineering Services During Construction.  Major elements of the SDC work includes technical project representation (TPR) duties, construction phase engineering, shop drawing review, responding to RFIs, developing RFPS, start-up and commissioning assistance, training, and record documentation for the remaining construction activities.\n \nConstruction Administration / Construction Inspection (CA/CI) services will be performed by others. \n \nThe Community Planning Area for the HCWP is “99 - Citywide” since it provides service to several communities.\n \n1.1 Amount of additional funds to be expended:  $491,200.00\nOriginal Contract Amount:                     $   418,000.00                     (PO042055)\nRenewal No. 1:                     $1,487,600.00                     (PO144141)\nRenewal No. 2:                     $1,299,900.00                     (PO229745)\nModification No. 3 (current):                     $   491,200.00\nTotal (Orig. + Rens/Mod)                     $3,696,700.00\n \n1.2. Reasons additional goods/services could not be foreseen:   \nThis modification was anticipated and explained in the original legislation under Ordinance No. 2094-2014.\n \n1.2. Reason other procurement processes are not used:  \nThe current consultant is familiar with the project and has completed all preliminary and detailed design work to date.  Bidding the work to another consultant will delay the project and will result in higher costs due to bringing a new consultant up to speed on the project and potentially increase the risk of not meeting anticipated future water quality regulation deadlines.\n \n1.3. How cost of renewal was determined:\nThe Consultant prepared an estimate based on the scope of work for the services during construction during the contracted duration.  City Project Manager and associated staff reviewed and approved these cost summaries. \n \n2. ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT:  This project will address improvement needs for operational components and equipment associated with Hoover Dam. The Hoover Dam provides water for the City of Columbus Hap Cremean Water Plant, which serves more than 500,000 customers. Management of the City’s reservoirs and dams is crucial for reliability of the water supply, long-term water supply planning, and economic development of the central Ohio area. There will be no public meetings held regarding this study. Hoover Dam is critical infrastructure and the project will be managed accordingly. The Division of Water will be responsible for coordinating with stakeholders.\n \n3. CONTRACT COMPLIANCE INFO:  34-6546916, expires 1/28/22, Majority, DAX No. 6998.\n \nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against ms consultants, inc.\n \n4. FISCAL IMPACT: A transfer of funds within the Water G.O. Bonds Fund - Fund No. 6006 will be necessary as well as an amendment to the 2021 Capital Improvements Budget.\n \n \nTitle\n \nTo authorize the Director of Public Utilities to modify and increase the professional engineering services agreement with ms consultants, inc. for the Watershed Miscellaneous Improvements - Hoover Dam Part 1 Project; for the Division of Water; to authorize a transfer and expenditure up to $491,200.00 within the Water General Obligations Bond Fund; and to authorize an amendment to the 2019 Capital Improvements Budget.  ($491,200.00)\n \n \nBody\n \nWHEREAS, Contract No. PO042055 was authorized by Ordinance No. 2611-2016, passed November 21, 2016, was executed on December 21, 2016, and approved by the City Attorney on January 9, 2017, for the Watershed Miscellaneous Improvements - Hoover Dam Part 1 Project; and\n \nWHEREAS, Contract Renewal No. 1 under PO144141 was authorized by Ordinance No. 2448-2018 passed October 1, 2018, was executed on November 2, 2018, and was approved by the City Attorney on November 5, 2018; and\n \nWHEREAS, Contract Renewal No. 2 under PO299745 was authorized by Ordinance No. 0963-2020 passed May 18, 2020, was executed on June 19, 2020, and was approved by the City Attorney on June 22, 2020; and\n \n(*Project changed from Renewals to Modifications with this legislation.)\n \nWHEREAS, Contract Modification No. 3 (current) is needed to provide Engineering Services During Construction through final construction; and\n \nWHEREAS, it is necessary to authorize a transfer and expenditure of funds within the Water G.O. Bonds Fund - Fund No. 6006, for the Division of Water; and  \n \nWHEREAS, it is necessary to authorize an amendment to the 2021 Capital Improvements Budget for purposes of providing sufficient funding and expenditure authority for the aforementioned project expenditure; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities, Division of Water, to authorize the Director of Public Utilities to modify and increase the professional engineering services agreement with ms consultants, inc., for the Watershed Miscellaneous Improvements - Hoover Dam Part 1 Project, for the preservation of the public health, peace, property, safety and welfare; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Utilities is hereby authorized and directed to modify and increase the professional engineering services agreement with ms consultants, inc. (FID# 34-6546916); 2221 Shrock Road, Columbus, OH 43229; for the Watershed Miscellaneous Improvements - Hoover Dam Part 1 Project, in an amount up to $491,200.00.\n \nSECTION 2.  That this modification is in compliance with Chapter 329 of Columbus City Codes.\n \nSECTION 3. That the transfer of $491,200.00 or so much thereof as may be needed, is hereby authorized between projects within Fund 6006 - Water G.O. Bonds Fund, per the account codes in the attachment to this ordinance.  \n \nSECTION 4.  That the 2021 Capital Improvements Budget is hereby amended per the account codes in the attachment to this ordinance.  \n \nSECTION 5. That the expenditure of $491,200.00 or so much thereof as may be needed, is hereby authorized in Fund 6006 - Water G.O. Bonds Fund, in Object Class 06 - Capital Outlay, per the accounting codes in the attachment to this ordinance.\n \nSECTION 6.  That the funds necessary to carry out the purpose of this Ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 7.  That the City Auditor is hereby authorized and directed to transfer any unencumbered balance in the project account to the unallocated balance within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies no longer required for said project; except that no transfer shall be made from a project account by monies from more than one source.\n \nSECTION 8.  That the City Auditor is authorized to establish proper project accounting numbers as appropriate.\n \nSECTION 9.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this Ordinance.\n \nSECTION 10.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 36,
    "meeting_date": "2022-01-31",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}