{
  "success": true,
  "vote": {
    "id": 2849,
    "item_number": "CA-9",
    "title": "To amend the 2021 Capital Improvement Budget; to authorize the Director of Public Service to make payment to the Ohio Department of Transportation relative to the Resurfacing - Urban Paving - SR 315 project; to authorize the expenditure of $246,728.82 from the Streets and Highways Bond Fund for the expenditure; and to declare an emergency.  ($246,728.82)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Service to make final payment to the Ohio Department of Transportation (ODOT) relative to the FRA-315-0.49 project, PID 76420, City of Columbus project Resurfacing - Urban Paving - SR 315.\n \nThe aforementioned project encompassed resurfacing SR-315 from Sullivant Avenue to the pavement break where the I-670 ramp joins SR-315, which is approximately ¾ mile south of the King Avenue exit, and resurfacing SR-315C (Goodale Street) from the I-670 off ramp to Goodale Street, the Michigan Avenue Connector, along the Goodale/Nationwide connector over SR-315, north on Olentangy River Road, to the SR-315 southbound on ramp. \n \nOrdinance 2823-2014 authorized the Director of Public Service to grant consent and propose cooperation with ODOT relative to that effort. Ordinance 2951-2017 authorized the Director of Public Service to enter into agreement with and to provide funding to ODOT in the amount of up to $220,000.00 to pay the local share of estimated construction and inspection costs. \n \nODOT first let the project on December 14, 2017, at which time the apparent low bid exceeded the original cost estimate, increasing the proportional share of construction and inspection costs to be borne by the City. Ordinance 0023-2018 authorized the encumbrance and expenditure of additional funding in the amount of $35,472.00 for that purpose.   \n \nODOT subsequently elected to reject all earlier bids and to re-advertise the project the following spring. Again, the apparent low bid received by ODOT on May 3, 2018, was significantly higher than anticipated, owing in part to changes in the items to be funded by ODOT. Ordinance 1435-2018 authorized the encumbrance and expenditure of additional funding in the amount of $193,092.00 for that purpose.\n \nWork on the project concluded on June 30, 2019, and through final accounting, ODOT determined the Department of Public Service owes the additional sum of $246,728.82, which represents its proportional share of cost overruns. This ordinance seeks to authorize the encumbrance and expenditure of the aforementioned sum to satisfy that obligation.  \n \n2.  FISCAL IMPACT\nFunding in the amount of $246,728.82 is available in the Streets and Highways Bond Fund, Fund 7704, within the Department of Public Service to support this project expenditure. An amendment to the 2021 Capital Improvement Budget is necessary for the purpose of providing sufficient spending authority for the aforementioned expenditure.  The funds are appropriated.\n \n3.  EMERGENCY DESIGNATION\nEmergency action is requested to satisfy the outstanding obligation owed to ODOT as soon as reasonably practicable.  \n \nTitle\nTo amend the 2021 Capital Improvement Budget; to authorize the Director of Public Service to make payment to the Ohio Department of Transportation relative to the Resurfacing - Urban Paving - SR 315 project; to authorize the expenditure of $246,728.82 from the Streets and Highways Bond Fund for the expenditure; and to declare an emergency.  ($246,728.82) \n \nBody\nWHEREAS, the Ohio Department of Transportation (ODOT) administered the FRA-315-0.49 project, PID 76420, which encompassed resurfacing various portions of SR-315 and SR-315C (Goodale Street) in the vicinity of I-670; and \n \nWHEREAS, this improvement project was located within the City of Columbus corporate boundaries; and \n \nWHEREAS, Ordinance 2823-2014 authorized the Director of Public Service to grant consent and propose cooperation with ODOT for this project; and\n \nWHEREAS, Ordinance 2951-2017 authorized the Director of Public Service to enter into agreement with and provide funding in the amount of $220,000.00 to ODOT to support the completion of the aforementioned improvements; and \n \nWHEREAS, ODOT received construction bids on December 14, 2017, at which time the apparent low bid exceeded the original cost estimate for those services, increasing the proportional share of construction and inspection costs to be borne by the City; and \n \nWHEREAS, Ordinance 0023-2018 authorized the Director of Public Service to provide additional funding in the amount of $35,472.00 to ODOT for that purpose; and \n \nWHEREAS, ODOT subsequently elected to reject all earlier bids and to re-advertise the project in the spring of 2018, at which time the apparent low bid exceeded the revised cost estimate for those services, increasing the proportional share of construction and inspection costs to be borne by the City; and \n \nWHEREAS, Ordinance 1435-2018 authorized the Director of Public Service to provide additional funding in the amount of $193,092.00 to ODOT for that purpose; and\n \nWHEREAS, construction of the project concluded on June 30, 2019; and \n \nWHEREAS, ODOT subsequently performed final accounting and determined that the Department of Public Service owes the additional sum of $246,728.82, which represents its proportional share of cost overruns; and \n \nWHEREAS, this ordinance seeks to authorize the Director of Public Service to make a final payment to ODOT relative to the FRA-315-0.49 project, PID 76420; and \n \nWHEREAS, it is necessary to authorize an amendment to the 2021 Capital Improvement Budget for the purpose of providing sufficient budget authority for the aforementioned project expenditure; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to authorize the Director to make the final payment to satisfy the outstanding obligation owed to ODOT as soon as reasonably practicable, thereby preserving the public health, peace, property, safety and welfare; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2021 Capital Improvement Budget authorized by Ordinance 2707-2021 be and is hereby amended to provide sufficient budget authority for the appropriate project authorized within this ordinance as follows:\n \nFund / Project / Project Name / Current / Change / Amended\n7704 / P530282-932018 / Resurfacing - 2018 Project 3 (Voted Carryover) / $963,433.00 / ($246,729.00) / $716,704.00\n7704 / P530282-100105 / Resurfacing - Urban Paving - SR 315 (PID 76420) (Voted Carryover) / $0.00 / $246,729.00 / $246,729.00\n \nSECTION 2.  That the Director of Public Service be and hereby is authorized to make payment to the Ohio Department of Transportation (ODOT) to satisfy the outstanding obligation owed to ODOT relative to the completion of the FRA-315-0.49 project, PID 76420. \n \nSECTION 3.  That the expenditure of $246,728.82, or so much thereof as may be necessary, is hereby authorized in Fund 7704 (Streets and Highways Bond Fund), Dept-Div 59-11 (Division of Infrastructure Management), Project P530282-100105 (Resurfacing - Urban Paving - SR 315 (PID 76420)), in Object Class 06 (Capital Outlay), per the accounting codes in the attachment to this ordinance. \n \nSECTION 4.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 7.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the mayor, or ten days after passage if the mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 37,
    "meeting_date": "2022-02-07",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services",
      "Public Works"
    ]
  }
}