{
  "success": true,
  "vote": {
    "id": 2884,
    "item_number": "CA-44",
    "title": "To authorize the City Clerk to enter into a grant agreement with Columbus Works to support of the organization’s Job Readiness Training program; and to authorize an appropriation and expenditure within the Job Growth subfund. ($75,000.00)",
    "description": "Explanation\nThis ordinance authorizes the City Clerk to enter into a grant agreement with Columbus Works in support of the organization’s Job Readiness Training program.\n \nColumbus Works is a non-profit organization providing hope and encouragement to area residents living in poverty who desire to advance to economic self-sufficiency through full-time employment. They offer holistic job readiness training and wraparound services, and job placement services via a network of employer partners.\n \nIn addition to providing Job Readiness Training programs, Columbus Works partners with members who complete the program for 5-7 years to eliminate barriers to sustained employment. Wraparound services include legal services, behavioral health care, housing referrals, day care referrals, transportation, and job placement services. As the relationship between the member and the coach continues, job retention coaching and financing coaching, as well as career development training, become part of the program.\n \nTo allow members to choose the location most convenient for them, Columbus Works has learning centers in multiple neighborhoods, including Linden, the East Side, South Side, Weinland Park, and Franklinton.\n \nWith this funding, Columbus Works would be able to serve 50 new, unique individuals, bringing their total membership of those actively receiving services to 470.\n \nFiscal Impact: Funding is available within the Job Growth subfund.\n \nTitle\nTo authorize the City Clerk to enter into a grant agreement with Columbus Works to support of the organization’s Job Readiness Training program; and to authorize an appropriation and expenditure within the Job Growth subfund. ($75,000.00) \n \nBody\nWHEREAS, Columbus Works provides Job Readiness Training and long-term wraparound services and connects participants to employer partners; and\n \nWHEREAS, Columbus Works participants receive competitive wages and full benefits through employer partners in addition to long-term career development; and\n \nWHEREAS, Columbus is experiencing chronic un-or-under employment among young adults and poverty rates are as high as 58% in some neighborhoods; and\n \nWHEREAS, Columbus Works is committed to providing hope and encouragement to residents living in poverty, especially young adults in the urban core; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the City Clerk is hereby authorized to enter into a grant agreement with Columbus Works in support of their Job Readiness Training.\n \nSECTION 2.  That the City Auditor is hereby authorized and directed to appropriate $75,000.00 in the Job Growth subfund, fund 1000, subfund 100015, to the City Clerk per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That the expenditure of $75,000.00, or so much thereof as may be needed pursuant to the action authorized in SECTION 1 of this ordinance, is hereby authorized in the Job Growth subfund, fund 1000, subfund 100015 per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5.  That this ordinance shall take effect at the earliest date allowable under law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 37,
    "meeting_date": "2022-02-07",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Grants"
    ]
  }
}