{
  "success": true,
  "vote": {
    "id": 2985,
    "item_number": "SR-15",
    "title": "To amend the Columbus City Codes by enacting new Section 919.27, Nature Preserve Code to designate portions of parks as nature preserves ($0.00).",
    "description": "Explanation \n \nBackground: This ordinance will amend the Columbus City Codes by enacting Section 919.27 - Nature Preserves. The purpose of this new section is to authorize the Director of the Recreation and Parks Department, with the approval of the Recreation and Parks Commission, to seek designation of portions of parks as Nature Preserves pursuant to the processes set forth herein. The Director shall also be authorized to promulgate rules and regulations to identify, protect and manage, Nature Preserves. To date, the City has a total of 19 Nature Preserves, with over 2,000 acres. This new code section codifies the Nature Preserve Advisory Council, which was originally created by Resolution Number 044X-2004. The Columbus Recreation and Parks Commission approved this code change at their October commission meeting.\n \nFiscal Impact: No cost to City of Columbus.\n \nTitle\n \nTo amend the Columbus City Codes by enacting new Section 919.27, Nature Preserve Code to designate portions of parks as nature preserves ($0.00).\n \nBody\n \nWHEREAS, it is necessary to amend the Columbus City Codes by enacting Section 919.27 - Nature Preserves; and \n \nWHEREAS, this new code section will authorize the Director of the Recreation and Parks Department, with the approval of the Recreation and Parks Commission, to seek designation of portions of parks as Nature Preserves pursuant to the processes set forth herein; and\n \nWHEREAS, this new code section will also authorize the Director to promulgate rules and regulations to identify, protect, and manage Nature Preserves; and\n \nWHEREAS, this new code section codifies the Nature Preserve Advisory Council, which was originally created by Resolution Number 044X-2004; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Recreation and Parks Department to amend the Columbus City Codes; NOW, THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Columbus City Codes are hereby amended to enact Section 919.27 to read as follows: \n \n919.27 Nature Preserves \n \nA. Purpose: \nThe purpose of this section is to authorize the Director, with the approval of the recreation and parks commission, to designate portions of parks as Nature Preserves pursuant to the processes set forth herein. The Director is also hereby authorized to promulgate rules and regulations to identify, protect, and manage Nature Preserves. \n \nB. Nature Preserve Advisory Council: \n(1) There is hereby created the Nature Preserve Advisory Council. This Council shall be advisory to the Director of the Recreation and Parks Department and shall, from time to time, make recommendations for the operation, development and uses of the Columbus Recreation and Parks Nature Preserves. This is a codification of Resolution 044X-2004 that originally created the Nature Preserve Advisory Council. \n(2) The Council shall be composed of nine (9) members who shall be appointed by the Recreation and Parks Commission. An employee of the Department of Recreation and Parks shall be assigned as liaison to the Council. Council members shall serve for staggered three (3) year terms or until a successor is appointed and qualified. The Council shall be comprised of natural resources management professionals and representatives from the communities in which the nature preserves are located. Members shall serve without compensation during their respective terms. \n(3) The Council shall elect from its membership at its first meeting a chair and vice chair. The secretary may be an employee of the recreation and parks department. All secretarial supplies needed by the secretary shall be supplied by the recreation and parks department. \n(4) The Council shall meet bi-monthly at such time and place as it decides. The Council shall meet at special meetings as called by the chairperson, provided twenty-four hours written notice is given to each member \n(5) The Council shall adopt by-laws, rules and regulations that are not inconsistent with the provisions of the Columbus City Codes. A copy of the by-laws and rules shall be filed with the clerk of the city of Columbus. \n \nC. Duties of Nature Preserve Advisory Council: \n(1) Advise and make recommendations to the Director and Commission regarding the designation, development, operation, and use of Nature Preserves. \n(2) Advise and make recommendations on criteria necessary for nature preserve designation. Such criteria shall be submitted to the Director for approval and may be amended from time to time. \n(3) Advise and make recommendations on management plans for existing and proposed Nature Preserves. \n(4) To serve as a public forum for presentations concerning public use, management and access to the Nature Preserves.\n \nD. Process for designation of Nature Preserves \n(1) A portion of a Park to be considered for Nature Preserve designation shall first be evaluated by the Nature Preserve Advisory Council. If the Nature Preserve Advisory Council believes the portion of a park meets certain criteria, as outlined in the Nature Preserve Rules and Regulations, it shall provide a recommendation for designation to the Director. \n \n(2) The recommendation shall be based on, but not be limited to, the following: \na. The items in the Rules and Regulations that are met by this portion of a park. \nb. Relevant background of the proposed nature preserve, including any restrictions, covenants, and conditions. \nc. General site information, including information on park accessibility. \nd. Environmental conditions and resources such as the geology, topography, soils, wetland and vernal pools, surface water, cultural, and natural resources. \ne. Potential use as passive or active parkland or as a conservation area. \nf. Known presence of species (plant and animal) or habitat, per the Federal, State, and local databases, for candidate species or habitat, threatened or endangered species and also species proposed for a status change, all under the Endangered Species Act and the Migratory Bird Act. \ng. A draft nature preserve management plan. \n \n(3) If the recommendation is approved by the Director, the Department shall submit it to the Commission for approval.  \n(4) Upon approval by the Commission, the Department will submit an ordinance to City Council to authorize the area to be designated as a Nature Preserve.\n(5) Consideration of new Nature Preserves that may include city-owned property eligible for coverage under a Land Stewardship Agreement, pursuant to Section 1117 of the Columbus City Codes, shall be jointly reviewed and approved by the Director of Recreation and Parks and the Director of Public Utilities prior to final designation. \n \nE. Removal of all or portions of property from Nature Preserve \n(1) If an imperative and unavoidable public necessity arises, the Department may consider the removal of all or a portion of a Nature Preserve from Nature Preserve designation. In order to allow for removal of the Nature Preserve designation, the following procedure shall be followed by the Department: \na. The request for removal shall first be evaluated by the Nature Preserve Advisory Council. \nb. After evaluation, the Nature Preserve Advisory Council shall provide a recommendation to the Director. \nc. After considering the recommendation, the Director may submit the recommendation for removal to the Commission for approval. \nd. If the recommendation is approved by the Commission, the Department will then submit an ordinance to City Council to authorize the removal from Nature Preserve designation. \n \nF. Management of Nature Preserves \n(1) The Department shall be responsible for the management, development, operation, and use of all Nature Preserves. Management of Nature Preserves shall be consistent with the nature preserve management plans established by the Nature Preserve Advisory Council and approved by the Director. Exceptions to a nature preserve management plan may be approved by the Director if it is deemed that such exception is in the best interest of the City, Department or the public. \n(2) Management plans for Nature Preserves designated prior to the effective date of this section shall be submitted to the Director for approval within one (1) year of the effective date of this section. Management plans may be amended from time to time as recommended by the Nature Preserve Advisory Council and approved by the Director. \n(3) In general, the majority of a nature preserve area shall be maintained in its existing, near-natural, or restored natural state. It shall not be used for active or high impact purposes, such as sports fields or courts, picnic areas, or other uses that would physically impair or alter the ecological or cultural value of the site. In some cases, where appropriate, portions of the nature preserve may be used to create reasonable recreational amenities and access with the least amount of physical impact to the Nature Preserve. \n \nG. Prohibitions \n(1) In addition to the other prohibitions found in Chapter 919, or elsewhere in the Columbus City Codes, the following acts and uses are expressly prohibited in Nature Preserves. Activities performed by city personnel, or authorized agents on behalf of the city, are exempt from these prohibitions when approved by the Director: \na. Use of motorized or non-motorized vehicles, including, but not limited to, snowmobiles, ATVs, motorcycles, drones, bicycles, scooters, and mopeds. Official vehicles of the City, State or Federal agencies are permitted, as well as the use of handicapped accessible equipment on approved trails. \nb. Feeding any wild animal found within the confines of the Nature Preserves, other than by city personnel (or personnel authorized by the City) engaged in official duties. \nc. Camping, fishing (except at Nature Preserves located on City of Columbus Reservoirs, or if otherwise posted), hunting, trapping, wading, bathing, and swimming. \nd. Kindling, building, maintaining, or use of fire. \ne. Harassment of any of the animal life or disturbance of animal habitat including, but not limited to, trees, bat boxes, and bird nesting (including nesting boxes) locations. \nf. Littering, dumping, or burial of any refuse, debris, yard waste, fill, or soil. \ng. Allowing dogs, cats, livestock, horses, or other animals to enter a nature preserve, except for at designated locations in which animals must be controlled at all times on a leash not more than six feet long. This does not prohibit the use of a service animal. \nh. Traversing the Nature Preserve outside of approved trail or waterway. \ni. Storing materials or equipment for non-nature preserve projects. \nj. Constructing infrastructure that doesn’t directly improve the nature preserve, as determined by the Director. \nk. Release of any wild or domestic animal, or plant culture, seed, or vegetation of any type, unless otherwise approved by the Director with a permit or an agreement, in conjunction with appropriate local, state and federal permitting bodies. \nl. Collection, removal, or other disturbance of ice, soil, sand, gravel, rocks, fossils, mineral, trees, plant materials, animals, or any other natural substance unless otherwise approved by the Director, with a permit or agreement, in conjunction with local, state and federal permitting bodies.\nm. Any act or use that is not in compliance with the Nature Preserve Management Plan.\n \n(2) Where appropriate, the Nature Preserve Advisory Council may recommend that one or more of the above listed prohibited uses be allowed in a Nature Preserve. The prohibitions of section 919.27 shall not apply to city-owned property eligible for coverage under a Land Stewardship Agreement entered into between the Department of Public Utilities and a private property owner pursuant to Section 1117 of the Columbus City Codes.\n \nSECTION 2.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 38,
    "meeting_date": "2022-02-14",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Appointments",
      "Parks & Recreation"
    ]
  }
}