{
  "success": true,
  "vote": {
    "id": 3025,
    "item_number": "CA-30",
    "title": "To authorize the Director of Recreation and Parks to enter into contract with Decker Construction Company for the Turnberry Golf Course Improvements Construction Project; to authorize the transfer of $804,436.34 within the Recreation and Parks Voted Bond Fund, to authorize the amendment of the 2021 Capital Improvements Budget; to authorize the expenditure of $493,100.00 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($804,436.34)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Director of the Recreation and Parks Department to enter into contract with Decker Construction Company for the Turnberry Golf Course Improvements Construction Project. The contract amount is $443,825.47, with a contingency of $49,274.26, for a total of $493,100.00 being authorized by this ordinance.\n \nThe Turnberry Golf Course, bordering Blacklick Creek, is an Arthur Hills designed links style championship course. This course hosts many local youth tournaments, provides learning opportunities for all ages, and is open to the public. Revenues generated through greens fees, cart rentals, tournaments, and rentals support the operation of the golf courses. Currently there are many areas throughout Turnberry Golf Course that hold water and need improved drainage, along with improvements to user circulation throughout the course. These improvements to the golf course will encourage increased use and revenue for the department. \n \nVendor Bid/Proposal Submissions (ODI designation status):\n \nProposals were advertised through Vendor Services, in accordance with City Code Section 329, on December 6, 2021 and received by the Recreation and Parks Department on December 21, 2021. This project was also picked up by various local and regional plan rooms and distributed to their membership. Bids were received from the following companies:\n \nDecker Construction Company (MAJ): $443,825.47\nMcDaniel’s Construction Corp., Inc. (MBE): $482,882.58\nM&D Blacktop (MAJ): $485,230.00\nStrawser Paving Company (MAJ): $581,498.50\n2K General Company (MAJ): $619,540.00\n \nAfter reviewing the bids that were submitted, it was determined that Decker Construction Company was the lowest and most responsive bidder. Decker Construction Company and all proposed subcontractors have met code requirements with respect to prequalification, pursuant to relevant sections of Columbus City Code Chapter 329.\n \nPrincipal Parties: \nDecker Construction Company\n3040 McKinley Avenue Columbus, OH 43204                                                      \nJonathan R. Apple, 614-488-7958                                                   \nContract Compliance Number, Tax ID: 004549, 31-0983557\nContract Compliance Expiration Date: December 2, 2023\n \nEmergency Justification: Emergency action is requested so construction can begin early in spring of 2022, allowing the course to be closed a minimum amount of time during the golf season.\n \nBenefits to the Public: Improving drainage to reduce standing water and improving the circulation of cart paths for ease of player use will encourage increased use of the course. Additionally, the parking, circulation, and staging area in the front of the clubhouse will see significant improvements allowing for people to more easily access the course.\n \nCommunity Input/Issues: This site hosts various junior tournaments and the Central Ohio High School Sectional Golf Tournament. Golfers demand that the playing surfaces be in satisfactory condition, especially when competing in tournaments.\n \nArea(s) Affected: South East (65)\n \nMaster Plan Relation: This project supports the department’s Master Plan by improving revenue producing amenities. Additionally, this project will help maximize the use of existing recreational facilities for enhanced programming and offerings. Also, the Department promotes the preservation and wise use of the city’s natural resources. A large portion of the Turnberry Golf Course is in the floodplain and use as a public golf course benefits the greater community by protecting these natural resources from development.  \n \n \nFiscal Impact: $493,100.00 is budgeted and available from within the Recreation and Parks Voted Bond Fund 7702 and 7712 to meet the financial obligations of this contract.\n \nTitle\n \nTo authorize the Director of Recreation and Parks to enter into contract with Decker Construction Company for the Turnberry Golf Course Improvements Construction Project; to authorize the transfer of $804,436.34 within the Recreation and Parks Voted Bond Fund, to authorize the amendment of the 2021 Capital Improvements Budget; to authorize the expenditure of $493,100.00 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($804,436.34)\n \nBody\n \nWHEREAS, it is necessary to authorize the Director of the Recreation and Parks to enter into contract with Decker Construction Company for the Turnberry Golf Course Improvements Construction Project; and\n \nWHEREAS, it is necessary to authorize the transfer of $804,436.34 within the Recreation and Parks Voted Bond Fund 7702 and 7712; and\n \nWHEREAS, it is necessary to authorize the amendment of the 2021 Capital Improvements Budget Ordinance 2707-2021 in order to provide sufficient budget authority for this and future projects; and\n \nWHEREAS, it is necessary to authorize the expenditure of $493,100.00 from the Recreation and Parks Voted Bond Fund 7702 and 7712; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Recreation and Parks Department in that it is immediately necessary to authorize the Director to enter into contract with Decker Construction Company construction can begin early in spring of 2022, allowing the course to be closed a minimum amount of time during the golf season, all for the preservation of the public health, peace, property, safety, and welfare and, NOW, THEREFORE \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Recreation and Parks be and is hereby authorized to enter into contract with Decker Construction Company for the Turnberry Golf Course Improvements Construction Project.\n \nSECTION 2. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 4. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 5. That the transfer of $804,436.34 or so much thereof as may be needed, is hereby authorized between projects within the Recreation and Parks Bond Fund 7702 and 7712 per the account codes in the attachment to this ordinance.\n \nSECTION 6. That the 2021 Capital Improvements Budget Ordinance 2707-2021 is hereby amended as follows in order to provide sufficient budget authority for this ordinance and future projects.\nFund / Project / Project Name / Current / Change / Amended\n \nFund 7702; P510036-100000; King Arts Complex (Voted Carryover) / $941,308 / ($691,308) / $250,000\nFund 7702; P510429-100000; Golf Course Improvements (Voted Carryover) / $103 / ($103) / $0\nFund 7702; P515000-100000; Program Projects (Large) - Misc. (Voted Carryover); $100,000 / ($100,000) / $0\nFund 7712; P510430-100000; Champions Golf Course (Voted Carryover) / $53 / ($53) / $0\nFund 7712; P510038-100000; Linden Community Recreation Center (Voted Carryover) / $3,071 / ($3,071) / $0\nFund 7712; P514002-100000; Program Projects (Small) - Golf Misc. (Voted Carryover); $9,903/ ($9,903) / $0\n \nFund 7702; P514011-100000; Turnberry Golf Course Improvements (Voted Carryover) / $0 / $480,075 / $480,075\nFund 7702; P517000-100000; Opportunity Projects - Misc. (Voted Carryover) / $384,469 / $311,336 / $695,805\nFund 7712; P514011-100000; Turnberry Golf Course Improvements (Voted Carryover) / $0 / $13,027 / $13,027\n \nSECTION 7. For the purpose stated in Section 1, the expenditure of $493,100.00 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Recreation and Parks Voted Bond Fund 7702 and 7712 in object class 06 Capital Outlay per the accounting codes in the attachments to this ordinance.  \nSECTION 8. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 39,
    "meeting_date": "2022-02-28",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}