{
  "success": true,
  "vote": {
    "id": 3030,
    "item_number": "CA-35",
    "title": "To authorize the Director of Public Utilities to enter into an agreement with GS-OH, Inc. for environmental management system support for the Department of Public Utilities, to authorize the expenditure of $13,695.00 from the Power Operating Fund, $87,106.00 from the Water Operating Fund, $97,657.00 from the Sewerage System Operating Fund and $26,042.00 from the Stormwater Operating Fund ($224,500).",
    "description": "Explanation\n \nBACKGROUND: This legislation authorizes the Director of Public Utilities to enter into a professional consulting service agreement with GS-OH, Inc., for environmental management system support and maintaining conformity with the ISO 14001:2015 standard, preparing and/or conducting environmental training, and providing general support for assessing and ensuring environmental regulatory compliance with applicable environmental laws and regulations for the Department of Public Utilities.\n \nThis project will provide the Department of Public Utilities the assistance of a qualified and experienced consultant to support the Department in the implementation of its Environmental Management System (EMS). Consultant will be responsible for (1) assisting department staff to ensure that the Department’s EMS conforms to the International Organization for Standardization (ISO) 14001:2015 standard, (2) providing air permitting and compliance support, (3) delivering support for Spill Prevention Control and Countermeasures (SPCC) plan updates, and (4) offering other general environmental compliance support as needed.\n \nPROCUREMENT:   Request for proposals were formally advertised on the Vendor Services and Bonfire websites in accordance with the procedures set forth in Columbus City Code, Section 329 from October 15, 2021 to November 19, 2021.  The city received three (3) responses.  The proposals were deemed responsive and were fully evaluated when the Evaluation Committee met on December 2, 2021. The Evaluation Committee selected GS-OH, Inc. They submitted the strongest overall proposal for the following reasons: 1- The team conveyed a thorough and knowledgeable understanding of the program needs, and their approach covered every aspect of the scope.  2- The team has an abundance of experience with the aspects of this project as well as other environmental endeavors. 3- They exhibited a clear understanding of the importance of the City's environmental sustainability goals.\n \nServices under this agreement are to be provided over a period of three (3) years from date of execution to and including April 16, 2025. Funds for the project shall be reviewed and approved on a year-to-year basis of the three-year contract based upon mutual agreement, availability of budgeted funds and approval Columbus City Council. The recommended award amount for the initial year of this contract is $224,500.00. If unforeseen issues or difficulties are encountered that would require additional funding, a modification would be requested. This service agreement will not automatically renew.     \n            \nSUPPLIER: GS-OH, Inc. (62-1736493, V #009789) Expires 2/4/2022 (MAJ)\nThe company is not debarred according to the Excluded Party Listing System of the Federal Government. \n \nFISCAL IMPACT: $224,500.00 is needed and was budgeted for this expenditure. This ordinance is contingent on the passage of the 2022 Operating Budget, Ordinance #2742-2021\n \n$178,570.37 was spent in 2021\n$131,061.91 was spent in 2020\n \nTitle\n \nTo authorize the Director of Public Utilities to enter into an agreement with GS-OH, Inc. for environmental management system support for the Department of Public Utilities, to authorize the expenditure of $13,695.00 from the Power Operating Fund, $87,106.00 from the Water Operating Fund, $97,657.00 from the Sewerage System Operating Fund and $26,042.00 from the Stormwater Operating Fund ($224,500). \n \nBody\n \nWHEREAS, the Department of Public Utilities has a continued need to sustain its environmental management system to ensure that its environmental compliance requirements are met and its environmental footprint is reduced; and\n \nWHEREAS, the contract will provide the Department of Public Utilities the ability to build upon the previous work on the department's environmental management system with the goal of maintaining conformance to the ISO 14001:2015 standard and compliance with applicable environmental laws and regulations. The consultant will be responsible for (1) assisting department staff to ensure that the Department’s EMS conforms to the International Organization for Standardization (ISO) 14001:2015 standard, (2) providing air permitting and compliance oversight, (3) delivering support for Spill Prevention Control and Countermeasures (SPCC) plan updates, and (4) offering other general environmental compliance support as needed; and\n \nWHEREAS, the Director of Public Utilities received three (3) proposals and GS-Ohio, Inc.’s proposal was deemed acceptable by the selection committee and the Director; and\n \nWHEREAS, this ordinance authorizes the expenditure of $224,500.00 or so much hereof is needed to enter into a service agreement with GS-OH, Inc. to provide support in the Environmental Management System for the Department of Public Utilities; and\n \nWHEREAS, services under this agreement are to be provided over a period of three (3) years from date of execution to and including April 16, 2025. Funds for the project shall be reviewed and approved on a year-to-year basis of the three-year contract based upon mutual agreement, availability of budgeted funds and approval Columbus City Council. This service agreement will not automatically renew; and\n \nWHEREAS, the City may, at any time during the performance of the services under this Agreement, propose a modification of the Contract by a properly authorized written instrument. With the approval of City Council and execution of such modification by both parties hereto, it shall be fully incorporated into this Contract and shall govern all subsequent performance under the Contract; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities to authorize the Director to enter into a contract with GS-OH Inc. for support in the Environmental Management System for the  preservation of the public health, peace, property and safety; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS: \n \nSECTION 1. That the Director of Public Utilities be and is hereby authorized to enter into an agreement with GS-OH, Inc. for environmental management system support and support in maintaining conformity with the ISO 14001:2015 standard and compliance with applicable environmental laws and regulations for the Department of Public Utilities.\n \nSECTION 2. That said firm shall conduct the work to the satisfaction of the Director of Public Utilities.\n \nSECTION 3.  That this contract is in accordance with the relevant provisions of Columbus City Code Chapter 329 relating to awarding professional service contracts through requests for proposals.\n \nSECTION 4. That the expenditure of $224,500.00 or so much thereof as may be needed, be and the same hereby is authorized per the accounting codes in the attachment to this ordinance. \n \nSECTION 5. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 39,
    "meeting_date": "2022-02-28",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}