{
  "success": true,
  "vote": {
    "id": 3071,
    "item_number": "SR-3",
    "title": "To authorize the Director of the Department of Finance and Management to enter into contracts and a License Agreement with Columbus Early Learning Centers, to serve as the operator and tenant of the Hilltop Early Learning Center; to authorize the City Auditor to establish a Hilltop Early Learning Center special revenue fund; to authorize a transfer of appropriation within the general fund; to authorize the expenditure of $3,470,000.00; and to declare an emergency ($3,470,000.00)",
    "description": "Explanation\n \nBACKGROUND:  This legislation authorizes the Director of the Department of Finance and Management to enter into contracts, including a License Agreement, with Columbus Early Learning Centers (CELC) to serve as the operator and tenant of the new Hilltop Early Learning Center located at 45 Clarendon Avenue.  CELC will be responsible for the design and implementation of a high quality program of pre-kindergarten education and wrap-around services in conjunction with the CELC’s sub-providers and partners, and provide support services to its sub-providers, the medical services provider, and community groups.\nMayor Ginther’s vision for America’s Opportunity City is that every child in Columbus enters kindergarten ready to learn. Becoming kindergarten-ready is about so much more than participating in a quality early learning program. Children who come to school ready to learn are more likely to succeed academically and in life. Ample evidence shows that children who enter school unprepared and who get a poor start in their earliest years are more likely to struggle throughout school and subsequently, fail to graduate. An investment in early childhood development helps prevent achievement gaps, reduces the need for special education, increases the likelihood of healthier lifestyles, lowers the crime rate and reduces overall social costs. \nStrategies that assist children to successfully transition to kindergarten focus on serving the needs of the whole child and their families. Screenings that identify developmental delays early, along with referrals and rehabilitative services, are crucial in meeting educational goals. Home-visitation or center-based education and advocacy programs provide important information to family members on the early developmental needs of their child. For children and families that have experienced trauma and toxic stresses, mental and behavioral health and counseling services are necessary. In addition, meeting the basic needs of the family, such as having access to fresh fruits and vegetables, stable housing, employment, childcare, and transportation are important for the success of the entire family.\nIn the Hilltop, fewer children are enrolled in quality early learning programs than anywhere else in the city. In 2017, Mayor Ginther created the Hilltop Early Childhood Partnership (HECP) and charged the partnership with doubling the number of Hilltop children enrolled in quality early programs in this community. One of the recommendations in the HECP’s 2018 report was to build a new early learning center in the Hilltop to increase capacity and provide quality programming.\nThe City of Columbus solicited request for proposals, seeking an organization to serve as the master tenant of the Hilltop Early Learning Center. Proposals were submitted in response to RFQ018639 in accordance with the relevant provisions of Chapter 329 of the Columbus City Codes.  Proposals were due June 24, 2021, and four (4) proposals were received.  A committee reviewed the proposals and determined preliminary scores. The committee conducted presentations with the four organizations that submitted proposals. CELC received the highest overall score from the committee and, as such, is being recommended to serve as the master tenant.\nThe term of the Operations Agreement shall be from September 1, 2022 through August 31, 2023, with an option to renew the Contract for up to two (2) additional one year terms running from September 1, 2023 through August 31, 2024 and September 1, 2024 through August 31, 2025.  The maximum amount to be paid under any purchase order associated with this Contract shall not exceed $3,120,000.00 per school year unless additional funds are appropriated and authorized by the City.\nThe term of the Startup Contract shall be from March 15, 2022 through August 31, 2022.  The maximum amount to be paid under any purchase order associated with this Contract shall not exceed $350,000.00 unless additional funds are appropriated and authorized by the City.\nIn addition to executing the Operations Agreement and Startup Contract, CELC is required to enter into a separate License Agreement with the City of Columbus for the occupancy and use of the Hilltop Early Learning Center located at 45 Clarendon Avenue, Columbus, Ohio 43223. The License Agreement shall be for a three (3) year term with a renewal option for an additional three year term.  \nColumbus Early Learning Centers, Contract Compliance CC# 034596, Expires 01/27/2023\nFiscal Impact: $3,470,000.00 is budgeted and available in the 2022 General Fund budget in support of this initiative.  The City will receive rental funds for the term of the License Agreement that shall be deposited in a separate special revenue fund established for the support of the City's Hilltop Early Learning Center that will be used for building interior and exterior repairs and replacements, and for the replacement of the associated equipment or furnishings.\n \nThis ordinance is contingent on passage of the 2022 operating budget.\n \nEmergency action is requested so that these contracts can be entered into immediately to allow Columbus Early Learning Centers time to on-board staff, develop programs and services to ensure the center is ready to open this coming school year.\n \nTitle\n \nTo authorize the Director of the Department of Finance and Management to enter into contracts and a License Agreement with Columbus Early Learning Centers, to serve as the operator and tenant of the Hilltop Early Learning Center; to authorize the City Auditor to establish a Hilltop Early Learning Center special revenue fund; to authorize a transfer of appropriation within the general fund; to authorize the expenditure of $3,470,000.00; and to declare an emergency ($3,470,000.00)\nBody\n \nWHEREAS, the City of Columbus solicited request for proposals, seeking to identify and assess qualified organizations to serve as the operator and tenant of the Hilltop Early Learning Center; and\n \nWHEREAS, through a competitive process, Columbus Early Learning Centers was awarded this project; and\n \nWHEREAS, the Mayor’s vision for Columbus, America’s Opportunity City, is that all children enter kindergarten ready to learn; and \n \nWHEREAS, data shows that children who participate in quality early education programs, notably in Columbus’ Early Start Columbus program, are better prepared to start school; and \n \nWHEREAS, the Hilltop Early Childhood Partnership recommended that a new early learning center be constructed in the Hilltop to increase the availability of quality pre-kindergarten programs for Hilltop children; and  \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Finance and Management in that it is immediately necessary to authorize the Director to enter into contracts and a License Agreement with Columbus Early Learning Centers to serve as the operator and tenant of the Hilltop Early Learning Center so that such activities can begin without delay, for the preservation of the public health, peace, property, safety, and welfare; NOW, THEREFORE\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1.  That the Director of the Department of Finance and Management is hereby authorized to enter into contracts with Columbus Early Learning Centers to serve as the master tenant of the Hilltop Early Learning Center and a License Agreement, as prepared and approved by the City Attorney, Real Estate Section, and authorizes the Director of Finance and Management to approve those future amendments to the License Agreement necessary to reflect changes to the License Agreement exhibits defining the personal property furnishings, technology, communications, and security cameras provided by the City.\n \nSECTION 2. That the transfer of appropriation and expenditure of up to $3,470,000.00, or so much thereof as may be needed pursuant to the action authorized in SECTION 1, is hereby authorized, in Object Class 03 - Contractual Services, per the accounting codes in the attachment to this ordinance.\n \nSee Attached File: Ord 0441-2022 Legislation Template.xls\n \nSECTION 3.  That the City Auditor shall establish a \" Hilltop Early Learning Center” special revenue fund separate and distinct from the \"General Fund\" into which annual rent shall be deposited and such funds shall be held by the City Auditor solely for the payment of costs at the City's Hilltop Early Learning Center related to the repair and replacements of building interior and exterior components and for the repairs and replacement of the associated technology, communications, security equipment and furnishings that have reached the end of their useful life.\n \nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 5. That the monies appropriated in the foregoing Sections shall be paid upon the order of the Department of Finance and Management, and that no order shall be drawn or money paid except by voucher, the form of which shall be approved by the City Auditor.\n \nSECTION 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 7. That for the reasons stated in the preamble hereto, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 39,
    "meeting_date": "2022-02-28",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}