{
  "success": true,
  "vote": {
    "id": 3087,
    "item_number": "2",
    "title": "To Recognize National Women in Construction Week and Celebrate Women in the Construction Industry and Their Contribution to the City of Columbus.",
    "description": "Title\nTo Recognize National Women in Construction Week and Celebrate Women in the Construction Industry and Their Contribution to the City of Columbus.\n \nBody\nWHEREAS, National Women in Construction Week is celebrated March 6-11, 2022 to raise awareness and celebrate the work of women in the construction industry in the City of Columbus and across the country; and\n \nWHEREAS, Women remain an underrepresented group in the trades, and activities to improve women’s recruitment and retention in skilled construction jobs are critically important in helping to close the workforce skills gap, build the middle class, and help meet the needs of the City of Columbus; and\n \nWHEREAS, According to the U.S. Bureau of Labor Statistics women make up almost 13% the construction industry nationwide, and 12% here in the State of Ohio; and\n                                                  \nWHEREAS, Building Futures is a 12-week pre-apprenticeship program to help participants start their careers in Central Ohio’s booming construction industry. Last month, the first all-female Building Futures cohort started this program. Upon graduation they will have a direct path to a career in construction and the building trades; and \n \nWHEREAS, Women in the construction industry have contributed greatly to projects across Columbus, and will continue to help build our City as it grows. Recognizing their work and encouraging the next generation of women in the construction industry is an important part of the success of the City of Columbus; now, therefore\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS:                                                                              \nThat this Council does hereby recognize National Women in Construction Week and celebrate women in the construction industry and their contribution to the City of Columbus.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 40,
    "meeting_date": "2022-03-07",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}