{
  "success": true,
  "vote": {
    "id": 3091,
    "item_number": "CA-3",
    "title": "To determine that the petition to establish the Hamilton Crossing Community Authority is sufficient and complies with the requirements of Chapter 349 of the Ohio Revised Code; to set the time and place for a public hearing on the petition; to authorize the notice of such public hearing by publication in a newspaper; and to declare an emergency.",
    "description": "Explanation\nBackground: Ordinance 1307-2012 passed by Council on July 30, 2012 and Ordinance 1758-2015 passed by Council on July 13, 2015 rezoned property in the vicinity of the N. Hamilton Road and State Route 161 interchange including Franklin County Auditor tax parcel ID’s 010-220083, 010-247888, 010-296370, 010-301660, 545-294042, 545-175661, and 545-291670 (collectively, the “New Community Authority Site”) now owned or controlled by Hamilton Crossing, LLC; The New Albany Company; Center State Enterprises LLC; and affiliates of Casto AP Residential LLC: HQ Flats Phase I LLC; HQ Flats Phase II LLC; and HQ Flats Phase III LLC (each a “Developer” and collectively, the “Developers”). The Developers have constructed or plan to construct at least 750 residential units and are proposing to construct a yet to be determined amount of mixed use development, which may include additional multifamily, retail, office, medical office, senior housing, or hospitality/conference altogether on approximately 114 acres. This proposed development represents an estimated private investment of approximately $75,000,000 to $85,000,000. The Developers may also finance upfront at least $7,000,000 of public infrastructure improvements. Pursuant to Ordinance 2189-2020 passed by Council on October 5, 2020, the Director of the Department of Development entered into the First Partial Amendment to Economic Development Agreement dated January 29, 2021 amending the Economic Development Agreement dated September 24, 2015 (together, the “EDA”) with the Hamilton Crossing, LLC; The New Albany Company; Center State Enterprises LLC; and Casto AP Residential, LLC to reaffirm and outline the plans and respective commitments of the parties for the fulfillment of establishing a new community authority, among other things, in relation to the New Community Authority Site. On February 22, 2022, a petition for the organization of the Hamilton Crossing Community Authority (the “Petition”) was filed by the Developers including, Casto AP Residential, LLC, with the City Clerk. By this resolution, City Council, as the organizational board of commissions described and required by Chapter 349 of the Ohio Revised Code (“R.C.”), will determine the sufficiency of the Petition, authorize a public notice, and set a public hearing date on the Petition.\n \nEmergency Justification: Emergency action is requested in order to facilitate the development of the New Community Authority Site in a timely manner in accordance with the EDA and in order to provide notice in a newspaper for three consecutive weeks prior to a public hearing and set the public hearing date within 30-45 days of the date after the Petition was filed in accordance with R.C. Chapter 349.\n \nFiscal Impact: No funding is required for this legislation.\n \nTitle\nTo determine that the petition to establish the Hamilton Crossing Community Authority is sufficient and complies with the requirements of Chapter 349 of the Ohio Revised Code; to set the time and place for a public hearing on the petition; to authorize the notice of such public hearing by publication in a newspaper; and to declare an emergency.\n \nBody\nWHEREAS, Hamilton Crossing, LLC; The New Albany Company; Center State Enterprises LLC; and affiliates of Casto AP Residential, LLC: HQ Flats Phase I LLC; HQ Flats Phase II LLC; and HQ Flats Phase III LLC (each a “Developer” and collectively, the “Developers”) have constructed or plan to construct at least 750 residential units and are proposing to construct a yet to be determined amount of mixed use development which may include additional multifamily, retail, office, medical office, senior housing, or hospitality/conference altogether on approximately 114 acres consisting of Franklin County Auditor tax parcel ID’s 010-220083, 010-247888, 010-296370, 010-301660, 545-294042, 545-175661, and 545-291670 (the “New Community Authority Site”); and\n \nWHEREAS, while the foregoing represents an estimated private investment of approximately $75,000,000 to $85,000,000, the Developers also plan to provide initial funding for the design and construction costs required to complete public infrastructure improvements anticipated to include, but not be limited to: a new roadway called Central Boulevard, reconstruction of Old Dublin-Granville Road west of N. Hamilton Road, widening of N. Hamilton Road, ramp improvements at the State Route 161 interchange, parkland, public structured parking, shared use paths, and storm water mitigation of at least $7,000,000; and \n \nWHEREAS, pursuant to Ordinance 2189-2020 passed by Council on October 5, 2020, the Director of the Department of Development entered into the First Partial Amendment to Economic Development Agreement dated January 29, 2021 amending the Economic Development Agreement dated September 24, 2015 (together, the “EDA”) with Hamilton Crossing, LLC; Casto AP Residential, LLC; The New Albany Company; Center State Enterprises LLC to reaffirm and outline the plans and respective commitments of the parties for the fulfillment of establishing a new community authority, among other things, in relation to the New Community Authority Site; and\n \nWHEREAS, on February 22, 2022, the Developers including Casto AP Residential, LLC, submitted to the City Clerk on behalf of the Council of the City (“Council”), pursuant to Section 349.03 of the Ohio Revised Code (“R.C.”), a Petition for Establishment of the Hamilton Crossing Community Authority under R.C. Chapter 349 (the “Petition”); and\n \nWHEREAS, the Hamilton Crossing New Community District, as described in the Petition, is located entirely within the municipal corporate boundaries of the City, and this Council, as the legislative authority of the City, is therefore the organizational board of commissioners for purposes of this Petition in accordance with R.C. Chapter 349; and\n \nWHEREAS, this Council has reviewed the Petition, and by this resolution desires to legislatively determine, pursuant to R.C. Section 349.03, that the Petition complies with the requirements of that section as to form and substance; pursuant to R.C. Section 349.03, to set the time and place of a hearing on the Petition; and further pursuant to R.C. Section 349.03, authorize the notice by publication of the hearing on the Petition; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to make the legislative determinations described herein regarding the sufficiency of the Petition in order to facilitate the redevelopment of the New Community Authority Site in accordance with the EDA and in order to provide notice in a newspaper for three consecutive weeks prior to a public hearing and set the public hearing date within 30-45 days of the date after the Petition was filed in accordance with R.C. Chapter 349 all for the preservation of the public health, peace, property, safety, and welfare; NOW, THEREFORE, \n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: \n \nSECTION 1.  Organizational Board of Commissioners.  This Council hereby acknowledges and determines that, pursuant to R.C. Section 349.01(F)(3), it is the “organizational board of commissioners” of the Hamilton Crossing Community Authority for all purposes of R.C. Chapter 349.\n \nSECTION 2.  Petition’s Sufficiency and Compliance with R.C. Section 349.03.  This Council has examined the Petition and finds and determines that the Petition is sufficient and complies with the requirements of R.C. Section 349.03 in form and substance.\n \nSECTION 3.  Time and Place of Hearing.  Pursuant to R.C. Section 349.03, this Council hereby determines to hold a hearing on the Petition on March 31, 2022 at 10:00 a.m. at the offices of the City Department of Development, 111 N. Front St., Columbus, OH  43215, and this Council hereby authorizes each of the City Attorney, the City Clerk, and the City’s Director of the Department of Development, or any of them individually, to cause notice of the hearing to be published once a week for three consecutive weeks, or as provided in R.C. Section 7.16, in a newspaper of general circulation within Franklin County, Ohio, pursuant to R.C. Section 349.03(A).\n \nSECTION 4.                     Effective Date.                       For the reasons stated in the Preamble hereto, which is hereby made a part hereof, this resolution is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after the passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 40,
    "meeting_date": "2022-03-07",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services"
    ]
  }
}