{
  "success": true,
  "vote": {
    "id": 3106,
    "item_number": "CA-18",
    "title": "To authorize the Director of Public Utilities to enter into a professional engineering agreement with AECOM Technical Services, Inc. for the DOSD Pump Stations SA13 Evaluation and Upgrade Project, CIP# 650660-100013; to amend the 2021 Capital Improvement Budget; to authorize an appropriation, transfer within and expenditure of up to $231,539.23 from the Sanitary Sewer PayGo Fund. ($231,539.23)",
    "description": "Explanation\n \nBACKGROUND: This legislation is required to provide Professional Engineering Services for the design of CIP 650660-100013, DOSD Sanitary Pump Stations SA13 Evaluation & Upgrade. The basic services to be provided under this Agreement by the Design Professional are preliminary engineering, detailed design, and services during construction. The primary objective of this project is to develop a concise set of design documents that will allow for the complete renovation of the Sanitary Pump Station SA-13.\n \nThe Community Planning Area is 99 - Citywide\n \nPROCUREMENT: The Department of Public Utilities advertised a Request for Proposals (RFP’s) for DOSD Pump Stations SA13 Evaluation and Upgrade #650660-100013 on the Vendor Services and Bonfire websites that closed on November 19, 2021.  The city received four (4) responses from the following firms:  AECOM Technical Services, Inc., Hatch Associates Consultants, Inc., Prime AE Group, Inc. and CHA Consulting, Inc.  All proposals were evaluated in accordance with Columbus City Code Title 3, Chapter 329.28, and were scored according to competence to perform, past performance, and understanding of the project approach. Scoring and awards include:\n1.                      AECOM Technical Services, Inc. \n(DP assigned to: DOSD Sanitary Pump Station SA-13 Evaluation & Upgrade, CIP 650660-100013)\n2.                      Prime AE Group, Inc. \n(DP assigned to: DOSD Stormwater Pump Station ST-29 Evaluation & Upgrade, CIP 611660-100029)\n3.                      Hatch Associates Consultants, Inc.\n4.                      CHA Consulting, Inc.\n \n                \nMULTI-YEAR CONTRACT: The Department anticipates requesting additional future renewals to this contract. \n \nPROJECT TIMELINE: AECOM will begin work after the notice to proceed (NTP) is given upon execution of their Professional Engineering Services Agreement. NTP is anticipated to be during the second quarter of 2022. The engineering agreement will provide Step 1, Preliminary Design Services. The completion of Preliminary Design and approval of the PDR is currently scheduled for the first quarter of 2023. A renewal request for Detailed Design is currently scheduled for late 2022 so that the renewal can be finalized and Detailed Design can begin upon completion of Preliminary Design in the first quarter of 2023. Detailed Design will continue until advertisement for bids, then bidding services will commence. It is anticipated that plans and specs will be finalized and ready for advertisement during the first quarter of 2024, bids will be received in the second quarter of 2024, and Notice to Proceed of the construction contract will be in the summer of 2024. The anticipated end of the construction contract is 2025. The Professional Engineering Services contract will continue beyond completion of construction to provide “as-built” record drawings of the constructed facilities. The engineering agreement is anticipated to be closed in 2026.\n \nContract Compliance No.:  95-2661922 | MAJ | 7/22/2022 | Vendor#: 010897\n \nEmergency Designation:  Emergency legislation is not requested at this time. \n \nEconomic Impact: The performance of this project’s activities to provide specialized professional engineering services to evaluate and provide recommendations for the upgrade of DOSD’s Sanitary Pump Station SA-13 is needed to plan improvements to maintain peak operational performance. If left unperformed, the required work could become larger in scope and more expensive and could produce a major impact to the collection system and the budget. No community outreach is considered for this project. \n \nFiscal Impact: This contract requires a transfer and appropriation of funds, and an expenditure of up to $231,539.23 from the Sanitary Sewer PayGo Fund 6116 and amends the 2021 Capital Improvement Budget.\n \nTitle\n \nTo authorize the Director of Public Utilities to enter into a professional engineering agreement with AECOM Technical Services, Inc. for the DOSD Pump Stations SA13 Evaluation and Upgrade Project, CIP# 650660-100013; to amend the 2021 Capital Improvement Budget; to authorize an appropriation, transfer within and expenditure of up to $231,539.23 from the Sanitary Sewer PayGo Fund. ($231,539.23)\n \nBody\n \nWHEREAS, the Department of Public Utilities advertised for Requests for Proposals for the DOSD Pump Station Evaluation and Upgrade Project; and\n \nWHEREAS, the Department of Public Utilities received four (4) proposals, AECOM Technical Services, Inc., Hatch Associates Consultants, Inc., Prime AE Group, Inc. and CHA Consulting, Inc.; and\n \nWHEREAS, all four proposals were evaluated and AECOM Technical Services, Inc. was determined to best meet the needs of the Department; and\n \nWHEREAS, it is necessary for the City to enter into a professional engineering agreement with AECOM Technical Services, Inc. for the DOSD Pump Stations SA13 Evaluation and Upgrade Project; and\n \nWHEREAS, it is necessary to authorize the appropriation, transfer, and expenditure of up to $231,539.23 from the Sanitary Sewer PayGo Fund 6116; and\nWHEREAS, it is necessary to amend the 2021 Capital Improvement Budget to align the authority with the expenditure; and\nWHEREAS, it has become necessary in the usual daily operation of the Division of Sewerage and Drainage, Department of Public Utilities, to authorize the Director to enter into a professional engineering agreement with AECOM Technical Services, Inc. for the DOSD Pump Stations SA13 Evaluation and Upgrade Project, for the preservation of the public health, peace, property, safety and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Utilities is hereby authorized to enter into a professional engineering agreement with AECOM Technical Services, Inc. 277 W. Nationwide Blvd. Columbus, OH 43215; for an expenditure up to $231,539.23; in accordance with the terms and conditions as shown in the contract agreement on file in the office of the Division of Sewerage and Drainage.\n \nSECTION 2. That the City Auditor is hereby authorized to appropriate, transfer within, and expend up to $231,539.23 from the Sanitary Sewer PayGo Fund 6116, per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That the 2021 Capital Improvement Budget is hereby amended per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That said firm, AECOM Technical Services, Inc., shall conduct the work to the satisfaction of the Director of Public Utilities and the Administrator of the Division of Sewerage and Drainage.\n \nSECTION 5.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6. That the City Auditor is hereby authorized and directed to transfer any unencumbered balance in the project account to the unallocated balance within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies no longer required for said project; except that no transfer shall be made from a project account by monies from more than one source.\n \nSECTION 7. That the City Auditor is authorized to establish proper project accounting numbers as appropriate.\n \nSECTION 8.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this Ordinance.\n \nSECTION 9.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 40,
    "meeting_date": "2022-03-07",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}