{
  "success": true,
  "vote": {
    "id": 3185,
    "item_number": "CA-3",
    "title": "To celebrate and recognize the Beta Chi Chapter of Kappa Alpha Psi Fraternity, Inc. on the milestone of its Seventy Fifth anniversary",
    "description": "Title\nTo celebrate and recognize the Beta Chi Chapter of Kappa Alpha Psi Fraternity, Inc. on the milestone of its Seventy Fifth anniversary\n \n \nBody\nWHEREAS, Kappa Alpha Psi Fraternity, Inc, was established on January 5, 1911 at Indiana University in Bloomington, Indiana: and\n \nWHEREAS, the Beta Chi Chapter of Kappa Alpha Psi Fraternity, was established April 19, 1947 on the campus of Hampton University in Hampton Virginia; and\n \nWHEREAS, the chartering members of Beta Chi Chapter of Kappa Alpha Psi Fraternity, Inc. were Lonnie Adkins, Nerva Antonine, Henry T. Cooper, Calvin Culbreath, John Harrison, John Jarrell, Dennis A. Patterson, Albert Queen, and Charlie Roberts ; and\n \nWHEREAS, the Beta Chi Chapter of Kappa Alpha Psi Fraternity, Inc is celebrating Seventy Five years of Achievement in Every Field of Human Endeavor\n \nWHEREAS, the Beta Chi Chapter of Kappa Alpha Psi Fraternity, Inc prides itself on its outstanding Guide Right Program. Through Guide Right Brothers Mentor young people throughout the Hampton Roads community. Currently the chapter is raising funds to support its St. Jude’s Research Hospital, The Eva C. Mitchell Playground Project, and to raise awareness about domestic violence against women and children. It is for this reason that The Beata Chi Chapter of Alpha Psi Fraternity Inc. has been named Greek Organization of the year four consecutive years; and\n \nWHEREAS, the Columbus, Ohio Alumni Chapter of Kappa Alpha Psi was founded in 1921 and under the current leadership of Polemarch Jeffrey Ushry and many active accomplished members, continues to undertake community initiatives such as mentoring for children and scholarships for college students; assistance for families in need during the Thanksgiving and Christmas holidays; and other programs to improve people’s lives. Distinguished members of the Columbus Alumni Chapter: are former Mayor Michael B. Coleman, The Honorable State Senator Hearcel Craig, former Columbus City Councilman and former Ohio State Senator Ben Espy, former Ohio State Legislator Otto Beatty, Jr. former (Ohio) U.S. Congressman Louis Stokes and former mayor(s) of Cleveland, Ohio Carl Stokes and Michael White; now therefore,\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS:  To celebrate and recognize the Beta Chi Chapter of Kappa Alpha Psi Fraternity, Inc. on the milestone of its Seventy Fifth anniversary.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 41,
    "meeting_date": "2022-03-21",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}