{
  "success": true,
  "vote": {
    "id": 3306,
    "item_number": "CA-17",
    "title": "To authorize the Director of Public Utilities to modify, increase and extend the contract through June 30, 2023 with The Ohio State University, Office of Sponsored Programs, for the NPDES Stormwater and Clintonville Blueprint Monitoring Project for the Division of Sewerage and Drainage, Stormwater and Regulatory Management Section, to authorize the expenditure of $360,000.00 from the Storm Sewer Operating Fund.  ($360,000.00)",
    "description": "Explanation\n \nThis legislation authorizes the Director of Public Utilities to modify, increase and extend the contract with Ohio State University, Office of Sponsored Programs for the purpose of providing professional engineering services for the NPDES Stormwater and Clintonville Blueprint Monitoring Project for the Division of Sewerage and Drainage, Stormwater and Regulatory Management Section.  \n \nThe City's Stormwater National Pollutant Discharge Elimination System (NPDES) permit requires the City to monitor discharges from its municipal separate storm sewer system (MS4) during wet weather events.  Monitoring and data collection services performed under this project will allow the City to meet its permit obligations.  Wet weather monitoring will be performed at Stormwater outfalls to characterize the change in quality and quantity of discharges from outfalls in the Clintonville Blueprint Project Area after the installation of green infrastructure (GI).  Simulated storm events will be used to quantify changes on storm water quality and quantity from selected GI practices.  Tasks associated with this project include all outfall sampling, laboratory analysis, laboratory data evaluation, report generation, and project management.  Additional data collection and analysis will be performed to determine to what extent property values increase or decrease as a result of the installation of GI, to evaluate changes in other selected social and economic indicators, and to evaluate the effect of GI on habitat and bio diversity. \n \nAs a non-profit organization, the Ohio State University, Office of Sponsored Programs will ensure continued compliance with the City’s Stormwater NPDES permit, to measure the performance of GI installations for the purpose of improving the design and planning of future projects, to measure the economic, social, and environmental impact of a large-scale GI project on the community in which it is installed.  \n \nThis contract covers a seven-year period from March 3, 2016 through and including June 30, 2023.  For each year of the seven year contract, funds for the services shall be reviewed and expenditures shall be approved by Ordinance of City Council, and the appropriation and certification of funds by the City Auditor.  The original agreement was for the period of March 3, 2016 through March 2, 2017 in the amount of $325,000.00.  This modification No. 6 is to provide funding necessary for the continuation of the NPDES Stormwater and Clintonville Blueprint Monitoring Project through June 30, 2023. Total amount for this modification No. 6 is $360,000.00. The additional six months is needed for data analysis. Total amount including this modification is $1,765,713.72.  If unforeseen issues or difficulties are encountered that would require additional funding, a modification would be requested.  \n \nSUPPLIER:  Ohio State University, Office of Sponsored Programs (31-6025986), DAX #006163, Expires 5/1/2022.\nOhio State University, Office of Sponsored Programs is a Non-Profit Organization and therefore does not hold MBE/FBE status.\n \nThe company is not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.\n \n1.                       Amount of additional funds:  Total amount of additional funds needed for this contract modification No. 6 is $360,000.00.  Total contract amount including this modification is $1,765,713.72.\n2.                     Reasons additional funds were not foreseen:  This is a planned modification.  The need for additional funds was known at the time of the initial contract.  This modification is to provide the funding necessary for the payment of service to be provided through June 30, 2023.\n3.                     Reason other procurement processes were not used:  Work under this modification is a continuation of services included in the scope of the original contract.  No lower pricing/more attractive terms and conditions are anticipated at this time.\n4.                     How was cost determined:  The cost, terms and conditions are in accordance with the original agreement.\n \nFISCAL IMPACT:  $360,000.00 is budgeted and available for this program. \n$223,848.81 was spent in 2021\n$217,106.24 was spent in 2020\n \nTitle\n \nTo authorize the Director of Public Utilities to modify, increase and extend the contract through June 30, 2023 with The Ohio State University, Office of Sponsored Programs, for the NPDES Stormwater and Clintonville Blueprint Monitoring Project for the Division of Sewerage and Drainage, Stormwater and Regulatory Management Section, to authorize the expenditure of $360,000.00 from the Storm Sewer Operating Fund.  ($360,000.00)\n \nBody\n \nWHEREAS, the Division of Sewerage and Drainage, Stormwater and Regulatory Management Section entered into a contract with Ohio State University, Office of Sponsored Programs for the purpose of providing professional engineering services for the National Pollutant Discharge Elimination System (NPDES) Stormwater and Clintonville Blueprint Monitoring Project for the Division of Sewerage and Drainage, Stormwater and Regulatory Management Section, and \n \nWHEREAS, the City’s Stormwater National Pollutant Discharge Elimination System (NPDES) permit requires the City to monitor discharges from its municipal separate storm sewer system (MS4) during wet weather events, and\n \nWHEREAS, the results of this project will attempt to characterize the seasonal types and levels of chemical constituents that are discharged from the City’s storm sewer system, and\n \nWHEREAS, this contract covers a seven-year period from March 3, 2016 through and including June 30, 2023.  The parties agree that the City’s obligation for subsequent years is subject to and conditioned upon the approval of City Council, and appropriation and certification of funds by the City Auditor; and \n \nWHEREAS, this ordinance authorizes the expenditure of $360,000.00 or so much thereof as may be needed for this contract, and \n \nWHEREAS, the Department of Public Utilities, Division of Sewerage and Drainage, Stormwater and Regulatory Management Section wishes to modify, increase and extend PO002813 with Ohio State University, Office of Sponsored Programs for the NPDES Stormwater and Clintonville Blueprint Monitoring Project to provide the additional funding necessary for the sixth year of the contract, through and including June 30, 2023, and \n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities, Division of Sewerage and Drainage, Stormwater and Regulatory Management Section, to authorize the Director of Public Utilities to modify, increase and extend the existing agreement with Ohio State University, Office of Sponsored Programs for the NPDES Stormwater and Clintonville Blueprint Monitoring Project; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Utilities be and is hereby authorized to modify, increase and extend contract No. PO002813 with Ohio State University, Office of Sponsored Programs, 1960 Kenny Road, Columbus, OH 43210-1016, for the NPDES Stormwater and Clintonville Blueprint Monitoring Project for the Department of Public Utilities, in accordance with the terms and conditions as shown in the agreement on file in the office of the Division of Sewerage and Drainage, Stormwater and Regulatory Management Section.  Total amount of modification No. 6 is $360,000.00.  Total contract amount including this modification is $1,765,713.72.\n \nSECTION 2.  That the expenditure of $360,000.00 or so much thereof as may be needed, is hereby authorized in Fund 6200 Storm Sewer Operating Fund in object class 03 Services per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 1,
    "absent": 0,
    "meeting_id": 42,
    "meeting_date": "2022-03-28",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSTAIN"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}