{
  "success": true,
  "vote": {
    "id": 3351,
    "item_number": "CA-9",
    "title": "To authorize the Director of Public Service to solely or jointly apply for a Rebuilding American Infrastructure with Sustainability and Equity Program Planning Grant from the United States Department of Transportation; to authorize the execution of grant and other requisite agreements with the United States Department of Transportation and other entities providing for the acceptance and administration of said grant award on behalf of the City of Columbus, Department of Public Service; to authorize the expenditure of any awarded funds and the refund of any unused funds; and to declare an emergency.  ($0.00)",
    "description": "Explanation\n1.  BACKGROUND\nThe United States Department of Transportation (USDOT) has issued a Notice of Funding Opportunity (NOFO) for approximately $1.5 billion in discretionary grant funding through the Rebuilding American Infrastructure with Sustainability and Equity (RAISE) Grant Program.  This is the fourteenth round of funding for the RAISE grant program.  The final NOFO was released on January 27, 2022 and will remain open only through April 14, 2022.\n \nSince 2009, $9.9 billion has been awarded under National Infrastructure Investments for capital investments and planning grants for surface transportation infrastructure over 13 rounds of competitive grants.  Throughout the program, these discretionary grant awards have supported projects that improve safety, economic strength and global competitiveness, equity, and climate and sustainability consistent with DOT’s strategic goals.  FY 2022 RAISE grants continue to align with these strategic goals.  USDOT seeks to fund projects under the RAISE Program that reduce greenhouse gas emissions and are designed with specific elements to address climate change impacts.  USDOT also seeks to award projects under the RAISE Program that address environmental justice, particularly for communities that disproportionally experience climate change-related consequences.  The Department also seeks to award projects under the RAISE Program that proactively address racial equity and barriers to opportunity, including automobile dependence as a form of barrier, or redress prior inequities and barriers to opportunity.  In addition to prioritizing projects that address climate change, proactively address racial equity, and reduce barriers to opportunity, the Department intends to use the RAISE program to support the creation of good-paying jobs with the free and fair choice to join a union and the incorporation of strong labor standards and training and placement programs, especially registered apprenticeships and Local Hire agreements, in project planning stages.\n \nThe City meets the criteria to be eligible to submit a RAISE program planning grant application.  The Department of Public Service is working with the Department of Development, Franklin County Engineer’s Office, the Mid-Ohio Regional Planning Commission (MORPC), and other stakeholders regarding a RAISE program planning grant application to develop a corridor plan for the Williams Road corridor, from Williams Road’s western terminus, near the Scioto River, to its eastern terminus, near Hamilton Road (SR 317).  The precise scope of the application is still being finalized, but it will focus on developing a regionally accepted concept for the entire corridor, as well completing the corridor’s Planning Phase, Preliminary Engineering Phase, Stage 1 Plans, and all required environmental studies and NEPA documentation for the entire Williams Road corridor.  The Department estimates the total planning project cost will be at least $6.25 million, and it intends to request up to 80% of the future eligible project costs (at least $5 million) in RAISE funding from USDOT.\n \nDPS is also working with the Central Ohio Transit Authority, MORPC, and other regional stakeholders to develop a planning grant application for the LinkUS initiative.  MORPC is taking the lead on preparing this application; and, while the precise scope of the application is still being finalized, at least a portion of the application will focus on prioritizing LinkUS projects.  The grant application will also request funding for some preliminary engineering and design work as well.  The Department estimates the total planning project cost will be at least $6.25 million, and MORPC intends to request up to 80% of the future eligible project costs (at least $5 million) in RAISE funding from USDOT.\n \nThis legislation will authorize the Director of Public Service to formally apply for an RAISE program grant as either the lead applicant or joint applicant for Williams Road and the LinkUS initiative.  It also authorizes the City of Columbus to support the LinkUS planning grant application even if the City is not the lead or joint applicant.  It also authorizes the execution of agreements with USDOT, Franklin County Engineer’s Office, MORPC, or others in connection with the application for the grant, the award of the grant, the expenditure of grant funds, and the return of unused grant funds if any should remain at the end of the grant.\n \n2.  FISCAL IMPACT\nRAISE grants may be used for up to eighty percent (80%) of future eligible project costs.  No financial participation is required at this time.  City funds will be approved in the form of design contracts and/or construction contracts that will be or have been submitted for Council's approval.\n \n3.  EMERGENCY DESIGNATION\nEmergency action is requested to provide the Department of Public Service with the authorization to proceed with an application prior to the application period’s end.\n \nTitle\nTo authorize the Director of Public Service to solely or jointly apply for a Rebuilding American Infrastructure with Sustainability and Equity Program Planning Grant from the United States Department of Transportation; to authorize the execution of grant and other requisite agreements with the United States Department of Transportation and other entities providing for the acceptance and administration of said grant award on behalf of the City of Columbus, Department of Public Service; to authorize the expenditure of any awarded funds and the refund of any unused funds; and to declare an emergency.  ($0.00)\n \nBody\nWHEREAS, the United States Department of Transportation (USDOT) announced the fourteenth round of funding for the Rebuilding American Infrastructure with Sustainability and Equity (RAISE) Grant Program, which is a grant program to be awarded on a competitive basis; and\n \nWHEREAS, USDOT is accepting applications for the FY 2022 funding round through April 14, 2022; and \n \nWHEREAS, the City intends to partner with other interested stakeholders, including the Franklin County Engineer’s Office and the Mid-Ohio Regional Planning Commission, to submit a planning grant funding application for the Williams Road corridor, from Williams Road’s western terminus, near the Scioto River, to its eastern terminus, near Hamilton Road (SR 317); and\n \nWHEREAS, the City intends to partner with other interested stakeholders, including the Central Ohio Transit Authority, and the Mid-Ohio Regional Planning Commission, to submit a planning grant funding application for the LinkUS initiative; and\n \nWHEREAS, the interested stakeholders have yet to identify the most appropriate lead applicant and primary award beneficiary, but the City of Columbus will be involved in the application process and the use of the funds if awarded; and\n \nWHEREAS, City Council approval is needed to apply for and accept the grant funding; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to authorize the Director to prepare and submit the aforesaid grant application prior to the end of the application period, for the public health, safety and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Service be and is hereby authorized to solely or jointly submit applications seeking grant funding from USDOT’s RAISE program for both the Williams Road corridor and the LinkUS initiative; to accept said grants, if awarded; and to execute a grant agreement and any other documents necessary to effectuate said applications, acceptance, or agreement on behalf of the Department of Public Service.\n \nSECTION 2.  That the Director of Public Service be and hereby is authorized to execute any agreements or other documents necessary to effectuate the RAISE grant application if a more appropriate lead applicant is identified to submit an application to USDOT concerning the Williams Road corridor or the LinkUS initiative.\n \nSECTION 3.  That the Department of Public Service be and hereby is authorized to expend any awarded grant funds in accordance with the terms and conditions of said grant.\n \nSECTION 4.  That, at the end of the grant period, or upon request of the grantor, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements.\n \nSECTION 5.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 43,
    "meeting_date": "2022-04-04",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}