{
  "success": true,
  "vote": {
    "id": 3377,
    "item_number": "SR-1",
    "title": "To authorize the Director of the Department of Development to enter into a Downtown Office Incentive Agreement with Orveon Global US, LLC for a term of up to five (5) consecutive years in consideration of the company’s proposed capital investment of $1,000,000.00 and creation of 150 net new full-time permanent positions with an estimated payroll of approximately $15,020,000.00 as provided in Columbus City Council Resolution Number 0088X-2007, adopted June 4, 2007.",
    "description": "Explanation\nBACKGROUND:  The Columbus Department of Development is proposing to enter into a City of Columbus Downtown Office Incentive Agreement with Orveon Global US, LLC.\n \nOrveon Global US, LLC (“Orveon”) is a wholesaler and distributor of skin care products and cosmetics that was created in 2021 following private equity firm Advent International's closing of a definitive agreement with Shiseido Americas Corporation. Advent International is headquartered in New York City, New York and has 1,600 employees in 22 countries. Orveon is managed by its sole member bare Minerals US Holdco Inc. which provides contributions to capital to fund the company’s operations when necessary. Orveon consists of the following iconic clean beauty brands: Bare Minerals, Buxom, and Laura Mercier. The company is targeting the City of Columbus market for establishing a corporate office facility. \n \nOrveon is proposing to invest a total project cost of approximately $1,000,000 which includes $200,000 in furniture and fixtures, $150,000 in stand-alone computers, and $650,000 in leasehold improvements to renovate and occupy a vacant office space consisting of approximately 22,000 square-foot space at 343 N. Front Street, Suites 100 and 200 Columbus, OH 43215 parcel #010-039398 (the “Project Site”) in the Arena District. With this investment, Orveon plans to establish a new corporate office and create 150 net new full-time permanent positions with an estimated annual payroll of approximately $15,020,000 at the Project Site.\n \nOrveon is requesting a Downtown Office Incentive from the City of Columbus to assist in the establishment of a new corporate and administrative offices.  \n \nThis legislation is presented as 30-day legislation.\n \nFISCAL IMPACT:  \n \nNo funding is required for this legislation\n \nTitle\nTo authorize the Director of the Department of Development to enter into a Downtown Office Incentive Agreement with Orveon Global US, LLC for a term of up to five (5) consecutive years in consideration of the company’s proposed capital investment of $1,000,000.00 and creation of 150 net new full-time permanent positions with an estimated payroll of approximately $15,020,000.00 as provided in Columbus City Council Resolution Number 0088X-2007, adopted June 4, 2007. \n \nBody\nWHEREAS, the City desires to increase employment opportunities and encourage the creation of new jobs in the City in order to improve the overall economic climate of the City and its citizens; and\n \nWHEREAS, Resolution Number 0088X-2007, adopted June 4, 2007, authorized the Department of Development to establish the Columbus Downtown Office Incentive program as amended; and \n \nWHEREAS, the Department of Development received a completed application for the Columbus Downtown Office Incentive program from Orveon Global US, LLC; and \n \nWHEREAS, Orveon Global US, LLC is proposing to invest a total project cost of approximately $1,000,000 which includes $200,000 in furniture and fixtures, $150,000 in stand-alone computers, and $650,000 in leasehold improvements to renovate and occupy a vacant office space consisting of approximately 22,000 square-foot space at 343 N. Front Street, Suites 100 and 200 Columbus, OH 43215 parcel #010-039398 (the “Project Site”); and \n \nWHEREAS, Orveon Global US, LLC will create 150 net new full-time permanent positions with an estimated associated annual payroll of approximately $15,020,000 at the proposed project site; and\n \nWHEREAS, Orveon Global US, LLC has indicated that a Downtown Office Incentive is crucial to its decision to establish administrative operations within the City of Columbus; and\n \nWHEREAS, the City of Columbus desires to facilitate the future growth of Orveon Global US, LLC at the project site by providing a Downtown Office Incentive; and NOW THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     That the Director of the Department of Development is hereby authorized to enter into a Downtown Office Incentive Agreement with Orveon Global US, LLC equal to (i) fifty percent (50%) of the City of Columbus income tax withheld on the Columbus payroll of new employees for a term of up to five (5) consecutive years on the estimated job creation of 150 net new full-time permanent positions to be located at 343 N. Front Street, Suites 100 and 200 Columbus, Ohio 43215.\n \nSECTION 2.                     Each year of the term of the agreement with Orveon Global US, LLC the City’s obligation to pay the incentive is expressly contingent upon the passage of an ordinance appropriating and authorizing the expenditure of monies sufficient to make such payment and the certification of the City Auditor pursuant to Section 159 of the Columbus City Charter.\n \nSECTION 3.                     That the City of Columbus Downtown Office Incentive Agreement is signed by Orveon Global US, LLC within 90 days of passage of this ordinance, or this ordinance and the credit herein shall be null and void.\n \nSECTION 4.                     The City Council hereby extends authority to the Director of the Department of Development to amend Orveon Global US, LLC City of Columbus Downtown Office Incentive Agreement for certain modifications to the agreement requested in writing by the company and or the City and deemed appropriate by the Director of Development with these certain modifications being specifically limited to reductions in length of term, methods of calculating the incentive, or adding or deleting business entities associated with the employment commitments related to this incentive. All other requested amendments must be approved by City Council.\n \nSECTION 5.                     That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 43,
    "meeting_date": "2022-04-04",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Economic Development"
    ]
  }
}