{
  "success": true,
  "vote": {
    "id": 3390,
    "item_number": "SR-14",
    "title": "To amend Section 377.02 of the Columbus City Codes to authorize the Wage Theft Prevention and Enforcement Commission to hear and determine whether an adverse determination should issue for a breach of any contractual obligation to the City to assume the obligations of any provision of Chapter 377.",
    "description": "Explanation\nBACKGROUND:  On September 21, 2020, City Council passed Ordinance 1802-2020, creating Columbus City Codes --Chapter 377, Wage Theft Prevention and Enforcement.  This new chapter set forth various provisions designed to ensure that entities who commit wage theft or payroll fraud do not benefit from contracts with the City of Columbus.  \nThe provisions of Chapter 377 extend to all persons who constitute a “covered entity” as defined under the code who enter into contract for the provision of goods/services or who enter into a financial incentive agreement with the City.  However, from time to time, the City has occasion to enter into such contracts or agreements with entities that do not constitute a covered entity under the code but who nonetheless have agreed to be bound by the provisions of Chapter 377.  This amendment authorizes the Wage Theft Prevention and Enforcement Commission to hear and determine whether an adverse determination should issue for entities who have contractually agreed to subject themselves to the jurisdiction of the Commission. \nFISCAL IMPACT:  No funding is required for this legislation.\nTitle\nTo amend Section 377.02 of the Columbus City Codes to authorize the Wage Theft Prevention and Enforcement Commission to hear and determine whether an adverse determination should issue for a breach of any contractual obligation to the City to assume the obligations of any provision of Chapter 377. \nBody\nWHEREAS, on September 21, 2020, City Council passed Ordinance 1802-2020, creating Columbus City Code Chapter 377, Wage Theft Prevention and Enforcement; and\nWHEREAS, The provisions of Chapter 377 extend to all persons who constitute a “covered entity” as defined under the code who enter into contract for the provision of goods/services or who enter into a financial incentive agreement with the City; and\nWHEREAS, Section 377.02 sets forth the duties and jurisdiction of the Wage Theft Prevention and Enforcement Commission; and \nWHEREAS, the City has occasion to enter into contracts or agreements with entities that do not constitute a covered entity under the code but who nonetheless have agreed to be bound by the provisions of Chapter 377; and\nWHEREAS, it is in the best interests of the City of Columbus to amend Section 377.02 to expand the jurisdiction of the Wage Theft Prevention and Enforcement Commission to include the ability to hear and determine whether an adverse determination should issue for a breach of such contractual terms; NOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1. That Section 377.02 of the Columbus City Codes is hereby amended as follows:\n377.02 Wage Theft Prevention and Enforcement Commission\n(a)                     There is hereby created the Wage Theft Prevention and Enforcement Commission, the duties and powers of which shall include hearing and determining whether an adverse determination should issue for a violation of section 377.03, 377.04, 377.05, 377.06, 377.07, 377.08, 377.09, or 377.10 of the city code or for a breach of any contractual obligation to the City to assume the obligations of any provisions within this Chapter; recommending to the City Attorney penalties and remedies for a finding of non-compliance with section 377.03, 377.04, 377.05, 377.06, 377.07, 377.08, 377.09, or 377.10 of the city code; approving settlement agreements to settle or compromise alleged violations of sections 377.03, 377.05, 377.06, 377.07, 377.08, 377.09, and 377.10 of the city code where the covered entity has taken reasonable action to cure, remedy, or correct the action which formed the basis for the alleged violation; approving staff resolutions alleging non-compliance with sections 377.03, 377.04, 377.05, 377.06, 377.07, 377.08, 377.09, or 377.10 of the city code; receiving complaints from residents, workers, and businesses regarding non-compliance with sections 377.03, 377.04, 377.05, 377.06, 377.07, 377.08, 377.09, and 377.10 of the city code; publishing and updating the adverse determination list; hearing and determining whether to grant a waiver or other relief pursuant to section 377.02(o)-(r) of the city code to a person with an adverse determination under section 377.01(a)(1)(A); and participating in community education programs. \n(b)                     The Commission shall be composed of five (5) members. Upon appointment to the Commission, members shall serve for a term not exceeding three years, subject to 377.02(d) of this section. Members may be reappointed to a new three year terms at the conclusion of their term. \n(c)                     Of the five (5) members comprising the Commission, two (2) members shall be appointed by the Mayor, two (2) members shall be appointed by Council, and the fifth member shall be appointed by the Commission with the advice and consent of the Mayor and Council. All member appointments shall be subject to a vote by Council, with a majority in the affirmative required for appointment. \n(d)                     The initial appointments to the Wage Theft Prevention and Enforcement Commission shall occur no later than April 1, 2021, and the terms for the initial appointments shall vary to provide for staggered terms: \n(1)                     Two (2) members shall be appointed for a term not exceeding two years; \n(2)                     Three (3) members shall be appointed for a term not exceeding three years; \n(3)                     As provided in section 377.02(b), upon expiration of their initial term, any member may be reappointed to a new term not to exceed three years. \n(e)                     The Commission shall hold public meetings, the intervals between which shall not exceed sixty (60) days. Records of all proceedings shall be maintained and open to the public. \n(f)                     The Commission shall receive staff support, to be provisioned by the Department of Finance, equivalent to no less than one (1) full-time employee. \n(g)                     Upon receipt of a complaint alleging that a covered entity has violated section 377.03, 377.04, 377.05, 377.06, 377.07, 377.08, 377.09, or 377.10 of the city code, Commission staff shall conduct an investigation to determine if a violation has occurred. \n(1)                     During the course of the investigation, Commission staff may work with a covered entity to attempt to cure or compromise any alleged violation of section 377.03, 377.05, 377.06, 377.07, 377.08, 377.09, or 377.10 of the city code so as to reach a settlement agreement to resolve the matter. If so reached, Commission staff shall present the proposed settlement agreement to the Commission for approval and, if approved by the Commission, no adverse determination shall be made based upon the allegation. Notwithstanding anything in this Chapter to the contrary, the Wage Theft Prevention and Enforcement Commission has the authority to settle any alleged violation of section 377.03, 377.05, 377.06, 377.07, 377.08, 377.09, 377.10 prior to a final determination by the Wage Theft Prevention and Enforcement Commission upon a hearing that a violation has occurred. \n(2)                     Where there are reasonable grounds to believe that a violation has occurred and either a settlement agreement has not been reached or the allegation pertains to a violation of section 377.04, the matter shall be submitted to the Commission for a hearing to determine if a violation has occurred. \n(3)                     The covered entity shall be notified by Commission staff of a pending investigation where it is determined that there are reasonable grounds to believe that a violation has occurred. Commission staff shall provide a covered entity with notice that it may submit information to the Commission staff relevant to whether the covered entity has violated this Chapter. \n(h)                     If the Commission staff determines, based upon its investigation and after reviewing any information provided by the covered entity, that there are reasonable grounds to believe that a violation of section 377.03, 377.04, 377.05, 377.06, 377.07, 377.08, 377.09 or 377.10 has occurred, a hearing on the alleged violation shall be conducted by the Commission at a meeting open to the public. \n(1)                     The Commission shall provide the covered entity with notice of the hearing and a description of the subject(s) of the investigation at least thirty (30) days in advance of the public hearing. \n(2)                     The Commission shall provide the covered entity with an opportunity to submit documents, present information, call, examine, and cross examine witnesses, and be heard by the Commission during the public hearing and prior to a vote. \n(3)                     The Commission shall determine, based on all of the information presented, if a violation of section 377.03, 377.04, 377.05, 377.06, 377.07, 377.08, 377.09 or 377.10 of the city code has occurred. \n(1)                     A majority vote by the Commission finding a violation shall result in finding of an adverse determination. \n(2)                     A covered entity may appeal to the Franklin County Court of Common Pleas pursuant to the procedures and requirements set forth in Ohio Revised Code Chapter 2506 or any successor thereto. \n(i)                     The Commission shall provide written notice of its findings of facts and conclusions of law and any recommended penalties and remedies for any adverse determination based on a violation of section 377.03, 377.04, 377.05, 377.06, 377.07, 377.08, 377.09 or 377.10 of the city code. \n(j)                     The Commission shall publish and update the adverse determination list at least once every sixty days. \n(k)                     The Commission may receive complaints from residents, workers and businesses regarding non-compliance with sections 377.03, 377.04, 377.05, 377.06, 377.07, 377.08, 377.09 and 377.10 of the city code investigation. \n(l)                     The Commission may contract with a qualified non-for-profit organization to assist with investigations and education programs. \n(m)                     The Commission shall issue a report annually to Council on its activities and whether it recommends the reduction or revocation of any financial incentives defined in this chapter due to violations of Chapter 377. \n(n)                     A member of the Commission may be removed by a majority vote of the rest of the members for inefficiency, neglect of duty, or malfeasance in office. Such a vote shall only be taken after the member is provided a copy of the charges and an opportunity to be heard in person or by defense counsel. \n(o)                     A covered entity, or any person that reasonably believes it may become a covered entity, may request a waiver from the Commission for an adverse determination which would result in its placement on the adverse determination list. A covered entity shall submit any such waiver request in writing in a manner and form prescribed by the Commission and shall include one or more of the following bases for the grant of said waiver: \n(1)                     There has been a bona fide change in ownership of the covered entity or an affiliate since the adverse determination occurred; \n(2)                     The covered entity or an affiliate of the covered entity has taken significant and verifiable remedial actions to prevent any future adverse determinations from occurring and has complied with the requirements of the determination forming the basis of the adverse determination, including, as applicable satisfaction of the reporting obligation under this Chapter, providing the Commission with documents and information required by this Chapter, and the payment of required back pay, interest, penalties, and fines; and \n(3)                     Other factors that the covered entity believes is relevant to the granting of a waiver. \n(p)                     The Commission shall consider all information submitted by a covered entity or person under 377.02 (o)(1)-(3) and may request additional information from a covered entity or person to determine whether to grant a waiver. \n(q)                     The Commission may grant a waiver to a covered entity or person under 377.02 (o)-(p) by removing a covered entity or person from the 377.02 (j) list, reducing the time period a covered entity or person is on the adverse determination list, or allowing a covered entity or person a one-time waiver to enter into a financial incentive agreement with the City, receive a financial incentive provided by the City, enter into a City contract for goods or services, enter into a construction contract pursuant to, related to, or in furtherance of a financial incentive agreement, enter into an agreement to provide janitorial, maintenance, repair, property management, or landscaping services at a development location covered by a financial incentive agreement, or enter into an agreement with a covered entity to perform work or services pursuant to or in satisfaction of a City contract for services. \n(r)                     A supermajority vote of the Commission shall be required to grant a waiver to a covered entity under 377.02 (o)-(q). \n(s)                     If the Commission, in the course of performing its duties, discovers evidence or receives a complaint that a person has committed wage theft or payroll fraud, the Commission may refer the matter to the United States Department of Labor, the Ohio Department of Commerce, or any other appropriate entity for further investigation. \n(t)                     A City Department may request a waiver from the Commission on behalf of a covered entity that has an adverse determination which would result in its placement on the adverse determination list. The Commission may grant the waiver if the City Department demonstrates that the inability of the City Department to contract with said covered entity would result in serious disruption to the efficient and orderly operations of the City or the covered entity is a sole source provider of goods or services that are necessary for the efficient and orderly operations of the City. \nSECTION 2. That the existing Section 377.02 of the Columbus City Codes is hereby repealed.\nSECTION 3.  That this Ordinance shall take effect and be in force from the earliest date allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 43,
    "meeting_date": "2022-04-04",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements"
    ]
  }
}