{
  "success": true,
  "vote": {
    "id": 3427,
    "item_number": "CA-24",
    "title": "To amend the 2021 Capital Improvement budget; to transfer appropriation within the Streets and Highways Bond Fund; to authorize the Director of Public Service to enter into contract with G & G Concrete Construction, LLC for the UIRF- Far South Engineering 2017 project; to authorize the expenditure of up to $848,802.82 from the Streets and Highways Bond Fund for the project; and to declare an emergency. ($848,802.82)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Service to enter into contract with G & G Concrete Construction, LLC for the UIRF- Far South Engineering 2017 project and to provide payment for construction, construction administration and inspection services.  \n \nThis contract includes the installation of sidewalks and other improvements at three locations.  The first location will install sidewalk on the east side of Wilson Avenue from Marion Franklin Community Center to Koebel Avenue; the second location will install sidewalk on the north side of Williams Road from east of High Street to Parsons Avenue; the third location will install a stormwater bioswale on High Street in front of Great Southern Shopping center and other work as may be necessary to complete the contract in accordance with the plans and specifications set forth in the Bid Submittal Documents.\n \nThe estimated Notice to Proceed date is May 6, 2022.  The project was let by the Office of Support Services through Vendor Services and Bid Express.  Three bids were received on December 21, 2021, (two Majority, one Women Business Enterprise) and tabulated as follows:   \n      \nCompany Name                                                      Bid Amount               City/State                                          Majority/MBE/FBE     \nG & G Concrete Construction, LLC       $771,638.92                     Columbus, Ohio                     MAJ\nDecker Construction Company                            $1,043,639.39                     Columbus, Ohio                     MAJ\nFacemyer Company                            $1,281,298.90                     Sunbury, Ohio                     WBE\n \nAward is to be made to G & G Concrete Construction, LLC as the lowest responsive and responsible and best bidder for their bid of $771,638.92.  The amount of construction administration and inspection services will be $77,163.90.  The total legislated amount is $848,802.82. \n \nSearches in the System for Award Management (Federal) and the Findings for Recovery list (State) produced no findings against G & G Concrete Construction, LLC.\n \n2. CONTRACT COMPLIANCE INFORMATION\nThe contract compliance number for G & G Concrete Construction, LLC is CC023297 and expires 1/3/24.\n \n3. PRE-QUALIFICATION STATUS\nG & G Concrete Construction, LLC and all proposed subcontractors have met code requirements with respect to pre-qualification, pursuant to relevant sections of Columbus City Code Chapter 329.\n \n4.  FISCAL IMPACT\nFunds in the amount of $848,802.82 are available within the Streets and Highways Bonds Fund, Fund 7704. A transfer of appropriation in the amount of $42,485.56 within the Streets and Highways Bonds Fund, Fund 7704 is necessary.  An amendment to the 2021 Capital Improvement Budget is required to establish sufficient budget authority for the project. Funds are appropriated.\n5. EMERGENCY DESIGNATION\nEmergency action is requested in order to complete needed improvements at the earliest possible time to ensure the safety of the traveling public.\nTitle\nTo amend the 2021 Capital Improvement budget; to transfer appropriation within the Streets and Highways Bond Fund; to authorize the Director of Public Service to enter into contract with G & G Concrete Construction, LLC for the UIRF- Far South Engineering 2017 project; to authorize the expenditure of up to $848,802.82 from the Streets and Highways Bond Fund for the project; and to declare an emergency. ($848,802.82)\n \nBody\nWHEREAS, the Department of Public Service is engaged in the UIRF- Far South Engineering 2017 project; and  \n \nWHEREAS, the work for this project consists of the installation of sidewalks and other improvements at three locations.  The first location will install sidewalk on the east side of Wilson Avenue from Marion Franklin Community Center to Koebel Avenue; the second location will install sidewalk on the north side of Williams Road from east of High Street to Parsons Avenue; the third location will install a stormwater bioswale on High Street in front of Great Southern Shopping center and other work as may be necessary to complete the contract in accordance with the plans and specifications set forth in the Bid Submittal Documents; and\n \nWHEREAS, G & G Concrete Construction, LLC will be awarded the contract for the UIRF- Far South Engineering 2017 project; and \n \nWHEREAS, the Department of Public Service requires funding to be available for the UIRF- Far South Engineering 2017 project for construction expense along with construction administration and inspection services; and\n \nWHEREAS, it is necessary to amend the 2021 Capital Improvement Budget to establish authority within the correct project; and \n \nWHEREAS, a transfer of appropriation within the Streets and Highways Bond Fund, Fund 7704, is necessary; and \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to enter into contract with G & G Concrete Construction, LLC to ensure the safety of the traveling public, thereby preserving the public health, peace, property, safety and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the 2021 Capital Improvements Budget authorized by ordinance 2707-2021 be amended as follows to establish  sufficient authority for this project:\n \nFund / Project  / Project Name / Current  / Change /C.I.B. as Amended\n7704 / P440005-100000 / UIRF- Urban Infrastructure Recovery Fund (Voted Carryover) / $740,583.00 / $168,015.00 / $908,598.00 (to match cash)\n \n7704 / P440005-100000 / UIRF- Urban Infrastructure Recovery Fund (Voted Carryover) / $908,598.00/ ($848,803.00) / $59,795.00\n \n7704 / P4400005-100071 / UIRF- Far South Engineering 2017 (Voted Carryover) / $0.00 / ($848,803.00) / $848,803.00\n \nSECTION 2.  That the transfer of $42,485.56 in appropriation, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5911 (Infrastructure Management), Project P440005-100071 (UIRF- Far South Engineering 2017), Object Class 06 (Capital Outlay) to Dept-Div 5912 (Design and Construction), Project P440005-100071 (UIRF- Far South Engineering 2017), Object Class 06 (Capital Outlay) between projects per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That the Director of Public Service be and is hereby authorized to enter into a construction services contract with G&G Concrete Construction LLC., 2849 Switzer Avenue, Columbus Ohio 43219, for the UIRF- Far South Engineering 2017 project in the amount of up to $771,638.92 in accordance with the specifications and plans on file in the Office of Support Services, which are hereby approved; and to pay for necessary construction administration and inspection costs associated with the project up to a maximum of $77,163.90.\n \nSECTION 4.  That the expenditure of $848,802.82, or so much thereof as may be needed, is hereby authorized in Fund 7704 (Streets and Highways Bond Fund), Dept-Div 5912 (Design and Construction), Project P440005-100071 (UIRF- Far South Engineering 2017), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 5.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 7.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 8.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 44,
    "meeting_date": "2022-04-18",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}