{
  "success": true,
  "vote": {
    "id": 344,
    "item_number": "CA-31",
    "title": "To authorize the appropriation and expenditure of up to $65,500.00 from the East Main Street SID fund; authorize the Director of Development to enter into a contract with the East Main Street Special Improvement District in an amount up to $65,500.00; and to declare an emergency. ($65,500.00)",
    "description": "Explanation\nBACKGROUND: This legislation authorizes the appropriation and expenditure of up to $65,500.00 and the Director of Development to enter into a contract with the East Main Street Special Improvement District in an amount up to $65,500.00.\n \nChapter 1710 of the Ohio Revised Code, effective September 29, 1994 provides for the creation of Special Improvement Districts (SIDs) by non-profit corporations governed by trustees elected by the property owners for the provision of special services in a designated district. \n \nIn 2017, a petition to create a new SID was approved by Columbus City Council. The property owners initiated a petition process in which the owners of at least 60% of the front footage of all real property located within in the East Main Street area between Bexley and Whitehall acknowledge that they are interested in the creation of a Special Improvement District and they approve of the Plan for Improvements and Services to be provided by the East Main Street SID. This petition was accepted and approved by Columbus City Council by Ordinance 0765-2017, passed March 27, 2017. \n \nAnother action required by the Ohio Revised Code is the approval of the Plan for Improvements and Services in said plan. This legislation was approved by Columbus City Council by Resolution No. 0071X-2017, passed April 3, 2017. \n \nThe third piece of legislation was to declare the necessity to implement the Plan of Services adopted by the East Main Street SID, and to levy a special assessment for the services. This legislation was approved by Columbus City Council by Resolution No. 0147X-2017, passed May 15, 2017. \n \nA final piece of legislation, providing for the levy of assessment to property owners, was approved by City Council by Ordinance No. 1608-2017, passed July 10, 2017. Each assessment is to be returned to the SID for operational requirements as set forth in the District Plan.\n \nThis legislation disburses assessments to be collected in fiscal year 2021 to be returned to the SID. \n \nEmergency action is requested to continue services without interruption.\n \nFISCAL IMPACT: Funds for this expenditure will be received from the levy of assessments to be collected from property owners in the East Main Street Special Improvement District. These funds are deposited into and expended from the East Main Street SID fund (fund 3313).\n \nCONTRACT COMPLIANCE:  The vendor’s vendor number is 025514.  Contractor Compliance is pending.\n \nTitle\nTo authorize the appropriation and expenditure of up to $65,500.00 from the East Main Street SID fund; authorize the Director of Development to enter into a contract with the East Main Street Special Improvement District in an amount up to $65,500.00; and to declare an emergency. ($65,500.00)\n \nBody\nWHEREAS, City Council approved the creation and implementation of a plan for services for the East Main Street Special Improvement District for a period of 5 years from January 1, 2018, through December 31, 2022; and\n \nWHEREAS, City Council has also levied assessments in accordance with the Ohio Revised Code, Chapter 1710 for such purposes, which funds are in the process of collection and are required by law to be distributed to the District by the City; and\n \nWHEREAS, the assessment funds collected by the County and forwarded to the City for disbursement will be available in March and September 2021; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development, Economic Development Division, in that it is immediately necessary to appropriate and expend said funds to allow for continuation of services without interruption, thereby preserving the public health, peace, property, safety, and welfare; and NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSection 1. That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2021, the sum of $65,500.00 is appropriated in Fund 3313 (East Main St SID), Dept-Div 44-02 (Economic Development), in object class 05 (Other)\n \nSection 2. That the expenditure of $65,500.00 or so much thereof as may be needed, is hereby authorized in Fund 3313 (East Main St SID), Dept-Div 44-02 (Economic Development) in object class 05 (Other) per the accounting codes in the attachment to this ordinance.\n \nSection 3.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 4.                     That the Director of Development is hereby authorized to enter into a contract with the East Main Street Special Improvement District for an amount up to $65,500.00.\n \nSection 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.                     That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 6,
    "meeting_date": "2021-03-01",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}