{
  "success": true,
  "vote": {
    "id": 3444,
    "item_number": "CA-41",
    "title": "To authorize the Director of Public Utilities to enter into a contract modification with General Temperature Control, Inc. for boiler maintenance services at various Department of Public Utilities, Division of Sewerage and Drainage facilities; to authorize the expenditure of $60,000.00 from the Sewer Operating Sanitary Fund; and to declare an emergency. ($60,000.00)",
    "description": "Explanation\n \nThis legislation authorizes the Director of Public Utilities to enter into a contract modification with General Temperature Control, Inc. for boiler maintenance services for the Southerly Wastewater Treatment Plant, Jackson Pike Wastewater Treatment Plant, and Sewer Maintenance Operations Center. Other Department facilities may be added in the future. The work under this contract mainly concerns boilers and their associated equipment and systems that require inspection, testing, troubleshooting, chemical addition and balancing, maintenance, and repair or replacement of failed components. The work may also include updating software and firmware for the various boiler system heating units or any boiler-associated equipment. Fees for state inspections are also considered part of the boiler system and therefore under the scope of the contract work.\n \nThe Department of Public Utilities (DPU) solicited competitive bids for the services in accordance with the relevant provisions of Chapter 329 of City Code (RFQ006735). Six hundred ninety-one (691) vendors were solicited. One (1) bid was received, on October 4, 2017. General Temperature Control, Inc. was determined to be the lowest, responsive, responsible and best bidder.\n \nThe original contract was for one (1) year to and including January 22, 2019. The contract language permits the Department of Public Utilities to renew the contract for three (3) additional years based upon mutual agreement of the parties, availability of budgeted funds, and approval of City Council. If unforeseen issues or difficulties are encountered that would require additional funding, a modification would be requested. \n \nThis proposed modification #3 is for the third and last renewal, being the unplanned fifth year of the contract in response to unforeseen issues in advertising new bids. The modification will extend the contract through September 30, 2022 \n \n1. Amount of additional funds:  The total amount of additional funds needed for this modification #3 is $60,000.00. Total contract amount including this modification is $1,689,999.00.\n \n2. Reason additional funds were not foreseen:  The additional unplanned year of the contract is due to unforeseen issues advertising new bids.\n \n3. Reason other procurement processes not used:  Work under this modification is a continuation of services included in the scope of the original bid contract. No lower pricing/more attractive terms and conditions are anticipated at this time.\n \n4. How was cost determined:  The cost, terms and conditions are in accordance with the original agreement.\n \nSUPPLIER:  \n \nGeneral Temperature Control, Inc. federal EIN 31-1201236, D365 Vendor #004830, expires 09/30/2022. General Temperature Control, Inc. does not hold MBE/WBE status.  \n \nThe company is not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.\n \nFISCAL IMPACT:  \n \n$60,000.00 is budgeted and needed for this modification.  \n \n$83,430.75 has been spent in 2022\n$244,504.81 was spent in 2021\n$497,575.08 was spent in 2020\n \nEMERGENCY DESIGNATION: \n \nThis ordinance is being submitted as an emergency in order to avoid a lapse in critical boiler maintenance services at various DPU, DOSD facilities. The requisite services were intended to be bid out this year but a temporary delay in advertising bids has prevented the contract process from moving forward.\n \n \nTitle\n \nTo authorize the Director of Public Utilities to enter into a contract modification with General Temperature Control, Inc. for boiler maintenance services at various Department of Public Utilities, Division of Sewerage and Drainage facilities; to authorize the expenditure of $60,000.00 from the Sewer Operating Sanitary Fund; and to declare an emergency. ($60,000.00)\n \n \nBody\n \nWHEREAS, there is a need for boiler maintenance services at various Department of Public Utilities, Division of Sewerage and Drainage facilities, specifically at the Southerly Wastewater Treatment Plant, Jackson Pike Wastewater Treatment Plant, and Sewer Maintenance Operations Center, and other department sites may be added in the future; and\n \nWHEREAS, the Department of Public Utilities solicited competitive bids for the services in accordance with the provisions of Chapter 329 of City Code; and\n \nWHEREAS, one (1) bid was received and opened on October 4, 2017; and\n \nWHEREAS, the Division of Sewerage and Drainage recommended that an award be made to the lowest, responsive, and best bidder, General Temperature Control, Inc.; and\n \nWHEREAS, the original contract was established for a period of one (1) year to and including January 22, 2019, and the contract language permits the Department of Public Utilities to renew the contract for three (3) additional years based upon mutual agreement of the parties, availability of budgeted funds, and approval of City Council; and\n \nWHEREAS, if unforeseen issues or difficulties are encountered that would require additional funding, a modification would be requested; and\n \nWHEREAS, the Department of Public Utilities intended to bid out this contract at the end of the third renewal but a temporary delay in advertising bids has prevented the contract process from moving forward.\n \nWHEREAS, the Department now wishes to modify the contract with General Temperature Control, Inc. to extend the contract and provide the necessary funding for boiler maintenance services through September 30, 2022; and\n \nWHEREAS, the expenditure of $60,000.00 or so much thereof as may be needed, is hereby authorized in Fund 6100, Sewer Operating Sanitary Fund, in object class 03, Services, per the accounting codes in the attachment to this ordinance; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Utilities, Division of Sewerage and Drainage in that it is immediately necessary to authorize the Director of Public Utilities to modify its contract for boiler maintenance services with General Temperature Control, Inc.,  in order to avoid a lapse in critical boiler maintenance services at various DPU, DOSD facilities, for the immediate preservation of the public health, peace, property and safety; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Utilities is hereby authorized to modify and increase Contract No. PO267683 with General Temperature Control, Inc., 970 West Walnut Street, Canal Winchester, Ohio 43110, for boiler maintenance services at various Division of Sewerage and Drainage facilities. Total amount of Modification No. 3 is ADD $60,000.00. Total contract amount including this modification is $1,689,999.00.  \n \nSECTION 2.  That this modification is in accordance with the relevant provisions of Chapter 329 of City Code relating to contract modifications.\n \nSECTION 3.  That the expenditure of $60,000.00 or so much thereof as may be needed, is hereby authorized in Fund 6100, Sewer Operating Sanitary Fund, in object class 03, Services, per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure, and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 44,
    "meeting_date": "2022-04-18",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}