{
  "success": true,
  "vote": {
    "id": 351,
    "item_number": "SR-4",
    "title": "To amend the 2020 Capital Improvement Budget; to authorize the Director of Finance and Management to enter into a contract on behalf of the Office of Construction Management with Farber Corporation for HVAC System phase one renovations at the Central Safety Building; to authorize the transfer of $1,264,000.00 between projects within the Construction Management Capital Improvement Fund; to authorize the expenditure of $1,264,000.00 from the Construction Management Capital Improvement Fund; and to declare an emergency. ($1,264,000.00)",
    "description": "Explanation\nBACKGROUND:  This legislation authorizes the Finance and Management Director to enter into a contract on behalf of the Office of Construction Management with Farber Corporation for renovation of the direct digital controls for the HVAC System phase one at the Central Safety Building facility located at 120 Marconi Boulevard. \nPhase one of the HVAC renovation will include replacing all heating coil and radiant panel control valves, damper actuators, outside air dampers, variable frequency drives for motor control, air handler sensors, and provide a complete replacement of the buildings Direct Digital Control system. The Direct Digital Control system will incorporate a new JACE (Java Application Control Engine), actuators, thermostats, humidistats, and electrical wiring.\nFormal bids were solicited and the City received two (2) bids (0 FBE, 0 MBE) on December 22, 2020 as follows:\n                                                                                                                                        \nCompany                                                                                    City                                                               AS1/FBE/MBE                     \nFarber Corporation                                                                Columbus                                          EBOCC                                          \nGeneral Temperature Control                                          Columbus                                          EBOCC\n \nFarber Corporation submitted the lowest bid of $1,264,000.00. The Office of Construction Management recommends the bid award be made to the lowest responsive and responsible bidder Farber Corporation.\n \nFarber Corporation Contract Compliance No. 31-0746886, expiration date November 24, 2022. \n \nEmergency action is requested so that necessary upgrades at Central Safety Building can begin as quickly as possible to ensure that the HVAC renovations can be completed quickly.\n \nFiscal Impact: This ordinance authorizes the expenditure of $1,264,000.00 from the Construction Management Capital Improvement Fund with Farber Corporation for the HVAC system phase one controls renovation at the Central Safety Building located at 120 Marconi Boulevard. This legislation is contingent on bond sale proceed deposits.\n \nTitle\nTo amend the 2020 Capital Improvement Budget; to authorize the Director of Finance and Management to enter into a contract on behalf of the Office of Construction Management with Farber Corporation for HVAC System phase one renovations at the Central Safety Building; to authorize the transfer of $1,264,000.00 between projects within the Construction Management Capital Improvement Fund; to authorize the expenditure of $1,264,000.00 from the Construction Management Capital Improvement Fund; and to declare an emergency. ($1,264,000.00)\n \nBody\nWHEREAS, it is necessary to amend the 2020 Capital Improvement Budget and to authorize transfers between projects within the Construction Management Capital Improvement Fund; and\n \nWHEREAS, the Finance and Management Department, Office of Construction Management desires to enter into a contract for renovation of the HVAC system direct digital controls at the Central Safety Building.\n \nWHEREAS, formal bids were solicited by the Office of Construction Management and the City received two bids on December 22, 2020; and\n \nWHEREAS, Farber Corporation was deemed the lowest, responsive, and responsible bidder; and\n \nWHEREAS, it is necessary to authorize the expenditure of $1,264,000.00 from the Construction Management Capital Improvement Fund; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Finance and Management, Office of Construction Management, in that it is immediately necessary to authorize the Director of Finance and Management to enter into a contract with Farber Corporation for renovation of the HVAC direct digital controls at the Central Safety Building, so that these necessary upgrades can be implemented as soon as possible, thereby, preserving the public health, peace, property, safety and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Finance and Management Director is hereby authorized to enter into a contract on behalf of the Office of Construction Management with Farber Corporation for renovation of the HVAC direct digital controls at the Central Safety Building facility located at 120 Marconi Boulevard. \nSECTION 2. That the 2020 Capital Improvement Budget be amended as follows:\nFund/Project Name / Project Number / Current Authority/ Revised Authority/ Difference\n7733/Facility Renovation Various (Councilmanic SIT Supported)/570030-100120/$3,521,918/$2,257,918/($1,264,000)\n7733/Central Safety Building HVAC - Reno (Councilmanic SIT Supported)/570099-100000/$867,982/$2,131,982/$1,264,000.00\nSECTION 3. That the transfer of $1,264,000.00, is hereby authorized in the Construction Management Capital Improvement Fund 7733, in Object Class 06 - Capital Outlay, per the accounting codes in the attachment to this ordinance.  \n \nSECTION 4. That the expenditure of $1,264,000.00, or so much thereof that may be necessary in regards to the action authorized in SECTION 1, is hereby authorized in the Construction Management Capital Improvement Fund 7733, in Object Class 06 - Capital Outlay, per the accounting codes in the attachment to this ordinance.  \n \nSECTION 5. That the monies in the foregoing Sections shall be paid upon order of the Director of Finance and Management, and that no order shall be drawn or money paid except by voucher, the form of which shall be approved by the City Auditor.\n \nSECTION 6. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 7.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 8. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 9.   For the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten (10) days after its passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 6,
    "meeting_date": "2021-03-01",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}