{
  "success": true,
  "vote": {
    "id": 3524,
    "item_number": "CA-5",
    "title": "To authorize the Director of the Department of Technology to renew a contract with Digital Information Services for Red Hat Linux licenses, Red Hat learning subscriptions, and Red Hat runtimes (JBoss); and to authorize the expenditure of $140,313.00 from the Department of Technology, Information Services Division, Information Services Operating Fund. ($140,313.00)",
    "description": "Explanation\n \nThis ordinance authorizes the Director of the Department of Technology (DoT) to renew a contract with Digital Information Services (Remit: dba Computer Intelligence Association) for Red Hat Linux licenses, Red Hat learning subscriptions and Red Hat runtimes (JBoss) in the amount of $140,313.00, for the coverage term period from July 1, 2022 through June 30, 2023.\n \nDoT utilizes Red Hat Linux on multiple operating systems, on which many of the city's critical applications reside. As such, maintenance and support is required. On May 24, 2019, the Department of Technology (DoT), received seven (7) bids in response to RFQ012308 for the purchase of Red Hat Linux licenses, Red Hat learning subscriptions and Red Hat runtimes (JBoss). Following a review of the submissions, it was recommended that Digital Information Services (Remit: dba Computer Intelligence Association) be awarded the contract.  The initial contract was authorized with the passage of Ordinance No. 1617-2019, passed by the Columbus City Council on June 24, 2019. The initial contract was for one year (from July 1, 2019 through June 30, 2020) with four (4) additional one-year terms subject to mutual agreement and approval of proper City authorities.  The first renewal was authorized with passage of Ordinance 1361-2020. This contract was most recently renewed and authorized with the passage of Ordinance No. 0996-2021, passed by the Columbus City Council on May 17, 2021.  This ordinance authorizes the third of the four (4) allowable renewal options.   \n \nFISCAL IMPACT\nIn fiscal year 2020 and 2021, the Department of Technology expended $140,313.00, respectively for both years, for the above-described purchases.  The total 2022 cost for maintenance and support through this ordinance is $140,313.00. The funds for this expenditure have been identified and are available within the Department of Technology, Information Services Division, Information Services Operating Fund. \n \nOriginal Ordinance - 1617-2019:                                          $116,065.40\nRenewal #1 - Ord.#-  1361-2020:                     $140,313.00\nRenewal #2 - Ord.#-  0996-2021:                     $140,313.00\nRenewal #3 - Ord.# - 1045-2022:                     $140,313.00\nTotal:                                                                                                                                                                        $537,004.40\n \nCONTRACT COMPLIANCE\nVendor Name: Digital Information Services (Remit: dba Computer Intelligence Association);     CC#/F.I.D. #:   52-2278330;   Expiration Date: 05/15/2023\n(DAX Acct. #: 022100) \n \n \nTitle\nTo authorize the Director of the Department of Technology to renew a contract with Digital Information Services for Red Hat Linux licenses, Red Hat learning subscriptions, and Red Hat runtimes (JBoss); and to authorize the expenditure of $140,313.00 from the Department of Technology, Information Services Division, Information Services Operating Fund. ($140,313.00)\n \nBody\nWHEREAS, the Department of Technology received seven (7) bids in response to RFQ012308 for the purchase of Red Hat Linux licenses, Red Hat learning subscriptions and Redhat runtimes (JBoss); and\n \nWHEREAS, following evaluation of all submissions, the contract was awarded to Digital Information Services (Remit: dba Computer Intelligence Association); and\n \nWHEREAS, the original contract, established with passage of ordinance 1617-2019, authorized four (4) one-year renewals; and\n \nWHEREAS, this ordinance authorizes the third of four renewals of an existing contract with Digital Information Services for Red Hat Linux licenses, Red Hat learning subscriptions and Red Hat runtimes (JBoss), for the coverage term period from July 1, 2022 through June 30, 2023, at a total cost of $140,313.00; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Technology to authorize the Director of Technology to renew an existing contract with Digital Information Services for Red Hat Linux licenses, Red Hat learning subscriptions and Red Hat runtimes (JBoss), thereby preserving the public health, peace, property, safety and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Department of Technology is hereby authorized to renew a contract with Digital Information Services (Remit: dba Computer Intelligence Association) for Red Hat Linux licenses, Red Hat learning subscriptions and Red Hat runtimes (JBoss), in the amount of $140,313.00, for a period of one year, for the coverage term period from July 1, 2022 through June 30, 2023.\n \nSECTION 2. That the expenditure of $140,313.00, or so much thereof as may be necessary, is hereby authorized as follows in the attachment to this ordinance (Please see 1045-2022 EXP).\n \nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 4: That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 5:  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 45,
    "meeting_date": "2022-05-02",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements"
    ]
  }
}