{
  "success": true,
  "vote": {
    "id": 3536,
    "item_number": "CA-17",
    "title": "To authorize the Director of Finance and Management to enter into a contract with R.W.Setterlin Company for City of Columbus Renovation of Council Chamber - Phase 1; to authorize a transfer between divisions within the general fund; to authorize an expenditure of $113,000.00 from the general fund; and to declare an emergency ($113,000.00).",
    "description": "Explanation\n \nBACKGROUND: This legislation authorizes the Director of the Department of Finance and Management to enter into a contract with R.W.Setterlin Company for City of Columbus Renovation of Council Chamber - Phase 1. This project will include the replacement of the three curtains and curtain rods, applying new leather on all doors and transoms, and polishing the brass on each door. Care will be taken to preserve the historic features of the Chamber.  The Department of Finance and Management, Office of Construction Management, solicited bids that were formally advertised. On March 11, 2022, the City received three (3) responses (0 AS1, 1 FBE, 0 MBE,) as follows:  \n \n\n\n\nBidder/Consultant\n\nCity\n\nFBE/MBE\n\nAmount of Bid\n\n\n\n2K General Company\n\nDelaware\n\nEBOCC\n\n$58,0000.00\n\n\n\nR. W. Setterlin Company\n\nColumbus\n\nEBOCC\n\n$108,000.00\n\n\n\nBomar Construction Co., Inc.\n\nGrove City\n\nFBE\n\n$203,916.00\n\n\n \n2K General Company was the low bidder; however, 2K General Company withdrew its bid due to its not meeting the bid specifications and their subcontractor did not have full coverage of the required scope of work. The Office of Construction Management recommends the bid award be made to the second most responsive and responsible bidder, R.W.Setterlin Company for an amount of $108,000.00 with additional contingency of $5,000.00 for any additional unforeseen conditions with the project (Total Project $113,000.00).\nR.W.Setterlin Company Contract Compliance No. 310836188, expiration date November 03, 2022.\n \nEmergency action is requested to expedite the procurement of materials to complete the work during the Council Recess in August of 2022.\n \nFiscal Impact: This ordinance authorizes a transfer and expenditure of $113,000.00 within the general fund with R.W.Setterlin Company for City of Columbus Renovation of Council Chamber - Phase 1.\nTitle\nTo authorize the Director of Finance and Management to enter into a contract with R.W.Setterlin Company for City of Columbus Renovation of Council Chamber - Phase 1; to authorize a transfer between divisions within the general fund; to authorize an expenditure of $113,000.00 from the general fund; and to declare an emergency ($113,000.00).\n \nBody\nWHEREAS, the Finance and Management Department, Office of Construction Management desires to enter into a contract for City of Columbus Renovation of Council Chamber - Phase 1; and\n \nWHEREAS, three firms submitted bids and R.W. Setterlin Company was awarded the project; and\n \nWHEREAS, it is necessary to authorize a transfer between divisions within the general fund; and\n \nWHEREAS, it is necessary to authorize an expenditure of $113,000.00 from the general fund; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Finance and Management, Office of Construction Management, to authorize the Finance and Management Director to enter into a contract with R.W.Setterlin Company for City of Columbus Renovation of Council Chamber - Phase 1 located at 90 West Broad Street, so that work can be completed during council recess in August of 2022; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Department of Finance and Management is hereby authorized to enter into a contract on behalf of the Office of Construction Management with R.W.Setterlin Company for City of Columbus Renovation of Council Chamber - Phase 1 located at 90 West Broad Street. \n \nSECTION 2. That the transfer of $113,000.00 or so much thereof as may be needed, is hereby authorized within the general fund, Fund 1000, from Dept-Div 4501, Object Class 10 (Transfer Out) to Dept-Div 4550, Object Class 03 (Contractual Services) per the account codes in the attachment to this ordinance.\n \nSECTION 3.That the expenditure of $113,000.00, or so much thereof as may be necessary, is hereby authorized in the general fund (Fund 1000) in Dept-Div 4550, Object Class 03 (Contractual Services) per the accounting codes in the attachment to this ordinance. \n \nSECTION 4. That the monies in the foregoing sections shall be paid upon order of the Director of Finance and Management, and that no order shall be drawn or money paid except by voucher, the form of which shall be approved by the City Auditor.\nSECTION 5.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 7.  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared an emergency measure and shall take effect and be enforced from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor votes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 45,
    "meeting_date": "2022-05-02",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}