{
  "success": true,
  "vote": {
    "id": 3548,
    "item_number": "CA-29",
    "title": "To authorize the Finance and Management Director to enter into three (3) contracts for the option to purchase Turf and Golf Course Chemicals with Harrell’s LLC, Helena Chemical Company, and Rentokil North America Inc (dba Target Specialty Products); to authorize the expenditure of $3.00 from General Budget Reservation BRPO002025; and to declare an emergency. ($3.00).",
    "description": "Explanation\nBACKGROUND:  This legislation authorizes the Finance and Management Director to establish three (3) Universal Term Contracts (UTC) for the option to purchase Turf and Golf Course Chemicals with Harrell’s LLC, Helena Chemical Company and Rentokil North America (dba Target Specialty Products).  The Division of Golf is the primary user for Turf and Golf Course chemicals.  Turf and Golf Course Chemicals are used for all City of Columbus golf courses and parks to maintain and treat grass and ponds in all City parks and recreation areas.  The term of the proposed three (3) option contracts would be approximately three (3) years, expiring December 31, 2025, with the option to renew for one (1) additional year.  The Purchasing Office opened formal bids on March 17, 2022.   In addition, the expenditure of $3.00 is hereby authorized from General Budget Reservation BRPO002025.                     \n \nThe Purchasing Office advertised and solicited competitive bids in accordance with the relevant provisions of Section 329 relating to competitive bidding (Request for Quotation No. RFQ020973).  Three [3] bids were received.  \n \nThe Purchasing Office is recommending award to the overall lowest, responsive, responsible and best bidders as follows:\n \nHarrell’s LLC, CC# 020552 expires 4/8/2024, Items 10, 12, 13, 14, 17, 18, 52, 58, 62, 64, 73, 74, 77, 80, 83, 90, 91, 94, 102, 107, 111, and 112, $1.00\n \nHelena Chemical Company, CC#009931 expires 1/11/2024, Items 2, 3, 6, 7, 8, 11, 22, 23, 24, 52, 53, 54, 55, 57, 59, 63, 66, 68, 70, 71, 72, 73, 76, 77, 78, 82, 83, 85, 86, 88, 89, 90, 93, 95, 96, 97, 99, 100, 101, 103, 104, 108, 109, 110, 111, 112, 113, 114, 116, 117, 119, 120, 123, 124, 126, 128, 136, 137, 139, 143, 144, 146,and 168, $1.00\n \nRentokil North America Inc. dba Target Specialty Products, CC#001750 expires 4/24/2022, Items 1, 4, 7, 9, 11, 15, 16, 19, 20, 21, 25, 26, 27, 28, 30, 31, 35, 36, 48, 52, 58, 61, 67, 71, 73, 75, 79, 80, 81, 83, 87, 88, 90, 91, 92, 111, 112, 118, 121, 125, 127, 129, 130, 135, 147, 148, 149, 150, 153, 156, 157, 158, and 164, $1.00\n \nNo bids were received on items # 5, 29, 32, 33, 34, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 49, 50, 51, 56, 60, 65, 69, 84, 98, 105, 106, 115, 122, 131, 132, 133, 134, 138, 140, 141, 142, 145, 151, 152, 154, 155, 159, 160, 161, 162, 163, 165, 166, and 167.\n \nTotal Estimated Annual Expenditure: $250,000.00 with the Division of Golf, the primary user.\n \nEmergency Designation:  The Finance and Management Department respectfully requests this legislation to be considered an emergency ordinance to avoid the interruption in supply of chemicals used to maintain the City of Columbus golf courses and parks.\n \nThese companies are not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.   \n \nFISCAL IMPACT: The expenditure of $3.00 is hereby authorized from General Budget Reservation BRPO002025.  City Agencies will be required to obtain approval to expend from their own appropriations for their estimated annual expenditures.  \n \nTitle\n \nTo authorize the Finance and Management Director to enter into three (3) contracts for the option to purchase Turf and Golf Course Chemicals with Harrell’s LLC, Helena Chemical Company, and Rentokil North America Inc (dba Target Specialty Products); to authorize the expenditure of $3.00 from General Budget Reservation BRPO002025; and to declare an emergency. ($3.00).\n \nBody\n \nWHEREAS, the Turf and Golf Course Chemicals UTC will provide for the purchase of various types of chemicals to treat and maintain City golf course and parks; and,  \n \nWHEREAS, the Purchasing Office advertised and solicited formal bids on March 17, 2022 and selected the overall lowest, responsive, responsible and best bidders; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Recreation and Parks Department in that it is immediately necessary to authorize the Finance and Management Director to enter into a Universal Term Contracts with Harrell’s LLC, Helena Chemical Company, and Rentokil North America Inc (dba Target Specialty Products) for the option to purchase Turf and Golf Course Chemicals to avoid the interruption in supply of chemicals used to treat and maintain the golf courses and parks, thereby preserving the public health, peace, property, safety, and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Finance and Management Director is hereby authorized to enter into the following three (3) contracts for the option to purchase Turf and Golf Course Chemicals in accordance with Request for Quotation RFQ020973 for a term of approximately three (3) years, expiring December 31, 2025, with the option to renew for one (1) additional year, as follows:\n \nHarrell’s LLC,  Items 10, 12, 13, 14, 17, 18, 52, 58, 62, 64, 73, 74, 77, 80, 83, 90, 91, 94, 102, 107, 111, and 112, $1.00\n \nHelena Chemical Company, Items 2, 3, 6, 7, 8, 11, 22, 23, 24, 52, 53, 54, 55, 57, 59, 63, 66, 68, 70, 71, 72, 73, 76, 77, 77, 78, 82, 83, 85, 86, 88, 89, 90, 93, 95, 96, 97, 99, 100, 101, 103, 104, 108, 109, 110, 111, 112, 113, 114, 116, 117, 119, 120, 123, 124, 126, 128, 136, 137, 139, 143, 144, 146,and 168, $1.00\n \nRentokil North America Inc. dba Target Specialty Products, Items 1, 4, 7, 9, 11, 15, 16, 19, 20, 21, 25, 26, 27, 28, 30, 31, 35, 36, 48, 52, 58, 61, 67, 71, 73, 75, 79, 80, 81, 83, 87, 88, 90, 91, 92, 111, 112, 118, 121, 125, 127, 129, 130, 135, 147, 148, 149, 150, 153, 156, 157, 158, and 164, $1.00\n \nSECTION 2. That the expenditure of $3.00 is hereby authorized from General Budget Reservation BRPO002025 of this ordinance to pay the cost thereof.\n \nSECTION 3.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That for the reason stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 45,
    "meeting_date": "2022-05-02",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}