{
  "success": true,
  "vote": {
    "id": 3598,
    "item_number": "SR-11",
    "title": "To authorize the Director of Public Utilities to enter into a construction contract with Driven Excavating, LLC for the Division of Sewerage and Drainage’s Meeklynn Drive Sanitary Sewer and Meeklynn Drive Stormwater Improvements, inclusive of project-related paving work funded by the Department of Public Service; to authorize the appropriation and transfer of $1,165,674.00 from the Storm Sewer Reserve Fund to the OWDA Storm Sewer Loan Fund; to authorize the appropriation and transfer of $941,737.20 from the Sanitary Sewer Reserve Fund to the OWDA Sanitary Loan Fund; to authorize the expenditure of up to $1,165,674.00 from the OWDA Storm Sewer Loan Fund; to authorize the expenditure of up to $941,737.20 from the OWDA Sanitary Loan Fund; to authorize the expenditure of up to $40,174.20 from the Streets and Highways Bond Fund; to authorize the transfer within and expenditure for prevailing wage services to the Department of Public Service of up to $1,000.00 from the Storm Sewer Bond Fund; to authorize the expenditure of $1,000.00 from the Sanitary Bond Fund for prevailing wage services to the Department of Public Service; and to amend the 2021 Capital Improvement Budget. ($2,149,586.00)",
    "description": "Explanation\n \nBACKGROUND: A storm sewer will be constructed along Meeklynn Road that outlets to Kempton Run on Olentangy River Road. A sanitary sewer will be constructed to serve the residents of Meeklynn Road, outletting to an existing sanitary sewer in the Haley Hollow neighborhood on the east side of Olentangy River Road.\n \nPlanning Area - 34 Northwest \n \nPROJECT TIMELINE: Contract work is required to be substantially complete in a manner acceptable to the City within 365 days from the date that a Notice To Proceed (NTP) is given by the City.\n \nPROCUREMENT INFORMATION: The Division advertised for competitive bids submission for the subject services on the City's Vendor Services website and in the City Bulletin in accordance with the overall provisions of Chapter 329 of the Columbus City Code. The Division of Sewerage and Drainage received three (3) bids from the following: \n \n\n\n\nNAME\n\nTAX ID\n\nDAX #\n\nCity/State\n\nStatus\n\nExpiration\n\n\n\nDriven Excavating LLC\n\n84-2637427\n\n033459\n\nShelby, OH\n\nMAJ\n\n8/19/2023\n\n\n\nComplete General Construction\n\n31-4366382\n\n006056\n\nColumbus, OH\n\nMAJ\n\n6/8/2023\n\n\n\nTrucco Construction Co., Inc.\n\n31-1293605\n\n004988\n\nDelaware, OH\n\nMAJ\n\n1/23/2024\n\n\n \n \nEMERGENCY DESIGNATION is not requested at this time. \n \nECONOMIC / ENVIRONMENTAL IMPACT: The sanitary portion of this project will extend over 3,200 feet of sanitary sewer service on Meeklynn Drive to serve the developed area that is currently served by home treatment systems. This project will eliminate the home treatment systems due to the potential ground water pollution hazard to the Olentangy River. The storm sewer project will mitigate street and reduce roadside drainage issues. \nFISCAL IMPACT: This ordinance authorizes the City Auditor to appropriate and transfer funds from the Storm Sewer Reserve Fund 6207 to the Ohio Water Development (OWDA) Storm Loan Fund 6211 in order to fund $1,165,674.00 of this expenditure.  This ordinance authorizes the City Auditor to appropriate and transfer funds from the Sanitary Sewer Reserve Fund 6102 to the Ohio Water Development (OWDA) Sanitary Loan Fund 6111 in order to fund $941,737.20 of this expenditure. These two transaction are temporary measures that are required until such time as the division is able to execute two loans with the OWDA Loan Fund and reimburse the Sanitary Sewer Reserve Fund and the Storm Water Reserve Fund, respectively.  The loans are expected to be approved in April 2022.  \nThis ordinance also includes a transfer of $1,000.00 within the Storm Water General Obligation Bond Fund 6204 to allow for the expenditure of $1,000.00 each from the Storm Sewer Bond Fund and from the Sanitary Sewer Bond Fund for $2,000.00 cumulative total of prevailing wage services to the Department of Public Service. \nThis ordinance also authorizes an expenditure of $40,174.80 from the Streets and Highways Bond Fund 7704 with the Department of Public Services for paving work necessary to the project. This ordinance amends the 2021 Capital Improvements Budget.\n \nTitle\n \nTo authorize the Director of Public Utilities to enter into a construction contract with Driven Excavating, LLC for the Division of Sewerage and Drainage’s Meeklynn Drive Sanitary Sewer and Meeklynn Drive Stormwater Improvements, inclusive of project-related paving work funded by the Department of Public Service; to authorize the appropriation and transfer of $1,165,674.00 from the Storm Sewer Reserve Fund to the OWDA Storm Sewer Loan Fund; to authorize the appropriation and transfer of $941,737.20 from the Sanitary Sewer Reserve Fund to the OWDA Sanitary Loan Fund; to authorize the expenditure of up to $1,165,674.00 from the OWDA Storm Sewer Loan Fund; to authorize the expenditure of up to $941,737.20 from the OWDA Sanitary Loan Fund; to authorize the expenditure of up to $40,174.20 from the Streets and Highways Bond Fund; to authorize the transfer within and expenditure for prevailing wage services to the Department of Public Service of up to $1,000.00 from the Storm Sewer Bond Fund; to authorize the expenditure of $1,000.00 from the Sanitary Bond Fund for prevailing wage services to the Department of Public Service; and to amend the 2021 Capital Improvement Budget. ($2,149,586.00)\n \n \nBody\n \nWHEREAS, the Division of Sewerage and Drainage advertised for competitive bids for the Meeklynn Drive Sanitary Sewer Improvements and Meeklynn Drive Stormwater Improvements, and three (3) bids were received on February 23, 2022; and\n \nWHEREAS, Driven Excavating LLC was the best, responsive, responsible bidder determined through the bid tabulation and Quality Factor Form evaluation process; and \n \nWHEREAS, it is necessary to authorize the Director of the Department of Public Utilities to execute a construction contract with Driven Excavating, LLC and to encumber and expend funds to provide for prevailing wage services for the Division of Sewerage and Drainage’s Meeklynn Drive Sanitary Sewer Improvements and Meeklynn Drive Stormwater Improvements Project; and \n \nWHEREAS, it is necessary to both appropriate funds from the Storm Sewer Reserve Fund 6207 and to authorize the transfer of said funds to the OWDA Storm Sewer Loan Fund 6211 in order to temporarily fund this expenditure until such time as the City receives loan proceeds for the above stated purpose and reimburses the Storm Sewer Reserve Fund; and\n \nWHEREAS, it is necessary to both appropriate funds from the Sewer System Reserve Fund 6102 and to authorize the transfer of said funds to the OWDA Sanitary Sewer Loan Fund 6111 in order to temporarily fund this expenditure until such time as the City receives loan proceeds for the above stated purpose and reimburses the Sewer System Reserve Fund; and\n \nWHEREAS, the City anticipates incurring certain Original Expenditures (as defined in Section 1.150-2(c) of the Treasury Regulations (the “Treasury Regulations” promulgated pursuant to the Internal Revenue Code of 1986, as amended)) with respect to the construction of the Project described in this Ordinance (collectively, the “Project”); and\n \nWHEREAS, it is necessary to authorize the expenditure of up to $40,174.80 from the Streets and Highways Bond Fund 7704 for paving services for the project to the Department of Public Service; and\n \nWHEREAS, it is necessary to authorize the expenditure of up to $1,000.00 from the Sanitary Sewer General Obligation Bond Fund 6109 and the transfer within and expenditure of up to $1,000.00 from the Storm Sewer Bond Fund 6204 for a cumulative total of $2,000.00 for Prevailing Wage Services to the Department of Public Service; and\n \nWHEREAS, it is necessary to authorize an amendment to the 2021 Capital Improvement Budget; and  \n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities, Division of Sewerage and Drainage, to authorize the Director to enter into a construction contract with Driven Excavating LLC for the Linworth Rd./Meeklynn Dr. Stormwater System Improvements CIP# 610782-100000 and Meeklynn Dr. Area Sanitary Sewer Improvements CIP#  650890-100000 in order to meet project deadlines and deliverables, for the preservation of the public health, peace, property, and safety; now, therefore\n \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That Ordinance 2459-2021, passed by Columbus City Council on October 18, 2021, authorized the Director of Public Utilities to apply for, accept, and enter into sixty-three (63) WPCLF loan agreements with Ohio Water Development Authority, which include Linworth Rd./Meeklynn Dr. Stormwater System Improvements CIP# 610782-100000 and Meeklynn Dr. Area Sanitary Sewer Improvements CIP#  650890-100000.\n \nSECTION 2.  That the Director of Public Utilities is hereby authorized to enter into a construction contract with Driven Excavating LLC, 139 Technology Parkway, Shelby, Ohio 44875; for the Division of Sewerage and Drainage’s Linworth Rd./Meeklynn Dr. Stormwater System Improvements CIP# 610782-100000 and Meeklynn Dr. Area Sanitary Sewer Improvements CIP#  650890-100000, in accordance with the terms and conditions as shown in the agreement on file in the office of the Division of Sewerage and Drainage; and to obtain the necessary prevailing wage services from the Department of Public Services up to a maximum amount of $2,000.00.\n \nSECTION 3.  That from the unappropriated monies in the Storm Sewer Reserve Fund 6207 and from all monies estimated to come into said fund from any and all sources, and unappropriated for any other purpose during the fiscal year ending December 31, 2022, the sum of $1,165,674.00 is appropriated in Fund 6207, per the account codes in the funding attachment to this ordinance.\n \nSECTION 4.  That from the unappropriated monies in the Sanitary Sewer Reserve Fund 6102 and from all monies estimated to come into said fund from any and all sources, and unappropriated for any other purpose during the fiscal year ending December 31, 2022, the sum of $941,737.20 is appropriated in Fund 6102, per the account codes in the funding attachment to this ordinance.\n \nSECTION 5.  That the transfer of $1,165,674.00 or so much thereof as may be needed, is hereby authorized between the Storm Sewer Reserve Fund 6207 and OWDA Storm Loan Fund 6211 per the accounting codes in the attachment to this ordinance. \n \nSECTION 6.  That the transfer of $941,737.20 or so much thereof as may be needed, is hereby authorized between the Sanitary Sewer Reserve Fund 6102 and OWDA Sanitary Loan Fund 6111 per the accounting codes in the attachment to this ordinance. \n \nSECTION 7.  That the transfer within and expenditure of up to $1,000.00 from the Storm Sewer Bond Fund 6204 and the expenditure of up to $1,000.00 from the Sanitary Sewer General Obligation Bond Fund 6109 is hereby authorized to fund prevailing wage services with the Department of Public Service.\n \nSECTION 8.  That the expenditure of $2,149,586.00, inclusive of $2,000.00 to the Department of Public Service for prevailing wage services, or so much thereof as may be needed, is hereby authorized per the accounting codes in the attachment to this ordinance.\n \nSECTION 9.  That the 2021 Capital Improvement Budget is amended as per the accounting codes as attached to this ordinance.\n \nSECTION 10.  That the said company, Driven Excavating LLC, shall perform the work to the satisfaction of the Director of Public Utilities and the Administrator of the Division of Sewerage and Drainage.\n \nSECTION 11.  That the City Auditor is hereby authorized to transfer any unencumbered balance in the project account to the unallocated balance within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project; except that no transfer shall be made from a project by monies from more than one source. \n \nSECTION 12.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 13.  That the City Auditor is authorized to establish proper project accounting numbers as appropriate.\n \nSECTION 14.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 15.  That upon obtaining other funds for the purpose of funding sanitary sewer system capital improvement work, the City Auditor is hereby authorized to repay the Sanitary Sewer Reserve Fund the amount transferred above (Section 3), and said funds are hereby deemed appropriated for such purposes.\n \nSECTION 16.  That the City intends that this Ordinance constitute an \"official intent\" for purposes of Section 1.150-2(e) of the Treasury Regulations, and that the City reasonably expects to reimburse itself for certain Original Expenditures incurred with respect to the Project from the proceeds of obligations to be issued by the City in a principal amount currently estimated to be $2,107,411.20 (the \"Obligations\").\n \nThe City intends to make a reimbursement allocation on its books for the Original Expenditures not later than eighteen months following the later to occur of the date of the Original Expenditure to be reimbursed or the date the Project for which such Original Expenditures were made is \"placed in service\" within the meaning of Treasury Regulations Section 1.150-2(c).  Upon the issuance of the Obligations, the proceeds of such Obligations shall be used to reimburse the Storm Sewer Reserve Fund 6207 and the Sanitary Sewer Reserve Fund 6102, which are the funds from which the advance for costs of the Project will be made.\n \nSECTION 17.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 45,
    "meeting_date": "2022-05-02",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}