{
  "success": true,
  "vote": {
    "id": 362,
    "item_number": "SR-15",
    "title": "To authorize the Director of the Department of Development to enter into a contract with the Community Shelter Board for the purpose of continuing the City’s support for men, women and families who are experiencing, or at risk of experiencing, homelessness in Columbus; to authorize the payment of expenses starting January 1, 2021; to authorize the expenditure of $5,389,650.00 from the General Fund; and to declare an emergency. ($5,389,650.00)",
    "description": "Explanation\nBACKGROUND:  This legislation authorizes the Director of the Department Development to enter into contract with the Community Shelter Board (CSB) in an amount up to $5,389,650.00 to administer five initiatives to address homelessness in the City of Columbus and to authorize the payment of expenses starting January 1, 2021.\n \nPrior to FY2020, the Director of Development had submitted five different ordinances to enter into five separate contracts, one for each initiative. In 2020, in order to increase efficiencies in payments and reporting, all programs were managed under one single contract. This was proven to be more effective and efficient and will be the model moving forward.\n \nCSB has, and will continue, to administer the following five initiatives to address homelessness in our community: Continuum of Care Application, Crisis Response, Outreach Services, Permanent Supportive Housing (PSH) Services, and the Safety Net Program. These programs provide support for men, women and families who are experiencing, or at risk of experiencing, homelessness in Columbus. The CSB leads a coordinated, community effort to make sure everyone has a place to call home. \n \nThe CSB is the collective impact organization driving strategy, accountability, collaboration, and resources to achieve the best outcomes for people facing homelessness in Columbus and Franklin County. The CSB will provide administration, oversight and monitoring of the City’s investment for each of these five initiatives. The City and the CSB are working together to effectively and efficiently help individuals and families resolve their housing crisis and maintain stability in permanent housing.  Below is more detail, and amount, for each program.\n \nContinuum of Care (CoC) Consolidated Application ($10,000.00)\nCSB is the designated Collaborative Applicant on behalf of the City of Columbus and Franklin County and will prepare the 2020 Consolidated Application for the Continuum of Care. The Consolidated Application will be submitted to the U.S. Department of Housing and Urban Development for all Columbus and Franklin County renewal and new permanent supportive housing projects. CSB will work with the Columbus and Franklin County Continuum of Care governing committee to develop local Continuum of Care priorities and review projects to be included in the Columbus and Franklin County submission.\n \nCrisis Response ($1,537,704.00)\nCSB and its partners are providing services through the following crisis response initiatives for persons experiencing homelessness: single adult crisis response program; assistance to families experiencing homelessness; assistance to pregnant women experiencing homelessness; and, assistance for non-VA eligible veterans. \nCollaborative (Street) Outreach Services ($117,000.00)\nCSB will provide street and land outreach services through its funded partners to reduce unsheltered homelessness in Columbus. Outreach teams will work collaboratively to provide pro-active engagement, referral to medical and behavioral healthcare, and linkage to emergency shelter and permanent housing. \n \nPermanent Supportive Housing (PSH) Services ($877,688.00)\nCSB will provide its permanent supportive housing (PSH) partners with funding for various supportive services to PSH residents. These services will consist of necessary on-site social services and/or referrals to physical and mental health agencies for formerly homeless individuals currently living in PSH units. \n \nSafety Net ($2,847,258.00)\nCSB will provide funding to its partners to continue the City’s support for the operation of emergency shelters, related emergency shelter services, homelessness prevention and transition services for persons experiencing or at risk of experiencing homelessness.\n \nThe services included in this contract cannot be provided by existing city employees because these services are beyond the City’s current staffing capacity to provide.\n \nEmergency action is requested to continue to provide these essential services to the people experiencing homeless without interruption.\nFISCAL IMPACT: Funds for this contract are allocated the Housing Division’s FY2021 General Fund budget.  This ordinance is contingent upon the passage of the 2021 operating budget.\nCONTRACT COMPLIANCE:  the vendor’s vendor number is 004795 and is valid from 2/5/2021-2/5/2023.\n \nTitle\nTo authorize the Director of the Department of Development to enter into a contract with the Community Shelter Board for the purpose of continuing the City’s support for men, women and families who are experiencing, or at risk of experiencing, homelessness in Columbus; to authorize the payment of expenses starting January 1, 2021; to authorize the expenditure of $5,389,650.00 from the General Fund; and to declare an emergency. ($5,389,650.00)\n \nBody\nWHEREAS, the Director of the Department of Development desires to enter into a contract with the Community Shelter Board; and\n \nWHEREAS, the Community Shelter Board will provide administration, oversight, and monitoring of the City’s investment in these five initiatives: Continuum of Care Application, Crisis Response, Outreach Services, Permanent Supportive Housing (PSH) Services, and Safety Net Program; and\n \nWHEREAS, these initiatives are working effectively and efficiently to help individuals and families resolve their housing crisis and maintain stability in permanent housing; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is necessary to authorize the Director of the Department of Development to enter into a contract with the Community Shelter Board so it can continue to provide these essential services to the people experiencing homeless without interruption, thereby preserving the public health, peace, property, safety, and welfare; and NOW THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     That the Director of the Department of Development is hereby authorized enter into contract with the Community Shelter Board, effective January 1, 2021, and ending February 28, 2022, for the purpose of continuing the City’s support for men, women and families who are experiencing, or at risk of experiencing, homelessness in our city.\n \nSECTION 2.                     That for the purpose as stated in Section 1, the expenditure of $5,389,650.00 or so much thereof as may be needed, is hereby authorized in Fund 1000 (General Fund), Dept-Div 44-10 (Housing), in Object Class 03 (Contractual Services) per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.                     That these contracts are awarded pursuant to the relevant provisions of Chapter 329 of City Code relating to the process for awarding not-for-profit service contracts.\n \nSECTION 4.                     Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.                     That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 5,
    "noes": 0,
    "abstain": 1,
    "absent": 1,
    "meeting_id": 6,
    "meeting_date": "2021-03-01",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "ABSTAIN"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}