{
  "success": true,
  "vote": {
    "id": 3672,
    "item_number": "SR-8",
    "title": "To authorize the Director of Recreation and Parks to enter into contract with Plug Smart for the HVAC Controls Integration Project; to authorize the transfer of $1,000,000.00 within the Recreation and Parks Voted Bond Fund, to authorize the amendment of the 2021 Capital Improvements Budget; to authorize the expenditure of $1,000,000.00 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($1,000,000.00)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Director of the Recreation and Parks Department to enter into contract with Plug Smart for the HVAC Controls Integration Project. The contract amount is $834,784.00, with a contingency of $165,216.00, for a total of $1,000,000.00 being authorized by this ordinance. \n \nAccording to the Columbus Climate Action Plan, buildings are responsible for approximately one quarter of city greenhouse gas emissions, primarily from heating, ventilation, and air conditioning (HVAC) system operations.  The Columbus Climate Action Plan commits to reducing emissions by at least 45% by 2030 and to achieve zero emissions by 2050. Reducing building emissions is a major component of reaching these goals. Additionally, reduced building energy use results in utility costs savings which can allow the City to redirect operational funding towards achieving other objectives.\n \nThe Recreation and Parks Department is responsible for the operation of 46 City of Columbus buildings which possess programmable Building Automation System (BAS) controllers for the mechanical HVAC systems. These buildings include community centers, athletic complexes, golf course clubhouses, and cultural arts centers. 32 of these facilities utilize advanced BACNet standard controllers which have the capability to be operated remotely from a common platform. This capability allows the Department to centrally manage building HVAC systems and schedule settings during unoccupied periods. It also allows the Department to receive consolidated alarming for trouble situations such as stuck dampers and concurrent heating or cooling. Furthermore, by providing a single web portal with defined credentials for HVAC system monitoring and operation by users of all levels, the Department can develop trend logs to adjust and optimize HVAC system operations and encourage responsible occupant behavior. This project is a first step towards eventual integration of all Columbus Recreation and Parks buildings’ HVAC systems into a central control system which will reduce overall energy use and help the City meet it greenhouse gas reduction goals.\n \nVendor Bid/Proposal Submissions (ODI designation status):\n \nProposals were advertised through Vendor Services, in accordance with City Code Section 329, on August 20, 2021 and received by the Recreation and Parks Department on September 20, 2021. This project was also picked up by various local and regional plan rooms and distributed to their membership. Proposals were received from the following companies:\n \nPlug Smart (MAJ)\nSchneider Electric (MAJ)\nControls Concepts of Ohio (MAJ)\nTrane (MAJ)\nSauer Control Systems (MAJ)\nJohnson Controls (MAJ)\n \nOf note, professional services contracts are quality based selections and not based on price. Costs were not requested nor where they part of this evaluation. \n \nIn accordance with City Code, a selection team evaluated the proposals and recommended that Plug Smart be selected to perform the work. The firm was chosen based on their referenced projects, experience, qualifications, availability, timeline, and project approach.\n \nPrincipal Parties: \nJuice Technologies, Inc. DBA Plug Smart\n640 Lakeview Plaza, Suite J, Worthington, OH 43085 \nDave Zahala, 614-935-0041     \nContract Compliance Number, Tax ID: 002293, 26-2368277\nContract Compliance Expiration Date: October 30, 2022       \n \nEmergency Justification: Emergency action is requested to allow for the prompt execution of this contract, immediately improving the occupant experience of our facilities while maximizing operational efficiency and helping to combat climate change. \n \nBenefits to the Public: The reduction in building energy use enabled by this project will enable the City to meet its climate goals, positively impacting the quality of life for generations of residents to come.\n \nCommunity Input/Issues: The community has expressed the desire for updated facilities and amenities through public workshops, social media, and direct contact with City staff.  \n \nArea(s) Affected: Citywide (99)\n \nMaster Plan Relation: This project supports the Columbus Recreation and Parks Department’s Master Plan by helping to improve operations and services to the citizens of Columbus\nFiscal Impact: $1,000,000.00 is budgeted and available from within the Recreation and Parks Voted Bond Fund 7702 to meet the financial obligations of this contract.\n \nTitle\n \nTo authorize the Director of Recreation and Parks to enter into contract with Plug Smart for the HVAC Controls Integration Project; to authorize the transfer of $1,000,000.00 within the Recreation and Parks Voted Bond Fund, to authorize the amendment of the 2021 Capital Improvements Budget; to authorize the expenditure of $1,000,000.00 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($1,000,000.00)\n \nBody\n \nWHEREAS, it is necessary to authorize the Director of the Recreation and Parks to enter into contract with Plug Smart for the HVAC Controls Integration Project; and\n \nWHEREAS, it is necessary to authorize the transfer of $1,000,000.00 within the Recreation and Parks Voted Bond Fund 7702; and\n \nWHEREAS, it is necessary to authorize the amendment of the 2021 Capital Improvements Budget Ordinance 2707-2021 in order to provide sufficient budget authority for this and future projects; and\n \nWHEREAS, it is necessary to authorize the expenditure of $1,000,000.00 from the Recreation and Parks Voted Bond Fund 7702; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Recreation and Parks Department in that it is immediately necessary to authorize the Director to enter into this contract to allow for the prompt execution of this contract, immediately improving the operational efficiency and occupant experience of our facilities, all for the preservation of the public health, peace, property, safety, and welfare and, NOW, THEREFORE \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Recreation and Parks be and is hereby authorized to enter into contract with Plug Smart for the HVAC Controls Integration Project.\n \nSECTION 2. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 4. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 5. That the transfer of $1,000,000.00 or so much thereof as may be needed, is hereby authorized between projects within the Recreation and Parks Bond Fund 7702 per the account codes in the attachment to this ordinance.\n \nSECTION 6. That the 2021 Capital Improvements Budget Ordinance 2707-2021 is hereby amended as follows in order to provide sufficient budget authority for this ordinance and future projects.\nFund / Project / Project Name / Current / Change / Amended\n \nFund 7702; P511002-100000; Facility Assessment Implementation (Voted Carryover) / $2,751,060 / ($1,000,000) / $1,751,060\n \nFund 7702; P511040-202101; HVAC Controls Integration (Voted Carryover) / $0 / $1,000,000 / $1,000,000\n \nSECTION 7. For the purpose stated in Sections 1, the expenditure of $1,000,000.00 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Recreation and Parks Voted Bond Fund 7702 in object class 06 Capital Outlay per the accounting codes in the attachments to this ordinance. \nSECTION 8. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 46,
    "meeting_date": "2022-05-09",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}