{
  "success": true,
  "vote": {
    "id": 3686,
    "item_number": "FR-1",
    "title": "To authorize the Finance and Management Director, on behalf of the Fleet Management Division, to establish a purchase order with Grimco Inc., for the purchase of Gerber and 3M films and foils; and to authorize the expenditure of $57,644.22 from the Fleet Management Operating Fund. ($57,644.22)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Finance and Management Director to establish a purchase order with Grimco Inc. in the amount of $57,644.22 for the purchase of Gerber and 3M films and foils per the results of bid RFQ021444.  These films and foils will be used to replace and repair emblems and markings on City vehicles. This bid was processed in accordance with the competitive bidding provisions of Columbus City Code. Two responses were received and opened for RFQ021444 on April 21, 2022 as follows:\n \nGrimco Inc., Vendor #023773, FID 43-0955083 $57,644.22\nTarazi LLC, Vendor #031380, FID 84-3647481 $84,315.00\n \nThe Finance and Management Department therefore recommends the bid be awarded to Grimco Inc, as the lowest, most responsive and responsible bidder. \n \nGrimco Inc., Vendor #023773, FID 43-0955083 $57,644.22\n \nFiscal Impact: This ordinance authorizes an appropriation and expenditure of $57,644.22 from the Fleet Management Operating Fund with Grimco Inc. for the purchase of Gerber and 3M films and foils. In 2021, the Fleet Management Division expended $4,800 for Gerber and 3M films and foils.  In 2020 there were no purchases of Gerber and 3M films and foils.\n \nTitle\n \nTo authorize the Finance and Management Director, on behalf of the Fleet Management Division, to establish a purchase order with Grimco Inc., for the purchase of Gerber and 3M films and foils; and to authorize the expenditure of $57,644.22 from the Fleet Management Operating Fund. ($57,644.22)\n \nBody\n \nWHEREAS, the City has a need for the purchase of Gerber and 3M films and foils for use at the Fleet Management Body Shop, and\n \nWHEREAS, a formal bid (RFQ021444) was advertised on March 31, 2022, and \n \nWHEREAS, the Finance and Management Department recommends a bid award to Grimco Inc. as the overall lowest, responsive, and responsible bidder, and\n \nWHEREAS, funding for these films and foils are budgeted and available within the Fleet Management Operating Fund; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Finance and Management, Fleet Management Division, to authorize the Finance and Management Director to establish a purchase order with Grimco Inc. for the purchase of Gerber and 3M films and foils; NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Finance and Management Director, on behalf of the Fleet Management Division, is hereby authorized to establish a purchase order with Grimco Inc. for the purchase of Gerber and 3M films and foils, as follows:\n \nRequest for Quotation RFQ021444: Grimco Inc., $57,644.22.\nSECTION 2. That the expenditure of $57,644.22 or so much thereof as may be necessary, in regard to the actions authorized in Section 1 are hereby authorized and approved from the Fleet Management Operating Fund 5200, in Object Class 02 per the accounting codes in the attachment to the ordinance:\n \nSee Attached File: Ord 1213-2022 Legislation Template.xls\n \nSECTION 3. That the monies in the foregoing Sections shall be paid upon order of the Director of Finance and Management, and that no order shall be drawn or money paid except by voucher, the form of which shall be approved by the City Auditor.\n \nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 6. That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "FAIL",
    "ayes": 0,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 47,
    "meeting_date": "2022-05-16",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Public Works"
    ]
  }
}