{
  "success": true,
  "vote": {
    "id": 3687,
    "item_number": "FR-2",
    "title": "To authorize the Finance and Management Director to associate all General Budget Reservations resulting from this ordinance with the appropriate Universal Term Contract Purchase Agreements for the purchase of  materials, supplies and services for the Division of Sewerage and Drainage, Southerly Wastewater Treatment Plant; and to authorize the expenditure of $300,000.00 from the Sewerage Operating Fund. ($300,000.00)",
    "description": "Explanation\n \nBACKGROUND: This legislation authorizes the Finance and Management Director to associate all General Budget Reservations resulting from this ordinance with the following Universal Term Contract Purchase Agreements listed below for the Division of Sewerage and Drainage, Southerly Wastewater Treatment Plant. \n \nThe parts, materials and services from these contracts are used to monitor, maintain and repair equipment for the various processes throughout the wastewater treatment plant as required by federal and state standards.\n \nThe following Purchase Agreement association requires approval by City Council in order for the Division to expend more than $100,000.00, per 329.19(g):\n \nUNIVERSAL TERM CONTRACT PURCHASE AGREEMENTS:\n \nPlant Manufacturer Specific Parts, Equipment and Services\nAndritz D5LL Centrifuge Parts\nAndritz D7 & D12 Centrifuge Parts & Services\nAndritz Aqua Screen Parts\n \nThe companies are not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.  \n \nFISCAL IMPACT:  $300,000.00 is budgeted and needed for this purchase.  \n \n$425,230.54 was spent in 2021\n$207,115.65 was spent in 2020\n \n \nTitle\n \nTo authorize the Finance and Management Director to associate all General Budget Reservations resulting from this ordinance with the appropriate Universal Term Contract Purchase Agreements for the purchase of  materials, supplies and services for the Division of Sewerage and Drainage, Southerly Wastewater Treatment Plant; and to authorize the expenditure of $300,000.00 from the Sewerage Operating Fund. ($300,000.00)\n \n \nBody\n \nWHEREAS, the Purchasing Office has established Universal Term Contract Purchase Agreements for the purchase of materials, supplies and services; and\n \nWHEREAS, the expenditure of $300,000.00 or so much thereof as is needed for the purchase of  materials, supplies and services from and within the Division of Sewerage Operating Fund; and\n \nWHEREAS, the parts, materials and services are used to monitor, maintain and repair equipment for the various processes throughout the maintenance facilities and the wastewater treatment plant per the federal and state standards; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities to authorize the Finance and Management Director to associate all General Budget Reservations resulting from this ordinance with the appropriate Universal Term Contract Purchase Agreements for the purchase of materials, supplies and services; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Finance and Management Director be and is hereby authorized to associate all General Budget Reservations resulting from this ordinance with the appropriate Universal Term Contract Purchase Agreements for the purchase of materials, supplies and services.\n \nSECTION 2.  That the expenditure of $300,000.00 or so much thereof as may be needed, be and is hereby authorized in Fund 6100 (Sewerage Operating-Sanitary) in object class 06 Capital Outlay per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.   That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "FAIL",
    "ayes": 0,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 47,
    "meeting_date": "2022-05-16",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}