{
  "success": true,
  "vote": {
    "id": 3755,
    "item_number": "5",
    "title": "To recognize and congratulate Randolph J. Malloy on 30 incredible years with CD 92.9 FM.",
    "description": "Title\nTo recognize and congratulate Randolph J. Malloy on 30 incredible years with CD 92.9 FM.\n \nBody\nWHEREAS, Randolph J. Malloy has advanced and supported the Columbus area musical arts through his thirty years of steadfast advocacy and passionate commitment in his many roles with WWCD-FM and WWCD-AM; and\n \nWHEREAS, after starting as an intern driving the illustrious CD101 ice cream truck, Randy was hired as the Promotions Director on May 22, 1992, was later promoted to the Marketing Director, was later promoted to the Director of Operations, and finally became the President and Owner of the radio station on March 31, 2011; and\n \nWHEREAS, in his thirty years with the radio station, Randy’s tireless and charismatic efforts to engage the entire Columbus community - business leaders, elected officials, families, students, and countless others - set a high standard for community involvement and action during time of dramatic change within Columbus and the radio industry; and\n \nWHEREAS, Randy’s sense of humor, kindness, energy, tenacity, and graciousness has enriched those fortunate enough to know and to work with him; and\n \nWHEREAS, by implementing and promoting CD1025 Cares during the coronavirus pandemic, Randy helped elevate the local business community during a time of crisis; and by consistently providing promotional and advertising support to nonprofit organizations, Randy has solidified the radio station as a key partner in the Columbus community; and \n \nWHEREAS, the radio station’s children’s charity has raised hundreds of thousands of dollars that have benefitted many children in need through nonprofit organizations such as Ronald McDonald House Charities of Central Ohio, Nationwide Children’s Hospital, and Directions for Youth and Families; and \n \nWHEREAS, Randy has received numerous awards throughout his tenure with the radio station to commemorate his commitment to the local arts community including the Governor’s Award for the Arts in Ohio, the White Glove Award, and the Greater Columbus Arts Council Business/Arts Partnership Award; and \n \nWHEREAS, future generations will benefit from Randy’s unique vision as a local radio station owner who has created a compassionate core of listeners and who has staunchly supported musicians to help them advance to the national - and international - stage, including, among many others, Fitz & the Tantrums, Foals, Matt & Kim, Young the Giant, The Killers, Cage the Elephant, alt-J, Walk the Moon, The Black Keys, Death Cab for Cutie, Interpol, Portugal. The Man, Caamp, Wolf Alice, Arcade Fire, TV on the Radio, and They Might Be Giants; now, therefore\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: That this Council does hereby recognize and congratulate Randolph J. Malloy for his leadership, vision, and innovative contributions to the City of Columbus, and wishes him well in his continued service as the President and Owner of CD 92.9 FM.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 48,
    "meeting_date": "2022-05-23",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}