{
  "success": true,
  "vote": {
    "id": 3760,
    "item_number": "CA-20",
    "title": "To authorize and direct the Executive Director of the Mayor’s Office of Education to extend a contract with YMCA of Central Ohio for the purpose of supporting the Fresh Start Program; and to declare an emergency.  ($0.00)",
    "description": "Explanation\nBackground  For the past 20 years, the YMCA of Central Ohio has been dedicated to, and significantly engaged with, youth in Franklin County.  The organization identifies that there is more work to be done and guidance to be given as gun violence increases, academic successes wane, and youth fall victim to street and drug dealings.  These trends are alarming as they increase the chances of both incarceration and learning gaps for youth. It is clear that youth and young adults need academic support, emotional development, and options for success.  \n \nOrdinance 1399-2021 authorized the Department of Education to contract with YMCA to engage in the Fresh Start Program.  In 2021, Fresh Start served at-risk youth ages 15-18 with social and emotional development, continued education, vocational skills / job acquisition, pro-social activity, social support, substance abuse, and victim awareness.\n \nBecause the pandemic however, success at engaging youth was inconsistent.  Now that the pandemic has abated somewhat, participation has begun to increase.  Staff have been able to access school buildings and capitalize on program referrals at a much more consistent rate. Staff have also pivoted to providing in-school group services and both virtual and in person mentoring, which has shown success. \n \nOrdinance 1399-2021 encumbered $131,450.00 in American Rescue Plan funds for the Fresh Start Program.  Of this, only $26,214.77 was spent.  Extending the current contract, and allocating the remaining balance ($105,235.23) of funds will allow YMCA to continue and increase this work in the community significantly.\n \nThe Department of Education requests the authority to modify and extend the contractual deadline for the Fresh Start Program to June 14, 2023 and to allocate the remaining funds.\n \nFiscal Impact: There is no new funding associated with this ordinance.\n \nEmergency Designation: Emergency designation is requested to modify the Fresh Start contract prior to expiration.\nTitle\nTo authorize and direct the Executive Director of the Mayor’s Office of Education to extend a contract with YMCA of Central Ohio for the purpose of supporting the Fresh Start Program; and to declare an emergency.  ($0.00)\nBody\nWHEREAS, the YMCA of Central Ohio has been dedicated and significantly engaged with youth in Franklin County; and \n \nWHEREAS, there is more work to be done and guidance to be given as gun violence increases, academic successes wane, and youth fall victim to street and drug dealings; and\n \nWHEREAS, the COVID-19 pandemic has intensified the needs of at-risk youth; and  \n \nWHEREAS, the Fresh Start Program will continue to address this need by serving at-risk youth ages 15-18 with social and emotional development, continued education, vocational skills / job acquisition, pro-social activity, social support, substance abuse, and victim awareness; and\n \nWHEREAS, the expenditure of American Rescue Plan funding to provide assistance for the YMCA of Central Ohio, a not for profit entity, is crucial for our economic recovery, necessary due to the COVID-19 public health emergency; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Mayor’s Office of Education in that it is immediately necessary to authorize the Director to modify and extend the deadline to June 14, 2023 for a grant agreement with the YMCA of Central Ohio before the contract expires, all for the preservation of public health, peace, property, and safety; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Education is hereby authorized to modify and extend a grant agreement with the YMCA of Central Ohio to support the Fresh Start Program.\n \nSECTION 3.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or 10 days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 1,
    "absent": 0,
    "meeting_id": 48,
    "meeting_date": "2022-05-23",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "ABSTAIN"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}