{
  "success": true,
  "vote": {
    "id": 3806,
    "item_number": "CA-26",
    "title": "To authorize the Director of Finance and Management to enter into a contract with K. N. S. Services, Inc. to provide camera security system improvements at the Morse Road CNG fueling station for the Fleet Management Division, in accordance with the sole source procurement provisions of Columbus City Code; and to authorize the expenditure of $9,608 from the Fleet Management Capital Fund ($9,608.00)",
    "description": "Explanation\nBackground: This ordinance authorizes the Director of Finance and Management to enter into a contract with K.N.S. Services, Inc. for camera security system improvements at the Morse Road CNG fueling station for the Fleet Management Division. \n \nK.N.S. Services currently provides installation, integration, service and support for the Genetec security surveillance system. K.N.S. is the only Unified Elite Genetec Partner in Ohio and as such K.N.S. maintains the Genetec system licensing and programming. Therefore, due to the proprietary nature of the security software and compatibility of existing security and camera equipment, it is in the best interest of the City to enter into contract with K.N.S. in accordance with the sole source procurement provisions of Columbus City Code.\nK.N.S. Services, Inc. (vendor #005443; CC# 31-1460220, expiration date March 8, 2023) $9,608.00\n \nFiscal Impact:  This ordinance authorizes an expenditure of $9,608.00 from the Capital Fund with K.N.S. Services, Inc. to provide security camera upgrades for the Morse Road CNG fueling station under the purview of the Fleet Management Division. The Fleet Management Division budgeted $6,950,129 for capital funded projects.  In 2020 $6,080,578 was expended for capital funded projects.\n \nTitle\nTo authorize the Director of Finance and Management to enter into a contract with K. N. S. Services, Inc. to provide camera security system improvements at the Morse Road CNG fueling station for the Fleet Management Division, in accordance with the sole source procurement provisions of Columbus City Code; and to authorize the expenditure of $9,608 from the Fleet Management Capital Fund ($9,608.00)\nBody\n \nWHEREAS, it is in the best interest of the City to enter into a contract with K.N.S Services, Inc. to allow for a single vendor to provide the necessary hardware, software, technical support, and camera equipment replacements for security systems for the Fleet Management Division; and  \n \nWHEREAS, due to the proprietary nature of the security software and compatibility of existing security and camera equipment, it is in the best interest of the City to enter into this contract with K.N.S. Services, Inc. in accordance with the sole source provisions of Chapter 329 of the Columbus City Code; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Finance and Management to authorize the Director to enter into a sole source contract with K.N.S. Services, Inc. for camera security system improvements at the Morse Road CNG fueling station for the Fleet Management Division; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Finance and Management Director is hereby authorized to enter into a contract with K.N.S. Services, Inc. in order to provide camera security system improvements at the Morse Road CNG fueling station for the Fleet Management Division\n \nSECTION 2. That the expenditure of $9,608.00, or so much thereof that may be necessary in regard to the action authorized in SECTION 1, is hereby authorized in Fund 5205 Fleet Management Capital Fund in object class 06 per the accounting codes in the attachment to this ordinance.\n \nSee Attached File: Ord 1282-2022 Legislation Template.xls\n \nSECTION 3. That the monies in the foregoing Sections shall be paid upon order of the Director of Finance and Management, and that no order shall be drawn or money paid except by voucher, the form of which shall be approved by the City Auditor.\n \nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 6. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 7. That this contract is made and entered into in accordance with the sole source provisions of Chapter 329 of the Columbus City Code.\n \nSECTION 8. That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 49,
    "meeting_date": "2022-06-06",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Public Works"
    ]
  }
}