{
  "success": true,
  "vote": {
    "id": 3815,
    "item_number": "CA-35",
    "title": "To authorize the Director of Recreation and Parks to enter into contract with Schorr Architects to provide design services for the Champions Golf Course and Kilbourne Run Barn Improvements Project; to authorize the transfer of $188,337.17 within the Recreation and Parks Voted Bond Fund, to authorize the amendment of the 2021 Capital Improvements Budget; to authorize the expenditure of $128,000.00 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($128,000.00)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Director of the Recreation and Parks Department to enter into contract with Schorr Architects to provide design services for the Champions Golf Course and Kilbourne Run Barn Improvements Project. The contract amount is $116,304.01, with a contingency of $11,695.99, for a total of $128,000.00 being authorized by this ordinance.\n \nChampions Golf Course, bordering Alum Creek and designed by Robert Trent Jones, is open to the public and provides recreational opportunities for all ages. In 2020, the course opened a new clubhouse with a restaurant and event rental space. The previous clubhouse facility remains in a poor state and must be demolished. Since this facility is attached to the golf cart storage barn, this project will include exterior improvements to the barn that will better match the architectural aesthetic of the new clubhouse and provide better support for daily course operations. \n \nKilbourne Run Sports Park, located less than two miles from Champions Golf Course, is a prime soccer facility for the City, hosting numerous tournaments and special events. This park requires a dedicated barn for storage of maintenance equipment and operational supplies. \n \nGiven the close proximity of these two facilities and similarity of the work required, completing them as a single project will yield efficiencies of scale which will reduce overall project costs.\n \nVendor Bid/Proposal Submissions (ODI designation status):\n \nProposals were advertised to three firms that were pre-qualified through the bi-annual Request for Statement of Qualification (RFSQ) process, in accordance with City Code Section 329, on March 10, 2022 and received by the Recreation and Parks Department on March 24, 2022. Request for proposals were sent to the following companies:\n \nSchorr Architects (MAJ)\nBBCO (MBE)\nLatus Studios (MAJ)\n \nOf note, professional services contracts are quality based selections and not based on price. Costs were not requested nor where they part of this evaluation. \n \nIn accordance with City Code, a selection team evaluated the proposals and recommended Schorr Architects be selected to perform the work.  The firm was chosen based on their referenced projects, experience, qualifications, availability, timeline, and project approach.\nPrincipal Parties: \nSchorr Architects Inc.\n230 Bradenton Avenue\nDublin, Ohio 43017                                                 \nTony Schorr, 614-798-2096                                   \nContract Compliance Number, Tax ID: 000140, 03-0499713\nContract Compliance Expiration Date: March 3, 2024\n \nEmergency Justification: Emergency action is requested so that final construction documents are ready for bidding in the summer of 2022, allowing construction to move forward between the 2022-2023 golf and soccer seasons. \n \nBenefits to the Public: Improving the storage barns for these facilities will enable staff to most effectively maintain and operate them for the public.\n \nCommunity Input/Issues: The community has expressed the desire for well-kept parks and amenities through public workshops, social media, and direct contact with City staff.  \n \nArea(s) Affected: Northland (35) and Northeast (41) - The golf and soccer communities throughout Central Ohio will benefit from the improvements to these regional facilities. \n \nMaster Plan Relation: This project will support the Recreation and Parks Master Plan by expanding and improving sports infrastructure, facilities, and accessibility.\n \nFiscal Impact: $128,000.00 is budgeted and available from within the Recreation and Parks Voted Bond Fund 7702 and 7712 to meet the financial obligations of this contract.\n \nTitle\n \nTo authorize the Director of Recreation and Parks to enter into contract with Schorr Architects to provide design services for the Champions Golf Course and Kilbourne Run Barn Improvements Project; to authorize the transfer of $188,337.17 within the Recreation and Parks Voted Bond Fund, to authorize the amendment of the 2021 Capital Improvements Budget; to authorize the expenditure of $128,000.00 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($128,000.00)\n \nBody\n \nWHEREAS, it is necessary to authorize the Director of the Recreation and Parks to enter into contract with Schorr Architects to provide design services for the Champions Golf Course and Kilbourne Run Barn Improvements Project; and\n \nWHEREAS, it is necessary to authorize the transfer of $188,337.17 within the Recreation and Parks Voted Bond Fund 7702 and 7712; and\n \nWHEREAS, it is necessary to authorize the amendment of the 2021 Capital Improvements Budget Ordinance 2707-2021 in order to provide sufficient budget authority for this and future projects; and\n \nWHEREAS, it is necessary to authorize the expenditure of $128,000.00 from the Recreation and Parks Voted Bond Fund 7702 and 7712; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Recreation and Parks Department in that it is necessary to authorize the Director to enter into contract with Schorr Architects to provide design services for the Champions Golf Course and Kilbourne Run Barn Improvements Project, so that final construction documents are ready for bidding in the summer of 2022, allowing construction to move forward between the 2022-2023 golf and soccer seasons, all for the preservation of the public health, peace, property, safety, and welfare and, NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Recreation and Parks be and is hereby authorized to enter into contract with Schorr Architects to provide design services for the Champions Golf Course and Kilbourne Run Barn Improvements Project.\n \nSECTION 2. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 4. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 5. That the transfer of 188,337.17 or so much thereof as may be needed, is hereby authorized between projects within the Recreation and Parks Bond Fund 7702 and 7712 per the account codes in the attachment to this ordinance.\n \nSECTION 6. That the 2021 Capital Improvements Budget Ordinance 2707-2021 is hereby amended as follows in order to provide sufficient budget authority for this ordinance and future projects.\n \nFund / Project / Project Name / Current / Change / Amended\n \nFund 7702 / P516000-100000; Emergency Replacement - Misc (Voted Carryover); $562,200 / ($60,337) / $501,863\nFund 7712 / P511000-100000; Renovation - Misc (Voted Carryover); $130,344 / ($60,337) / $70,007\nFund 7712 / P514003-100000; Sports Misc. (Voted Carryover); $242,288 / ($67,663) / $174,625\n \nFund 7702 / P511000-100000; Renovation - Misc (Voted Carryover); $0 / $60,337 / $60,337\nFund 7712 / P515006-100000; Champions Golf Course and Kilbourne Run Barn Improvements (Voted Carryover); $0 / $128,000 / $128,000\n \nSECTION 7. For the purpose stated in Section 1, the expenditure of $128,000.00 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Voted Recreation and Parks Bond Fund 7712 in object class 06 Capital Outlay per the accounting codes in the attachments to this ordinance.\nSECTION 8. That for the reasons stated in the preamble hereto, which is hereby made a part hereof,, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 49,
    "meeting_date": "2022-06-06",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}