{
  "success": true,
  "vote": {
    "id": 3871,
    "item_number": "3",
    "title": "To Recognize June 14th as 614 Day in the City of Columbus",
    "description": "Title\n \nTo Recognize June 14th as 614 Day in the City of Columbus\n \nBody\n \nWHEREAS, 614 Day is reflective of the date that matches our beloved city’s 614 area code, and is a special time that we reflect, respect, and honor all that makes the city of Columbus unique.\n \nWHEREAS, The City-Wide 614 Day was brought to Columbus June 14th by Yohannan Terrell and Warhol & WALL ST and was officially recognized by the City of Columbus in 2019. \n \nWHEREAS, 614 Day happens every June 14th and is a day where we celebrate Columbus, OH and the great things that come out the capital city, from the people, the food, the local businesses, to the music, the art, and community\n \nWHEREAS, 614 Day is a day where we wear our favorite Columbus T-Shirt, we eat local, we drink local, we buy local, we support local and we show our pride in our local community\n \nWHEREAS, 614 day provides residents from all over the city of Columbus an opportunity to observe our city’s strong relationship with our local business and neighborhoods, and to show our appreciation of their support.\n \nWHEREAS, 2020 and 2021 proved to be the most challenging years in generations, and we continue to return to a sense of normalcy;\n \nWHEREAS, Columbus has united to heal and move forward together. And this year’s celebration is about honoring the perseverance of the city, and celebrating the passion to move forward better that before the pandemic.\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: That this Council does hereby recognize June 14th as 614 Day in the City of Columbus.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 50,
    "meeting_date": "2022-06-13",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}