{
  "success": true,
  "vote": {
    "id": 3890,
    "item_number": "CA-16",
    "title": "To authorize the Director of Recreation and Parks to enter into a grant agreement with the Ohio Department of Natural Resources for the Eastmoor Green Line Project and accept a grant in the amount of $463,730.00 with a minimum local match of $194,770.00; to authorize the appropriation of $463,730.00 in the Recreation and Parks Grant Fund 2283; to authorize the amendment of the 2021 Capital Improvements Budget Ordinance; and to authorize the transfer of $194,770.00 within the Recreation and Parks Voted Bond Fund. ($658,500.00)",
    "description": "Explanation \n \nBackground: This ordinance authorizes the Director of Recreation and Parks to enter into a grant agreement with the Ohio Department of Natural Resources (ODNR) for the Eastmoor Green Line Project. This ordinance will also authorize the appropriation of grant and matching funds. The grant amount is $463,730.00 and the local match amount is $194,770.00. There is a total of $658,500.00 being authorized by this ordinance. \n \nIn February of 2019, the Department applied for grant funding to the Ohio Department of Natural Resources Clean Ohio Trails Fund, as authorized by Ordinance 0124-2019, to support the Eastmoor Green Line Project. In March of 2020, the Department received notice that the grant was approved. The Eastmoor Green Line will become a unique linear park for the Mid East Neighborhoods of the city.  Located on an abandoned rail corridor running from Broad Street to south of Livingston Avenue, the Green Line will provide the area’s first trail connectivity. The Green Line will be approximately 3 miles long and consist of 17.5 acres. The corridor will have passive park space, native plantings, and a 10 foot wide trail.  The project also offers important social equity for several inner city neighborhoods facing a deficit of trail access and natural resources.\n \nPrincipal Parties: \nOhio Department of Natural Resources \n2045 Morse Road, Columbus, OH  43229\nD’Juan Hammonds, 614-256-6417, Division of Real Estate\nContract Compliance Number, Tax ID: 005089, 31-1334820 \nExpiration Date: N/A (State of Ohio Agency)                                                               \n     \nBenefits to the Public: The Eastmoor, Linwood, Leawood, and Beechwood areas of the City lack access to significant open spaces and parks, as well as, access to greenways and waterways. For over 25 years, the City has been engaging in protecting and providing access to a comprehensive linear system of rivers, trails, and paths. The timing of constructing a trail within this park corridor ties directly to the City’s goal of providing a lift to inner city neighborhoods cut off from safe and easy access to outdoor experiences. The scale of construction costs estimated in this application relies heavily upon the outside funding assistance, such as the Clean Ohio Trails Fund, to achieve these goals.\n \nCommunity Input/Issues: Letters of Support for this project were received from the community, the Mideast Area Commission, the City of Whitehall, and trail users.\n \nArea(s) Affected:  Mid East (57)\n \nMaster Plan Relation:  This project will support the Recreation and Parks Master Plan by providing equitable and safe access to the City’s trail system for underserved communities.\n \nFiscal Impact: This ordinance will authorize the appropriation of $463,730.00 in grant funds in the Recreation and Parks Grant Fund 2283. This ordinance will also authorize a grant match of $194,770.00 from the Recreation and Parks Voted Bond Fund 7702. $194,770.00 is budgeted and available from within the Recreation and Parks Voted Bond Fund 7702 to meet the financial obligations of this grant match. There is a total of $658,500.00 available for this project. Future legislation will be prepared to expend these funds once construction is ready to move forward.\n \nTitle\n \nTo authorize the Director of Recreation and Parks to enter into a grant agreement with the Ohio Department of Natural Resources for the Eastmoor Green Line Project and accept a grant in the amount of $463,730.00 with a minimum local match of $194,770.00; to authorize the appropriation of $463,730.00 in the Recreation and Parks Grant Fund 2283; to authorize the amendment of the 2021 Capital Improvements Budget Ordinance; and to authorize the transfer of $194,770.00 within the Recreation and Parks Voted Bond Fund. ($658,500.00) \n \nBody\n \nWHEREAS, Ordinance No. 0124-2019 authorized the Director of Recreation and Parks to apply for funding through the Ohio Department of Natural Resources (ODNR) Clean Ohio Trails Fund and ODNR has awarded the City of Columbus a grant for the Eastmoor Green Line Project; and\n \nWHEREAS, it is necessary to authorize and direct the Director of Recreation and Parks to accept a grant in the amount of $463,730.00 and enter into an agreement with the Ohio Department of Natural Resources for the Eastmoor Green Line Project; and\n \nWHEREAS, it is necessary to authorize the appropriation of $463,730.00 to the Recreation and Parks Grant Fund; and \n \nWHEREAS, it is necessary to authorize that the 2021 Capital Improvements Budget Ordinance 2707-2021 be amended in order to provide sufficient budget authority for this legislation and future projects; and\n \nWHEREAS, it is necessary to authorize the transfer of $194,770.00 within the Recreation and Parks Voted Bond Fund; and\n \nWHEREAS, it has become necessary in the usual daily operations of the Recreation and Parks Department to authorize the Director to sign the grant agreement and accept the funding in order to move this project forward, all for the preservation of public health, peace, property, safety, and welfare and, NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That Ordinance No. 0124-2019 authorized the Director of Recreation and Parks to apply for funding through the Ohio Department of Natural Resources (ODNR) Clean Ohio Trails Fund and ODNR has awarded the City of Columbus a grant for the Eastmoor Green Line Project.\n \nSECTION 2. That the Director of Recreation and Parks is authorized and directed to accept a grant and enter into a grant agreement with the Ohio Department of Natural Resources for the Eastmoor Green Line Project. The amount of the grant is $463,730.00 and requires a minimum of $194,770.00 in City matching funds. There is a total of $658,500.00 available for this project. Future legislation will be prepared to expend these funds once construction is ready to move forward.\n \nSECTION 3. That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ending December 31, 2022, the sum of $463,730.00 is appropriated to the Recreation and Parks Grant Fund 2283 per the account codes in the attachment to this ordinance. Appropriation effective upon receipt of executed grant agreement.\n \nSECTION 4. That at the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements. \n \nSECTION 5. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 7. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 8. That the transfer of $194,770.00 or so much thereof as may be needed, is hereby authorized between projects within the Recreation and Parks Bond Fund 7702 per the account codes in the attachment to this ordinance.\n \nSECTION 9. That the 2021 Capital Improvements Budget Ordinance 2707-2021 is hereby amended as follows in order to provide sufficient budget authority for this ordinance and future projects.\nFund / Project / Project Name / Current / Change / Amended\n \nFund 7702 / P512000-100000; New Development - Misc. (Voted Carryover); $1,559,862 / ($194,770) / $1,365,092\n \nFund 7702 / P510925-512000; ODNR - Eastmoor Green Line Grant Match (Voted Carryover); $0 / $194,770 / $194,770\n \nSECTION 10. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 50,
    "meeting_date": "2022-06-13",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Grants"
    ]
  }
}