{
  "success": true,
  "vote": {
    "id": 3892,
    "item_number": "CA-18",
    "title": "To authorize the Director of Recreation and Parks to modify an existing contract with Burgess and Niple for the Olentangy Trail - Arena District Connector Project; to authorize the transfer of $126,463.51 within the Recreation and Parks Voted Bond Fund, to authorize the amendment of the 2021 Capital Improvements Budget; to authorize the expenditure of $126,463.51 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($126,463.51)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Director of the Recreation and Parks Department to modify an existing contract with Burgess and Niple for the Olentangy Trail - Arena District Connector Project. The modification amount being authorized by this ordinance is $126,463.51.\n \nThis contract modification is for additional design and construction engineering services required to complete the new Olentangy Trail pedestrian connector bridge as well as a new 3.5 acre park located downtown along the east bank of the Olentangy River. During construction, additional tasks were determined to be necessary to be included into the project by the Department of Public Utilities. It is not practical to procure these additional services from another vendor since Burgess and Niple has provided the specific engineering services associated with these two projects and the tasks were needed to be completed during construction to avoid incurring contract delay costs. The cost of the modification was determined by established hourly rates and negotiated effort hours remaining to complete the scope of work by the project team.\n \nThe Department was awarded Clean Ohio Trails Funds, through the Ohio Department of Natural Resources (ODNR) in 2018 to build a bridge from the Olentangy Trail to a newly improved Nationwide Boulevard and Confluence Village, a major redevelopment in downtown Columbus. Since opening in July of 2021, the bridge has been used by thousands of pedestrians and cyclists. Also, the Recreation and Parks Department is nearly complete with a new 3.5 acre park along the Olentangy River, enabling a significant downtown greenspace to be opened to further compliment the new commercial and residential developments underway in the area, including the recently opened new home of the Columbus Crew. \n \nPrincipal Parties: \nBurgess and Niple, Ltd.\n5085 Reed Road, Columbus, Ohio 43220                                                 \nJohn Shanks (614) 459-2050                 \nContract Compliance Number, Tax ID: 004425, 31-0885550\nContract Compliance Expiration Date: February 9, 2024\n \nEmergency Justification: Emergency action is requested as construction work is currently taking place and the department does not want a delay in providing design and engineering services for the construction work.\n \nBenefits to the Public: Over two million people visit the Arena District each year. The area contains major attractions, special events, employment centers, and rapidly expanding residential living.  The Olentangy Trail travels along the west side of the river and thousands of trail users will be able to access the east side of the river via the connector bridge, providing a safe, direct, and non-motorized corridor into the heart of the Arena District. Also the bridge will connect to a 128 mile trail network spanning the entire region.\n \nCommunity Input/Issues: Several planning documents and studies recommend safe and easy access to the north side of downtown. Non-motorized and active transportation is considered one of the key draws to downtown as a place to live, work, and play. Current trail access is limited to an indirect route and many residents have inquired about more direct connectivity. \n \nArea(s) Affected: Downtown (55) - All Columbus and regional trail users will benefit from these improvements, especially neighborhoods west of Route 315.\n \nMaster Plan Relation: This project supports the department’s Master Plan by improving access to trails and greenways corridors. It provides safe connections to the regional trail network for nearby neighborhoods. The project will provide an overall safer trail and access to active mode of transportation for the nearby community. It also promotes the environmental health of the City by improving recreational access to waterways while providing long term protection corridors for water quality and trail development.\n \nFiscal Impact: The expenditure of  $898,362.74 was legislated for the Alum Creek Trail - Johnstown Road East Side Connector construction contract by Ordinances 1556-2017 and 1272-2019. This ordinance will provide funding that will modify the previously authorized amount by $126,463.51. $126,463.51 is budgeted and available in the Recreation and Parks Voted Bond Fund 7702 to meet the financial obligations of this contract modification. The aggregate total amount authorized, including this modification, is $1,024,826.25.   \n \nTitle\n \nTo authorize the Director of Recreation and Parks to modify an existing contract with Burgess and Niple for the Olentangy Trail - Arena District Connector Project; to authorize the transfer of $126,463.51 within the Recreation and Parks Voted Bond Fund, to authorize the amendment of the 2021 Capital Improvements Budget; to authorize the expenditure of $126,463.51 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($126,463.51)\n \nBody\n \nWHEREAS, it is necessary to authorize the Director of the Recreation and Parks to modify an existing contract with Burgess and Niple for the Olentangy Trail - Arena District Connector Project; and\n \nWHEREAS, it is necessary to authorize the transfer of $126,463.51 within the Recreation and Parks Voted Bond Fund 7702; and\n \nWHEREAS, it is necessary to authorize the amendment of the 2021 Capital Improvements Budget Ordinance 2707-2021 in order to provide sufficient budget authority for this and future projects; and\n \nWHEREAS, it is necessary to authorize the expenditure of $126,463.51 from the Recreation and Parks Voted Bond Fund 7702; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Recreation and Parks Department in that it is immediately necessary to authorize the Director to modify this contract as construction work is currently taking place and the department does not want a delay in providing design and engineering services for the construction work, all for the preservation of the public health, peace, property, safety, and welfare and, NOW, THEREFORE \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Recreation and Parks be and is hereby authorized to modify an existing contract with Burgess and Niple for the Olentangy Trail - Arena District Connector Project.\n \nSECTION 2. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 4. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 5. That the transfer of $126,463.51 or so much thereof as may be needed, is hereby authorized between projects within the Recreation and Parks Bond Fund 7702 per the account codes in the attachment to this ordinance.\n \nSECTION 6. That the 2021 Capital Improvements Budget Ordinance 2707-2021 is hereby amended as follows in order to provide sufficient budget authority for this ordinance and future projects.\nFund / Project / Project Name / Current / Change / Amended\n \nFund 7702 / P510306-100000; Olentangy Trail (Voted Carryover) / $19,296 / ($19,296) / $0\nFund 7702 / P512000-100000; New Development - Misc. (Voted Carryover); $1,225,577 / ($107,167) / $1,118,410\n \nFund 7702 / P510306-100003; Olentangy Trail - Arena District Connector Bridge (Voted Carryover) / $0 / $126,463 / $126,463\n \nSECTION 7. For the purpose stated in Section 1, the expenditure of $126,463.51 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Recreation and Parks Voted Bond Fund 7702 in object class 06 Capital Outlay per the accounting codes in the attachments to this ordinance.  \n \nSECTION 8. That for the reasons stated in the preamble hereto, which is hereby made a part hereof,, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 1,
    "absent": 0,
    "meeting_id": 50,
    "meeting_date": "2022-06-13",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "ABSTAIN"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}