{
  "success": true,
  "vote": {
    "id": 3948,
    "item_number": "SR-16",
    "title": "To authorize the City Clerk to enter into a grant agreement with the UNIK Foundation in support of its Expand Reentry Programming for the New American/Immigrant/Muslim Communities in Columbus initiative; to authorize an appropriation and expenditure of $50,000.00 within the Neighborhood Initiatives subfund; and to declare an emergency. ($50,000.00)",
    "description": "Explanation\n \nThis ordinance authorizes the City Clerk to enter into a grant agreement with the UNIK Foundation in support of its Expand Reentry Programming for the New American/Immigrant/Muslim Communities in Columbus initiative.\n \nThe UNIK Foundation is a Columbus-based non-profit organization dedicated to supporting incarcerated citizens from the New American/Immigrant/Muslim communities. Restored citizens in general, and New Americans/Immigrant/Muslim restored citizens in particular, face tremendous challenges navigating and finding suitable and affordable housing in safe neighborhoods and good paying jobs to escape poverty. UNIK engages with inmates prior to release to prepare them for community reintegration. Once released, restored citizens are assigned dedicated case managers help individuals quickly find suitable housing and job-training program through our community partners.\n \nThis funding will expand UNIK’s in-prison reentry program (culturally-appropriate cognitive behavioral Therapy and digital job readiness) to include more correctional institutional partners.  It will engage incarcerated individuals in-prison with reentry programming, while efficiently connecting individuals with needed services through its community resource partners (such as Southeast, Inc, and Heart of Ohio Family Health) post-release.\n \nFISCAL IMPACT: Funding for this grant agreement is available within the Neighborhood Initiatives subfund.\n \n \nEMERGENCY DESIGNATION: Emergency action is requested to immediately provide resources necessary to expand programming within vulnerable Columbus communities.\n \n \nTitle\n \nTo authorize the City Clerk to enter into a grant agreement with the UNIK Foundation in support of its Expand Reentry Programming for the New American/Immigrant/Muslim Communities in Columbus initiative; to authorize an appropriation and expenditure of $50,000.00 within the Neighborhood Initiatives subfund; and to declare an emergency. ($50,000.00)\n \n \nBody\n \nWHEREAS, Columbus City Council has focused on being a welcoming City to all of its immigrant, migrant, and refugee residents; and\n \nWHEREAS, there has also been a focus on criminal justice solutions that emphasize reentry for ex-offenders and reduce recidivism; and\n \nWHEREAS, the UNIK Foundation is a Columbus-based non-profit organization dedicated to supporting incarcerated citizens from the New American/Immigrant/Muslim communities; and\n \nWHEREAS, Council is providing funding to expand UNIK’s Expand Reentry Programming for the New American/Immigrant/Muslim Communities in Columbus initiative; and\n \nWHEREAS, there is funding available for this purpose within the Neighborhood Initiatives subfund; and\n \nWHEREAS, an emergency exists in the usual daily operation of the City Clerk in that it is immediately necessary to authorize the City Clerk to enter into a grant agreement with the UNIK Foundation in support of its Expand Reentry Programming to provide these services, and to preserve the public health, property, safety, and welfare; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the City Clerk is hereby authorized and directed to enter into a grant agreement with the UNIK Foundation in support of the Expand Reentry Programming for the New American/Immigrant/Muslim Communities in Columbus initiative.\n \nSECTION 2. That the Auditor is hereby authorized to appropriate $50,000.00 within the Neighborhood Initiatives subfund, fund 1000, subfund 100018 per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That per the action authorized by Section 1 of this ordinance, the expenditure of $50,000.00 is hereby authorized per the accounting codes in the attachment to this ordinance.\n \nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 5. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 50,
    "meeting_date": "2022-06-13",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}