{
  "success": true,
  "vote": {
    "id": 4054,
    "item_number": "CA-18",
    "title": "To amend the 2021 Capital Improvements Budget; to authorize the transfer of funds and appropriation between projects within the Streets and Highways Bond Fund; to authorize the Director of Public Service to modify a contract with Double Z Construction Company in connection with the King Lincoln District - Long Street, Garfield Avenue, Monroe Avenue and Talmadge Street project; to authorize the expenditure of up to $312,033.35 from the Streets and Highways Bond Fund; and to declare an emergency.  ($312,033.35)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Service to modify and increase an existing contract with Double Z Construction Company for the King Lincoln District - Long Street, Garfield Avenue, Monroe Avenue and Talmadge Street project (P441770-100000, the “Streetscape Improvements”) project in an amount up to $312,033.35.\nOrdinance 0404-2021 authorized the Director of Public Service to enter into a contract with Double Z Construction Company for the construction of the King Lincoln District - Long Street, Garfield Avenue, Monroe Avenue and Talmadge Street project and to provide for construction administration and inspection services.\n \nOrdinance 1803-2021 authorized the work for modification 1 which consisted of an additional duct vault and 1,888 accumulative feet of additional duct bank conduit installation, and other such work as may be necessary.\n \nThe work performed to date for this project consists of the major reconstruction of Long Street, Garfield Avenue, Talmadge Street and Monroe Avenue. The major work components of concrete, asphalt and safety features have all been constructed. The undergrounding of the overhead facilities remains a work item as the power cable, a major component described below, has yet to be procured and installed. Currently, the project from a traffic standpoint has reached substantial completion as traffic is using the full lanes of traffic throughout the corridor. Significant volume of primary electrical and demolition of the existing overhead utilities remains.\n \nThe work for modification 2 will consist of significant extra work on the permanent power found primarily underground where the plan documents did not adequately address the appropriate circuitry to conduct the work as programmed. This has caused the project delay costs and significant upcharges in cabling prices due to supply chain shortages. A second significant cost impact to the project was observed on N. Monroe Avenue south of Long Street where updates to the profiles of Long Street had negatively impacted the drainage along the west curb line. To create positive drainage, a significant volume of work is required, including curb and driveway demolition, leveling course of asphalt, milling and fill operation on the current profile of Monroe Avenue. A third extra work item is the effort addressing the orphaned street lights. The project as programmed did not address existing overhead lighting following the projects intention to underground the primary power on the project. An RFP was provided to the contractor for cost estimation and other such work as may be necessary to complete the contract.  \n \nThe original contract amount, no inspection:             $                     3,275,108.84                     (PO265380, Ord. 0404-2021)   \nThe total of Modification No. 1, no inspection:         $                     312,380.00     (PO282842, Ord. 1803-2021)                       \nThe total of Modification No. 2, no inspection:         $                     312,033.35     (This Ordinance)\nThe contract amount including all modifications:     $                     3,899,522.19 \n \nSearches in the System for Award Management (Federal) and the Findings for Recovery list (State) produced no findings against Double Z Construction Company.\n \n2.  UNPLANNED MODIFICATION\nThis is an unplanned modification that is necessary because the design documents do not include the electrical single line diagram in sufficient detail to have included the modification dollars in the original scope. This unforeseen condition met the requirements of extra work in the City of Columbus specification. The planned scope of work did not include the drainage modifications along N. Monroe Avenue at the time of legislation. A service request regarding the drainage issue was brought to the attention of the construction team and it was requested to add the effort into the scope. The plan documents do not adequately address the overhead circuit following the demolition of the overhead circuit. The orphaned lighting was requested by Division of Power to be restored by the construction project. The costs of this extra work item was not contemplated in the original scope. It was deemed to be more cost efficient to modify the existing contract than to bid this part of the work.\n \n3.  CONTRACT COMPLIANCE\nThe contract compliance number for Double Z Construction Company is CC005966 and expires 06/29/2023.\n \n4.  Pre-Qualification Status\nDouble Z Construction Company and all proposed trades subcontractors have met Code requirements with respect to pre-qualification, pursuant to relevant sections of Columbus City Code Chapter 329.  \n \n5.  FISCAL IMPACT\nFunding in the amount of $312,033.35 is available within the Streets and Highways Bond Fund within the Department of Public Service.  An amendment to the 2021 Capital Improvements Budget and a transfer of funds are necessary to align funding for these project expenditures.  \n \n6.  EMERGENCY DESIGNATION\nEmergency action is requested to prevent unnecessary delays in the completion of modification 2 for the King Lincoln District - Long Street, Garfield Avenue, Monroe Avenue and Talmadge Street project to facilitate the completion of planned improvements in a timely manner, to ensure the safety of the traveling public.\n \nTitle\nTo amend the 2021 Capital Improvements Budget; to authorize the transfer of funds and appropriation between projects within the Streets and Highways Bond Fund; to authorize the Director of Public Service to modify a contract with Double Z Construction Company in connection with the King Lincoln District - Long Street, Garfield Avenue, Monroe Avenue and Talmadge Street project; to authorize the expenditure of up to $312,033.35 from the Streets and Highways Bond Fund; and to declare an emergency.  ($312,033.35) \n \nBody\nWHEREAS, contract no. PO265380 with Double Z Construction Company, in the amount of  $3,275,108.84, was authorized by ordinance no. 0404-2021; and \n \nWHEREAS, modification no. 1, PO282842, in the amount of $312,380.00, was authorized by ordinance no. 1803-2021; and\n \nWHEREAS,   it has become necessary to modify the contract in an amount up to $312,033.35 for the purpose of performing additional construction work in the King Lincoln District - Long Street, Garfield Avenue, Monroe Avenue and Talmadge Street projects; and\n \nWHEREAS, it is necessary to provide for contract payment for that project; and \n \nWHEREAS, it is necessary to amend the 2021 Capital Improvement Budget and transfer cash to align funding for project expenditures; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to authorize the Director to modify a contract with Double Z Construction Company to  in order to prevent delays in the construction schedule and to ensure the safety of the traveling public thereby preserving the public health, peace, property, safety, and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n                     \nSECTION 1.  That the 2021 Capital Improvements Budget authorized by ordinance 2707-2021 be amended to establish sufficient authority for this project:\n \nFund / Project / Project Name / Current C.I.B. / Amendment Amount / C.I.B. as Amended\n \n7704 / P530282-100051 / Resurfacing - Resurfacing Projects (Voted 2019 SIT Supported) / $2,904,278.00 / ($253,943.00) / $2,650,335.00\n \n7704 / P441770-100000/ King Lincoln District - Long, Garfield, Monroe and Talmadge (Voted 2019 SIT Supported)/ $00.00 / $253,943.00 / $253,943.00\n \nSECTION 2.  That the transfer of $253,942.34 or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5911 (Infrastructure Management), Project P530282-100051 (Resurfacing - Resurfacing Projects), Object Class 06 (Capital Outlay) to Dept-Div 5912 (Design and Construction), P441770-100000 (King Lincoln District - Long, Garfield, Monroe and Talmadge), Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\nSECTION 3.  That the Director of Public Service be and hereby is authorized to enter into a contract modification with Double Z Construction Company located at 2550 Harrison Road, Columbus, OH 43204, for the King Lincoln District - Long Street, Garfield Avenue, Monroe Avenue and Talmadge Street project in the amount of $312,033.35, or so much thereof as may be needed, in accordance with the plans and specifications on file in the Department of Public Service, which are hereby approved.\nSECTION 4.  That the expenditure of $312,033.35 or so much thereof as may be needed, is hereby authorized in Fund 7704 (Streets and Highways Bond Fund), Dept-Div 5912 (Design and Construction), Project P441770-100000 (King Lincoln District - Long Street, Garfield, Monroe and Talmadge), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\nSECTION 5.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\nSECTION 7.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\nSECTION 8.   That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the mayor, or ten days after passage if the mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 1,
    "absent": 0,
    "meeting_id": 52,
    "meeting_date": "2022-07-11",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSTAIN"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}