{
  "success": true,
  "vote": {
    "id": 4060,
    "item_number": "CA-24",
    "title": "To authorize and direct the Director of the Department of Neighborhoods to accept a grant in the amount of $100.00 and enter into an agreement with Per Scholas to host engagement events that focus on education and information related to exploring tech career pathways for boys and young men of color; to appropriate $100.00 to the Department of Neighborhoods Grant Fund; and to declare an emergency. ($100.00)",
    "description": "...Explanation\nBackground: This ordinance appropriates monies originally awarded in 2019 to the Department of Neighborhoods from Per Scholas via their partnership with KeyBank Business Boost & Build Powered by Jumpstart Initiative to provide financial support to My Brother’s Keeper for engagement events that focus on education and information related to exploring tech career pathways, as well as an opportunity to seek relevant industry training and certification through Per Scholas Columbus.\nPrincipal Parties:\nPer Scholas\n112 Jefferson Ave\nColumbus, OH. 43215\nFederal ID# 04-3252955\n \nEmergency Justification: Emergency action is requested to comply with the terms of the grant and so that funds are available for use.\nFiscal Impact: This ordinance authorizes the appropriation of $100.00 within the Department of Neighborhoods Grant Fund in an agreement with Per Scholas via their partnership with Key Bank Business Boost & Build Powered by Jumpstart Initiative for the financial support of My Brother’s Keeper. \n...Title\nTo authorize and direct the Director of the Department of Neighborhoods to accept a grant in the amount of $100.00 and enter into an agreement with Per Scholas to host engagement events that focus on education and information related to exploring tech career pathways for boys and young men of color; to appropriate $100.00 to the Department of Neighborhoods Grant Fund; and to declare an emergency. ($100.00)\n...Body\nWHEREAS, Per Scholas previously awarded the City of Columbus, Department of Neighborhoods, a grant to provide outreach opportunities to My Brother’s Keeper participants; and\nWHEREAS, it is necessary to appropriate $100.00 to the Department of Neighborhoods Grant Fund; and\nWHEREAS, an emergency exists in the usual daily operation of the Department of Neighborhoods in that it is immediately necessary to appropriate said grant funds to comply with the terms of the grant and so that funds are available for My Brother’s Keeper programming; NOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1. This ordinance authorizes the appropriation of $100.00 within the Department of Neighborhoods Grant Fund.\nSECTION 2. That from the unappropriated monies in the Department of Neighborhoods Grant Fund and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the grant period ending December 31, 2022, the sum of $100.00 and any eligible interest earned during the grant period is hereby appropriated within fund 2291, Department of Neighborhoods Grant Fund per the account codes in the attachment to this ordinance.\nSECTION 3. That the monies in the foregoing Section 2 shall be paid upon order of the Director of the Department of Neighborhoods, and that no order shall be drawn or money paid except by voucher, the form of which shall be approved by the City Auditor.\nSECTION 4. At the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements.\nSECTION 5. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\nSECTION 6. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 52,
    "meeting_date": "2022-07-11",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}