{
  "success": true,
  "vote": {
    "id": 4110,
    "item_number": "CA-74",
    "title": "To authorize the Board of Health to modify an existing contract with Gatehouse Media Partners, Inc., for media campaign services for the period of April 1, 2022 through August 31, 2022 ; to authorize the expenditure of $7,556.00 from the Health Operating fund to pay the costs thereof; and to declare an emergency.  ($7,556.00).",
    "description": "Explanation\n \nBACKGROUND:   This ordinance authorizes the Board of Health to modify an existing contract with Gatehouse media Partners, Inc for media campaign services that promotes violence reduction and increased awareness on the impact of trauma the period of April 1, 2022 through August 31, 2022 in an amount not to exceed $7,556.00 for a new contract amount of $107,556.00. These services were advertised through Bonfire (RFQ020955) according to bidding requirements of the City Code. \n \nColumbus Public Health has a need for media campaign services that promotes violence reduction and increased awareness on the impact of trauma. An emphasis will be placed on targeted strategies to create measurable engagement, knowledge, awareness building, and behavioral change.\n \nEmergency action is requested in order to not delay the start of video production services.\n \nFISCAL IMPACT:  $7,556.00 is budgeted in the Health Operating Fund for violence and trauma media campaign services. \n \nTitle\n \nTo authorize the Board of Health to modify an existing contract with Gatehouse Media Partners, Inc., for media campaign services for the period of April 1, 2022 through August 31, 2022 ; to authorize the expenditure of $7,556.00 from the Health Operating fund to pay the costs thereof; and to declare an emergency.  ($7,556.00).\n \nBody\n \nWHEREAS, The Board of Health has a need to modify an existing media campaign contract with Gatehouse Media Partners Inc. and\n \nWHEREAS, Gatehouse Media Partners, Inc has the expertise required; and\n \nWHEREAS, an emergency exists in the daily operations of Columbus Public Health such that it is immediately necessary to authorize the Board of Health to modify a contract with Gatehouse Media Partners, Inc for media campaign services, in order to not delay the start of video production services,all for the immediate preservation of the public health, peace, property, safety and welfare; NOW THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Board of Health is hereby authorized  to modify an existing contract with Gatehouse Media Partners, Inc. in the amount of $7,556.00 for the period of April 1, 2022 through August 31, 2022\n \nSECTION 2.  That to pay the costs of said contract, the expenditure of $7,556.00 is hereby authorized from the Health Operating fund. \n \nSECTION 3.  That this contract is in compliance with Chapter 329 of the Columbus City Code.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes necessary to ensure that this contract is properly accounted for and recorded accurately on the city's financial records.\n \nSECTION 5.  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 52,
    "meeting_date": "2022-07-11",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}