{
  "success": true,
  "vote": {
    "id": 4127,
    "item_number": "SR-14",
    "title": "To authorize the Director of Finance and Management to associate all General Budget reservations resulting from this ordinance with the appropriate Universal Term Contract Purchase Agreements for the purchase of water meters and appurtenances needed for the Division of Water’s Enhanced Meter Project (EMP) (fka “Advanced Metering System{AMS} Implementation Project”), with various water meter vendors; to authorize the appropriation and transfer of $33,000,000.00 from the Water System Reserve Fund to the Water Supply Revolving Loan Account Fund; to authorize the appropriation and expenditure of $33,000,000.00 from the Water Supply Revolving Loan Account Fund; to authorize an amendment to the 2021 Capital Improvements Budget; and to declare an emergency.  ($33,000,000.00)",
    "description": "Explanation\n \nThat the Finance and Management Director is hereby authorized to associate all General Budget Reservations resulting from this ordinance with the appropriate Universal Term Contract Purchase Agreements for water meters and appurtenances, with the vendors listed below.\n \nThe Purchase Agreement associations listed require approval by City Council in order for the division to expend more than $100,000.00, per Columbus City Code Section 329. \n \nPurchase Orders will be established to purchase water meters and appurtenances for the Division of Water’s *Enhanced Meter Project (EMP), CIP No. 690358-100001.  The EMP will allow for centralized reading of the Division’s retail meters via radio transmitters and receivers, which will greatly reduce meter reading costs, allowing for more frequent readings and billings, provide data for analysis of unaccounted-for water, and greatly enhance our customer service capabilities.\n \n*Project formerly named Advanced Metering System (AMS) Implementation Project.\n \nThe Department of Public Utilities, Division of Water requests funding of $33,000,000.00 to be distributed between the vendors below:\n \n                     UTC # /                      C.C. # /                                           \nVendor                     Exp. Date                     Exp. Date                     DAX #             Status\nBadger Meter, Inc.                     PA003472 - 3/31/23                     39-0143280 - expired**                     7720                     MAJ                     \nNeptune Technology, Inc.                     PA003474 - 3/31/23                     13-4192672 - expired**                     0689                     MAJ\nMetron-Farnier LP                     PA003475 - 3/31/23                     84-1328980 - expired**                     10502                     MAJ\nMaster Meter, Inc.                     PA003473 - 3/31/23                     75-1739575 - expired**                     10104                     MAJ\nCore & Main, LP.                     PA003476 - 3/31/23                     03-0550887 - 2/24/23                     0148                     MAJ\n \n**Vendors will be contacted to update Contract Compliance Numbers.\n \nThese companies are not debarred according to the Excluded Parties listing of the Federal Government and are not listed in the Auditor of States database for Findings for Recovery.\n \nCommunity Planning Area = “99 - Citywide”\n \n3. EMERGENCY DESIGNATION:  It is requested that this Ordinance be handled in an emergency manner in order to meet the project timeline and deliverables schedule.\n \n4. FISCAL IMPACT:  This Ordinance authorizes the City Auditor to appropriate and transfer funds from the Water System Reserve Fund to the Water Supply Revolving Loan Account Fund in order to fund this proposed expenditure.  This transaction is a temporary measure that is required until such time as the Division is able to execute a loan with the Water Supply Revolving Loan Account Fund and reimburse the Water System Reserve Fund.  The loan is expected to be approved in July 2022.  An amendment to the 2021 Capital Improvements Budget will also be necessary.\n \n \nTitle\n \nTo authorize the Director of Finance and Management to associate all General Budget reservations resulting from this ordinance with the appropriate Universal Term Contract Purchase Agreements for the purchase of water meters and appurtenances needed for the Division of Water’s Enhanced Meter Project (EMP) (fka “Advanced Metering System{AMS} Implementation Project”), with various water meter vendors; to authorize the appropriation and transfer of $33,000,000.00 from the Water System Reserve Fund to the Water Supply Revolving Loan Account Fund; to authorize the appropriation and expenditure of $33,000,000.00 from the Water Supply Revolving Loan Account Fund; to authorize an amendment to the 2021 Capital Improvements Budget; and to declare an emergency.  ($33,000,000.00)\n \n \nBody\n \nWHEREAS, the Purchasing Office has established Universal Term Contract Purchase Agreements with various water meter suppliers, for the purchase of Water Meters and Appurtenances; and\n \nWHEREAS, the Division of Water needs to establish purchase orders in the amount of $33,000,000.00 for water meters and appurtenances needed for the Division of Water’s Enhanced Meter Project (EMP); and \n \nWHEREAS, it is necessary to both appropriate funds from the Water System Reserve Fund and to authorize the transfer of said funds into the Water Supply Revolving Loan Account Fund in order to temporarily fund this expenditure, until such time as the City is able to execute a loan for the above stated purpose and reimburse the Water System Reserve Fund; and\n \nWHEREAS, the City anticipates incurring certain Original Expenditures (as defined in Section 1.150-2(c) of the Treasury Regulations (the “Treasury Regulations”) promulgated pursuant to the Internal Revenue Code of 1986, as amended) with respect to the construction of the Project described in this Ordinance (collectively, the “Project”); and\n \nWHEREAS, an emergency exists in the usual daily operation of the Division of Water, Department of Public Utilities, in that it is immediately necessary to authorize the Director of Finance and Management to associate all General Budget Reservations resulting from this ordinance with the appropriate Universal Term Contract Purchase Agreements, for the purchase of water meters and appurtenances needed for the Division of Water’s Enhanced Meter Project (EMP), in an emergency manner in order to meet the project timeline and deliverables schedule; for the immediate preservation of the public health, peace, property and safety; now therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Finance and Management be and is hereby authorized to associate all General Budget Reservations resulting from this ordinance with the appropriate Universal Term Contract Purchase Agreements for water meters and appurtenances needed for the Division of Water’s Enhanced Meter Project (EMP), for the Division of Water, in an amount up to $33,000,000.00.\n \nSECTION 2. That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2022, the sum of $33,000,000.00 is appropriated in Fund 6003 - Water System Reserve Fund, in Object Class 10 - Transfer Out Expenditure, per the account codes in the attachment to this ordinance.\n \nSECTION 3. That the transfer of $33,000,000.00 or so much thereof as may be needed, is hereby authorized between Fund 6003 - Water System Reserve Fund and Fund 6011 - Water Supply Revolving Loan Account Fund, per the account codes in the attachment to this ordinance.\n \nSECTION 4. That the appropriation and expenditure of $33,000,000.00 or so much thereof as may be needed, is hereby authorized in Fund 6011 - Water Supply Revolving Loan Account Fund, in Object Class 06 - Capital Outlay, per the accounting codes in the attachment to this ordinance. \n \nSECTION 5.  That upon obtaining other funds for the purpose of funding water system capital improvement work, the City Auditor is hereby authorized to repay the Water System Reserve Fund the amount transferred under Section 3 above, and said funds are hereby deemed appropriated for such purpose.\n \nSECTION 6.  That the City intends that this Ordinance constitute an \"official intent\" for purposes of Section 1.150-2(e) of the Treasury Regulations, and that the City reasonably expects to reimburse itself for certain Original Expenditures incurred with respect to the Project from the proceeds of obligations to be issued by the City in a principal amount currently estimated to be $33,000,000.00 (the \"Obligations\").\n \nThe City intends to make a reimbursement allocation on its books for the Original Expenditures not later than eighteen months following the later to occur of the date of the Original Expenditure to be reimbursed or the date the Project for which such Original Expenditures were made is \"placed in service\" within the meaning of Treasury Regulations Section 1.150-2(c).  Upon the issuance of the Obligations, the proceeds of such Obligations shall be used to reimburse the Water System Reserve Fund, Fund No. 6003, which is the fund from which the advance for costs of the Project will be made.\n \nSECTION 7.  That the funds necessary to carry out the purpose of this Ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 8.  That the City Auditor is hereby authorized and directed to transfer any unencumbered balance in the project account to the unallocated balance within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies no longer required for said project; except that no transfer shall be made from a project account by monies from more than one source.\n \nSECTION 9.  That the City Auditor is authorized to establish proper project accounting numbers as appropriate.\n \nSECTION 10.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this Ordinance.\n \nSECTION 11.  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 52,
    "meeting_date": "2022-07-11",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}