{
  "success": true,
  "vote": {
    "id": 4128,
    "item_number": "SR-15",
    "title": "To authorize the Finance and Management Director to modify the contracts for the option to purchase Distribution Wire and Cable with American Wire and Cable and Consolidated Electrical Distributors, Inc.; to waive the provisions of competitive bidding, and to declare an emergency.",
    "description": "Explanation\nBACKGROUND:  This legislation authorizes the Finance and Management Director to modify two (2) existing Universal Term Contracts (UTC) for the option to obtain Distribution Wire and Cable with American Wire Group and Consolidated Electrical Distributors, Inc.  This contract provides for wire and cable used in the distribution of electricity within the City of Columbus service area.  This modification is necessary to award additional items to these vendors for which they were the second low bidder.  The original vendor awarded these items is experiencing supply issues and in order to have another source to obtain these goods, it is necessary to have these items awarded to two potential suppliers.  As the original contract did not allow for award to multiple vendors for the same items, it is necessary to waive the provisions of competitive bidding.  The contracts, PO314739 and PO316833 were established in accordance with Request for Quotation RFQ020579 and will expire March 31, 2025.\n \nAmerican Wire Group, CC# 009875 expires 1/3/24, Items 2, 4-7, 11-13 and 27-28A\nConsolidated Electrical Distributors, CC# 010270 expires 5/28/23, Items 1 and 3 \n \nNo additional funds are necessary to modify the option contract as requested.  There is no change in the type of products being procured.  The original contract was formally bid.  The original terms and conditions will remain in effect. \n \nEMERGENCY DESIGNATION:  The Finance and Management Department respectfully requests this legislation be considered an emergency in order to obtain sufficient stock of these vitally needed materials.\n \nFISCAL IMPACT: No funding is required to modify the option contracts.  The Department of Public Utilities must set aside their own funding for their estimated expenditures.  \n \nTitle\n \nTo authorize the Finance and Management Director to modify the contracts for the option to purchase Distribution Wire and Cable with American Wire and Cable and Consolidated Electrical Distributors, Inc.; to waive the provisions of competitive bidding, and to declare an emergency.\n \nBody\n \nWHEREAS, the Purchasing Office entered into multiple Universal Term Contracts for Distribution Wire and Cable for use by Division of Power; and,  \n \nWHEREAS, it is necessary to modify the existing Universal Term Contracts to add additional items to their award, with American Wire and Cable, Items 2, 4-7, 11-13 and 27-28A and Consolidated Electrical Distributors, Inc., Items 1 and 3; and,\n \nWHEREAS, as the original contract specifications did not provide for multiple award of the same items, it is necessary to waive the provisions of competitive bidder; and, \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Utilities in that it is necessary to authorize the Finance and Management Director to immediately modify two (2) Universal Term Contracts with  American Wire and Cable and Consolidated Electrical Distributors, Inc for the option to obtain Distribution Wire and Cable in order to obtain sufficient stock of these vitally needed materials, thereby preserving the public health, peace, property, safety, and welfare; now, therefore: \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Finance and Management Director is hereby authorized to modify two (2) contracts for option to obtain Distribution Wire and Cable with American Wire and Cable and Consolidated Electrical Distributors, Inc.\n \nSECTION 2. That this modification is in accordance with relevant provisions of Section 329 of the Columbus City Code.  \n \nSECTION 3. This Council finds it is in the best interest of the City of Columbus to waive the relevant provisions of Columbus City Codes Section 329 to permit the aforementioned purchase.\n \nSECTION 4.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 52,
    "meeting_date": "2022-07-11",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}