{
  "success": true,
  "vote": {
    "id": 4130,
    "item_number": "SR-17",
    "title": "To authorize the Director of the Department of Development to enter into a subaward agreement with Legal Aid Society of Columbus in an amount up to $600,000.00 to provide housing stability services (as defined by U.S. Treasury) to qualifying residents of the local community to ensure housing stability; to authorize the Director of Development to modify the terms and conditions of the subaward agreement as needed without seeking further City Council approval; to authorize payment of expenses starting January 1, 2021; to authorize the expenditure of up to $600,000.00 from the Emergency Rental Assistance 2 Funds; and to declare an emergency ($600,000.00)",
    "description": "Explanation\nBACKGROUND:  This legislation authorizes the Director of the Department of Development to enter into a subaward grant agreement with Legal Aid Society of Columbus in an amount up to $600,000.00 of federal Emergency Rental Assistance 2 funds to provide housing stability services for qualified residents and providing for expenses starting January 1, 2021.  Legal Aid Society of Columbus shall be a “subrecipient” as defined under federal guidelines.\n \nOrdinance 2275-2021 authorized the City of Columbus to accept and appropriate $22,355,652.60 of federal Emergency Rental Assistance (ERA 2) program funds, as passed by the Consolidated Appropriations Act of 2021.  Of this amount, up to $600,000.00 will be used for a subaward agreement with Legal Aid Society of Columbus to provide housing stability services (as defined by U.S. Treasury) to qualifying residents of the local community to ensure housing stability.\n \nIn this agreement, at least 60% of the funding will support households with an AMI at 50% or below and/or have a member of the household who has been unemployed for 90 days; up to 40% of the funding can be used for households with an AMI at 80% or below; and 10% of the funding will be utilized for Administrative costs. \n \nLegal Aid Society of Columbus will be piloting an expansion of its current work at the on-site clinic at eviction court. This one year pilot, funded by both ERA2 and City of Columbus general funds (see companion ordinance), will provide enhanced services at court to give tenants a fair chance to access legal representation and remain in their homes. These services will help address the many needs of tenants experiencing multiple barriers to achieving lasting housing stability. Legal Aid Society of Columbus has successfully provided services as a partner in an ERA1 agreement and has access to eligible tenants and landlords for providing services with ERA2 funds.\n \nIt is expected that the guidance from the U.S. Department of Treasury will be modified while this subaward agreement is in effect and it is requested that the Director of Development be given the authority to modify the terms and conditions of the subaward agreement without seeking additional Council Approval in order to align with the most current version of the laws, regulations, and guidance.\n \nEmergency action is requested to prevent as many evictions as possible.\n \nFISCAL IMPACT: Funding is provided to the City of Columbus from the Consolidated Appropriations Act of 2021 passed by Congress and signed into law December 27, 2020, and contingent upon passage of Ordinance 2275-2021.\n \nCONTRACT COMPLIANCE:  the vendor’s vendor number is 006124 and expires 3/28/2024.\n \n \nTitle\nTo authorize the Director of the Department of Development to enter into a subaward agreement with Legal Aid Society of Columbus in an amount up to $600,000.00 to provide housing stability services (as defined by U.S. Treasury) to qualifying residents of the local community to ensure housing stability; to authorize the Director of Development to modify the terms and conditions of the subaward agreement as needed without seeking further City Council approval; to authorize payment of expenses starting January 1, 2021; to authorize the expenditure of up to $600,000.00 from the Emergency Rental Assistance 2 Funds; and to declare an emergency ($600,000.00)\n \n \nBody\nWHEREAS, the Director of the Department of Development desires to enter into a subaward agreement with Legal Aid Society of Columbus and authorize payment of expenses beginning January 1, 2021, to provide housing stability services (as defined by U. S. Treasury) to qualifying residents of the local community to ensure housing stability; and\n \nWHEREAS, at least 60% of the funding will support households with an AMI at 50% or below and/or have a member of the household who has been unemployed for 90 days; up to 40% of the funding can be used for households with an AMI at 80% or below; and 10% of the funding will be utilized for Administrative costs; and \n \nWHEREAS, it is expected that the guidance from the U.S. Department of Treasury will be modified while this agreement is in effect and it is requested that the Director of Development be given the authority to modify the terms and conditions of the subaward agreement without seeking additional Council Approval in order to align with the most current version of the laws, regulations, and guidance; and\n \nWHEREAS, the COVID-19 pandemic has resulted in much needed assistance when low income households have seen significant decreases in personal income during COVID-19 and the public health emergency; and\n \nWHEREAS, expenditure of ERA funding to provide low income households with financial assistance is necessary to address reduced income needed to pay rent and utility expenses during the COVID-19 public health emergency; and\n \nWHEREAS, such expenditure of funds has not been previously accounted for in the 2022 Budget; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to authorize the Director to enter into a subaward agreement with Legal Aid Society of Columbus to prevent as many evictions as possible, all for the preservation of the public health, peace, property, safety and welfare; NOW THEREFORE,\n \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Development is hereby authorized to enter into a subaward agreement with Legal Aid Society of Columbus in an amount up to $600,000.00; is authorized to make payment for expenses starting January 1, 2021, for the purpose of providing housing stability services (as defined by U.S. Treasury) to qualifying residents under the guidance of the Emergency Rental Assistance program authorized under the Consolidated Appropriations Act of 2021 passed by Congress and signed into law December 27, 2020; and is authorized to modify the scope of services of the subaward agreement as needed without further City Council approval in order to align with the evolving federal guidance.  \n \nSECTION 2.  That the expenditure of $600,000.00, or so much thereof as may be needed2, is hereby authorized in Fund 2208 (ERA Fund), Dept-Div 44-10 (Housing Division), in object class 03 (Services) per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That this agreement is awarded pursuant to the relevant provisions of the Columbus City Codes related to awarding subaward agreements.\n \nSECTION 4:  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5:  That the City Auditor is authorized to make any accounting changes to revise the funding source for all subawards or subaward modifications associated with this legislation.\n \nSECTION 6:  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 52,
    "meeting_date": "2022-07-11",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}