{
  "success": true,
  "vote": {
    "id": 4162,
    "item_number": "SR-49",
    "title": "To authorize the Director of the Department of Public Safety to enter into a contract with The Research Foundation of the City University of New York on behalf of Criminologist David Kennedy and the National Network for Safe Communities at John Jay College to assist the City in serious violence prevention; to authorize the expenditure of $150,000.00 from the General Fund; to waive the competitive bidding provisions of the Columbus City Code; and to declare an emergency ($150,000.00)",
    "description": "Explanation\n \nBACKGROUND:  This legislation authorizes the Director of the Department of Public Safety to enter into contract with The Research Foundation of the City University of New York on behalf of the National Network for Safe Communities at John Jay College to assist the City in a comprehensive Group Violence Intervention (GVI) strategy in Columbus. GVI focuses on the groups at highest risk for violent victimization and offending, with the intention to keep those in them alive, safe, and out of prison. The agreement shall be for a period of fourteen months beginning May 1, 2022 and ending July 1, 2023.\nAn experienced team of National Network for Safe Communities (NNSC) staff will work directly with local stakeholders over a 14 month period to support the implementation of the Group Violence Intervention in Columbus. This will include the following deliverables; Conduct a one-day executive session on focused deterrence tailored to Columbus in 2022; Group audit Refresh; Regular Strategic Advising; Intensive Strategic Advising; Peer exchange/workshop/subject matter experts; Access to National Network working sessions; Participation in one-hour weekly virtual workshops for support and outreach partners; Participation in two-hour monthly virtual workshops for law enforcement agencies.\nThis legislation seeks a waiver of the competitive bidding provisions of the Columbus City Code.  National Network for Safe Communities, a project of John Jay College of Criminal Justice is uniquely well-suited to serve as consultants to Columbus' law enforcement and community partners in their implementation efforts. David Kennedy and the National Network is also the only entity that can offer access to scores of jurisdictions across the country that are implementing its violence intervention strategies, providing Columbus the opportunity to directly collaborate with and learn from peers doing this work. The city worked with this group in 2020 and again in 2021.  \nTerm: The agreement shall be for the period covering May 1, 2022 to July 1, 2023\nFiscal Impact:  This legislation authorizes the expenditure of $150,000.00 from the General Fund with the Research Foundation of the City University of New York to support a comprehensive problem analysis of serious violence in the City of Columbus.  The City contracted with the Research Foundation for $80,000.00 in 2020 and $195,000.00 in 2021. Funding is available in Public Safety's 2022 General Fund Budget for this contract.   \nEmergency action is requested so that a contract can be entered into immediately and project activities can begin without delay.\n \nTitle\n \nTo authorize the Director of the Department of Public Safety to enter into a contract with The Research Foundation of the City University of New York on behalf of Criminologist David Kennedy and the National Network for Safe Communities at John Jay College to assist the City in serious violence prevention; to authorize the expenditure of $150,000.00 from the General Fund; to waive the competitive bidding provisions of the Columbus City Code; and to declare an emergency ($150,000.00)\nBody\n \nWHEREAS, the City has a need to reduce violence and improve public safety, minimize arrest and incarceration, strengthen communities, and improve relationships between  law enforcement and the communities it serves; and, \nWHEREAS, the City of Columbus has identified the National Network for Safe Communities, a project of John Jay College of Criminal Justice as a group that supports cities implementing proven strategic interventions to reduce violence; and,\nWHEREAS, Dr. David Kennedy and the National Network’s operational approach includes working with cities to identify serious violent crime problems; assembling partnerships of law enforcement, community leaders, and social service providers; conducting crime analyses to identify the conditions driving the majority of serious offending; and devising a response that uses enforcement strategically to reduce collateral consequences; and,                                                                                                                                                                                             \nWHEREAS, a                      waiver of the competitive bid provisions of the Columbus City Code is necessary as the National Network for Safe Communities, a project of John Jay College of Criminal Justice is uniquely well-suited to serve as consultants to Columbus' law enforcement and community partners in their implementation efforts; and,                                                                                                                                                                                                                                                             \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Safety in that it is immediately necessary to authorize the Director to enter into contract with The Research Foundation of the City University of New York on behalf of Criminologist David Kennedy and the National Network for Safe Communities at John Jay College to support a comprehensive analysis of serious violence in the City of Columbus, so that project activities can begin without delay, for the preservation of the public health, peace, property, safety, and welfare; NOW, THEREFORE:\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1.  That the Director of the Department of Public Safety is hereby authorized to enter into contract with The Research Foundation of the City University of New York on behalf of Criminologist David Kennedy and the National Network for Safe Communities at John Jay College to support a comprehensive analysis of serious violence in the City of Columbus.  \n \nSECTION 2.  That this Council finds it is in the best interests of the City to waive the competitive bidding provisions of Chapter 329 of the Columbus City Code to enter into this contract, and hereby waives such provision.\n \nSECTION 3. That the expenditure of up to $150,000.00, or so much thereof as may be needed pursuant to the action authorized in SECTION 1, is hereby authorized in the General Fund 1000, in Object Class 03 - Contractual Services, per the accounting codes in the attachment to this ordinance.\n \nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 5. That the monies appropriated in the foregoing sections shall be paid upon the order of the Director of the Department of Public Safety, and that no order shall be drawn or money paid except by voucher, the form of which shall be approved by the City Auditor.\n \nSECTION 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 7. That for the reasons stated in the preamble hereto, which is hereby made a part thereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 52,
    "meeting_date": "2022-07-11",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}