{
  "success": true,
  "vote": {
    "id": 4219,
    "item_number": "CA-39",
    "title": "To authorize the Director of Recreation and Parks to modify an existing contract with Williams Architects for the Glenwood and Windsor Swimming Pool Replacement Design Project; and to authorize the expenditure of $557,515.00 from the Recreation and Parks Voted Bond Fund. ($557,515.00)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Director of the Recreation and Parks Department to modify an existing contract with Williams Architects for the Glenwood and Windsor Swimming Pool Replacement Design Project. The modification amount being authorized by this ordinance is $557,515.00.\n \nThe Windsor Swimming Pool was originally built in 1968 and Glenwood Swimming Pool was built in 1973.  After serving the City of Columbus for more than fifty years, these aquatics facilities need to be replaced in order to function in an efficient and safe manner. The bathhouse at Windsor, which was built in 2012, will undergo minor improvements as well. Both pools will be improved to be more inclusive to persons with various abilities, meeting the requirements obtained by the public outreach activities which are part of the Recreation and Parks Department’s Aquatics Capital Improvement Plan.\n \nThe Department has advertised this project for construction and a “notice to proceed” is anticipated in September 2022.  By modifying this contract, the Department will have their design professional in place to offer construction administration services to move this project forward. This modification does not include the services required for management and inspection but will accompany those services to deliver these projects successfully. \n \nThe Department is requesting $557,515.00 for this modification. The needs for these funds was anticipated, however, they could not be quantified until the design work had been completed.  It is not in our best interest to award this work to another vendor as Williams Architects was selected as our design professional.  Prices were determined by established hourly rates and evaluating anticipated hours to successfully complete the construction of these projects. \nPrincipal Parties: \nWilliams Architects\n1335 Dublin Road, Suite 221-A, Columbus, Ohio 43215                                                      \nTom Poulos, 614-705-1531, tcpoulos@williams-architects.com \nContract Compliance Number, Tax ID: 007307, 36-3932319\nContract Compliance Expiration Date: March 15, 2023                     \n \nBenefits to the Public: This project will benefit the public by improving two important recreational facilities that have served their respective communities for over 50 years. Improvements to our parks and facilities provide significant benefits to the neighborhoods in which they are located.   \n \nCommunity Input/Issues: As part of the Department’s Aquatics Capital Improvement Plan, residents in the service areas of these swimming pools have been and will continue to be engaged through their associations and commissions.  In addition, a project website has been established with a survey which is intended to gather pertinent information that will lead to a successful design and construction opportunity in the South Linden and Greater Hilltop Neighborhoods. (https://www.surveymonkey.com/r/ACIPSurvey).  \n \nArea(s) Affected: East Columbus (50), Greater Hilltop (53)\n \nMaster Plan Relation: This project will support the Recreation and Parks Master Plan by improving existing aquatics facilities.\n \nFiscal Impact: The expenditure of $ $1,000,000.00 was legislated for the Glenwood and Windsor Swimming Pool Replacement Design contract by Ordinance 0940-2021. This ordinance will provide funding that will modify the previously authorized amount by $557,515.00. $557,515.00 is budgeted and available in the Recreation and Parks Voted Bond Fund 7702 to meet the financial obligations of this contract modification. The aggregate total amount authorized, including this modification, is $1,557,515.00.   \n \nTitle\n \nTo authorize the Director of Recreation and Parks to modify an existing contract with Williams Architects for the Glenwood and Windsor Swimming Pool Replacement Design Project; and to authorize the expenditure of $557,515.00 from the Recreation and Parks Voted Bond Fund. ($557,515.00)\n \nBody\n \nWHEREAS, it is necessary to authorize the Director of the Recreation and Parks to modify an existing contract with Williams Architects for the Glenwood and Windsor Swimming Pool Replacement Design Project; and\n \nWHEREAS, it is necessary to authorize the expenditure of $557,515.00 from the Recreation and Parks Voted Bond Fund 7702; and\n \nWHEREAS, it has become necessary in the usual daily operations of the Recreation and Parks Department in that it is necessary to authorize the Director to modify this contract, all for the preservation of the public health, peace, property, safety, and welfare and, NOW, THEREFORE \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Recreation and Parks be and is hereby authorized to modify an existing contract with Williams Architects for the Glenwood and Windsor Swimming Pool Replacement Design Project.\n \nSECTION 2. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 4. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 5. For the purpose stated in Section 1, the expenditure of $557,515.00 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Recreation and Parks Voted Bond Fund 7702 in object class 06 Capital Outlay per the accounting codes in the attachments to this ordinance.  \n \nSECTION 6. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 53,
    "meeting_date": "2022-07-18",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Parks & Recreation"
    ]
  }
}