{
  "success": true,
  "vote": {
    "id": 4264,
    "item_number": "SR-9",
    "title": "To authorize the transfer of funds and appropriation within the Streets and Highways Bond Fund; to appropriate funds within the Streets and Highways Non Bond Fund; to authorize the Director of Public Service to enter into a professional services contract with Woolpert, Inc. for the Roadway - North Knot-SR315 project; to authorize the expenditure of up to $750,000.00 from the Streets and Highways Bond Fund and the Streets and Highways Non Bond Fund to pay for this contract; and to declare an emergency.  ($750,000.00)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Service to enter into a professional services contracts with Woolpert, Inc. in the amount of up to $750,000.00 for the Roadway - North Knot-SR315 project.\n \nThe intent of this project is to provide the City of Columbus, Department of Public Service, general engineering and transportation planning services for preliminary design services for improvements to State Route 315 (SR-315) and its exit or entrance ramps and interchanges between the SR-315 bridge (south of King Avenue) over the Olentangy River and Ackerman Road.  This project will be used to identify traffic capacity improvements to the freeway ramps and interchanges needed to support existing and planned development in the area. It will also be used to identify traffic capacity improvements to intersections in close proximity to the interchanges. \nOrdinance 1508-2022 authorized the Director of the Department of Public Service to enter into agreements with and accept funds from both The Ohio State University and the Franklin County Engineer’s Office to advance the Roadway - North Knot-SR315 project.\nThe Department of Public Service, Office of Support Services, issued a Request for Proposals for the Roadway - North Knot-SR315 contract.  The project was formally advertised on the Vendor Services and Bonfire web sites from May 18, 2022 to June 8, 2022.  The City received five (5) responses.  All proposals were deemed responsive and were fully evaluated when the Evaluation Committee met on June 22, 2022.  The responding firms were:  \nCompany Name                                                      City/State            Majority/MBE/MBR/F1/AS1/PHC\nArcadis                                                                                                                              Columbus, OH                                          Majority\nHDR Engineering, Inc.                                                                                    Columbus, OH                                          Majority\nHNTB Ohio, Inc.                                                                                    Columbus, OH                                          Majority\nWoolpert, Inc.                                                                                                         Columbus, OH                                          Majority\nWSP USA, Inc.                                                                                                         Columbus, OH                                          Majority\n \nWoolpert, Inc. received the highest score by the evaluation committee and will be awarded the Roadway - North Knot-SR315 contract.  \n \nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against Woolpert, Inc.\n \n2.  CONTRACT COMPLIANCE\nThe contract compliance number for Woolpert, Inc. is CC001040 and expires 5/11/2024.  \n \n3.  FISCAL IMPACT\nThis project is funded in part by a contribution in the amount of $500,000.000 from The Ohio State University and $50,000.000 from the Franklin County Engineer’s Office.  These funds will need to be appropriated in Fund 7766, the Street and Highway Improvement Fund.  This ordinance is contingent upon receipt of these funds.\n \nThe remaining balance in the amount of $200,000.00 is available within Fund 7704, the Streets and Highways Bond Fund.  A transfer of cash and appropriation are required to align funds with the proper project.  Funds are appropriated.\n \n4. EMERGENCY DESIGNATION\nEmergency action is requested to expedite this contract to complete the project in a timely manner, to ensure the safety of the traveling public.\n \nTitle\nTo authorize the transfer of funds and appropriation within the Streets and Highways Bond Fund; to appropriate funds within the Streets and Highways Non Bond Fund; to authorize the Director of Public Service to enter into a professional services contract with Woolpert, Inc. for the Roadway - North Knot-SR315 project; to authorize the expenditure of up to $750,000.00 from the Streets and Highways Bond Fund and the Streets and Highways Non Bond Fund to pay for this contract; and to declare an emergency.  ($750,000.00)\n \nBody\nWHEREAS, there is a need to enter into a professional services contract to provide for preliminary design services for improvements to State Route 315 (SR-315) and its exit or entrance ramps and interchanges between the SR-315 bridge (south of King Avenue) over the Olentangy River and Ackerman Road; and\n \nWHEREAS, the Department of Public Service, Office of Support Services, solicited Requests for Proposals for the Roadway - North Knot-SR315 project; and\n \nWHEREAS, Woolpert, Inc. submitted the best overall proposal for this project; and\n \nWHEREAS, it is necessary to enter into a contract with Woolpert, Inc. for the provision of professional engineering consulting services described above in the amount of up to $750,000.00; and\n \nWHEREAS, it is necessary to authorize a transfer of funds within Fund 7704, the Streets and Highways Bond Fund, to establish sufficient cash to pay for the project; and\n \nWHEREAS, funds must be appropriated within the Streets and Highways Non Bond Fund; and\n \nWHEREAS, this ordinance is contingent upon the receipt of funds from The Ohio State University in the amount of $500,000.00 and from the Franklin County Engineer’s Office in the amount of $50,000.00; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to authorize the Director of Public Service to enter into contract with Woolpert, Inc. in order to provide funding for the Roadway - North Knot-SR315 so that upcoming construction projects may be completed as soon as possible, to ensure the safety of the traveling public thereby preserving the public health, peace, property, safety and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the transfer of $200,000.00, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5913 (Division of Traffic Management), Project P531024-100000 (Roadway - LinkUS - NW Corridor), Object Class 06 (Capital Outlay) to Dept-Div 5913 (Division of Traffic Management), Project P531060-100000 (Roadway - North Knot-SR315), object class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\n \nSECTION 2.  That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2022, the sum of $550,000.00 is appropriated in Fund 7766 (Street and Highway Improvement Fund), Dept-Div 5913 (Division of Traffic Management), Project P531060-100000 (Roadway - North Knot/SR 315), in Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That the Director of Public Service be, and hereby is, authorized to enter into a professional services contract with Woolpert, Inc. at One Easton Oval, Suite 400, Columbus, OH  43219, for the Roadway - North Knot-SR315 project in an amount up to $750,000.00.\n \nSECTION 4.  That the expenditure of $200,000.00, or so much thereof as may be needed, is hereby authorized in Fund 7704 (Streets and Highways Bond Fund), Dept-Div 5913 (Division of Traffic Management), Project P531060-100000 (Roadway - North Knot-SR315), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 5.  That the expenditure of $550,000.00, or so much thereof as may be needed, is hereby authorized in Fund 7766 (Street and Highway Improvement Fund), Dept-Div 5913 (Division of Traffic Management), Project P531060-100000 (Roadway - North Knot-SR 315), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 6.  That this ordinance is contingent upon the receipt of funding contributions from The Ohio State University and the Franklin County Engineer’s Office.\n \nSECTION 7.  That the Director of Public Service is authorized to return any unused funding contributed by The Ohio State University and/or by the Franklin County Engineer’s Office for the Roadway - North Knot-SR 315 project upon final accounting being performed by the Department of Public Service for the project or upon certification by the Department of Public Service, Division of Design and Construction, that the remaining contributed funds are no longer needed to complete the project.\n \nSECTION 8.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 9.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 10.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 11.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 53,
    "meeting_date": "2022-07-18",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}