{
  "success": true,
  "vote": {
    "id": 4266,
    "item_number": "SR-11",
    "title": "To authorize the City Clerk to enter into a contracts with the Ohio State University School of Social and Sky Nile Consulting, for the creation of Immigrant Refugee, and Migrant Town Halls; to authorize an appropriation and expenditure within the Neighborhood Initiatives subfund; and to declare an emergency. ($150,000.00 $50,000)",
    "description": "Explanation\nThis ordinance authorizes the City Clerk to enter into a contracts with the Ohio State University School of Social Work and Sky Nile Consulting, for the creation of Immigrant Refugee, and Migrant Town Halls.\n \nImmigrants and refugees are vibrant and vital to the City of Columbus. In 2019, they contributed $353 million dollars to state and local taxes. Immigrants contribute to the economic development of this city and we have long seen an impact in our historic neighborhoods like German Village, Italian Village, and Hungarian Village. As thousands have resettled and continue to resettle here, they often face barriers or are unable to access resources. These town halls will speak directly with immigrants, refugees, and migrants in Columbus to delve deep into the issues these communities face, and the ways the City can ensure that all residents can access the city in a comfortable way.\n \nThe City of Columbus utilized a Request for Proposals (RFP) process to identify and assess Facilitators to conduct moderated focus groups and listening sessions to hear from immigrants, refugees, and migrants with the goal of creating a plan for an inclusive City of Columbus and assess outreach and marketing specialists to assist in reaching out to the diverse immigrant, refugee, and migrant populations in Columbus.. Proposals were submitted in response to RFP021968 in accordance with the relevant provisions of Chapter 329 of the Columbus City Codes, and the Ohio State University School of Social Work received the highest overall score from the RFP committee for the role of facilitator and Sky Nile Consulting received the highest overall score from the RFP committee for the role of outreach and marketing specialist.\n \nThese town halls will:\n•                     Provide outreach to immigrant, refugee, and migrant populations in Columbus so that they are engaged and informed of the process;\n•                     Collect the ideas and opinions of immigrants, refugees, and migrants in Columbus about policies resources, and other areas affecting their integration and sense of belonging;\n•                     Articulate themes and priorities from the listening sessions to inform the City;\n•                     Create a report that provides recommendations and concrete action steps for the City and Community Stakeholders;\n \nFiscal Impact: Funding is available within the Neighborhood Initiatives subfund.\n \nEmergency action is requested in order to avoid any delay in providing the resources necessary to begin the town halls.\n \nTitle\nTo authorize the City Clerk to enter into a contracts with the Ohio State University School of Social and Sky Nile Consulting, for the creation of Immigrant Refugee, and Migrant Town Halls; to authorize an appropriation and expenditure within the Neighborhood Initiatives subfund; and to declare an emergency. ($150,000.00 $50,000)\n \nBody\nWHEREAS, ten percent of the city’s residents are foreign born and this number is only expected to rise; and\n \nWHEREAS, immigrants and refugees are vibrant and vital to the City of Columbus and in 2019, they contributed $353 million dollars to state and local taxes; and\n \nWHEREAS, as communities of immigrants, refugees, and migrants continue to spur growth in the cultural richness, economic growth, and development of Columbus, these town halls will ensure that their needs are addressed in an impactful way and that Columbus continues to make space for all residents; and\n \nWHEREAS, an emergency exists in the usual daily operation of the City Clerk's Office in that it is immediately necessary to authorize the Clerk to enter into a contracts with the Ohio State University School of Social Work and Sky Nile Consulting the to continue to build capacity in serving immigrant, refugee and migrant populations in order to avoid any delay in providing the resources necessary to develop these town halls, all in the interest of protecting the health, welfare, and safety of residents; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the City Clerk is hereby authorized to enter into a contracts with the Ohio State University School of Social Work and Sky Nile Consulting, for the creation of Immigrant Refugee, and Migrant Town Halls.\n \nSECTION 2. That the City Auditor is hereby authorized and directed to appropriate $150,000.00 $50,000.00 in the Neighborhood Initiatives subfund, fund 1000, subfund 100018, to Columbus City Council per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That the expenditure of $150,000.00 $50,000.00 or so much thereof as may be needed pursuant to the action authorized in SECTION 1, is hereby authorized in the Neighborhood Initiatives subfund, fund 1000, subfund 100018, per the accounting codes in the attachment to this ordinance.\n \nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 5,
    "noes": 0,
    "abstain": 2,
    "absent": 0,
    "meeting_id": 53,
    "meeting_date": "2022-07-18",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "ABSTAIN"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSTAIN"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}