{
  "success": true,
  "vote": {
    "id": 4282,
    "item_number": "SR-27",
    "title": "To withdraw the objection to the renewal of liquor permit number 5077469 held by Lena Food Inc., doing business as WEBER ROAD MARKET, located at 900 E Weber Road, Columbus, Ohio 43211, and to declare an emergency.",
    "description": "Explanation\nBACKGROUND:  The City has engaged in discussions with the business owner about their business practices, safety measures, and employee procedures, including involvement from the Columbus Division of Police to provide recommendations for security uplifts at the establishment.  These discussions have been codified into a nuisance abatement agreement between the City and the business owner, and includes requirements for security uplifts (cameras, lighting, hours of operation), employee training, and specific prohibitions on activity at the establishment.  The nuisance abatement agreement between the parties was reached in lieu of pursuing the outstanding objection, and the City reserves the right to object to their liquor license in the future or to bring the establishment into Franklin County Environmental Court should they not comply.  The Division of Liquor Control requested that the City therefore withdraw this objection via resolution.\n \nEMERGENCY DESIGNATION: This establishment has engaged in liquor sales on a temporary basis via the goodwill of the City and the Division of Liquor Control, but it does not yet have a valid 2022 liquor permit until the objection is withdrawn.  Now that the agreements are codified, and to facilitate the full, legal operation of liquor sales by business as soon as possible, the City requests passage of an emergency resolution.\n \n \nTitle\nTo withdraw the objection to the renewal of liquor permit number 5077469 held by Lena Food Inc., doing business as WEBER ROAD MARKET, located at 900 E Weber Road, Columbus, Ohio 43211, and to declare an emergency.\n \nBody\nWHEREAS, City Council previously objected to the renewal of liquor permit number 5077469  held by Lena Food Inc., doing business as WEBER ROAD MARKET, located at 900 E Weber Road, Columbus, Ohio 43211, in Resolution 0213X-2021; and\n \nWHEREAS, sufficient evidence from the Columbus Division of Police and the Columbus City Attorney’s office was presented to City Council in support of Resolution 0213X-2021; and\n \nWHEREAS, The City has engaged in discussions with the business owner about their business practices, safety measures, and employee procedures, including involvement from the Columbus Division of Police to provide recommendations for security uplifts at the establishment; and\n \nWHEREAS, The nuisance abatement agreement between the parties was reached in lieu of pursuing the outstanding objection, and the City reserves the right to object to their liquor license in the future or to bring the establishment into Franklin County Environmental Court should they not comply; and\n \nWHEREAS, The Division of Liquor Control requested that the City therefore withdraw this objection via resolution; and\n \nWHEREAS, an emergency exists in the usual operations of City Council in that it needs to withdraw its objection that was made on November 15, 2021 pursuant to 4303.271 and 4303.292, Ohio Revised Code to the renewal of the liquor permit for WEBER ROAD MARKET, 900 E Weber Road, Columbus, Ohio 43211 to facilitate the full, legal operation of liquor sales by business as soon as possible; now, therefore\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSection 1. That the Columbus City Council hereby withdraws its objection made on November 15, 2021  in resolution 0213X-2021, pursuant to state statute to the renewal of the liquor permit for WEBER ROAD MARKET, 900 E Weber Road, Columbus, Ohio 43211.\n \nSection 2. That the City Clerk be and hereby is directed to forward a certified copy of this resolution to the director of the Ohio Department of Liquor Control.\n \nSection 3. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 53,
    "meeting_date": "2022-07-18",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services",
      "Planning & Development",
      "Transportation"
    ]
  }
}