{
  "success": true,
  "vote": {
    "id": 4311,
    "item_number": "0",
    "title": "To authorize the Director of Education to enter into contracts with various non-profit organizations to provide after-school programs and services; to authorize the expenditure of $331,000.00 from the general fund. ; and to declare an emergency.  ($331,000.00)",
    "description": "Explanation\nMayor Ginther’s vision for Columbus, America’s Opportunity City, is that every Columbus child has access to a safe after-school environment to continue his/her education at the end of the school day.\n \nAccording to the Harvard Family Research Project and its national database of evaluations, research confirms that “children and youth who participate in after-school programs can reap a host of positive benefits in a number of interrelated outcome areas-academic, social-emotional, prevention, and health and wellness. These are the skills that many suggest are necessary for youth to succeed in the 21st Century global economy and world.”\n \nIn 2021, the After School Grant Program provided effective support and services for 2,200 children.  In 2022, the Mayor’s Office of Education plans to serve the same number of children.\nTherefore, the Office of Education requests permission to contract with the below after-school program providers to help us reach our goal - and the Mayor’s vision for Columbus.  Contracts are being awarded to the below providers pursuant to Section 329.30, which allows for the City to negotiate not-for-profit service contracts.  These providers were selected due to their prior experience and success in providing the same services in 2021.\n \nAsian American Community Services\nBoys and Girls Club\nCenter of Science and Industry\nCentral Community House of Columbus\nClintonville Beechwold CRC\nColumbus After School Allstars \nColumbus Urban League\nCommunities in Schools\nCommunity for New Direction\nDirections for Youth & Families\nEducational Service Center\nEthiopian Tewahedo Social Services\nKaleidoscope Youth Center\nOhio Afterschool Network\nSt. Stephen's Community House\nTech Corps Ohio\nVineyard Community Center\nYMCA of Central Ohio\nYWCA Family Center\n \nFISCAL IMPACT:Funding for these contracts ($331,000.00) is budgeted and available within the 2022 Office of Education General Fund budget.  \n \nEMERGENCY DESIGNATION: \nEmergency designation is requested to ensure the funding and contracts are established in time for the start of the program.\n \nTitle\nTo authorize the Director of Education to enter into contracts with various non-profit organizations to provide after-school programs and services; to authorize the expenditure of $331,000.00 from the general fund. ; and to declare an emergency.  ($331,000.00)\n \nBody\nWHEREAS, Mayor Ginther’s vision for Columbus, America’s Opportunity City, is that every Columbus child has access to a safe after-school environment to continue their education at the end of the school day; and\n \nWHEREAS, research has proven that children who participate in after-school programs learn the skills that many suggest are necessary to succeed in the 21st Century global economy and world; and \n \nWHEREAS, the Office of Education provided funding for effective after-school support and services for 2,200 children in 2021; and\n \nWHEREAS, in 2022, the Office of Education plans to serve the same number of children; and \n \nWHEREAS, contracts are being awarded to providers pursuant to Section 329.30, which allows for the City to negotiate not-for-profit service contracts; and  \n \nWHEREAS, the Office of Education does not have the capacity to operate after school programs; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Office of Education in that it is immediately necessary to authorize the Executive Director of the Office of Education to enter into contracts and expend funds to ensure the funding and contracts are established in time for the start of the program, for the preservation of public health, peace, property and safety; \n \nNOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Education is authorized to enter into contracts with the after-school program providers listed below:\n \nAsian American Community Services\nBoys and Girls Club\nCenter of Science and Industry\nCentral Community House of Columbus\nClintonville Beechwold CRC\nColumbus After School Allstars \nColumbus Urban League\nCommunities in Schools\nCommunity for New Direction\nDirections for Youth & Families\nEducational Service Center\nEthiopian Tewahedo Social Services\nGladden Community House\nKaleidoscope Youth Center\nOhio Afterschool Network\nSt. Stephen's Community House\nTech Corps Ohio\nVineyard Community Center\nYMCA of Central Ohio\nYWCA Family Center\n \nSECTION 2.  That the expenditure of $331,000.00, or so much thereof as may be needed, is hereby authorized to be expended from the General Fund as follows: \n (see attachment 0604-2022 EXP)\n \nDiv.: 40-06 | Fund: 1000 | SubFund: 100010 | Obj. Class: 03 | Main Acct: 63050 | Program: ED003 | Amount: $354,000\n \nSECTION 3.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this legislation.\n \nSECTION 5.  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is herby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or 10 days after passage if the Mayor neither approves nor vetoes the same.\n \nSECTION 5.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law",
    "outcome": "PASS",
    "ayes": 5,
    "noes": 0,
    "abstain": 2,
    "absent": 0,
    "meeting_id": 54,
    "meeting_date": "2022-07-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "ABSTAIN"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSTAIN"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Community Services",
      "Contracts & Agreements"
    ]
  }
}