{
  "success": true,
  "vote": {
    "id": 4354,
    "item_number": "CA-4",
    "title": "To authorize the Director of the Department of Development to enter into a grant agreement Ohio City/County Management Association for the purpose of providing support for the 2022 International City/County Management Association Annual Conference in an amount up to $50,000.00; to authorize a transfer within the General Fund in an amount up to $50,000.00; to authorize an expenditure in an amount up to $50,000.00 from the General Fund; and to declare an emergency.  ($50,000.00)",
    "description": "Explanation\nThis legislation authorizes the Director of the Department of Development to enter into a grant agreement with the Ohio City/County Management Association for the purpose of providing support for the 2022 International City/County Management Association Annual Conference to be held at the Greater Columbus Convention Center in September.\n \nThe International City/County Management Association (ICMA) is the leading organization of local government professionals dedicated to creating and sustaining thriving communities throughout the world. The organization provides technical and management assistance, professional development and information resources in the areas of performance measurement, ethics education and training, community and economic development, environmental management, technology, and other topics to its members and the broader local government community.\n \nThe ICMA Annual Conference is expected to attract nearly 5,000 attendees, generating 9,800 room nights and an estimated $4.7 million in direct visitor spending.  The event provides opportunities to showcase the amenities, infrastructure, technology, and community advancements of the city.\n \nCommunity support is critical to the success of the 2022 ICMA Annual Conference.\n \nEmergency legislation is requested in order to prevent interruption in the delivery of program services.\n \nFISCAL IMPACT: Funds will be transferred from the General Fund Citywide Account to the Department of Development General Fund budget.\n \nCONTRACT COMPLIANCE:  the vendor number is 032181 and certification is pending.\n \nTitle\nTo authorize the Director of the Department of Development to enter into a grant agreement Ohio City/County Management Association for the purpose of providing support for the 2022 International City/County Management Association Annual Conference in an amount up to $50,000.00; to authorize a transfer within the General Fund in an amount up to $50,000.00; to authorize an expenditure in an amount up to $50,000.00 from the General Fund; and to declare an emergency.  ($50,000.00)\n \nBody\nWHEREAS, The International City/County Management Association (ICMA) is the leading organization of local government professionals dedicated to creating and sustaining thriving communities throughout the world; and\n \nWHEREAS, The 2022 International City/County Management Association Annual Conference is to be held at the Greater Columbus Convention Center in September; and\n \nWHEREAS, The ICMA Annual Conference is expected to attract nearly 5,000 attendees, generating 9,800 room nights and an estimated $4.7 million in direct visitor spending; and\n \nWHEREAS, The event provides opportunities to showcase the amenities, infrastructure, technology, and community advancements of the city; and\n \nWHEREAS, the City of Columbus would like to provide support to Ohio City/County Management Association for the 2022 International City/County Management Association Annual Conference; and  \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to authorize the Director to enter into a grant agreement with Ohio City/County Management Association; to authorize the Auditor to appropriate and expend said funds for Ohio City/County Management Association in order to prevent interruption of services, thereby preserving the public health, peace, property and safety; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the transfer of $50,000.00 or so much thereof as may be needed, is hereby authorized within Fund 1000 (General Fund), from Dept-Div 45-01 (Financial Management), object class 10 (Transfer Out Operating) to Dept-Div 44-01 (Administration), object class 03 (Services) per the account codes in the attachment to this ordinance:\n \nSECTION 2. That the Director of the Department of Development is hereby authorized to enter into a grant agreement with Ohio City/County Management Association in an amount up to $50,000.00 for the purpose of providing support for the 2022 International City/County Management Association Annual Conference.\n \nSECTION 2. That the expenditure of $50,000.00 or so much thereof as may be needed is hereby authorized in Fund 1000 (General Fund), Dept-Div 44-01 (Administration), Object Class 03 (Services), per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.                     That this agreement is awarded pursuant to the relevant provisions of Columbus City Code related to awarding grant agreements.\n \nSECTION 4.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 54,
    "meeting_date": "2022-07-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}