{
  "success": true,
  "vote": {
    "id": 4361,
    "item_number": "CA-11",
    "title": "To authorize the Director of the Department of Development to enter into a contract with Designing Local Ltd in an amount up to $253,000.00 for the purpose of public education, and facilitating the community in public discussion about the potential re-installation of the Christopher Columbus statue to a public location; to authorize the transfer of $253,000.00 between the Department of Development’s Administration Division and Planning Division; to authorize the expenditure of $253,000.00 from the Division of Planning’s General Fund budget; and to declare an emergency. ($253,000.00)",
    "description": "Explanation\nBACKGROUND: This legislation authorizes the Director of the Department of Development to enter into contract with Designing Local Ltd in an amount up to $253,000.00 for the purpose of facilitating community education and engagement and developing contextual materials that would accompany the Christopher Columbus statue, to be evaluated for the potential re-installation of the statue in a new public location.\n  \nIn June of 2020, the Columbus Art Commission (CAC) approved the Administration’s request to remove a Christopher Columbus statue from the south plaza of Columbus’ City Hall. As with many cities across the country, historic sculptures and their representation in contemporary America are undergoing re-evaluation. \n \nThe Department utilized the Request for Proposals (RFP) process, in accordance with City procurement standards, to solicit proposals.  Proposals were submitted in response to RFQ021527 in accordance with the relevant provisions of Chapter 329 of the Columbus City Codes, and Designing Local Ltd received the highest overall score from the evaluation committee.\n \nThe Department of Development seeks to partner with Designing Local Ltd on the examination of the potential re-installation of the Christopher Columbus Statue at a public location with associated contextual material, installation design, and associated community learning opportunities.\n \nEmergency action is requested in order to meet immediate deadlines associated with this examination.\n \nFISCAL IMPACT: The funding of $253,000.00 for this contract is available in the Division of Planning’s 2022 General Fund Budget.  \n \nCONTRACT COMPLIANCE:  The vendor’s contract compliance 020995 is active and expires on 7/14/24.\n \nTitle\n \nTo authorize the Director of the Department of Development to enter into a contract with Designing Local Ltd in an amount up to $253,000.00 for the purpose of public education, and facilitating the community in public discussion about the potential re-installation of the Christopher Columbus statue to a public location; to authorize the transfer of $253,000.00 between the Department of Development’s Administration Division and Planning Division; to authorize the expenditure of $253,000.00 from the Division of Planning’s General Fund budget; and to declare an emergency. ($253,000.00)\n \n \nBody\n \nWHEREAS, in June of 2020, the Columbus Art Commission (CAC) approved the Administration’s request to remove a Christopher Columbus statue from the south plaza of Columbus’ City Hall; and \n \nWHEREAS, the Department of Development seeks to partner with Designing Local Ltd on the examination of the potential re-installation of the Christopher Columbus Statue at a public location with associated contextual material, installation design, and associated community learning opportunities; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to authorize the Director to enter into contract with Designing Local Ltd to meet immediate deadlines associated with this examination; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     That the Director of the Department of Development is authorized to enter into  contract with Designing Local Ltd in an amount up to $253,000.00 for the purpose of public education, and facilitating the community in public discussion about the potential re-installation of the Christopher Columbus statue to a public location.\n \nSECTION 2. That the transfer of $253,000.00 or so much thereof as may be needed, is hereby authorized within Fund 1000 (General Fund), from Dept-Div 44-01(Administration), object class 03 (Services) to Dept-Div 44-06 (Planning), object class 03 (Services) per the account codes in the attachment to this ordinance.\n \nSECTION 3.                     That the expenditure of  $253,000.00 or so much thereof as may be needed, is hereby authorized in Fund 1000 (General Fund), Dept-Div 44-06 (Planning), in object class 03 (Services) per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.                      That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.                     That this contract is awarded in accordance with the relevant provisions of Section 329 of the Columbus City Code.\n \nSECTION 6. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.  \n \nSECTION 7.                      That, for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 54,
    "meeting_date": "2022-07-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}