{
  "success": true,
  "vote": {
    "id": 4364,
    "item_number": "CA-14",
    "title": "To authorize the Director of the Department of Public Service to execute those documents necessary for the transfer of a 3.674 acre portion of right-of-way north of Agler Road to The KIPP Columbus Foundation. ($240,059.00 )",
    "description": "Explanation\n1. Background:\nThe City of Columbus, Department of Public Service, received a request from Amy Nagy, Senior Project Manager with EMH&T, on behalf of her client, The KIPP Columbus Foundation, asking that the City sell them a 3.674 acre portion of right-of-way north of Agler Road. Right-of-way totals 160,039 square feet or 3.674 acres.  \n \nThe purpose of the transfer will be to facilitate the combining of parcels to support a project that consists of the KIPP Columbus campus expansion for K-1 and 2-5 school buildings. The portions of right-of-way being requested are in the project area and would interfere with the project unless transferred.  The Department of Public Service has agreed to sell the right-of-way as described and shown within the attached legal description and exhibit, and extinguishes its need for this public right-of-way.  \n \nPer current practice, comments were solicited from interested parties, including City agencies, private utilities and the applicable area commission, before it was determined that, subject to the retention of a general utility easement for those utilities currently located within this right-of-way, the City will not be adversely affected by the transfer of this right-of-way.  The Department of Public Service submitted a request to the City Attorney’s Office, asking that they establish a value for this right-of-way, and a value of $240,059.00 was established.  This request went before the Land Review Commission on May 19, 2022.  After review of the request, the Land Review Commission voted to recommend the above referenced right-of-way be transferred to The KIPP Columbus Foundation at the cost of $240,059.00 to them.\n \n2. FISCAL IMPACT:\nThe City will receive a total of $240,059.00 and the funds are to be deposited in Fund 7748, Project P537650, as consideration for the transfer of the requested right-of-way.\n \nTitle\nTo authorize the Director of the Department of Public Service to execute those documents necessary for the transfer of a 3.674 acre portion of right-of-way north of Agler Road to The KIPP Columbus Foundation. ($240,059.00 )\n \nBody\nWHEREAS, the City of Columbus, Department of Public Service, received a request from Amy Nagy, Senior Project Manager with EMH&T, on behalf of her client, The KIPP Columbus Foundation, asking that the City sell them a 3.674 acre portion of right-of-way north of Agler Road. Right-of-way totals 160,039 square feet or 3.674 acres; and \n \nWHEREAS, The purpose of the transfer will facilitate the combining of parcels to support a project that consists of the KIPP Columbus campus expansion for K-1 and 2-5 school buildings. The portions of right-of-way being requested are in the project area and would interfere with the project unless transferred; and\n \nWHEREAS, the Department of Public Service has agreed to sell the right-of-way as described and shown within attached legal description and exhibit, and extinguishes its need for this public right-of-way; and\n \nWHEREAS, per current practice, comments were solicited from interested parties, including City agencies, private utilities and the applicable area commission, before it was determined that, subject to the retention of a general utility easement for those utilities currently located within this right-of-way, the City will not be adversely affected by the transfer of this right-of-way; and\n \nWHEREAS, the Department of Public Service submitted a request to the City Attorney’s Office, asking that they establish a value for this right-of-way; and\n \nWHEREAS, a value of $240,059.00 was established; and\n \nWHEREAS, this request went before the Land Review Commission on May 19, 2022; and\n \nWHEREAS, after review of the request, the Land Review Commission voted to recommend the above referenced right-of-way be transferred to The KIPP Columbus Foundation, at the cost of $240,059.00; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Public Service be and is hereby authorized to execute a quit claim deed and other incidental instruments prepared by the City Attorney’s Office, necessary to transfer the legal description as described below and attached exhibit of right-of-way to The KIPP Columbus Foundation; to-wit:\n \n2.022 ACRES\n \n \nSituated in the State of Ohio, County of Franklin, City of Columbus, in Quarter Township 2, Township 1, Range 17, United States Military District, being comprised of all of the right of way of Mecca Road and part of the right of way of Bridgewalk Street dedicated in the plat entitled \"Dedication of Mecca Road, Agler Road, Bridgewalk Street and Easements\", of record in Plat Book 46, Page 11 (all references are to the records of the Recorder’s Office, Franklin County, Ohio) and more particularly bounded and described as follows:\n \n                     Beginning at an iron pin set at the northeasterly corner of Lot 177 of the subdivision entitled “Northglen Subdivision”, of record in Plat Book 21, Page 25, a northwesterly corner of that 14.309 acre tract conveyed as Tract 3 to Bridgewalk Birdie, LLC by deed of record in Instrument Number 201812210173053;\n \n                     Thence North 03° 14' 00\" East, with the easterly line of said “Northglen Subdivision”, a distance of 100.01 feet to an iron pin set at a southwesterly corner of said 14.309 acre tract;\n \n                     Thence with the boundary of said 14.309 acre tract the following courses and distances:\n \n                     South 86° 33' 12\" East, a distance of 13.49 feet to an iron pin set;\n \n                     With the arc of a curve to the right, having a central angle of 09° 55' 11\", a radius of 1450.00 feet, an arc length of 251.04 feet, a chord bearing of South 81° 35' 42\" East and chord distance of 250.73 feet to an iron pin set;\n \n                     South 76° 38' 04\" East, a distance of 159.52 feet to an iron pin set;\n \n                     With the arc of a curve to the left, having a central angle of 10° 23' 28\", a radius of 950.00 feet, an arc length of 172.29 feet, a chord bearing of South 81° 49' 48\" East and chord distance of 172.06 feet to an iron pin set; and\n \n                     South 83° 57' 05\" East, a distance of 31.85 feet to an iron pin set in the westerly line of that 5.360 acre tract conveyed as Parcel VI to Kipp Columbus Foundation by deed of record in Instrument Number 202007160102703;\n \n                     Thence South 02° 57' 03\" West, with said westerly line, a distance of 100.00 feet to an iron pin set the northwesterly corner of the subdivision entitled “Bridgeview Estates No. 2”, of record in Plat Book 27, Page 67, the northwesterly corner of tract conveyed as Parcel II to Kipp Columbus Foundation by deed of record in Instrument Number 202007160102703, a northeasterly corner of said 14.309 acre tract;\n \n                     Thence with the boundary of said 14.309 acre tract the following courses and distances:\n \n                     North 83° 57' 05\" West, a distance of 31.85 feet to an iron pin set;\n \n                     With the arc of a curve to the right, having a central angle of 10° 23' 37\", a radius of 1050.00 feet, an arc length of 190.47 feet, a chord bearing of North 81° 49' 52\" West and chord distance of 190.21 feet to an iron pin set;\n \n                     North 76° 38' 04\" West, a distance of 139.72 feet to an iron pin set;\n \n                     With the arc of a curve to the left, having a central angle of 91° 05' 10\", a radius of 20.00 feet, an arc length of 31.80 feet, a chord bearing of South 57° 49' 21\" West and chord distance of 28.55 feet to an iron pin set;\n \n                     South 12° 16' 38\" West, a distance of 4.69 feet to an iron pin set;\n \n                     With the arc of a curve to the right, having a central angle of 11° 41' 00\", a radius of 525.00 feet, an arc length of 107.06 feet, a chord bearing of South 18° 07' 08\" West and chord distance of 106.87 feet to an iron pin set;\n \n                     South 23° 57' 38\" West, a distance of 11.62 feet to an iron pin set; and\n                     With the arc of a curve to the left, having a central angle of 29° 05' 29\", a radius of 700.00 feet, an arc length of 355.42 feet, a chord bearing of South 09° 24' 54\" West and chord distance of 351.61 feet to an iron pin set at the northwesterly corner of “Hickory Ridge Condominium Part 2”, of record in Condominium Plat Book 65, Page 73 and Official Record 29695A01;\n \n                     Thence North 81° 41' 13\" West, crossing the right of way of said Bridgewalk Street, a distance of 51.31 feet to an iron pin set at the northeasterly corner of “Hickory Ridge Condominium Part 1”, of record in Condominium Plat Book 65, Page 73 and Official Record 29695A01, a southeasterly corner of said 14.309 acre tract;\n \nThence with the boundary of said 14.309 acre tract the following courses and distances:\n \n                     With the arc of a curve to the right, having a central angle of 28° 10' 48\", a radius of 750.00 feet, an arc length of 368.87 feet, a chord bearing of North 09° 52' 14\" East and chord distance of 365.17 feet to an iron pin set;\n \n                     North 23° 57' 38\" East, a distance of 11.62 feet to an iron pin set;\n \n                     With the arc of a curve to the left, having a central angle of 11° 41' 01\", a radius of 475.00 feet, an arc length of 96.86 feet, a chord bearing of North 18° 07' 08\" East and chord distance of 96.69 feet to an iron pin set;\n \n                     North 12° 16' 38\" East, a distance of 4.54 feet to an iron pin set;\n \n                     With the arc of a curve to the left, having a central angle of 91° 56' 19\", a radius of 20.00 feet, an arc length of 32.09 feet, a chord bearing of North 33° 41' 21\" West and chord distance of 28.76 feet to an iron pin set;\n \n                     With the arc of a curve to the left, having a central angle of 06° 53' 42\", a radius of 1350.00 feet, an arc length of 162.46 feet, a chord bearing of North 83° 06' 21\" West and chord distance of 162.36 feet to an iron pin set; and\n \n                     North 86° 33' 12\" West, a distance of 13.12 feet to the POINT OF BEGINNING, containing 2.022 acres of land, more or less.\n \n                     Subject, however, to all legal rights-of-way and/or easements, if any, of previous record.\n \n                     Iron pins set, where indicated, are iron pipes, thirteen sixteenths (13/16) inch inside diameter, thirty (30) inches long with a plastic plug placed in the top bearing the initials EMHT INC.\n \n                     The bearings herein are based on the Ohio State Plane Coordinate System, South Zone, NAD83 (1986 Adjustment). Said bearings originated from a field traverse which was tied \"referenced\" to said coordinate system by GPS observations of Franklin County Engineering Department monuments FRANK 164 and FRANK 64. The bearing of North 86° 38' 21\" West, assigned to the centerline of Agler Road, is designated the “Basis of Bearings” for this description.\n \n                     This description is based on an actual field survey performed by or under the direct supervision of Matthew A. Kirk, Professional Surveyor Number 7865.\n \n                                                               EVANS, MECHWART, HAMBLETON & TILTON, INC.\n \n \n                                                                                                                                                   \n                                                                                    Matthew A. Kirk                                                               Date\n                                                                                    Professional Surveyor No. 7865\n \n \n1.652 ACRES\n \n                     Situated in the State of Ohio, County of Franklin, City of Columbus, in Quarter Township 2, Township 1, United States Military District, being comprised of all of the right--of-way of Bridgeview Drive and Bridgeview Court dedicated in the plat entitled \"Bridgeview Estates No. 2\", of record in Plat Book 27, Page 67 (all references are to the records of the Recorder's Office, Franklin County, Ohio) and more particularly bounded and described as follows: \n \n                     Beginning at an iron pin set at the southeasterly corner of Lot 2 of the subdivision entitled \"Bridgeview Estates\", of record in Plat Book 24, Page 39, at the intersection of the westerly right-of-way line of said Bridgeview Drive and the northerly right of way line of Agler Road (variable width);\n                     \n                     Thence with the boundary of Lot 2 of said Bridgeview Estates and Lots 1-6 of said Bridgeview Estates No. 2 the following courses and distances: \n \n                     With the arc of a curve to the left, having a central angle of 90° 24' 36\", a radius of 30.00 feet, an arc length of 47.34 feet, a chord bearing of North 48° 09' 21\" East and chord distance of\n42.58 feet to an iron pin set; \n \n                     North 02° 57' 03\" East, a distance of 620.04 feet to an iron pin set;\n \n                     With the arc of a curve to the right, having a central angle of 15° 38' 30\", a radius of 389.00 feet, an arc length of 106.20 feet, a chord bearing of North 10° 46' 33\" East and chord distance of 105.87 feet to an iron pin set; \n \n                     North 18° 36' 03\" East, a distance of 160.00 feet to an iron pin set;\n \n                     With the arc of a curve to the left, having a central angle of 06° 04' 50\", a radius of 338.82 feet, an arc length of 35.96 feet, a chord bearing of North 15° 33' 38\" East and chord distance of 35.94 feet to an iron pin set; and \n \n                     With the arc of a curve to the left, having a central angle of 110° 32' 30\", a radius of 20.00 feet, an arc length of 38.59 feet, a chord bearing of North 42° 24' 23\" West and chord distance of 32.87 feet to an iron pin set in the southerly line of that 5.360 acre tract conveyed as Parcel VI to Kipp Columbus Foundation by deed of record in Instrument Number 202007160102703; \n \n                     Thence with said southerly line, with the southerly line of that 4.194 acre tract conveyed as Parcel III to Kipp Columbus Foundation by deed of record in Instrument Number 202007160102703, and with the arc of a curve to the left, having a central angle of 04° 37' 34\", a radius of 1164.52 feet, an arc length of 94.02 feet, a chord bearing of North 80° 00' 35\" East and chord distance of 94.00 feet to an iron pin set at the northwesterly corner of Lot 7 of said \"Bridgeview Estates No. 2; \n \n                     Thence with the boundary of Lots 7-15 of said Bridgeview Estates No. 2 and Lot 3 of said Bridgeview Estates the following courses and distances: \n \n                     With the arc of a curve to the left, having a central angle of 66° 03' 53\", a radius of 20.00 feet, an arc length of 23.06 feet, a chord bearing of South 44° 47' 49\" West and chord distance of\n21.80 feet to an iron pin set; \n \n                     With the arc of a curve to the right, having a central angle of 11° 27' 31\", a radius of 388.82 feet, an arc length of 77.76 feet, a chord bearing of South 12° 52' 17\" West and chord distance of 77.63 feet to an iron pin set; \n \n                     South 18° 36' 03\" West, a distance of 160.00 feet to an iron pin set;\n \n                     With the arc of a curve to the left, having a central angle of 15° 38' 30\", a radius of 339.00 feet, an arc length of 92.55 feet, a chord bearing of South 10° 46' 33\" West and chord distance of 92.26 feet to an iron pin set;\n                     \n                     South 02° 57' 03\" West, a distance of 156.56 feet to an iron pin set;                     \n \n                     With the arc of a curve to the left, having a central angle of 117° 00' 00\", a radius of 20.00 feet, an arc length of 40.84 feet, a chord bearing of South 55° 33' 05\" East and chord distance of 34.11 feet to an iron pin set; \n \n                     North 65° 57' 03\" East, a distance of 131.63 feet to an iron pin set; \n \n                     With the arc of a curve to the left, having a central angle of 21° 47' 25\", a radius of 300.00 feet, an arc length of 114.09 feet, a chord bearing of North 55° 03' 20\" East and chord distance of 113.41 feet to an iron pin set; \n \n                     With the arc of a curve to the right, having a central angle of 223° 34' 25\", a radius of 50.00 feet, an arc length of 195.10 feet, a chord bearing of South 24° 03' 09\" East and chord distance of 92.86 feet to an iron pin set;\n \n                     With the arc of a curve to the left, having a central angle of 21° 47' 00\", a radius of 300.00 feet, an arc length of 114.06 feet, a chord bearing of South 76° 50' 33\" West and chord distance of 113.37 feet to an iron pin set; \n \n                     South 65° 57' 03\" West, a distance of 177.53 feet to an iron pin set; \n \n                     With the arc of a curve to the left, having a central angle of 63° 00' 00\", a radius of 20.00 feet, an arc length of 21.99 feet, a chord bearing of South 34° 27' 03\" West and chord distance of\n20.90 feet to an iron pin set; \n \n                     South 02° 57' 03\" West, a distance of 363.25 feet to an iron pin set; and \n \n                     With the arc of a curve to the left, having a central angle of 89° 35' 24\", a radius of 30.00 feet, an arc length of 46.91 feet, a chord bearing of South 41° 50' 39\" East and chord distance of\n42.27 feet to an iron pin set in the northerly right-of-way line of said Agler Road; \n \n                     Thence North 86° 38' 21\" West, with said northerly right-of-way line, a distance of 110.00 feet to the POINT OF BEGINNING, containing 1.652 acres of land, more or less. \n \n                     Subject, however, to all legal rights-of-way and/or easements, if any, of previous record. \n \n                     Iron pins set, where indicated, are iron pipes, thirteen sixteenths (13/16) inch inside diameter, thirty (30) inches long with a plastic plug placed in the top bearing the initials EMHT INC. \n \n                     The bearings herein are based on the Ohio State Plane Coordinate System, South Zone, NAD83 (1986 Adjustment). Said bearings originated from a field traverse which was tied \"referenced\" to said coordinate system by GPS observations of Franklin County Engineering Department monuments FRANK 164 and FRANK 64. The bearing of North 86° 38' 21\" West, assigned to the centerline of Agler Road, is designated the “Basis of Bearings” for this description.\n \n                     This description is based on an actual field survey performed by or under the direct supervision of Matthew A. Kirk, Professional Surveyor Number 7865. \n \n                                                               EVANS, MECHWART, HAMBLETON & TILTON, INC.\n                                                                                    \n                                          \n                                                                                    Matthew A. Kirk                                                               Date\n                                                                                    Professional Surveyor No. 7865\n \n \nSECTION 2.  That the attached referenced real property shall be considered excess road right-of-way and the public rights therein shall terminate upon the Director's execution and delivery of said quitclaim deed to the grantee thereof.\n \nSECTION 3.  That the City will receive a total of $240,059.00, to be deposited in Fund 7748, Project P537650, as consideration for the transfer of the requested right-of-way.\n \nSECTION 4.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 54,
    "meeting_date": "2022-07-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Property & Real Estate",
      "Public Works",
      "Transportation"
    ]
  }
}