{
  "success": true,
  "vote": {
    "id": 4389,
    "item_number": "CA-39",
    "title": "To authorize the Director of Recreation and Parks to enter into and to modify an existing contract with V.A.T. Inc. for transportation services associated with CRPD summer programming; to authorize the expenditure of $25,000.00 from the Recreation and Parks ARPA Fund; to authorize an increase to the contracted hourly rates for service; and to declare an emergency. ($25,000.00)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Director of the Recreation and Parks Department to modify Contract No. PO318702, with V.A.T. Inc. for transportation services associated with participant camps and activities as authorized by ORD 0568-2022. The modification is necessary to increase the maximum dollar amount of the contract and to escalate the hourly rates charged for services due to documented increases in the cost of fuel, a necessary supply for the delivery of services.  The increased amount authorized by this ordinance is $25,000.00.  The hourly rates for all vehicles will increase by $2.00/Hour as indicated on the revised Rate Proposal attached to this legislation. All other terms and conditions of Contract No. PO318702 shall remain in effect. The aggregate total amount authorized, including this modification, will be $108,000.00.   \n \nAdditional funding for transportation is necessary to support increased off-site programming taking place during summer camps and activities.  The added programming will primarily be trips to CRPD pools and other free programs in central Ohio, serving communities disproportionately impacted by the pandemic.\n \nThere was no quorum during the July Recreation and Parks Commission Meeting. Per the present Commissioners this ordinance was requested to be sent thru the legislation approval process in order to avoid a delay with this project. There is August recess for Commission and Council.\n \nPrincipal Parties: \nV.A.T. Inc.\nPaul Vellani, President\n460 E. High St.\nLondon, OH 43140\n2047 Leonard Ave.\nColumbus, OH 43219\n614-252-5060 (Phone)\nEIN:  31-1004545\n \nEmergency Justification:  Emergency action is requested to ensure the timely provision of additional safe and reliable transportation of Recreation programming participants for the summer camp season.\n \nFiscal Impact: $25,000.00 is budgeted and available from within the Recreation and Parks American Rescue Plan Act Fund 2209 to meet the financial obligations of this contract modification. \n \nTitle\n \nTo authorize the Director of Recreation and Parks to enter into and to modify an existing contract with V.A.T. Inc. for transportation services associated with CRPD summer programming; to authorize the expenditure of $25,000.00 from the Recreation and Parks ARPA Fund; to authorize an increase to the contracted hourly rates for service; and to declare an emergency. ($25,000.00)\n \nBody\n \nWHEREAS, it is necessary to authorize the Director of the Recreation and Parks to modify an existing contract with V.A.T Inc. for transportation services associated with CRPD summer programming; and\n \nWHEREAS, VAT Inc., has agreed to increase the amount, according to said modification of contract, from $83,000.00 to $108,000.00; and\n \nWHEREAS, it is necessary to authorize the expenditure of $25,000.00 from the Recreation and Parks ARPA Fund 2209; and\n \nWHEREAS, it is necessary to increase the contracted hourly rates in response to submitted evidence of an increase in the vendor's fuel costs; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Recreation and Parks Department in that it is immediately necessary to authorize the Director to enter modify this contract since the services are needed for summer programming; NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Recreation and Parks be and is hereby authorized to modify an existing contract with V.A.T Inc. for transportation services associated with CRPD summer programming. The amount of the modification is $25,000.00 and the aggregate total amount authorized, including this modification, is $108,000.00.\n \nSECTION 2.  That the expenditure of $25,000.00 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Recreation and Parks ARPA Fund 2209 per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That the contracted hourly rates for services will hereby increase by $2.00/hour in response to vendor documented increases in the price of fuel.\n \nSECTION 3. That the City Auditor is authorized to make any changes to revise the funding source for any contract or contract modifications associated with this ordinance.\nSECTION 4.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or 10 days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 54,
    "meeting_date": "2022-07-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}