{
  "success": true,
  "vote": {
    "id": 4403,
    "item_number": "CA-53",
    "title": "To amend the 2021 Capital Improvement Budget; to authorize the City Auditor to transfer funds within the Development - Taxable Bond Fund; to authorize the expenditure of up to $18,946.85 from the Development - Taxable Bond Fund; to authorize the appropriation and expenditure of up to $22,488.47 of the NSP 1 program income from the U.S. Department of Housing and Urban Development; to authorize a total of $41,435.32 to be added to the $338,000.00 for agreements authorized under Ordinance 0406-2022; to authorize the Director of the Department of Development to enter into two commitment letters, loan agreements, promissory notes, mortgages and one grant agreement with HNHF Realty Collaborative, Inc., for the construction of two single family homes in the South Linden neighborhood at 1089 and 1124 E 16th Avenue; and to declare an emergency. ($41,435.32).",
    "description": "Explanation\n \nBACKGROUND:  This ordinance authorizes the appropriation and expenditure of up to $22,488.47 of Neighborhood Stabilization Program 1 (NSP 1) program income from the U.S. Department of Housing and Urban Development (HUD) and authorizes the expenditure of $18,946.85 of bond funds, for a total of $41,435.32, to be added to the $338,000.00 authorized under Ordinance 0406-2022.\n \nOrdinance 0406-2022 authorized the Director of Development to enter into two commitment letters, loan agreements, promissory notes, mortgages, and restrictive covenants with HNHF Realty Collaborative, Inc., a non-profit corporation for the construction of two single family homes in the South Linden neighborhood, at 1089 and 1124 E 16th Avenue.  This ordinance will add additional funds to the yet to be executed agreements.  The total amount of the agreements authorized under Ordinance 0406-2022 and this ordinance is $379,435.32.\n \nOrdinance 0406-2022                     $338,000.00                     NSP 1 and NSP 3 funds\nThis ordinance                                          $  41,435.32                     NSP 1 funds and bond funds\nTotal amount                                          $379,435.32\n \nWith the construction of two new, single-family homes at 1089 and 1124 E 16th Avenue, HNHF Realty Collaborative, Inc. is bringing investment to the South Linden neighborhood in the central city of Columbus. Each home will have three bedrooms and two and a half baths and will be built to City AWARE standards.  Each home will be sold to a buyer at or below 120% of the Area Median Income as defined by HUD.  South Linden is a designated area for use of NSP 1 and NSP 3 funding.  HNHF is already doing work in this neighborhood and has already completed 28 home repair projects in the South Linden neighborhood.\n \nThe funding will be divided as follows for each location:\n \n1089 E 16th\n$81,619.59                      NSP 1                                          Ord. 0406-2022\n$87,380.41                     NSP 3                                          Ord. 0406-2022\n$20,717.66                      NSP 1 PI                     this ordinance\n$189,717.66\n \n1124 E 16th\n$169,000.00                      NSP 3                                          Ord. 0406-2022\n$    1,770.81                     NSP 1                                          this ordinance\n$  18,946.85                      Bond                                          this ordinance\n$189,717.66\n \nEmergency action is requested to allow for the developer to maintain the project schedule.\n \nContract Compliance:  the vendor number is 001183 and expires 10/9/2022\n \nFiscal Impact: $22,488.47 is available from the NSP 1 (G440500) program income.  The agreements will be funded from the ACPO for this ordinance and ACPO007493 from Ordinance 0406-2022.\n \nTitle\nTo amend the 2021 Capital Improvement Budget; to authorize the City Auditor to transfer funds within the Development - Taxable Bond Fund; to authorize the expenditure of up to $18,946.85 from the Development - Taxable Bond Fund; to authorize the appropriation and expenditure of up to $22,488.47 of the NSP 1 program income from the U.S. Department of Housing and Urban Development; to authorize a total of $41,435.32 to be added to the $338,000.00 for agreements authorized under Ordinance 0406-2022; to authorize the Director of the Department of Development to enter into two commitment letters, loan agreements, promissory notes, mortgages and one grant agreement with HNHF Realty Collaborative, Inc., for the construction of two single family homes in the South Linden neighborhood at 1089 and 1124 E 16th Avenue; and to declare an emergency. ($41,435.32).\n \nBody\nWHEREAS, the City of Columbus has received Neighborhood Stabilization 1 (NSP1) and Neighborhood Stabilization 3 (NSP3) grants from the U.S. Department of Housing and Urban Development; and\n \nWHEREAS, the implementation of NSP 1 and NSP 3 was delegated to the Department of Development; and\n \nWHEREAS, the Department of Development desires to support HNHF Realty Collaborative for the construction of two single family homes in the South Linden neighborhood, at 1089 and 1124 E 16th Avenue with NSP 1, NSP 3, and bond funds; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to appropriate and expend said funds to allow for the developer to begin construction as soon as possible, thereby preserving the public health, peace, property, safety, and welfare; and NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2021 Capital Improvements Budget authorized by ordinance 2707-2021 be amended as follows to establish sufficient authority for this this project:\n                                       \nFund / Project / Project Name / C.I.B. / Change / C.I.B. as Amended\n7739 / P782001-100000 / Housing Preservation (Councilmatic) / $452,299.00 / ($18,946.85) / $433,352.15\n7739 / P782037-100000 / Linden Rentals / $0.00 / $18,946.85 / $18,946.85\n \nSECTION 2.  That the transfer of $18,946.85 or so much thereof as may be needed, is hereby authorized within Fund 7739 (Development Taxable Bond fund), Dept-Div 44-10 (Housing) per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That for the purpose as stated in Sections 6 and 7, the expenditure of $18,946.85, or so much thereof as may be necessary, is hereby authorized in Fund 7739 (Development Taxable Bond fund), Project P782037-100000, Dept. 44-10 (Housing), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 4. That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2022, the sum of $22,488.47 is appropriated in Fund 2220 (General Government Grants) from Dept-Div 44-10 (Housing), G440500 (NSP 1 program income), object class 05 (Other Expenses) per the account codes in the attachment to this ordinance.\n \nSECTION 5.  That the expenditure of $22,488.47 or so much thereof as may be needed, is hereby authorized in Fund 2220 (General Government Grants), Dept-Div 4410 (Housing), G440500 (NSP 1 program income), object class 05 (Other Expenses) per the account codes in the attachment to this ordinance.\n \nSECTION 6.  That the Director of Development is hereby authorized to enter into a commitment letter, loan agreement, promissory note, mortgage, and restrictive covenant with HNHF Realty Collaborative, Inc. for the construction of the single family home at 1089 E 16th Avenue in an amount up to $189,717.66.\n \nSECTION 7. That the Director of Development is hereby authorized to enter into a commitment letter, loan agreement, promissory note, mortgage, restrictive covenant and grant agreement with HNHF Realty Collaborative, Inc. for the construction of the single family home at 1124 E 16th Avenue in an amount up to $189,717.66.\n                     \nSECTION 8.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n                                          \nSECTION 9.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 10.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 11. At the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements.\n \nSECTION 12.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 1,
    "absent": 0,
    "meeting_id": 54,
    "meeting_date": "2022-07-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "ABSTAIN"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}