{
  "success": true,
  "vote": {
    "id": 443,
    "item_number": "SR-13",
    "title": "To amend Chapter 4551 of Columbus City Codes requiring operators to provide tenants with a written receipt for any security deposit and for all rental payments.",
    "description": "Explanation\nLow-income tenants are at times unbanked and without access to electronic methods of making security deposit and rental payments, often utilizing cash or money order to meet obligations. In scenarios where these tenants are required to prove rent was paid on time, they are without proper documentation of their payment. An operator who provides a rental receipt helps protect both a tenant and landlord in the case of dispute. \nTitle\nTo amend Chapter 4551 of Columbus City Codes requiring operators to provide tenants with a written receipt for any security deposit and for all rental payments.\nBody\nWHEREAS, it is in the best interest of all parties that receipts be given to a tenant for any security deposit and for all rental payments; and\nWHEREAS, current code does not require an operator to provide a receipt to the tenant for any security deposits or rental payments; and\nWHEREAS, amending the city code to require operators to provide tenants with written receipts would benefit the City of Columbus by making sure there is proof of every transaction so that there are no disputes when it comes to potential late fees or eviction proceedings between the operator and the tenant; NOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1. That Chapter 4551 of Columbus City Codes is hereby amended to read as follows:\n4551.05 Rental Receipt\n(a) Written rent receipt required. Except as otherwise provided in division (b), no operator shall fail to cause a tenant to be provided with a written receipt for any security deposit and for all rental payments at the time the deposit or payment is received. In the event of payment by cash or by any other means that does not provide an automatically generated written receipt, the receipt shall be provided within 4 business days of the security deposit or rental payment being received.\n(b) The provisions of this section shall not apply to any operator of permanent supportive housing properties.\n(c) Where an operator provides for payment of either a security deposit or rent through a third-party online portal or service, the ability of the tenant to obtain a written receipt through the portal or service accepting the payment shall constitute evidence of the provision of a receipt by the operator.\n(d) Organizational criminal liability as provided for in Section 2301.23 is contemplated where an organization is an operator.\n(e) The offense established under this section is a strict liability offense.\n(f) Whoever violates this section is guilty of failure to provide a rent receipt, a misdemeanor of the fourth degree.\nSECTION 2. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 7,
    "meeting_date": "2021-03-08",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Housing"
    ]
  }
}