{
  "success": true,
  "vote": {
    "id": 4434,
    "item_number": "CA-84",
    "title": "To authorize the Director of the Department of Public Service to enter into grant agreements with various social service agencies in support of the Cleaner Columbus Employment Program;  to authorize appropriations and a transfer within the general fund; to authorize an expenditure of $315,000.00 within the general fund; and to declare an emergency. ($315,000.00)",
    "description": "Explanation\n \nThis ordinance authorizes the Director of the Department of Public Service to enter into grant agreements with various non-profit social service agencies in support of the Cleaner Columbus Initiative and the Cleaner Columbus Employment Program and to purchase supplies for litter clean-up for Keep Columbus Beautiful.\n \nAccording to a July 2020 study on the impact of COVID-19 in major US cities, more than half of residents reported experiencing serious financial problems. In 2020, the Cleaner Columbus Employment Program offered residents in five neighborhoods the opportunity to have temporary employment performing neighborhood beautification and cleanup. The funding provided temporary assistance due to financial hardship experienced because of the COVID-19 pandemic. The three-week initiative was a resounding success. Residents collected 5,789 bags of litter and debris for a total weight of 173,670 lbs. That is 53 percent of the total weight of litter and debris collected in all of 2019.  \n \nOn June 2, 2022, the City of Columbus published a Request for Proposals for social service agencies to apply for Cleaner Columbus employment grants. There were four (4) proposals submitted. An evaluation committee reviewed the proposals in consultation with Keep Columbus Beautiful staff and made recommendations for funding levels. \n \nThe Cleaner Columbus Employment Program will continue to offer employment opportunities to residents by paying a minimum of $15 per hour. Community partners will prioritize enrolling residents that have experienced employment disruption.\n \nThe Cleaner Columbus Employment Program has an annual period beginning March 1 and concluding November 30. The social service agencies listed below are for the reminder of the 2022 annual period. \n \nFiscal Impact: Funding is available within the Reimagine Safety subfund.\n \nEmergency action is requested in order to avoid any delay in providing the resources necessary to initiate the 2022 Cleaner Columbus Employment Program for those who are experiencing financial hardships.\n \nTitle\n \nTo authorize the Director of the Department of Public Service to enter into grant agreements with various social service agencies in support of the Cleaner Columbus Employment Program;  to authorize appropriations and a transfer within the general fund; to authorize an expenditure of $315,000.00 within the general fund; and to declare an emergency. ($315,000.00)\n \nBody\n \nWHEREAS, in major U.S. cities, more than half of residents reported experiencing serious financial hardship as a result of the COVID-19 pandemic; and\n \nWHEREAS, by offering temporary employment the Cleaner Columbus Employment Program will offer financial resources to some of our most vulnerable residents; and\n \nWHEREAS, litter has served as a constant nuisance in some of our low-income neighborhoods; and\n \nWHEREAS, the expenditure of these funds is necessary to address the challenges of unemployment and underemployment due to ongoing challenges with the COVID-19 pandemic; and\n \nWHEREAS, the City published a Request for Proposals for Cleaner Columbus Employment Grants in accordance with relevant provisions of Columbus City Code Chapter 329.  Four (4) proposals were received and opened on June 2, 2022. Of these four (4) responses, the committee selected four (4) of the firms. The evaluation committee met July 6, 2022 to submit final scores and recommended that St. Stephens Community House, Franklinton Board of Trade, and the Hilltop Shalom Zone will all be awarded one (1) grant each; and Community Development for all people will be awarded two (2) grants; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to authorize grant agreements with the selected agencies in order to avoid any delay in providing the resources necessary to initiate the 2022 Cleaner Columbus Employment Program for those who are experiencing financial hardships; NOW THEREFORE:\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Department of Public Service is hereby authorized to enter into grant agreements with the following social service agencies in support of the Cleaner Columbus Employment Program:                                                               \n                                          \nCommunity Development for All People - $120,000.00                                          \nSt. Stephens Community House - $60,000.00                                          \nFranklinton Board of Trade - $60,000.00\nGreater Hilltop Shalom Zone - $60,000.00                                                               \n \nSECTION 2. That the Auditor is hereby authorized and directed to appropriate $315,000.00 within the Reimagine Safety subfund, fund 1000,subfund 100019, to the Department of Public Service in 10-Transfers, per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That the Auditor is hereby authorized and directed to transfer $315,000.00 within the general fund per the accounting codes in the attachment to this ordinance.\n \nSECTION 4. That the Auditor is hereby authorized and directed to appropriate $315,000.00 within the general fund, fund 1000, subfund 100010, to the Department of Public Service in 03-Services, per the accounting codes in the attachment to this ordinance.\n \nSECTION 5. That per the action authorized in Section 1 of this ordinance, the expenditure of $315,000.00 within the general fund, fund 1000, subfund 100010, is hereby authorized per the accounting codes in the attachment to this ordinance.\n \nSECTION 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION7.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 54,
    "meeting_date": "2022-07-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Community Services",
      "Contracts & Agreements"
    ]
  }
}