{
  "success": true,
  "vote": {
    "id": 4437,
    "item_number": "CA-87",
    "title": "To amend the Management Compensation Plan, Ordinance No. 2713-2013, as amended, by amending Section 5(E), Section 10(D), Section 12(H), and Section 14(I); and to declare an emergency.",
    "description": "Explanation\n \nThis ordinance amends the Management Compensation Plan, Ordinance No. 2713-2013, as amended, by enacting the classifications of Parking Services Division Administrator (0231) and Personnel Analyst III (0902), by modifying the title of the classification of Assistant Director (Sustainability) (U) (0060), and repealing the classification of Assistant Director (Regulatory Compliance) (U) (0058) as a result of Civil Service Commission action and to reflect these changes in the Vacation and Sick Leave sections; by modifying the pay grades of the classifications of Assistant Auditor V (U) (0658), Assistant Auditor IV (U) (0657), Income Tax Division Administrator (0225), Income Tax Division Assistant Administrator (0224), and Personnel Administrative Manager (0898); and to refer to the Jury Duty portion regarding Court Leave in the Special Leave With Pay section regarding subpoenaed employees to direct that any compensation received by the court be surrendered to the treasurer.\n \n \nTitle\n \nTo amend the Management Compensation Plan, Ordinance No. 2713-2013, as amended, by amending Section 5(E), Section 10(D), Section 12(H), and Section 14(I); and to declare an emergency.\n \n \nBody\n \nWHEREAS, it is necessary to amend the Management Compensation Plan to enact the classification of Parking Services Division Administrator (0231) as a result of Civil Service Commission action and assign it to Pay Grade 96 ; and\n \nWHEREAS, it is necessary to amend the Management Compensation Plan to enact the classification of Personnel Analyst III (0902) as a result of Civil Service Commission action and assign it to Pay Grade 92 ; and\n \nWHEREAS, it is necessary to amend the Management Compensation Plan to modify the pay grade for the classification of Assistant Auditor V (U) (0658) and to reassign it to Pay Grade 97; and\n \nWHEREAS, it is necessary to amend the Management Compensation Plan to modify the pay grade for the classification of Assistant Auditor IV (U) (0657) and to reassign it to Pay Grade 96; and\n \nWHEREAS, it is necessary to amend the Management Compensation Plan to modify the pay grade for the classification of Income Tax Division Administrator (0224) and to reassign it to Pay Grade 97; and\n \nWHEREAS, it is necessary to amend the Management Compensation Plan to modify the pay grade for the classification of Income Tax Division Assistant Administrator (0225) and to reassign it to Pay Grade 95; and\n \nWHEREAS, it is necessary to amend the Management Compensation Plan to modify the pay grade for the classification of Personnel Administrative Manager (0898) and to reassign it to Pay Grade 94; and\n \nWHEREAS, it is necessary to amend the Management Compensation Plan to amend the title of the classification of Assistant Director (Sustainability) (U) (0060) to Assistant Director (Sustainability/Regulatory Compliance) (U) (0060) in Section 5(E) and to duplicate the class title change in Section 12(H)                      and Section 14(I) as a result of Civil Service Commission action; and\n \nWHEREAS, it is necessary to amend the Management Compensation Plan to amend Section 10(D) to include employees who are subpoenaed to surrender any compensation received by the court to the treasurer; and\n \nWHEREAS, it is necessary to amend the Management Compensation Plan to amend Section 5(E) by repealing the classification of Assistant Director (Regulatory Compliance) (U) (0058) as a result of Civil Service Commission action; and \n \nWHEREAS, an emergency exists in the usual daily operation of the City in that it is immediately necessary to amend certain provisions of the Management Compensation Plan, thereby preserving the public peace, property, health, safety, and welfare; Now, Therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSee Attachment",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 54,
    "meeting_date": "2022-07-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services"
    ]
  }
}