{
  "success": true,
  "vote": {
    "id": 4439,
    "item_number": "CA-89",
    "title": "To authorize participation in and adopt the bylaws of the OneOhio Region 1 Governance structure arising out of IN RE: NATIONAL PRESCRIPTION OPIATE LITIGATION in the United States District Court for the Northern District of Ohio, MDL Case No. 1:17-md-02804-DAP; to authorize the City Attorney to execute any additional documents necessary in furtherance of this Ordinance; and to declare an emergency.",
    "description": "Explanation\n \nIn 2017, the City of Columbus, through the Office of the City Attorney, obtained outside special counsel to represent the City in what would become the Multi-District Opiate Litigation (“the MDL”)  - IN RE:  NATIONAL PRESCRIPTION OPIATE LITIGATION in the United States District Court for the Northern District of Ohio, MDL Case No. 1:17-md-02804-DAP.  On August 6, 2021, the City Attorney, pursuant to the authorization provided by Ordinance 1263-2021, elected to participate in the material terms of the National Settlement Agreement dated July 21, 2021 pursuant to the terms of the OneOhio Memorandum of Understanding (“The Memorandum”) dated July 28, 2021.  \n \nThe Memorandum divides the state into 18 distinct regions and the City of Columbus is primarily served by Region 1.  The Memorandum mandates that all Local Governments (counties, townships, cities and villages) within a Region be given the opportunity to participate in establishing a regional governance structure.  Regions are further encouraged to involve stakeholders from the private sector, such as treatment providers and persons with lived experience with substance abuse, in regional decisions. In accordance with the dictates of the Memorandum, representatives from the City of Columbus, Franklin County, the Central Ohio Mayor and Managers Association (COMMA) and the Franklin County Township Association (FCTA) have agreed upon a structure (“The Board”) for the governance of Region 1 as further described in The Bylaws of the OneOhio Region 1 Board of Governance (“The Bylaws”).\nThe Board shall consist of eleven volunteer members representing Region 1 as selected by the appointing authorities as provided:\n \n•                     3 Members from Franklin County, appointed by the Franklin County Commissioners\n•                     3 Members from the City of Columbus, appointed by the Columbus Mayor and confirmed by the Columbus City Council\n•                     3 Members who are joint appointments from the City of Columbus and Franklin County\n•                     1 Member from a Franklin County city or village appointed by the Central Ohio Mayor and Managers Association (“COMMA”)\n•                     1 Member from a Franklin County township, appointed by the Franklin County Township Association (“FCTA”) \n \nIn selecting members of the Board, the appointing authorities shall ensure all local governments have input and equitable representation regarding regional decisions as provided for in The Memorandum.  Additionally, appointing authorities are encouraged to involve stakeholders from the private sector, in addition to the public sector, in order to assure that the Regional Opioid Funds equitably serve the needs of the entire region.  In considering stakeholder appointments, it is recommended that appointing authorities seek to obtain representation from public health, addiction services, the criminal justice system, hospitals and the medical community, the Alcohol, Drug and Mental Health Board of Franklin County (“ADAMH”), financial consultants, corporate partners, and individuals with lived experiences.\n \nTitle\n \nTo authorize participation in and adopt the bylaws of the OneOhio Region 1 Governance structure arising out of IN RE: NATIONAL PRESCRIPTION OPIATE LITIGATION in the United States District Court for the Northern District of Ohio, MDL Case No. 1:17-md-02804-DAP; to authorize the City Attorney to execute any additional documents necessary in furtherance of this Ordinance; and to declare an emergency.\n \nBody\n \nWHEREAS, in 2017, the City of Columbus, through the Office of the City Attorney, obtained outside special counsel to represent the City in what would become the Multi-District Opiate Litigation (“the MDL”)  - IN RE:  NATIONAL PRESCRIPTION OPIATE LITIGATION in the United States District Court for the Northern District of Ohio, MDL Case No. 1:17-md-02804-DAP; and\nWHEREAS, on August 6, 2021, the City Attorney, pursuant to the authorization provided by Ordinance 1263-2021, elected to execute formal documents authorizing the City to participate in the material terms of the National Settlement Agreement dated July 21, 2021 pursuant to the terms of the OneOhio Memorandum of Understanding (“The Memorandum”) dated July 28, 2021; and   \nWHEREAS, the Memorandum establishes a mechanism to disburse settlement proceeds from opioid litigation into Ohio’s communities to help abate the opioid crisis, including allocations to Local Governments and Regions through a statewide Foundation; and\nWHEREAS, the City is primarily a participant in Region 1, as established by The Memorandum; and\nWHEREAS, pursuant to The Memorandum, each Region shall create their own governance structure so it ensures all Local Governments have input and equitable representation regarding regional decisions including representation on the statewide Foundation Board and selection of projects to be funded from the region’s regional Share; and\nWHEREAS, a regional governance structure for Region 1 has been advanced that would allow for equitable representation for the citizens of the City of Columbus, Franklin County, as well as the townships and municipal subdivisions of Franklin County while assuring the involvement of stakeholders from the private sector, such as treatment providers and persons with lived experience with substance abuse, in regional decisions; and\nWHEREAS, an emergency exists in the usual daily operations of the Office of the City Attorney, in that it is necessary for this ordinance to be effective immediately in order to allow for the appointment of Columbus representatives to the governance board prior to the imminent, first distribution of local funds; NOW THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     That the City Council hereby finds that the regional governance structure attached hereto as Exhibit A ensures all Local Governments in this Region have input and equitable representation regarding regional decisions under The Memorandum.\n \nSECTION 2.                     That the City Council hereby approves and adopts the regional governance structure and bylaws attached hereto as Exhibit A.\n \nSECTION 3.                      That the City Attorney is hereby authorized to execute additional documents, including an intergovernmental agreement should that be needed, and take any and all actions necessary in furtherance of this Resolution that are required and are not inconsistent with this Resolution.\n \nSECTION 4.                     That for the reasons stated in the preamble hereto, which is made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force after passage and approval by the Mayor, or 10 days after passage if the Mayor neither vetoes nor approves the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 54,
    "meeting_date": "2022-07-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services"
    ]
  }
}