{
  "success": true,
  "vote": {
    "id": 4458,
    "item_number": "SR-9",
    "title": "To authorize the Director of the Department of Development to enter into a Job Creation Tax Credit Agreement of sixty-five percent (65%) for a period of ten (10) consecutive years with BBI Logistics, LLC in consideration of the company’s total proposed capital investment of approximately $56,527,136 million, retention of 175 full-time position with an annual payroll of approximately $12,867,400.00 and the proposed creation of approximately 953 net new full-time permanent positions with an annual payroll of approximately $80,577,408.00 over the full ten (10) year of the term of the incentive.",
    "description": "Explanation\nBACKGROUND: The need exists to enter into a Job Creation Tax Credit Agreement with BBI Logistics, LLC (“BBI Logistics”). The Ohio Tax Credit Legislation (Section 718.15 of the Ohio Revised Code) authorizing such agreements became effective January 14, 1993 and requires the City to enter a Council-approved agreement between the City and a participating company.\n \nBBI Logistics was established in 2017 as a freight brokerage firm specializing in handling full truck load shipments while also dealing with a variety of other services such as, LTL, intermodal, specialized equipment, and expediting shipments. The first employees ran all operations from a small startup office at Easton Town Center in Columbus, OH, and have grown to closing 2021 with $150 million in revenue and more than 150 employees as well as expanding into an office in Tampa, Florida that currently has 30 employees.\n \nBBI Logistics is proposing to invest a total capital expenditure of approximately $56,527,136, which includes $4,451,532 in acquisition costs, $32,809,254 in new construction, $4,000,000 in machinery and equipment, $4,800,000 in furniture and fixtures, $4,500,000 in computers and $5,966,350 in leasehold improvements to create a new corporate headquarters (“HQ”) in the Arena District.  The proposed HQ will be located at 600 W. Nationwide Boulevard, Columbus, Ohio 43215, parcel number 010-301902 though operations will remain at 80 E. Rich Street, Suite 200, Columbus, Ohio 43215, parcel number 010-296465 during construction (both addresses are the “Project Site”).  Additionally, BBI Logistics proposes to create approximately 953 net new full-time permanent positions with an annual payroll of approximately $80,577,408 over the full ten (10) year term of the incentive and retain 175 full-time positions with an annual payroll of approximately $12,867,400 at the Project Site.\n \nBBI Logistics is requesting from the City of Columbus, a Job Creation Tax Credit to assist in the development of the aforementioned project.  \n \nThis legislation is presented as 30-day legislation.  \n \nFISCAL IMPACT: No funding is required for this legislation. \n \nTitle\nTo authorize the Director of the Department of Development to enter into a Job Creation Tax Credit Agreement of sixty-five percent (65%) for a period of ten (10) consecutive years with BBI Logistics, LLC in consideration of the company’s total proposed capital investment of approximately $56,527,136 million, retention of 175 full-time position with an annual payroll of approximately $12,867,400.00 and the proposed creation of approximately 953 net new full-time permanent positions with an annual payroll of approximately $80,577,408.00 over the full ten (10) year of the term of the incentive. \n \nBody\nWHEREAS, contingent on the City granting a Job Creation Tax Credit, BBI Logistics, LLC will construct a new corporate headquarters (“HQ”) facility to expand their current operations.  The proposed HQ will be located at 600 W. Nationwide Boulevard, Columbus, Ohio 43215, parcel number 010-301902 though operations will remain at 80 E. Rich Street, Suite 200, Columbus, Ohio 43215, parcel number 010-296465 during construction (both addresses are the “Project Site”); and \n \nWHEREAS, BBI Logistics, LLC proposes to invest a total capital expenditure of approximately $56,527,136, which include $4,451,532 in acquisition costs, $32,809,254 in new construction, $4,000,000 in machinery and equipment, $4,800,000 in furniture and fixtures, $4,500,000 in computers and $5,966,350 in leasehold improvements to create a new HQ in the Arena District; and\n \nWHEREAS, BBI Logistics, LLC expects to create approximately 953 net new full-time permanent positions with an annual payroll of approximately $80,577,408 over the full ten (10) year term of the incentive and retain 175 full-time positions with an annual payroll of approximately $12,867,400, to increase employment opportunities and strengthen the economy of the city; and\n \nWHEREAS, receiving these tax credits from the City is a critical factor in BBI Logistics, LLC’s decision to go forward with the aforementioned project in Columbus; and\n \nWHEREAS, the City desires to increase employment opportunities and encourage the creation of new jobs in the City in order to improve the overall economic climate of the City and its citizens; and \n \nWHEREAS, BBI Logistics, LLC has indicated that a Job Creation Tax Credit is crucial to its decision to locate the aforementioned expansion in Columbus; and  \n \nWHEREAS, the City of Columbus desires to facilitate the future growth of BBI Logistics, LLC at the Project Site by providing a Job Creation Tax Credit Incentive, NOW THEREFORE,                                  \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS\n \nSECTION 1.                     That the City Council hereby finds and determines that the project will (1) create jobs in the State and City; (2) the project is economically sound and will benefit the people of the State and City by increasing opportunities for employment and strengthening the economy of the State and City; and (3) receiving the aforementioned tax credits is a critical factor in the decision for BBI Logistics, LLC to go forward with the project.\n \nSECTION 2.                     That the Director of the Department of Development is hereby authorized and directed to enter into and execute a Job Creation Tax Credit of sixty-five percent (65%) of the amount of City income tax withheld on new employees for a term up to ten (10) consecutive years with BBI Logistics, LLC. \n \nSECTION 3.                     That the City of Columbus Job Creation Tax Credit Agreement is signed by BBI Logistics, LLC within 90 days of passage of this ordinance, or this ordinance and the credit herein shall be null and void.\n \nSECTION 4.                      The City Council hereby extends authority to the Director of the Department of Development to amend the BBI Logistics, LLC City of Columbus Job Creation Tax Credit Agreement for certain modifications to the agreement requested in writing by the company and or the City and deemed appropriate by the Director of Development with these modifications being specifically limited to reductions in length of term, methods of calculating the incentive, or adding or deleting business entities associated with the employment commitments related to this incentive. All other requested amendments must be approved by City Council.\n \nSECTION 5.   That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 54,
    "meeting_date": "2022-07-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Economic Development"
    ]
  }
}