{
  "success": true,
  "vote": {
    "id": 4464,
    "item_number": "SR-15",
    "title": "To de-prioritize the enforcement of laws that criminalize access to safe reproductive healthcare procedures and services, and to declare an emergency.",
    "description": "Explanation\nOn June 24, 2022, the United States Supreme Court overturned Roe v. Wade declaring that the constitutional right to abortion, no longer exists. As a result, abortion rights have been rolled back in nearly half of the states immediately, with more restrictions likely to follow. For all practical purposes, abortion will not be available in large swaths of the country. On July 11, 2019, Ohio Governor Mike DeWine signed into law S.B. 23, criminalizing abortion with no exception for rape or incest after the detection of a fetal heartbeat at the felony level with a sentence of up to one year in prison. This law took effect shortly after the Supreme Court decision overturning Roe v. Wade.\n \nAn abortion ban at the detection of a fetal heartbeat will have profound negative impacts on the health of women in Columbus by effectively eliminating access to all legal abortion services, without exceptions for cases of rape and incest and with woefully inadequate protections for the life and health of the woman. Senate Bill 23 negatively impacts the ability of Columbus to attract and retain qualified medical professionals by threatening doctors with loss of license, civil liability and prison time and fines for performing duties in their capacity as medical professionals.\n \nAccess to comprehensive reproductive healthcare supports the health and wellbeing of women and families in Columbus by providing safe and healthy family planning options, preventing unintended pregnancies, increasing women’s participation in the labor force, and improving economic security for families. The City of Columbus is committed to de-prioritizing the enforcement of any laws banning actions that have been criminalized as a result of Roe v. Wade being overturned and S.B. 23 being implemented. The resources of the City must be dedicated to the health and wellbeing of its residents.\n \n \nTitle\nTo de-prioritize the enforcement of laws that criminalize access to safe reproductive healthcare procedures and services, and to declare an emergency.\n \nBody\nWHEREAS, the City of Columbus honors the rights of pregnant people to bodily autonomy and control over their private medical decisions; and\n \nWHEREAS, access to safe and legal abortion is a deciding factor in long-term health, safety, and quality of life; and\n \nWHEREAS, the Supreme Court of the United States has overturned the landmark ruling, Roe v. Wade, which eliminates federal constitutional protections for such care; and\n \nWHEREAS, on July 11, 2019, Ohio Governor Mike DeWine signed into law S.B. 23, that criminalizes abortion after the detection of a fetal heartbeat at the felony level with a sentence of up to one year in prison with no exception for rape or incest and which took effect soon after the Supreme Court decision overturning Roe v. Wade; and\n \nWHEREAS, anti-choice legislators have weaponized the criminal law to stigmatize reproductive choice, and the Council considers Ohio laws which seek to criminalize pregnancy outcomes to include those which seek to regulate or ban abortion, miscarriage, or other reproductive healthcare choice or acts; and\n \nWHEREAS, people have a basic human right to medical treatment, up to and including abortion; and\n \nWHEREAS, the Ohio Constitution preserves individual, inalienable rights to its people, among which are those of enjoying and defending life and liberty, and seeking and obtaining happiness and safety; and\n \nWHEREAS, the Ohio Constitution likewise preserves the freedom to choose health care and to be free from state laws which shall impose a penalty or fine for the sale or purchase of health care; and\n \nWHEREAS, eliminating legal access to abortion has been empirically proven to dramatically increase the risk of death, bodily injury, and infertility, especially within low-income communities and communities of color thereby depriving them of their constitutional rights; and\n \nWHEREAS, the resources of the City must be dedicated to the health and wellbeing of its residents; and\n \nWHEREAS, the City Council has previously demonstrated its commitment to abortion access in Resolution No. 0129X-2019; and\n \nWHEREAS, in the 1973 Roe v. Wade majority opinion, Supreme Court Justice Harry Blackmun stated \"[The] right of privacy, whether it be founded in the Fourteenth Amendment's concept of personal liberty and restrictions upon state action, as we feel it is, or, as the District Court determined, in the Ninth Amendment's reservation of rights to the people, is broad enough to encompass a woman's decision whether or not to terminate her pregnancy\"; and\n \nWHEREAS, the right to privacy should protect doctors, patients, and all others providing abortion-related medical care from any criminal investigation related to decisions made within the healthcare provider-patient relationship so long as those decisions occur without coercion, force, or negligence; and\n \nWHEREAS, equitable access to abortion care requires financial and logistical support, most often provided by abortion funds, practical support organizations, and volunteers who have been targeted by the State for providing these services; and\n \nWHEREAS, the City has a responsibility to protect its residents from any violation of their human and constitutional rights and any criminalization of the free exercise thereof; \n \nWHEREAS, an emergency exists in the usual daily operation in the City of Columbus in that it is immediately necessary to pass this ordinance to de-prioritize the enforcement of laws that criminalize access to safe reproductive healthcare procedures and services for the immediate preservation of the public peace, property, health and safety; NOW THEREFORE,\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nThe City of Columbus formally condemns any action intended to abrogate the fundamental liberties of its people and affirms its commitment to protecting the right of its residents to make reproductive health decisions, including abortion care, for themselves.\n \nBE IT FURTHER RESOLVED:\n \nIt is the policy of the City that, except to the extent otherwise required by state or federal law, City funds will not be used to do any of the following:\n                     -Store or catalog any report of an abortion, miscarriage, or other reproductive healthcare act;\n                     -Provide information to any other governmental body or agency about any abortion, miscarriage, or other reproductive healthcare act, unless such information is provided to defend the patient's right to abortion care or the healthcare provider's right to provide that care;\n                     -Conduct surveillance or collect information related to an individual or organization for the purpose of determining whether an abortion has occurred, except for aggregated data without personally identifying information or personal health information which is collected for purposes unrelated to criminal investigation, enforcement, or prosecution.\n \nBE IT FURTHER RESOLVED:\n \nThe policy stated above does not apply in cases where coercion or force is alleged to have been used against the pregnant person, or in cases involving an allegation of conduct criminally negligent to the health of the pregnant person seeking care, or where the abortion, miscarriage, or reproductive healthcare is not the crime being investigated but evidence of another crime.\n \nBE IT FURTHER RESOLVED:\n \nIt is the policy of the City that the investigation or support for the prosecution of any allegation, charge or information relating to the outcome of a given pregnancy, including abortion and abortion-related care, or any party thereto, will be the lowest priority for enforcement and the use of City resources and personnel, except in cases (a) where coercion or force is used against the pregnant person, (b) of criminally negligent conduct involving the health of the pregnant person seeking care, or (c) where the abortion, miscarriage, or reproductive healthcare is not the crime being investigated but evidence of another crime.\n \nBE IT FURTHER RESOLVED:\n \nThat for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or 10 days after its passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 54,
    "meeting_date": "2022-07-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services",
      "Health & Safety"
    ]
  }
}