{
  "success": true,
  "vote": {
    "id": 4495,
    "item_number": "SR-46",
    "title": "To amend the Far East Community Reinvestment Area to make modifications to align with the updates located in Chapter 4565 of the Columbus City Code; to set forth the circumstances under which a combined parcel resulting from the combination of a parcel within the original CRA boundaries and parcel(s) outside of the original CRA boundaries will be deemed to be within the CRA; and to further clarify exemption requirements.",
    "description": "Explanation\nIn 2018, the City adopted a new residential Community Reinvestment Area policy based on the 2016 study from HR&A that evaluated the effectiveness of real property tax abatements.  Chapter 4565 of the City Code was established by Ordinance 2184-2018 that outlines the requirements for eligibility to apply for residential tax abatements.  Chapter 4565 of the City Code also requires the City to evaluate the policy and CRA categorization every 3 years.  The Far East Community Reinvestment Area was created after the 2018 policy and now that the 2022 update is occurring, there is a need to update the Far East CRA to reflect the new policy.  This ordinance will modify the Far East Community Reinvestment Area by authorizing modifications that align with the updates to Chapter 4565 of the Columbus City Code.\n \nTitle\nTo amend the Far East Community Reinvestment Area to make modifications to align with the updates located in Chapter 4565 of the Columbus City Code; to set forth the circumstances under which a combined parcel resulting from the combination of a parcel within the original CRA boundaries and parcel(s) outside of the original CRA boundaries will be deemed to be within the CRA; and to further clarify exemption requirements.\n \n \nBody\nWHEREAS, the council of the City of Columbus (hereinafter \"Council\") desires to pursue reasonable and legitimate incentive measures to assist and encourage development in specific areas of the City of Columbus that have not enjoyed reinvestment from remodeling or new construction; and\n \nWHEREAS, Resolution No. 1698-78, approved August 3, 1978, authorized the Department of Development to carry out a Community Reinvestment Program, pursuant to Sections 3735.65 to 3735.70 of the Ohio Revised Code, and approved certain administrative procedures for the program; and  \n \nWHEREAS, Ordinance 1532-2019 created the Far East Community Reinvestment Area and authorized real property tax exemptions within it, as provided per Ohio Revised Code; and\nWHEREAS, the City of Columbus has established a goal of fostering private sector investment to build mixed income neighborhoods dispersed throughout the City; and\nWHEREAS, in 2018 the City developed an incentive policy to encourage development of affordable housing through targeted economic development incentives, including real property tax abatements, throughout the City; and\nWHEREAS, the policy adopted in 2018 outlined the requirement to review the categorization of existing CRAs and the policy requirements every three (3) years; and\nWHEREAS, the Far East Community Reinvestment Area was created after the 2018 policy and now that the 2022 update is occurring, there is a need to update the Far East Community Reinvestment Area to reflect the new policy;\nNOW, THEREFORE, BE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSection 1. That this Council finds and determines that the area within the Far East CRA is one in which housing facilities or structures of historical significance are located and new housing construction and repair of existing facilities or structures are discouraged. Council also finds and determines that amending the Far East CRA is in the City’s best interest and will incentivize the construction or remodeling of affordable housing within this area designation. Hereafter, the addition of new language to prior legislation is underlined, and deletions are marked as stricken. \n \nSection 2. That Section 2 of Ordinance 1532-2019 is hereby amended as follows:\n \nPursuant to ORC Section 3735.66, The Far East Community Reinvestment Area boundary is hereby established in the following described area:\n \nNorth\nBeginning at the intersection of Refugee Road, Noe Bixby Road and Big Walnut Creek, north of Laraine Court then easterly on Refugee Road to the City of Columbus/Village of Brice boundary.\n \nSouth\nBeginning at the intersection of Refugee Road and Big Walnut Creek at the south side of Nafzger Park, easterly along Refugee Road to Noe Bixby Road. Then north on Noe Bixby Road to the boundary of the City of Columbus and Truro Township. Then following east along the City of Columbus/Truro Township boundary to a point where this boundary extends south. Then south along the City of Columbus and Truro Township boundary until Chatterton Road. Then east on Chatterton Road to Retriever Road. Then south following along Retriever Road and Beagle Boulevard to Deforest Drive. Then west on Deforest Drive until the City of Columbus and Madison Township boundary. Then south along the Columbus and Madison Township boundary until the intersection of Blacklick Creek. Then following Blacklick Creek east from this point to Brice Road.\n \nEast\nBeginning at intersection of Brice Road and Blacklick Creek then north on Brice Road past Chatterton Road, then northwest following the City of Columbus /Village of Brice boundary to Refugee Road.\n \n \n \nWest\nBeginning at the intersection of Refugee Road, Noe Bixby Road and Big Walnut Creek, north of Laraine Court, then south on Refugee Road to Refugee/Chatterton Road. \n \nThe Community Reinvestment Area is approximately depicted as the area on the map marked Exhibit B, attached to this Ordinance; on the list of parcel numbers marked Exhibit C, and by this reference incorporated herein. In the event that an owner of a parcel within the Community Reinvestment Area combines the parcel within the Community Reinvestment Area with adjoining parcel(s) outside the Community Reinvestment Area, the resultant combined parcel shall be deemed to be within the Community Reinvestment Area only if (1) the parcel that was within the Community Reinvestment Area prior to the parcel combination constitutes at least fifty percent of the total parcel area of the combined parcel; (2) the parcels were combined into the parcel number listed in Exhibit C to be included in the Community Reinvestment Area; and (3) the parcel(s) that were combined with the parcel inside of the Community Reinvestment Area are all contiguous with and adjacent to the parcel within the Community Reinvestment Area.\n \nOnly properties consistent with the applicable zoning regulations and variances thereto within the designated Community Reinvestment Area will be eligible for exemptions under this program. For purposes of ORC Sections 3735.65 to 3735.70, rental housing, including without limitation rental housing located in a structure containing multiple residential housing units, is classified as residential.\nSection 3.                     That Section 3 of Ordinance 1532-2019 is hereby amended to read as follows:\n \nA tax exemption on the increase in the assessed valuation resulting from improvements as described herein shall be granted upon proper application by the property owner, filed with the Housing Officer no later than two years after construction completion, and certification thereof by the designated Housing Officer for the following periods:\n \n(a) For remodeling of a dwelling containing not more than two (2) family units, upon which the cost of remodeling is at least two thousand five hundred dollars ($2500) or twenty percent (20%) of the assessed value of the structure, whichever is more;\n \n•                      One hundred percent (100%) for fifteen (15) years in areas designated Ready for \nOpportunity Areas, Ready for Revitalization Areas, and Market Ready Areas.\n \n•                     One hundred percent (100%) for fifteen (15) years for Affordable Housing Units (as \ndefined in Section 4565.02) if the area is designated Ready for Revitalization or Market Ready, revocable upon transfer of title to the dwelling by the first owner following initial occupancy.\n \n(b) For construction of a new dwelling containing not more than three (3) family units:\n \n•                      One hundred percent (100%) for fifteen (15) years in areas designated Ready for \nOpportunity Areas and Ready for Revitalization Areas.\n•                      One hundred percent (100%) for fifteen years for Affordable Housing Units (as defined \nIn Section 4565.02(A) of the City Code) in areas designated Ready for Revitalization Areas or Market Ready Areas, revocable upon transfer of title to the dwelling by the first owner following initial occupancy.\n \n(c) For remodeling of a dwelling or construction of a new dwelling containing four (4) or\nmore family units containing three (3) family units, upon which the cost of remodeling is at least five thousand dollars ($5000) or twenty percent (20%) of the assessed value of the structure, whichever is more:\n \n•                      One hundred percent (100%) for fifteen (15) years in areas designated Ready for \nOpportunity Areas.\n \n•                      One hundred percent (100%) for fifteen (15) years in areas designated Ready for \nOpportunity Areas, Ready for Revitalization Areas and Market Ready Areas, subject to and contingent upon the owner of the dwelling and the City entering into a written agreement as described in City Code Sections 4565.07 or 4565.08, prior to the commencement of construction.\n \nDesignation of the Far East Community Reinvestment Area as a Ready for Opportunity Area, a Ready for Revitalization Area, or a Market Ready Area shall be made by the Development Director pursuant to City Code Section 4565.03.\n \nThe tax exemptions provided for herein shall further be governed by the terms and conditions contained in Chapter 4565 of the Columbus City Codes, including any amendments thereto.\n \nA pre-application may be required to insure the compatibility with neighborhood plans and to insure the maintenance of existing streetscape lines, style, scale setbacks and landscaping features compatible with neighborhood.\n \nTo receive an abatement as provided herein, the applicant for the Development Project must provide documentation that it has received a Certificate of Appropriateness, or other similar approval from the City, ensuring the residential project meets the City subdivision standards for the type of residential project being constructed or remodeled.\n \nThe tax exemption provided hereunder is senior to any tax exemption provided pursuant to ORC Sections 5709.40 or 5709.41.\nSection 4. That transition to the amendments to Section 3 of Ordinance 1532-2019 as provided in Section 3 of this Ordinance shall occur on the following schedule:\nThe Provisions of Section 3 of Ordinance 1532-2019 as it existed prior to the effective date of this Ordinance, shall apply to all projects that have an executed agreement or memorandum approved by City Council prior to the effective date of this ordinance, or that adhere to the following timeline:\na.                       Obtains all necessary building permits on or before August 31, 2023; or has closed on all project construction financing and obtained at least 50% of the project’s building permits by August 31, 2023\nSection 4. That all other provisions of Ordinance 1532-2019 regarding the Far East Community Reinvestment Area remain effective as adopted prior to this ordinance.\nSection 5. That a Community Reinvestment Area Housing Council shall be created, consisting of two members appointed by the Mayor of the City of Columbus, two members appointed by the Council of the City of Columbus and one member appointed by the Planning Commission of Columbus. The majority of those members shall then appoint an additional member who resides within the CRA. Terms of the members of the Council shall be for three years. An unexpired term resulting from a vacancy in the Council shall be filled in the same manner as the initial appointment was made for the remainder of the term of the vacated seat. Pursuant to R.C. 3735.66, Council designates the City’s Development Director as the Housing Officer as defined in R.C. 3735.65(A).\nSection 6. That the Community Reinvestment Area Housing Council shall make an annual inspection of the properties within the district for which an exemption has been granted under R.C. Section 3735.66. This Council shall also hear appeals under R.C. 3735.70. \nSection 7. That upon passage, the Clerk of this Council is directed to forward a copy of this Ordinance to the Franklin County Auditor for information and reference. The Clerk of this Council is further directed to cause notice of the passage of this Ordinance in a newspaper of general circulation in the City once a week for two consecutive weeks immediately following its passage, as required by Section 3735.66 of the Ohio Revised Code.\nSection 8. That, not later than sixty days after passage of this Ordinance, the Director shall petition the State Director of Development Services to confirm the findings described in this Ordinance. The petition shall include all documents and information required by R.C. 3735.66\nSection 9. That this Council further authorizes and directs the Mayor, the Clerk of Council, the Director of Development and/or other appropriate officers of the City, to prepare and sign all agreements and documents and to take any other actions as may be appropriate or necessary to implement this Ordinance.  \nSection 10. That this Ordinance shall take effect and be in force from and after the earliest date allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 54,
    "meeting_date": "2022-07-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Economic Development",
      "Property & Real Estate"
    ]
  }
}