{
  "success": true,
  "vote": {
    "id": 4506,
    "item_number": "SR-57",
    "title": "To amend Sections 371.02 and 371.18 and to enact Section 371.20 of Chapter 371 of the Columbus City Codes in order to amend the distribution schedule of the hotel/motel/short-term rental excise taxes to segregate a portion of the hotel/motel/short-term rental excise taxes generated by the hotel to be constructed at the North Market so that such funds may be used to subsidize affordable workforce housing, pursuant to the Economic Development Agreement dated September 11, 2019, by and between the City, North Market Development Authority, Inc., and NM Developer LLC, as modified by the letter dated August 9, 2021 from the City to NM Developer LLC; to establish two new city funds (North Market Housing Fund and North Market Capital Maintenance Fund) for the deposit of a portion of the hotel/motel/short-term rental excise taxes generated from the hotel to be constructed at the North Market; to authorize the North Market Workforce Housing Agreement between the City and NM Developer LLC; and to authorize the North Market Capital Maintenance Agreement between the City and North Market Development Authority, Inc.",
    "description": "Explanation\nBACKGROUND: City Council passed Ordinance 1993-2019 on July 22, 2019 authorizing the Director of the Department of Development to enter into an Economic Development Agreement by and between the City of Columbus (the “City”), North Market Development Authority, Inc. (“NMDA”), and NM Developer LLC (the “Developer”), dated September 11, 2019, as modified by the letter dated August 9, 2021 from the City to the Developer (as so modified, the “EDA”), concerning the development of a 31-story, mixed-use building on the surface parking lot adjacent to the existing “North Market,” which is owned by the City and located on Franklin County Tax ID Parcel No. 010-054645 (the Nos. 010-054645, 010-307273, 010-307274, 010-307275, 010-307276 (collectively, the “Site”). The mixed-use development will include an expansion of the North Market, a new public atrium and plaza, structured parking, office, residential units, and a hotel (collectively, the “Project”). The Developer has agreed to provide 20% of the residential units as affordable workforce housing on the condition that the City provide financial assistance, which the City intends to fund using a portion of the hotel/motel/short-term rental excise taxes (“Bed Taxes”) that are generated by the hotel located within the mixed-use development (the “North Market Hotel”). Additionally, the City has committed to using the remaining Bed Taxes generated by the North Market Hotel to providing funding to NMDA for the maintenance of the North Market and the cultural enrichment it provides to the community. \n \nThis legislation will amend Chapter 371 of the Columbus City Codes regulating hotel/motel/short-term rental excise taxes to provide that the tax revenues generated from a rate of three and six-tenths percent (3.6%) of the overall five and one-tenths percent (5.1%) hotel/motel/short-term rental excise tax rate applied to the North Market Hotel will be deposited into two new City funds, the North Market Housing Fund and North Market Capital Maintenance Fund, both created by this Ordinance, all in accordance with the EDA. This legislation will also authorize separate housing and capital maintenance agreements between the City and the Developer and the City and NMDA, respectively.\n \nFISCAL IMPACT: No funding is required for this legislation. The City is diverting a portion the hotel/motel/short-term rental excise tax revenue that will be generated by the hotel on the Site, once constructed, to two new city housing and maintenance funds. \n \nTitle\nTo amend Sections 371.02 and 371.18 and to enact Section 371.20 of Chapter 371 of the Columbus City Codes in order to amend the distribution schedule of the hotel/motel/short-term rental excise taxes to segregate a portion of the hotel/motel/short-term rental excise taxes generated by the hotel to be constructed at the North Market so that such funds may be used to subsidize affordable workforce housing, pursuant to the Economic Development Agreement dated September 11, 2019, by and between the City, North Market Development Authority, Inc., and NM Developer LLC, as modified by the letter dated August 9, 2021 from the City to NM Developer LLC; to establish two new city funds (North Market Housing Fund and North Market Capital Maintenance Fund) for the deposit of a portion of the hotel/motel/short-term rental excise taxes generated from the hotel to be constructed at the North Market; to authorize the North Market Workforce Housing Agreement between the City and NM Developer LLC; and to authorize the North Market Capital Maintenance Agreement between the City and North Market Development Authority, Inc.\n \n \nBody\nWHEREAS, City Council passed Ordinance 1993-2019 on July 22, 2019 authorizing the Director of the Department of Development to enter into an Economic Development Agreement dated September 11, 2019, as modified by the letter dated August 9, 2021 from the City to the Developer, (as so modified, the “EDA”) by and between the City, North Market Development Authority, Inc. (“NMDA”), and NM Developer LLC (the “Developer”); and \n \nWHEREAS, the EDA concerns the development of a 31-story, mixed-use building on the surface parking lot adjacent to the existing “North Market” owned by the City and located on Franklin County Tax ID Parcel No. 010-054645 (the Nos. 010-054645, 010-307273, 010-307274, 010-307275, 010-307276 (collectively, the “Site”).\n \nWHEREAS, Chapter 371 of the Columbus City Codes sets forth city law pertaining to the excise taxes applicable to hotels/motels and short-term rental operations; and\n \nWHEREAS, pursuant to the EDA and in compliance with Section 371.02(a) of the Columbus City Codes, the City has agreed to use a portion of the hotel/motel/short-term rental excise taxes generated from the new hotel to be constructed on the Site (the “North Market Hotel”) to provide financial assistance to the Developer to support affordable workforce housing and to NMDA to sustain and expand the cultural enrichment of the community by supporting the capital maintenance of the North Market; and\n \nWHEREAS, the City, in promotion of its efforts to provide affordable housing while encouraging cultural development of the community, finds it necessary to amend Chapter 371 to provide terms pursuant to which the hotel/motel/short term rental excise taxes generated by the North Market Hotel will be reserved for the uses set forth herein, in accordance with the EDA; and\n \nWHEREAS, in order to effectuate the EDA, the City will enter into the North Market Workforce Housing Agreement with the Developer setting forth the parties’ respective commitments concerning the provision of affordable housing within the North Market development and the City’s provision of funding to subsidize such affordable housing (the “Housing Agreement”), and the City will enter into the North Market Capital Maintenance Agreement with NMDA concerning capital maintenance of the North Market (the “Maintenance Agreement”); and\n \nWHEREAS, this Council has determined to establish two new city housing and maintenance funds (the “North Market Housing Fund” and the “North Market Capital Maintenance Fund”) into which there shall be deposited and distributed a portion of the tax receipts from the North Market Hotel after first providing for the required contributions to convention and visitors bureaus operating within the county annually (the “Available Hotel Tax Proceeds”); NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSection 1. Amendment to Chapter 371 of the Columbus City Codes. In accordance with the EDA, defined herein, Sections 371.02 and 371.18 of Chapter 371 of the Columbus City Codes are hereby amended as described on Exhibit A attached hereto, and Section 371.20 as also described on Exhibit A is enacted. \n \nSection 2.  Repeal. That Sections 371.02 and 371.18 in their current form are hereby repealed.  \n \nSection 3. North Market Housing Agreement. That the Director of the Department of Development (the “Director”), or his or her designee, for and in the name of the City, is hereby authorized to execute and deliver the North Market Workforce Housing Agreement (the “Housing Agreement”) with NM Developer LLC (the “Developer”) presently on file with the Director along with any changes or amendments thereto not inconsistent with this Ordinance and not substantially adverse to the City and which shall be approved by the Director and the City Attorney, provided that the approval of such changes and amendments thereto, and the character of those changes and amendments as not being substantially adverse to the City, shall be evidenced conclusively by the Director’s execution and delivery thereof.\n \nSection 4. North Market Capital Maintenance Agreement. That the Director or his or her designee, for and in the name of the City, is hereby authorized to execute and deliver the North Market Capital Maintenance Agreement (the “Maintenance Agreement”) with North Market Development Authority, Inc. (“NMDA”) presently on file with the Director along with any changes or amendments thereto not inconsistent with this Ordinance and not substantially adverse to the City and which shall be approved by the Director and the City Attorney, provided that the approval of such changes and amendments thereto, and the character of those changes and amendments as not being substantially adverse to the City, shall be evidenced conclusively by the Director’s execution and delivery thereof.\n \nSection 5. Subsequent Agreements and Instruments. That the Director or other appropriate officers of the City are authorized to execute and/or acknowledge and agree to such other agreements and instruments, subject to approval by the City Attorney’s Office, and to take all actions as may be necessary to implement this Ordinance and the transactions contemplated by the EDA, the Housing Agreement, and the Maintenance Agreement.\n \nSection 6. North Market Housing Fund and North Market Capital Maintenance Fund. This Council hereby establishes in accordance with the EDA and Chapter 371 of the Columbus City Codes as amended by Exhibit A attached hereto, a city housing fund (the “North Market Housing Fund”) and a city capital maintenance fund (the “North Market Capital Maintenance Fund”) into which there shall be deposited hotel/motel/short-term rental excise taxes collected from the North Market Hotel (as that term is defined in this Ordinance) other than those tax revenues required to be distributed to convention and visitors bureaus operating within the county annually (the “Available Hotel Tax Proceeds”) in accordance with  the Economic Development Agreement dated September 11, 2019, as modified by the letter dated August 9, 2021 from the City to the Developer,  (as so modified, the “EDA”) by and between the City, NMDA, and the Developer, and the Housing Agreement and the Maintenance Agreement, as authorized pursuant to Sections 3 and 4 of this Ordinance. The City Auditor may establish the North Market Housing Fund and North Market Capital Maintenance Fund as new City funds or as new City subfunds within the City’s Excise Tax Fund (2231). Those Available Hotel Tax Proceeds shall be used solely for the purposes authorized by the new Section 371.20, subject to annual appropriation. The North Market Housing Fund shall remain in existence so long as the Available Hotel Tax Proceeds are collected and used for the purposes set forth in the Housing Agreement after which time, the North Market Housing Fund shall be dissolved, and any surplus remaining therein shall be transferred to a fund of the new community authority established by City Council pursuant to the EDA and Chapter 349 of the Ohio Revised Code. The North Market Capital Maintenance Fund shall remain in existence so long as Available Hotel Tax Proceeds are collected and used for the purposes set forth in North Market Capital Maintenance Agreement. after which time, the North Market Capital Maintenance Fund shall be dissolved, and any surplus remaining therein shall be transferred to or within the City’s Excise Tax Fund (2231) or to other City funds, subfunds, or project accounts established for the deposit of the hotel/motel/short-term rental excise taxes, as determined necessary by the City Auditor.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 1,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 54,
    "meeting_date": "2022-07-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "NAY"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Economic Development"
    ]
  }
}