{
  "success": true,
  "vote": {
    "id": 4521,
    "item_number": "CA-3",
    "title": "To levy special assessments for the purpose of acquiring, constructing, and improving certain public improvements constituting special energy improvement projects in the City in cooperation with the Columbus Regional Energy Special Improvement District; and to declare an emergency.",
    "description": "Explanation\n \nBACKGROUND:  The Council of the City of Columbus previously adopted an ordinance (0311-2019) authorizing the Director of the Department of Development to approve petitions submitted by the owners of real property within the City requesting that their property be added to the territory of the Columbus Regional Energy Special Improvement District (the “District”) and plans for public improvements and public services attached to those petitions for and on behalf of the Council. \n \nUnder the authority granted by that ordinance, the Director of the Department of Development has approved eleven petitions for the addition of certain real property to the District and plans for public improvements and public services attached to those petitions for and on behalf of the Council.  Pursuant to those approvals, the real property subject to those petitions has been added to the District.  The petitions approved by the Director of the Department of Development provide that special assessments levied by the Council pursuant to Chapters 727 and 1710 of the Ohio Revised Code be used to pay the costs of “special energy improvement projects,” as that term is defined in Section 1710.01 of the Ohio Revised Code, to be constructed pursuant to the petitions.\n \nThis legislation is to levy such special assessments, all pursuant to Chapters 727 and 1710 of the Ohio Revised Code, and pursuant to the Charter of the City of Columbus.  \n \nEmergency action is requested on this legislation to allow the special assessment process to proceed in a timely manner and allow financing for the special energy improvement projects to be obtained by the District.\n \nFISCAL IMPACT:  No funding is required for this legislation.\n \nTitle\n \nTo levy special assessments for the purpose of acquiring, constructing, and improving certain public improvements constituting special energy improvement projects in the City in cooperation with the Columbus Regional Energy Special Improvement District; and to declare an emergency.\n \nBody\n \nWHEREAS, the Council (the “Council”) of the City of Columbus, Ohio (the “City”) adopted Ordinance 0311-2019 on June 25, 2019 (the “Commercial PACE Ordinance”); and\n \nWHEREAS, under the Commercial PACE Ordinance, the Director of the Department of Development, including any Interim Director of the Department of Development (collectively, the “Development Director”) is authorized, for and on behalf of Council, to receive and approve or disapprove petitions for special energy improvement projects and for special assessments (“Petitions”) and plans or supplemental plans for public improvements or public services (“Supplemental Plans”) submitted by the owners of commercial and industrial real property within the City, subject to the terms and conditions stated in the Commercial PACE Ordinance and the Program Guidelines adopted by the Commercial PACE Ordinance; and\n \nWHEREAS, under the Commercial PACE Ordinance, the Council further approved the Standing Assignment Agreement (the “Standing Assignment Agreement”) by and between Bexley, Columbus, Dublin, Grandview Heights, Grove City, Hilliard, Perry Township, Sharon Township, Upper Arlington, Whitehall, Worthington Energy Special Improvement District, Inc. doing business under the registered trade name Columbus Regional Energy Special Improvement District, Inc. (the “District”) and authorized the Development Director to execute and deliver the Standing Assignment Agreement for and on behalf of the City; and\n \nWHEREAS, the Standing Assignment Agreement was executed by each of the City and the District and became effective on July 24, 2019; and\n \nWHEREAS, under Ohio Revised Code Section 1710.02(F) and under Section 2.2 of the Standing Assignment Agreement, following approval of Petitions and Supplemental Plans by the Development Director, the City shall levy the special assessments described in such Petitions and Supplemental Plans; and \n \nWHEREAS, on July 2, 2021, the Development Director approved a Petition for Special Assessments for Special Energy Improvement Projects and Affidavit and a Columbus Regional Energy Special Improvement District Program Plan-Supplement to Plan for Alvis Project (collectively, “Petition and Supplemental Plan 2021-04”), including the list of maximum special assessments attached to them, a copy of which list of special assessments was attached to Petition and Supplemental Plan 2021-04, and pursuant to Petition and Supplemental Plan 2021-04, the Development Director approved the final list of special assessments, a copy of which is attached to this Ordinance as Exhibit A, on August 13, 2021; and\n \nWHEREAS, on September 10, 2021, the Development Director approved a Petition for Special Assessments for Special Energy Improvement Projects and Affidavit and a Columbus Regional Energy Special Improvement District Program Plan-Supplement to Plan for 5780-5792 N. Hamilton Road, Columbus, Ohio Project (collectively, “Petition and Supplemental Plan 2021-05”), including the list of special assessments attached to them, a copy of which list of special assessments is attached to this Ordinance as Exhibit B; and\n \nWHEREAS, on September 14, 2021, the Development Director approved a Petition for Special Assessments for Special Energy Improvement Projects and Affidavit and a Columbus Regional Energy Special Improvement District Program Plan-Supplement to Plan for 1206 N. Fourth Street, Columbus, Ohio Project (collectively, “Petition and Supplemental Plan 2021-06”), including the list of special assessments attached to them, a copy of which list of special assessments is attached to this Ordinance as Exhibit C; and\n \nWHEREAS, on November 9, 2021, the Development Director approved a Petition for Special Assessments for Special Energy Improvement Projects and Affidavit and a Columbus Regional Energy Special Improvement District Program Plan-Supplement to Plan for 3301 Brice Road, Columbus, Ohio Project (collectively, “Petition and Supplemental Plan 2021-07”), including the list of special assessments attached to them, a copy of which list of special assessments is attached to this Ordinance as Exhibit D; and\n \nWHEREAS, on November 29, 2021, the Development Director approved a Petition for Special Assessments for Special Energy Improvement Projects and Affidavit and a Columbus Regional Energy Special Improvement District Program Plan-Supplement to Plan for 8740 Orion Place, Columbus, Ohio Project (collectively, “Petition and Supplemental Plan 2021-08”), including the list of special assessments attached to them, a copy of which list of special assessments is attached to this Ordinance as Exhibit E; and\n \nWHEREAS, on June 15, 2022, the Development Director approved a Petition for Special Assessments for Special Energy Improvement Projects and Affidavit and a Columbus Regional Energy Special Improvement District Program Plan-Supplement to Plan for 35 N. Fourth Street, Columbus, Ohio Project (collectively, “Petition and Supplemental Plan 2022-01”), including the list of special assessments attached to them, a copy of which list of special assessments is attached to this Ordinance as Exhibit F; and\n \nWHEREAS, on June 15, 2022, the Development Director approved a Petition for Special Assessments for Special Energy Improvement Projects and Affidavit and a Columbus Regional Energy Special Improvement District Program Plan-Supplement to Plan for 150 East Broad Street, Columbus, Ohio Project (collectively, “Petition and Supplemental Plan 2022-02”), including the list of special assessments attached to them, a copy of which list of special assessments is attached to this Ordinance as Exhibit G; and\n \nWHEREAS, on July 14, 2022, the Development Director approved a Petition for Special Assessments for Special Energy Improvement Projects and Affidavit and a Columbus Regional Energy Special Improvement District Program Plan-Supplement to Plan for 77 East Nationwide Boulevard, Columbus, Ohio Project (collectively, “Petition and Supplemental Plan 2022-03”), including the list of special assessments attached to them, a copy of which list of special assessments is attached to this Ordinance as Exhibit H; and\n \nWHEREAS, on October 14, 2021, the Development Director approved an Amendment to Petition for Special Assessments for Special Energy Improvement Projects and Affidavit (the “Amending Petition and Supplemental Plan”), including a list of special assessments, a copy of which list of special assessments is attached to this Ordinance as Exhibit I, requested that the City approve an adjustment to the list of special assessments originally levied by the City by its Ordinance No. 3329-2018 on December 3, 2018; and\n \nWHEREAS, the actual costs of the special energy improvement projects described in Petition and Supplemental Plan 2021-04, Petition and Supplemental Plan 2021-05, Petition and Supplemental Plan 2021-06, Petition and Supplemental Plan 2021-07, Petition and Supplemental Plan 2021-08, Petition and Supplemental Plan 2022-01, Petition and Supplemental Plan 2022-02, Petition and Supplemental Plan 2022-03, and the Amending Petition and Supplemental Plan have been ascertained and have been certified to the City in the respective Petitions and the Supplemental Plans and the Amended Petition and Supplemental Plan for the special energy improvement projects; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is necessary that this Ordinance take effect at the earliest possible date in order to allow the District to take advantage of financing available to it for a limited time and for the immediate preservation of public peace, property, health and safety; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n(See ORD 2372-2022 Attachment)",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 55,
    "meeting_date": "2022-09-12",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services"
    ]
  }
}