{
  "success": true,
  "vote": {
    "id": 4551,
    "item_number": "CA-33",
    "title": "To authorize the Director of Recreation and Parks to modify an existing contract with MKSK for the Parkland Dedication Ordinance Improvements Project; to authorize the appropriation of $11,356.98 within the Recreation and Parks Permanent Improvement Fund; to authorize the transfer of $36,400.00 within the Recreation and Parks Permanent Improvement Fund; to amend the 2022 Capital Improvements Budget Ordinance 1896-2022; to authorize the expenditure of $36,400.00 from the Recreation and Parks Permanent Improvement Fund; and to declare an emergency. ($36,400.00)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Director of the Recreation and Parks Department to modify an existing contract with MKSK for the Parkland Dedication Ordinance Improvements Project. The modification amount being authorized by this ordinance is $36,400.00.\n \nIn 2020, the Recreation and Parks Department contracted with MKSK to perform a citywide analysis and recommendations for updating the City’s Parkland Dedication Ordinance. The purpose of the modification is to provide additional services related to finalizing the update of City Code 3318 (Parkland Dedication Ordinance). The tasks will include obtaining current GIS data relevant to population growth, 10 minute walkshed, and the social vulnerability index. Data on new properties and easements granted since 2018 as well as potential areas of park expansion and access will also be obtained. The additional tasks will also develop a system wide Demographic and Trends Analysis, an important component of the Department’s CAPRA Accreditation application currently underway.\n \nIt is not feasible to solicit for these services as the consultant has prepared all of the existing data and subconsultants involved in finalizing the project. The scope of the modification and the costs for the additional tasks were negotiated and approved by the Strategic Planning Section of the Recreation and Parks Department.\n \nPrincipal Parties: \nMKSK\n462 South Ludlow Alley\nColumbus, Ohio 43215                                                      \nBrian Kinzelman, (614) 621-2796, bkinzelman@mkskstudios.com\nContract Compliance Number, Tax ID: 028341, 83-2731940\nContract Compliance Expiration Date: November 24, 2022                     \n \nEmergency Justification: Emergency action is requested to help the Department meet the goal of CAPRA Accreditation submittal in March of 2023. \n \nBenefits to the Public: Parks and greenways provide significant benefits to Columbus residents. It is a core mission of the City to provide parkland equitably throughout the city and within the 10 minute walk access for nearby residents. Currently only 9% of the land use in Columbus is parkland, well below the recommended national average. Amendments to the Parkland Dedication Ordinance will provide a tool to offset the intensity of development and preserve open space in Columbus.\n \nCommunity Input/Issues: The project has received support from the City at large as residents have expressed strong priority for more parkland, park improvements, and protected environmentally sensitive areas for conservation. Developers have emphasized the need for consistency and equitability in the application of the Parkland Dedication Ordinance.\n \nArea(s) Affected: Citywide (99) \n \nMaster Plan Relation: This project will support the Recreation and Parks Master Plan by conserving, protecting, and enhancing the City’s natural resources, improving the overall environmental health of the City for this and future generations.\n \nFiscal Impact: The expenditure of $ $73,480.00 was legislated for the Parkland Dedication Ordinance Improvements Project by Ordinance 0384-2020. This ordinance will provide funding that will modify the previously authorized amount by $36,400.00. $36,400.00 is budgeted and available in the Recreation and Parks Permanent Improvement Fund 7747 to meet the financial obligations of this contract modification. The aggregate total amount authorized, including this modification, is $109,880.00.   \n \nTitle\n \nTo authorize the Director of Recreation and Parks to modify an existing contract with MKSK for the Parkland Dedication Ordinance Improvements Project; to authorize the appropriation of $11,356.98 within the Recreation and Parks Permanent Improvement Fund; to authorize the transfer of $36,400.00 within the Recreation and Parks Permanent Improvement Fund; to amend the 2022 Capital Improvements Budget Ordinance 1896-2022; to authorize the expenditure of $36,400.00 from the Recreation and Parks Permanent Improvement Fund; and to declare an emergency. ($36,400.00)\n \nBody\n \nWHEREAS, it is necessary to authorize the Director of the Recreation and Parks to modify an existing contract with MKSK for the Parkland Dedication Ordinance Improvements Project; and\n \nWHEREAS, it is necessary to authorize the appropriation of $11,356.98 within the Recreation and Parks Permanent Improvement Fund 7747; and\n \nWHEREAS, it is necessary to authorize the transfer of $36,400.00 within the Recreation and Parks Permanent Improvement Fund 7747; and\n \nWHEREAS, it is necessary to amend the 2022 Capital Improvements Budget Ordinance 1896-2022; and\n \nWHEREAS, it is necessary to authorize the expenditure of $36,400.00 from the Recreation and Parks Permanent Improvement Fund 7747; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Recreation and Parks Department in that it is immediately necessary to authorize the Director to modify this contract to help meet the goal of CAPRA Accreditation submittal in March of 2023, all for the preservation of the public health, peace, property, safety, and welfare and, NOW, THEREFORE \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Recreation and Parks be and is hereby authorized to modify an existing contract with MKSK for the Parkland Dedication Ordinance Improvements Project.\n \nSECTION 2. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 4. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 5. That the appropriation of $11,356.98 is authorized within the Recreation and Parks Permanent Improvement Fund 7747 per the accounting codes in the attachment to this ordinance.  \n \nSECTION 6. That the transfer of $36,400.00 or so much thereof as may be needed, is hereby authorized between projects within the Recreation and Parks Permanent Improvement Fund 7747 per the account codes in the attachment to this ordinance. \n \nSECTION 7. That the 2022 Capital Improvements Budget Ordinance 1896-2022 is hereby amended as follows in order to provide sufficient budget authority for this ordinance and future projects.\nFund / Project / Project Name / Current / Change / Amended\n \nFund 7747; P747999-100000; Unallocated Balance Fund 7747 (Carryover) / $440,253 / $161 / $440,414 (to match cash)\n \nFund 7747; P510043-100000; Parkland Dedication - Downtown (Carryover) / $2,475 / ($25) / $2,450\nFund 7747; P510044-100000; Parkland Dedication - Eastland/Brice (Carryover) / $33,681 / ($337) / $33,344\nFund 7747; P510047-100000; Parkland Dedication - Far North (Carryover) / $1,054,031 / ($10,540) / $1,043,491\nFund 7747; P510048-100000; Parkland Dedication - Far Northwest (Carryover) / $239,851 / ($2,389) / $237,462\nFund 7747; P510049-100000; Parkland Dedication - Far South (Carryover) / $2,175 / ($22) / $2,153\nFund 7747; P510050-100000; Parkland Dedication - Far West (Carryover) / $179,827 / ($1,798) / $178,029\nFund 7747; P510051-100000; Parkland Dedication - Franklinton (Carryover) / $88 / ($1) / $87\nFund 7747; P510052-100000; Parkland Dedication - Greenlawn/Frank Rd (Carryover) / $4,525 / ($45) / $4,480\nFund 7747; P510053-100000; Parkland Dedication - Hayden Run (Carryover) / $308,188 / ($3,082) / $305,106\nFund 7747; P510055-100000; Parkland Dedication - Near East (Carryover) / $104,613 / ($1,046) / $103,567\nFund 7747; P510057-100000; Parkland Dedication - Near South (Carryover) / $3,283 / ($33) / $3,250\nFund 7747; P510058-100000; Parkland Dedication - North Linden (Carryover) / $327 / ($3) / $324\nFund 7747; P510059-100000; Parkland Dedication - Northeast (Carryover) / $957 / ($10) / $947\nFund 7747; P510060-100000; Parkland Dedication - Northland (Carryover) / $24,738 / ($247) / $24,491\nFund 7747; P510061-100000; Parkland Dedication - Northwest (Carryover) / $34,086 / ($341) / $33,745\nFund 7747; P510062-100000; Parkland Dedication - Rickenbacker (Carryover) / $31,283 / ($313) / $30,970\nFund 7747; P510063-100000; Parkland Dedication - Rocky Fork-Blacklick (Carryover) / $531,223 / ($5,312) / $525,911\nFund 7747; P510064-100000; Parkland Dedication - South Linden (Carryover) / $791 / ($8) / $783\nFund 7747; P510065-100000; Parkland Dedication - Southeast (Carryover) / $48,588 / ($486) / $48,102\nFund 7747; P510066-100000; Parkland Dedication - West Olentangy (Carryover) / $77,278 / ($773) / $76,505\nFund 7747; P510067-100000; Parkland Dedication - West Scioto (Carryover) / $183,317 / ($1,833) / $181,484\nFund 7747; P510068-100000; Parkland Dedication - Westland (Carryover) / $459,635 / ($4,596) / $455,039\nFund 7747; P747999-100000; Unallocated Balance Fund 7747 (Carryover) / $440,414 / ($3,161) / $437,253\n \nFund 7747; P517747-100000; Parkland Dedication Ordinance Improvements Plan (Carryover) / $0 / $36,401 / $36,401\n \nSECTION 8. For the purpose stated in Section 1, the expenditure of $36,400.00 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Recreation and Parks Permanent Improvement Fund 7747 in object class 06 Capital Outlay per the accounting codes in the attachments to this ordinance.  \n \nSECTION 9. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 55,
    "meeting_date": "2022-09-12",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}