{
  "success": true,
  "vote": {
    "id": 4666,
    "item_number": "CA-32",
    "title": "To amend the Management Compensation Plan, Ordinance No. 2713-2013, as amended, by amending Section 5(E), Section 12(H), Section 14(I), Section 16(D), Section 16(I), and Section 16(O); and to declare an emergency.",
    "description": "Explanation\n \nThis ordinance amends the Management Compensation Plan, Ordinance No. 2713-2013, as amended, by enacting the classifications of Assistant Director (Lead Policy Advisor) (U) (0079) and Senior Executive Assistant to the City Attorney (U) (1974); repealing the classifications of Deputy Chief of Administration (City Attorney's Office) (U) (1974), Education Director (U) (0135), and Office of Diversity and Inclusion Executive Director (Secretary) (U) (0035) as a result of Civil Service Commission action and to reflect these changes as applicable in the Vacation and Sick Leave sections; by modifying the pay grade of the classification of Chief of Administration to the City Attorney (U); and to add language to the Insurance section regarding the High Deductible Health Plan/Health Savings Account.\n \n \nTitle\n \nTo amend the Management Compensation Plan, Ordinance No. 2713-2013, as amended, by amending Section 5(E), Section 12(H), Section 14(I), Section 16(D), Section 16(I), and Section 16(O); and to declare an emergency.\n \n \nBody\n \nWHEREAS, it is necessary to amend the Management Compensation Plan to enact the classification of Assistant Director (Lead Policy Advisor) (U) (0079) as a result of Civil Service Commission action and assign it to Pay Grade 95 and to add the new class title to Section 12(H) and Section 14(I);                      and\n \nWHEREAS, it is necessary to amend the Management Compensation Plan to enact the classification of Senior Executive Assistant to the City Attorney (U) (1974) as a result of Civil Service Commission action and assign it to Pay Grade 95; and \n \nWHEREAS, it is necessary to amend the Management Compensation Plan to modify the pay grade for the classification of Chief of Administration to the City Attorney (U) and to reassign it to Pay Grade 98; and\n \nWHEREAS, it is necessary to amend the Management Compensation Plan to amend Section 5(E) by repealing the classification of Deputy Chief of Administration (City Attorney's Office) (U) (1974) as a result of Civil Service Commission action; and \n \nWHEREAS, it is necessary to amend the Management Compensation Plan to amend Section 5(E) by repealing the classification of Education Director (U) (0135) as a result of Civil Service Commission action; and \n \nWHEREAS, it is necessary to amend the Management Compensation Plan to amend Section 5(E) by repealing the classification of Office of Diversity and Inclusion Executive Director (Secretary) (U) (0035) as a result of Civil Service Commission action and to remove the class title from Section 12(H)                      and Section 14(I); and \n \nWHEREAS, it is necessary to amend the Management Compensation Plan to amend Section 16(D), Section 16(I), and Section 16(O) in order to add language regarding the High Deductible Health Plan/Health Savings Account.; and\n \nWHEREAS, an emergency exists in the usual daily operation of the City in that it is immediately necessary to amend certain provisions of the Management Compensation Plan, thereby preserving the public peace, property, health, safety, and welfare; Now, Therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSee Attachment",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 56,
    "meeting_date": "2022-09-19",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services"
    ]
  }
}