{
  "success": true,
  "vote": {
    "id": 4760,
    "item_number": "SR-2",
    "title": "To authorize the transfer, appropriation, and expenditure of $681,686.08 in the West Edge TIF Fund (7420), $43,678.26 in the West Edge II TIF Fund (7422), and $274,635.66 from the East Franklinton TIF Fund (7463) as a substitute for $1,000,000 of the $1,500,000 on the Auditor’s Certificate associated with Ordinance 1068-2021 authorized to be disbursed for part of the remainder of the contribution towards the two hundred dedicated public spaces in the Gravity Project 2 structured parking facility in order to preserve the City’s capital improvement budget funding; and to declare an emergency. ($1,000,000.00)",
    "description": "Explanation\n \nBackground: The Gravity Project 2, LLC (together with its affiliates, collectively, the “Developer”) will design and construct the Gravity Phase II urban redevelopment project (“Project”) located between Broad Street, State Street, McDowell Street and the CSX railroad. The City, the Developer, and Columbus Housing Partnership (dba “Homeport”) entered into an Economic Development Agreement dated September 27, 2019 (the “EDA”) to further the Project and McDowell Place, the LIHTC project to be constructed by Homeport. Pursuant to that EDA, the Developer committed to dedicating at least two hundred (200) spaces for public use (the “Dedicated Public Spaces”) of the approximate nine-hundred (900) parking spaces structured parking facility (the “Parking Facility Project”), and the City agreed to a contribution of ten thousand dollars ($10,000) for each of the Dedicated Public Spaces in an amount not to exceed a total contribution of two-million dollars (the “Contribution”). City Council previously passed Ordinance 0911-2020 on May 18, 2020 to authorize the Director of the Department of Development to enter into a Neighborhood Structured Parking Incentive Contribution Agreement (the “Agreement”) with the Developer and to authorize the transfer, appropriation, and expenditure of the first 25% of the Contribution ($500,000) from the West Edge II TIF Fund and the East Franklinton TIF Fund. Following the passage of the 2020 Capital Improvement Budget impacted by the COVID-19 pandemic, City Council passed Ordinance 1068-2021 on May 10, 2021 to authorize the expenditure of the remaining 75% of the Contribution ($1,500,000). In order to provide greater financial flexibility to the City’s capital improvement budget, this legislation will authorize the transfer, appropriation, and expenditure of $1,000,000 collectively in the West Edge I TIF Fund (7420), West Edge II TIF Fund (7422), and the East Franklinton TIF Fund (7463) as a substitution for the $1,000,000 of the funds on the Auditor’s Certificate associated with Ordinance 1068-2021. The City will continue to disburse $500,000 of the funds from the existing Auditor’s Certificate, and then cancel the remaining $1,000,000 balance when appropriate.\n \nEmergency Justification:\nEmergency legislation is necessary to allow for the immediate disbursement from the City to the Developer of the majority of the remaining $1,500,000 of the Contribution pursuant to the Developer’s disbursement request already submitted in accordance with the Agreement for the continued construction of the Dedicated Public Spaces, and to allow $1,000,000 of the capital improvement budget to be reallocated to another project.\n \nFiscal Impact: From the 2020 Capital Improvement Budget and the monies from ACPO006501, the City will contribute $500,000 of the remaining $1,500,000 of the Contribution from the Development Taxable Bonds Fund (7739), and the other $1,000,000 to be cancelled from ACPO006501 will be replaced with cash available in the amounts of $681,686.08 from the West Edge I TIF Fund (7420), $43,678.26 from the West Edge II TIF Fund (7422), and $274,635.66 from the East Franklinton TIF Fund (7463). These funds will be disbursed to the Developer in two disbursements, which 65% of the total Contribution will be made available upon the issuance of the Building Permit, and 10% of the total Contribution will be made available upon issuance of the Certificate of Occupancy, each for the Parking Facility Project.\n \n Title\nTo authorize the transfer, appropriation, and expenditure of $681,686.08 in the West Edge TIF Fund (7420), $43,678.26 in the West Edge II TIF Fund (7422), and $274,635.66 from the East Franklinton TIF Fund (7463) as a substitute for $1,000,000 of the $1,500,000 on the Auditor’s Certificate associated with Ordinance 1068-2021 authorized to be disbursed for part of the remainder of the contribution towards the two hundred dedicated public spaces in the Gravity Project 2 structured parking facility in order to preserve the City’s capital improvement budget funding; and to declare an emergency. ($1,000,000.00)\n \n \nBody\nWHEREAS, The Gravity Project 2, LLC (together with its affiliates, the “Developer”) is developing the real property located between Broad Street, State Street, McDowell Street and the CSX railroad known as the Gravity Phase II (the “Project”); and\n \nWHEREAS, City Council previously passed Ordinance 1732-2019 on July 22, 2019 authorizing an Economic Development Agreement dated September 27, 2019 (the “EDA”) by and among the City, the Developer, and Columbus Housing Partnership (dba “Homeport”) with respect to the Project and McDowell Place, a LIHTC project to be constructed by Homeport; and\n \nWHEREAS, pursuant to the EDA, the Developer agreed to construct the Project’s approximately nine-hundred (900) spaces structured parking facility (the “Parking Facility Project”) comprised of a minimum of two hundred (200) parking spaces dedicated for public use (the “Dedicated Public Spaces”); and\n \nWHEREAS, pursuant to the EDA, the City agreed to make a contribution of ten thousand dollars ($10,000.00) for each of the Dedicated Public Spaces included in the Parking Facility Project in an amount not-to-exceed a total of two-million dollars (the “Contribution”); and\n \nWHEREAS, if Homeport does not obtain a Certificate of Occupancy by the McDowell Place Completion Deadline as described in the EDA, with the City’s assistance, the Developer, or any future purchasers, buyers, transferees, assignees, or successors in interest of the Project, the Project site, or any portion thereof will submit a petition to the City requesting a special assessment on the Project site, excluding the area of the Project site consisting of the Parking Facility Project, to repay the City’s Contribution for the Dedicated Public Spaces; and \n \nWHEREAS, the City’s disbursements of the Contribution is contingent on the Developer dedicating the Dedicated Public Spaces through a recorded Declaration of Public Parking Garage Covenants (first 25% disbursed), the issuance of the Building Permits (next 65%), and the issuance of the Certificate of Occupancy (final 10%); and\n \nWHEREAS, City Council previous passed Ordinance 0911-2020 on May 18, 2020 to authorize the Director of the Department of Development to enter into a Neighborhood Structured Parking Incentive Contribution Agreement (the “Agreement”) with the Developer; and \n \nWHEREAS, Ordinance 0911-2020 also authorized the transfer, appropriation, and expenditure of the first 25% of the Contribution in the amounts of $451,357.55 in the West Edge II TIF Fund (7422) and $48,642.45 in the East Franklinton TIF Fund (7463), which has been already been disbursed to the Developer; and\n \nWHEREAS, due to the COVID-19 pandemic impacting the 2020 Capital Improvement Budget, Ordinance 1068-2021 passed by City Council on May 10, 2021 authorized for expenditure the remaining 75% of the Contribution in the amount of $1,500,000 from the Development Taxable Bonds Fund (7739) to be disbursed pursuant to the Agreement; and\n \nWHEREAS, now in order to provide greater financial flexibility to the City’s capital improvement budget, $1,000,000 of the $1,500,000 on ACPO006501 associated with Ordinance 1068-2021 will be reallocated to another project while the other $500,000 will continue to be disbursed as part of the remaining 75% of the Contribution; and \n \nWHEREAS, in order to substitute $1,000,000 not to be used on ACPO006501, it is necessary to authorize the transfer, appropriation, and expenditure of funds equal to $1,000,000 collectively within the West Edge I TIF Fund (7420), West Edge II TIF Fund (7422) and the East Franklinton TIF Fund (7463) to establish sufficient cash to pay for the other part of the remaining 75% of the Contribution; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to authorize the transfer, appropriation, and expenditure of the funds described herein in order to allow for the disbursement of the majority of the Contribution already requested by the Developer for the construction of the Dedicated Parking Spaces pursuant to the Agreement, and to provide for the reallocation of $1,000,000 of the capital improvement budget for other projects thereby preserving the public health, peace, property, safety and welfare without delay; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the cash transfer of $681,686.08, or so much thereof as may be needed, is hereby authorized within Fund 7420 (West Edge I TIF Fund), from Dept-Div 44-02 (Economic Development), Project P420001-100000 (West Edge I TIF) to Dept-Div 44-02 (Economic Development), Project P440104-100104 (Gravity 2.0 Garage Contribution), per the account codes in the attachment to this ordinance.\n \nSECTION 2. That the cash transfer of $43,678.26, or so much thereof as may be needed, is hereby authorized within Fund 7422 (West Edge II TIF Fund), from Dept-Div 44-02 (Economic Development), Project P422001-100000 (West Edge II TIF) to Dept-Div 44-02 (Economic Development), Project P440104-100104 (Gravity 2.0 Garage Contribution), per the account codes in the attachment to this ordinance.\n \nSECTION 3. That the cash transfer of $274,635.66, or so much thereof as may be needed, is hereby authorized within Fund 7463 (East Franklinton TIF Fund) from Dept-Div 44-02 (Economic Development), Project P463001-100000 (East Franklinton TIF 90-200) to Dept-Div 44-02 (Economic Development), Project P440104-100104 (Gravity 2.0 Garage Contribution), per the account codes in the attachment to this ordinance.\n \nSECTION 4. That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources, and unappropriated for any other purpose, during the fiscal year ending December 31, 2022, the sum of $681,686.08 is appropriated in Fund 7420 (West Edge I TIF Fund), Dept-Div 44-02 (Economic Development), Project P440104-100104 (Gravity 2.0 Garage Contribution), in Object Class 06 (Capital Outlay), per the account codes in the attachment to this ordinance.\n \nSECTION 5. That from the unappropriated monies and from all monies estimated to come into said funds from any and all sources, and unappropriated for any other purpose, during the fiscal year ending December 31, 2022, the sum of $43,678.26 is appropriated in Fund 7422 (West Edge II TIF Fund), Dept-Div 44-02 (Economic Development), Project P440104-100104 (Gravity 2.0 Garage Contribution), in Object Class 06 (Capital Outlay), per the account codes in the attachment to this ordinance.\n \nSECTION 6. That from the unappropriated monies and from all monies estimated to come into said funds from any and all sources, and unappropriated for any other purpose, during the fiscal year ending December 31, 2022, the sum of $274,635.66 is appropriated in Fund 7463 (East Franklinton TIF Fund), Dept-Div 44-02 (Economic Development), Project P440104-100104 (Gravity 2.0 Garage Contribution), in Object Class 06 (Capital Outlay), per the account codes in the attachment to this ordinance.\n \nSECTION 7. That, for the purpose stated herein, the expenditure is hereby authorized for part of the remaining $1,500,000 of the Contribution in the amount of $681,686.08, or so much thereof as may be needed, in the West Edge I TIF Fund (7420), Dept-Div 44-02 (Economic Development), Project P440104-100104 (Gravity 2.0 Garage Contribution), in Object Class 06 (Capital Outlay), per the account codes in the attachment to this ordinance.\n \nSECTION 8. That, for the purpose stated herein, the expenditure is hereby authorized for part of the remaining $1,500,000 of the Contribution in the amount of $43,678.26, or so much thereof as may be needed, in the West Edge II TIF Fund (7422), Dept-Div 44-02 (Economic Development), Project P440104-100104 (Gravity 2.0 Garage Contribution), in Object Class 06 (Capital Outlay), per the account codes in the attachment to this ordinance.\n \nSECTION 9. That, for the purpose stated herein, the expenditure is hereby authorized for part of the remaining $1,500,000 of the Contribution in the amount of $274,635.66, or so much thereof as may be needed, in the East Franklinton TIF Fund (7463), Dept-Div 44-02 (Economic Development), Project P440104-100104 (Gravity 2.0 Garage Contribution), in Object Class 06 (Capital Outlay), per the account codes in the attachment to this ordinance.\n \nSECTION 10. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 11.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 12.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 13. This ordinance is hereby declared to be an emergency measure and shall take effect and be in full force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 57,
    "meeting_date": "2022-10-03",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Economic Development",
      "Emergency Services"
    ]
  }
}