{
  "success": true,
  "vote": {
    "id": 4771,
    "item_number": "SR-13",
    "title": "To authorize the City Auditor to transfer $80,300.00 within the General Fund; to authorize the expenditure of $80,300.00 from the General Fund; to authorize the Director of Public Safety, on the behalf of the Division of Fire, to modify and extend the current contract with and issue a purchase order to ESO Solutions for Fire Incident Reporting software integration and licensing; to waive the competitive bidding provisions of the Columbus City Codes, Chapter 329; and to declare an emergency. ($80,300.00)",
    "description": "Explanation\nBackground:  This ordinance authorizes the City Auditor to transfer funds within the Division of Fire’s general fund budget, and also authorizes the Director of Public Safety, on behalf of the Division of Fire, to modify and extend the term of the current contract with and issue a purchase order to ESO Solutions for software integration and licensing.  The current contract provides Fire Incident Reporting via ESO's cloud-based Firehouse software for the period covering December 1, 2021 through November 30, 2022 in the amount of $21,132.00.  The Firehouse software platform will be phased out by ESO not later than year end 2022, and replaced with a new version for Fire Incident reporting, which requires an additional year to be added to the contract, and additional funding in the amount of $80,300.00 which includes the import and integration of the existing data and cloud-based licensing.  A waiver of the competitive bidding provisions of the Columbus City Code, Chapter 329 is necessary for this purchase as there is not enough time to solicit a formal bid request prior to the termination of the existing software.  \n \nContract Compliance: ESO Solutions (#36-4566209) - (Vendor #023932)\n \nEmergency Designation:  This legislation is to be declared an emergency measure to allow for the immediate purchase of this software replacement prior to the termination of the existing platform which will be phased out by the end of 2022.\n \nFiscal Impact:  This ordinance authorizes the transfer and expenditure of $80,300.00 within and from the General Fund for this expenditure.  A total of  $21,132.00 has been spent thus far in 2022 for Fire Incident Reporting software services with ESO Solutions; this modification will bring the year's total spent for these software services to $101,432.00.  In 2021 and 2020, the Fire Division spent $21,132.00 for these services in both years.\n \nTitle\nTo authorize the City Auditor to transfer $80,300.00 within the General Fund; to authorize the expenditure of $80,300.00 from the General Fund; to authorize the Director of Public Safety, on the behalf of the Division of Fire, to modify and extend the current contract with and issue a purchase order to ESO Solutions for Fire Incident Reporting software integration and licensing; to waive the competitive bidding provisions of the Columbus City Codes, Chapter 329; and to declare an emergency. ($80,300.00)\n \nBody\n \nWHEREAS, this ordinance authorizes the expenditure necessary to modify and extend the current contract with ESO for continued NFIRS Fire Incident Reporting software management; and,  \n \nWHEREAS, the existing ESO Firehouse software platform will be phased out by year end and replaced with a new version for Fire Incident reporting, requiring an additional year be added to the contract, and additional funding in the amount of $80,300.00 to successfully import and integrate the existing data into the new platform; and,\n \nWHEREAS, it is necessary to transfer funds within the General Fund in order to fund this purchase; and,\n \nWHEREAS, it is necessary to waive the competitive bidding provisions of the Columbus City Codes, Chapter 329; and,\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Safety, Division of Fire, in that it is immediately necessary to authorize the Director of Public Safety to modify and extend the current contract with and issue a purchase order to ESO Solutions to purchase the aforementioned replacement software integration and licensing for the City of Columbus Fire Division prior to the termination of the existing platform which will be phased out by the end of 2022, for the immediate preservation of the public health, peace, property, safety, and welfare; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1:  That the City Auditor is hereby authorized to transfer $80,300.00, or so much thereof as may be needed, within the Division of Fire’s general operating fund budget, per the account codes in the attachment to this ordinance.\n \nSECTION 2.  That the Director of Public Safety is hereby authorized to modify and extend the current contract with and issue a purchase order to ESO Solutions in the amount of $80,300.00, or so much thereof as may be necessary for the purchase of Fire Incident Reporting software integration and licensing on behalf of the Columbus Division of Fire.\n \nSECTION 3.  That this Council finds it is in the best interest of the City of Columbus to waive the competitive bidding equipment provisions of the Columbus City Code, Chapter 329, relating to the aforementioned purchase.\n \nSECTION 4.  That the expenditure of $80,300.00, or so much thereof as may be necessary for the aforementioned purchase, be and is hereby authorized from the General Fund, per the accounting codes in the attachment to this ordinance.\n \nSECTION 5.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 7.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten (10) days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 57,
    "meeting_date": "2022-10-03",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}