{
  "success": true,
  "vote": {
    "id": 4773,
    "item_number": "0",
    "title": "To amend the 2022 Capital Improvement Budget; to authorize the City Auditor to transfer cash and appropriation between projects within the Development Taxable Bonds Fund; to authorize the Director of Public Service to  modify a Construction Guaranteed Maximum Reimbursement Agreement with Campus Partners for Community Urban Redevelopment, Inc., relative to the Arterial Street Rehabilitation - 15th and High Phase 2 project; and to authorize the expenditure of up to $2,396,201.00 from the Development Taxable Bonds Fund. ($2,396,201.00).",
    "description": "Explanation \n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Service to  modify a Construction Guaranteed Maximum Reimbursement Agreement with Campus Partners for Community Urban Redevelopment, Inc. (the “Developer”) relative to the Arterial Street Rehabilitation - 15th and High Phase 2 project (the “Project”), which is being constructed in conjunction with the Developer’s 15th+High development (“15th+High”). As part of a public-private partnership (3P) between the City and the Developer, the City is supporting the Project with funding from the Capital Improvement Budget and from Tax Increment Financing (“TIF”). The Director of the Department of Public Service and the Developer entered into a Construction Guaranteed Maximum Reimbursement Agreement effective September 14, 2021 (the “Agreement”) in the amount of $1 million under the authority of Ordinance No. 1033-2021.  The Agreement contemplated that the Department of Development would request funding through the 2022 Capital Improvement Budget to contribute an additional $1 million to the Project (the “Phase 2 Additional Contribution”).\n \nThe City established the “University TIF” pursuant to Ordinance No. 2888-2014 and entered into a Tax Increment Financing Agreement with the Developer on September 15, 2016 (the “TIF Agreement”) under the authority of Ordinance No. 0644-2016 to provide revenue generated from service payments in lieu of taxes (the Service Payments”) collected from parcels within the University TIF area to pay for certain public infrastructure improvements associated with 15th+High including the Project.  In 2015, City Council approved Ordinance No. 0643-2015 to expand the Weinland Park Community Reinvestment Area (the “CRA”), the boundaries of which initially overlapped with the University TIF area but were subsequently adjusted to remove the University TIF area from the CRA pursuant to Ordinance No. 2196-2018.  During the period in which the CRA and University TIF boundaries overlapped, certain parcels within the University TIF were provided with a superior CRA exemption to the one provided by the University TIF exemption. The result was that certain years’ Service Payments from those parcels that would have been available to fund the Project would no longer be available to be paid under the TIF Agreement (the “Impacted Service Payments”).\n \nOrdinance No. 2067-2021, passed by City Council on July 26, 2021, authorized the Director of Development to execute a Memorandum of Understanding with the Developer through which the Department of Development would request funding in the amount of $1,396,201.00 (the “Lump Sum Service Payment Amount”) through the 2022 Capital Improvement Budget to compensate the Developer for the Impacted Service Payments. This legislation will amend the 2022 Capital Improvement Budget and allow the Director of Public Service to modify the Agreement to authorize the encumbrance and expenditure of $2,396,201.00, which reflects the sum of the Phase 2 Additional Contribution plus the Lump Sum Service Payment Amount, thereby increasing the total reimbursement amount to $3,396,201.00.\n \n2.  CONTRACT COMPLIANCE INFORMATION\nThe contract compliance number for Campus Partners for Community Urban Redevelopment, Inc., is CC-005343, which expires December 21, 2023.\n \n3.  FISCAL IMPACT\nFunding in the amount of $2,396,201.00 is available for this Project in the Department of Development Taxable Bonds Fund (7739).  An amendment to the 2022 Capital Improvement Budget is necessary for the purpose of providing sufficient spending authority for the aforementioned project expenditure.  It is necessary to transfer funds within the Development Taxable Bonds Fund to align cash with the proper project.  Funds are appropriated.\n \n4.  MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThe purpose of this expenditure is to reimburse the Developer for eligible construction costs incurred during the completion of the Project and as such does not constitute an expenditure to which requirements of the Minority and Woman Owned Business Enterprise & Small Local Business Enterprise Program would apply. \n \nTitle\nTo amend the 2022 Capital Improvement Budget; to authorize the City Auditor to transfer cash and appropriation between projects within the Development Taxable Bonds Fund; to authorize the Director of Public Service to  modify a Construction Guaranteed Maximum Reimbursement Agreement with Campus Partners for Community Urban Redevelopment, Inc., relative to the Arterial Street Rehabilitation - 15th and High Phase 2 project; and to authorize the expenditure of up to $2,396,201.00 from the Development Taxable Bonds Fund. ($2,396,201.00).\n \nBody\nWHEREAS, Campus Partners for Community Urban Redevelopment, Inc. (the “Developer”) is undertaking the Arterial Street Rehabilitation - 15th and High Phase 2 capital improvement project (the “Project”) in conjunction with its 15th+High mixed-use development (“15th+High”); and\n \nWHEREAS, as part of a public-private partnership (3P) between the City and the Developer, the City is supporting the Project with funding from the Capital Improvement Budget and from Tax Increment Financing (“TIF”); and\n \nWHEREAS, the Director of Public Service and the Developer entered into a Construction Guaranteed Maximum Reimbursement Agreement effective September 14, 2021 (the “Agreement”) in the amount of $1 million under the authority of Ordinance No. 1033-2021; and\n \nWHEREAS, the Agreement contemplated that the Department of Development would request funding through the 2022 Capital Improvement Budget to contribute an additional $1 million to the Project (the “Phase 2 Additional Contribution”); and\n \nWHEREAS, the City established the “University TIF” pursuant to Ordinance No. 2888-2014 and entered into a Tax Increment Financing Agreement with the Developer on September 15, 2016 (the “TIF Agreement”) under the authority of Ordinance No. 0644-2016; and\n \nWHEREAS, the Agreement provided that revenue generated from service payments in lieu of taxes (the Service Payments”) collected from parcels within the University TIF area may be used to pay for certain public infrastructure improvements like the Project associated with 15th+High; and\n \nWHEREAS, City Council approved Ordinance No. 0643-2015 to expand the Weinland Park Community Reinvestment Area (the “CRA”), the boundaries of which initially overlapped with the University TIF area but were subsequently adjusted to remove the University TIF area from the CRA as part of Ordinance No. 2196-2018; and\n \nWHEREAS, during the period of time in which the boundaries of the CRA overlapped with the University TIF, certain parcels within the TIF were provided with a superior CRA exemption to the one provided by the University TIF exemption resulting in an anticipated shortfall in available TIF revenues due to certain years’ Service Payments from those parcels being unavailable to fund public infrastructure improvements like the Project under the TIF Agreement (the “Impacted Service Payments”); and\n \nWHEREAS, Ordinance No. 2067-2021, passed by City Council on July 26, 2021, authorized the Director of the Department of Development to execute a Memorandum of Understanding with the Developer through which the Department of Development would request funding in the amount of $1,396,201.00 (the “Lump Sum Service Payment Amount”) through the 2022 Capital Improvement Budget to compensate the Developer for the Impacted Service Payments; and\n \nWHEREAS, it is the intent of the City to use the sum of the Phase 2 Additional Contribution plus the Lump Sum Service Payment Amount to add $2,396,201.00 to the Agreement amount for the Project; and\n \nWHEREAS, it is necessary to authorize the Director of Public Service to modify the Agreement for that purpose relative to the construction of the Project; and\n \nWHEREAS, it is necessary to authorize an amendment to the 2022 Capital Improvement Budget for the purpose of providing sufficient spending authority for the aforementioned project expenditure; and\n \nWHEREAS, it is necessary to transfer cash and appropriation within the Department of Development Taxable Bonds Fund (7739) to establish funding within the correct project; and\n \nWHEREAS, the requirements of the City's Minority and Woman Owned Business Enterprise & Small Local Business Enterprise Program do not apply to this expenditure; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2022 Capital Improvement Budget authorized by Ordinance 1896-2022 be and is hereby amended to provide sufficient budget authority for the appropriate projects authorized within this ordinance as follows:\n \nFund / Project / Project Name / Current C.I.B. / Amendment Amount / C.I.B. as Amended\n7739 / P590427-100000 / OSU Economic Development Agreement (Unvoted Carryover) / $4,000,000.00 / $2,396,201.00 / $1,603,799.00\n \n7739 / P530103-100072 / Arterial Street Rehabilitation - 15th and High Phase 2 (Unvoted Carryover) / $0.00 / $2,396,201.00 / $2,396,201.00\n \nSECTION 2.  That the transfer of $2,396,201.00, or so much thereof as may be needed, is hereby authorized between projects within Fund 7739 (Development Taxable Bonds Fund), from Dept-Div 44-02 (Division of Economic Development), Project 590427-100000 (OSU Economic Development Agreement), to Dept-Div 59-12 (Division of Design and Construction), Project P530103-100072 (Arterial Street Rehabilitation - 15th and High Phase 2), Object Class 06 (Capital Outlay), per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That the Director of  Public Service be and is hereby authorized to modify the Construction Guaranteed Maximum Reimbursement Agreement with Campus Partners for Community Urban Redevelopment, Inc., located at 2003 Milliken Road, Columbus, Ohio 43215, relative to the construction of public infrastructure improvements in connection with the Arterial Street Rehabilitation - 15th and High Phase 2 project.\n \nSECTION 4.  That the expenditure of 2,396,201.00, or so much thereof as may be needed, is hereby authorized in Fund 7739 (Development Taxable Bonds Fund), Dept-Div 59-12 (Division of Design and Construction), Project P530103-100072 (Arterial Street Rehabilitation - 15th and High Phase 2) in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 5.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 7.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 8.  That this ordinance shall take effect and be in full force and effect from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 5,
    "noes": 0,
    "abstain": 2,
    "absent": 0,
    "meeting_id": 58,
    "meeting_date": "2022-10-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "ABSTAIN"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSTAIN"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Public Works"
    ]
  }
}