{
  "success": true,
  "vote": {
    "id": 4786,
    "item_number": "CA-7",
    "title": "To authorize the Director of Development to modify a contract with TOP5IVE Photography, LLC, in an amount up to $400.00; and to authorize the expenditure of up to $400.00 from the general fund. ($400.00).",
    "description": "Explanation\nThis legislation authorizes the Director of the Department of Development to modify (Modification No. 1) a contract with TOP5IVE Photography, LLC. for additional photography services.  \n \nOriginal contract amount                     $    825.00                     PO322034\nModification No. 1 amount                     $    400.00\nTotal contract amount                                          $ 1,225.00\n \n \nFISCAL IMPACT:  Funding is available in the Administrative Division’s General Fund budget (1000).\n \nCONTRACT COMPLIANCE:  The vendor number is 041354 and expires 3/24/2024.\n \n \nTitle\nTo authorize the Director of Development to modify a contract with TOP5IVE Photography, LLC, in an amount up to $400.00; and to authorize the expenditure of up to $400.00 from the general fund. ($400.00).\n \n \nBody\nWHEREAS, the Director of Development has identified the need to modify a contract with TOP5IVE Photography, LLC, for additional photography services in an amount up to $400.00; and\n \nWHEREAS, it has become necessary in the usual daily operations of the Department of Development to authorize the Director to appropriate and expend these funds, all for the preservation of the public health, peace, property, safety, and welfare and; NOW THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Development be and is hereby authorized to modify a contract with TOP5IVE Photography, LLC, in an amount up to $400.00.\n \nSECTION 2.  That the expenditure of $400.00 or so much thereof as may be needed, is hereby authorized in Fund 1000 (General Fund), Dept-Div 44-01 (Administrative Division), object class 03 (Services) per the account codes in the attachment to this ordinance.\nSECTION 3.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this Ordinance and the City Auditor shall establish such accounting codes as necessary.\nSECTION 4.  This modification is made in accordance with the relevant provisions of the City Code Charter 329 relating to contract modifications. \n \nSECTION 5.  That the City Auditor is authorized to establish such accounting codes as necessary, to make any accounting changes to revise the funding source for all agreements, contracts, or modifications associated with this Ordinance.\n \nSECTION 6.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 58,
    "meeting_date": "2022-10-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements"
    ]
  }
}