{
  "success": true,
  "vote": {
    "id": 4794,
    "item_number": "CA-15",
    "title": "To amend the 2022 Capital Improvement Budget; to authorize the Director of Public Service to pay utility relocation costs to various utilities for the Roadway Improvements - Creative Campus Phase 2 project; to authorize the expenditure of up to $681,040.81 for utility relocations for this project from the Streets & Highways Bond Fund; and to declare an emergency.  ($681,040.81)",
    "description": "Explanation\n1.  BACKGROUND:\nThis ordinance authorizes payment for utility relocation work for the Roadway Improvements - Creative Campus Phase 2 project by American Electric Power, Crown Castle, and other utilities, or companies contracted by the utility companies to perform utility relocation work as necessary, in an amount up to $681,040.81.\n \nThe Public Service Department is engaged in the Roadway Improvements - Creative Campus Phase 2 project.  Project work includes transforming Cleveland Avenue, from north of Mt. Vernon Avenue to south of Long Street, from four lanes to three lanes, including a center turn lane.  The project will also construct wider sidewalks and safer crosswalks, underground existing overhead utilities, plant new street trees, and establish on-street parking to complement Creative Campus neighborhood improvement efforts.  \n \nIn the course of effecting roadway improvements it is sometimes necessary to force the relocation of utilities from privately held easements or place overhead utilities underground to promote the public health, safety and welfare, including the economic development of the City.  It is necessary to move utilities to complete this project. \n \nOrdinance 0894-2019, passed by Council on April 8, 2019, authorized initial funding for utility relocation for this project in the amount of $830,233.00. Ordinance 1339-2020, passed by Council on June 6, 2020, authorized additional funding for this project in the amount of $1,700,000.00.  It is now necessary that the Public Service Department expend an additional $681,040.81 in order to pay for costs relative to the utility relocation necessary to the Roadway Improvements - Creative Campus Phase 2 project.\nThe funding request for utilities relocation reimbursement is based upon estimates from the utility companies involved.  The utility companies will invoice the City for actual costs incurred in relocating their utilities.  It may be necessary to request additional funding to relocate these utilities if the utility company estimates were low.  Additional utility relocations may also be necessary to complete the project.  If so, an ordinance requesting Council’s approval to expend additional funds will be submitted.     \n2.  FISCAL IMPACT:\nFunding is available and appropriated within Fund 7704, the Streets and Highways Bond Fund.  An amendment to the 2022 Capital Improvements Budget is necessary to align funding for these project expenditures.  \n \n3.  EMERGENCY DESIGNATION\nPublic Service is requesting emergency designation so as to provide funding for utility reimbursements at the earliest possible time to maintain the project construction schedule.\n \nTitle\nTo amend the 2022 Capital Improvement Budget; to authorize the Director of Public Service to pay utility relocation costs to various utilities for the Roadway Improvements - Creative Campus Phase 2 project; to authorize the expenditure of up to $681,040.81 for utility relocations for this project from the Streets & Highways Bond Fund; and to declare an emergency.  ($681,040.81)\n \nBody\nWHEREAS, the Department of Public Service is engaged in the Roadway Improvements - Creative Campus Phase 2 project; and\n \nWHEREAS, project work includes transforming Cleveland Avenue from Mt. Vernon Avenue to Long Street from four lanes to three lanes, including a center turn lane.  The project will also construct wider sidewalks and safer crosswalks, underground existing overhead utilities, plant new street trees, and establish on-street parking to complement Creative Campus neighborhood improvement efforts; and  \n \nWHEREAS, the City of Columbus is concerned with the use of the various rights-of-way areas in the City as such rights-of-way areas represent a valuable and limited resource that must be utilized to promote the public health, safety and welfare, including the economic development of the City; and\n \nWHEREAS, utilities within the public right-of-way are required to be relocated as part of this project; and\n \nWHEREAS, utility relocations must be completed before project construction can begin; and\n \nWHEREAS, initial utility relocation funding for this project, in the amount of $830,233.00, was authorized pursuant to Ordinance No. 0894-2019, passed by Council on April 8, 2019; and\n \nWHEREAS, additional acquisition funding for this project, in the amount of $1,700,000.00, was authorized pursuant to Ordinance No. 1339-2020, passed by Council on June 6, 2020; and\n \nWHEREAS, the Department of Public Service requires funding to be available for utility relocation expenses for the Roadway Improvements - Creative Campus Phase 2 project; and \n \nWHEREAS, this ordinance authorizes funding in the amount of $681,040.81 for that purpose; and\n \nWHEREAS, an amendment to the 2022 amendment to the 2022 Capital Improvements Budget is necessary to align funding for these project expenditures; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to authorize payment for utility relocation expenses at the earliest possible time to prevent construction delays, thereby preserving the public health, peace, property, safety and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2022 Capital Improvements Budget authorized by Ordinance 1896-2022 be amended to establish sufficient authority for this project:\n \nFund / Project / Project Name / C.I.B. / Change / C.I.B. as Amended\n7704 / P440104-100030 / Misc. Economic Development - West Franklinton - Cover My Meds (Voted Carryover) / $805,000.00 / ($681,041.00) / $123,959.00\n \n7704 / P440104-100027 / Roadway Improvements - Creative Campus Phase 2 (Voted Carryover) / $0.00 / $681,041.00 / $681,041.00\n \nSECTION 2.  That the Director of Public Service be and hereby is authorized to reimburse utilities for utility relocation costs for the Roadway Improvements - Creative Campus Phase 2 project by American Electric Power and Crown Castle, and other utilities as needed, and companies the utilities may subcontract to perform utility relocation work for the project.\n \nSECTION 3.  That the expenditure of $681,040.81, or so much thereof as may be needed, is hereby authorized in Fund 7704 (Streets and Highways Bond Fund), in Dept-Div 5912 (Division of Design and Construction), Project P440104-100027 (Miscellaneous Economic Development - Creative Campus Phase 2), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 7.  For the reasons stated in this ordinance's preamble, which are made a part of this ordinance, this ordinance is declared to be an emergency measure and is effective and in force from and after its passage and approval by the Mayor or ten days after its passage if the Mayor neither approves nor vetoes this ordinance.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 1,
    "absent": 0,
    "meeting_id": 58,
    "meeting_date": "2022-10-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "ABSTAIN"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services",
      "Infrastructure"
    ]
  }
}