{
  "success": true,
  "vote": {
    "id": 482,
    "item_number": "CA-33",
    "title": "To authorize the Director of Public Service to modify a professional services contract with DLZ Ohio for the Arterial Street Rehabilitation - SR161 - I71 to Cleveland Avenue Phase I project; to authorize the expenditure of up to $750,000.00 from the Streets and Highways Bond Fund to pay for the modification; and to declare an emergency.  ($750,000.00)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Service to modify a professional services contract with DLZ Ohio, Inc. to add funds in the amount of up to $750,000.00 for the detail design of the Arterial Street Rehabilitation - SR161 - I71 to Cleveland Avenue Phase I project.\n \nOrdinance 0654-2019 authorized the Director of Public Service to enter into a professional services contract with DLZ Ohio, Inc. for the Arterial Street Rehabilitation - SR161 - I71 to Cleveland Avenue Phase I project. This contract is for the preparation of preliminary engineering documents and detailed design plans for the first of multiple phases targeted to improve safety and increase multi-modal access throughout the State Route 161 (SR161) corridor between I71 and Cleveland Avenue.  This first phase will provide Improvements to SR161 from Maple Canyon Avenue to Cleveland Avenue.  Side streets including Maple Canyon Avenue and Parkville Street/Spring Run Drive will be improved north and south of SR161.  Improvements are to include the addition of pedestrian and bike facilities, new traffic signals, pavement widening and resurfacing, raised medians on the side streets, and the installation of mini-roundabouts on the side streets.  The $250,000.00 approved by 0654-2019 was to fund preliminary engineering.\n \nOrdinance 1089-2020 authorized the Director of Public Service to modify the contract in the amount of $550,000.00 to fund the start of detailed design plans, with another modification planned to add the funds needed to completed detailed design when additional funding was available.  \n \nOrdinance 1695-2020 authorized the Director of Public Service to modify the contract in the amount of $200,000.00 to fund the second part of detailed design plans, with another modification planned to add the funds needed to completed detailed design when additional funding was available.  \n \nThis ordinance authorizes the Director of Public Service to modify the contract in the amount of $750,000.00 to complete detailed design for the first phase of the project.  \n \nThe original contract amount:                                                                             $250,000.00     (PO163989, Ord. 0654-2019)                          \nThe total of Modification No. 1:                                                                      $550,000.00     (PO227075, Ord. 1089-2020)\nThe total of Modification No. 2:                                                                      $200,000.00     (PO245129, Ord. 1695-2020)\nThe total of Modification No. 3:                                                                                    $750,000.00     (This ordinance)\n \nThe contract amount including all modifications:                             $1,750,000.00  \n \nSearches in the System for Award Management (Federal) and the Findings for Recovery list (State) produced no findings against DLZ Ohio.\n \n2.  CONTRACT COMPLIANCE\nThe contract compliance number for DLZ Ohio, Inc. is CC004939 and expires 12/03/2022.\n \n3.  FISCAL IMPACT\nFunding in the amount of $750,000.00 is available and appropriated within the Streets and Highways Bond Fund, Fund 7704.  \n \n4.  EMERGENCY DESIGNATION\nEmergency action is requested to prevent unnecessary delays in the completion of the final design phase of the project.                     \n \nTitle\nTo authorize the Director of Public Service to modify a professional services contract with DLZ Ohio for the Arterial Street Rehabilitation - SR161 - I71 to Cleveland Avenue Phase I project; to authorize the expenditure of up to $750,000.00 from the Streets and Highways Bond Fund to pay for the modification; and to declare an emergency.  ($750,000.00) \n \nBody\nWHEREAS, contract PO163989 with DLZ Ohio, Inc. in the amount of $250,000.00 was authorized by ordinance 0654-2019 for preliminary design of the Arterial Street Rehabilitation - SR161 - I71 to Cleveland Avenue Phase I project; and\n \nWHEREAS, a contract modification in the amount of $550,000.00 was authorized by ordinance 1089-2020 to begin detailed design of the project; and \n \nWHEREAS, a second contract modification in the amount of $200,000.00 was authorized by ordinance 1695-2020 to continue detailed design of the project; and \n \nWHEREAS, it has become necessary to modify the contract in an amount up to $750,000.00 to fund the completion of detailed design for the project; and\n \nWHEREAS, a contract modification will need to be executed with DLZ Ohio, Inc. to finish design of the project; and\n \nWHEREAS, funds will need to be expended to pay for the work performed as part of the contract modification; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to enter into a contract modification with DLZ Ohio to prevent unnecessary delays in the completion of the final design phase of the project, thereby preserving the public health, peace, property, safety, and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n                     \nSECTION 1.  That the Director of Public Service be, and hereby is, authorized to modify the professional services contract with DLZ Ohio, Inc., 6121 Huntley Road, Columbus, Ohio, 43229, for the Arterial Street Rehabilitation - SR161 - I71 to Cleveland Avenue Phase I project in the amount of $750,000.00, or so much thereof as may be needed, in accordance with the plans and specifications on file in the Department of Public Service, which are hereby approved.\n \nSECTION 2.  That the expenditure of $750,000.00, or so much thereof as may be needed, is hereby authorized in Fund 7704 (Streets and Highways Bond Fund), Dept-Div 5912 (Design and Construction), Project P530103-100065 (Arterial Street Rehabilitation - SR161 - I71 to Cleveland Avenue Phase I), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 4.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 5.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 8,
    "meeting_date": "2021-03-22",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}