{
  "success": true,
  "vote": {
    "id": 4836,
    "item_number": "SR-13",
    "title": "To authorize the City Attorney to file complaints in order to immediately appropriate and accept the remaining fee simple and lesser real estate necessary to timely complete the Blueprint Miller Kelton Bedford Project; to authorize an expenditure of $12,775.00 from existing ACDI001666-10. ($12,775.00)",
    "description": "EXPLANATION\n \nBACKGROUND: The City’s Department of Public Utilities (“DPU”) is performing the Blueprint Miller Kelton Bedford Project (CIP 650870-101201, CIP 650870-162001, & 690236-100120) (“Public Project”). The City must acquire certain fee simple title and lesser real estate located in the vicinity of Miller Avenue, Kelton Avenue, Newton Street, and Bedford Avenue (collectively, “Real Estate”) in order for DPU to timely complete the Public Project. The City passed Ordinance Number 2759-2020 authorizing the City Attorney to acquire the Real Estate. Furthermore, the City also adopted Resolution 0062X-2022 establishing the City’s intent to appropriate the Real Estate. The City’s acquisition of the Real Estate will help make, improve, or repair certain portions of the public sewer infrastructure of Miller Avenue, Kelton Avenue, Newton Street, and Bedford Avenue.\n                     \nThe City Attorney, pursuant to Columbus City Code, Section 909.03, served notice to all of the owners of the Real Estate of the (i) Public Project’s public purpose and necessity, and (ii) adoption of Resolution 0062X-2022. However, the City Attorney was unable to either locate some of the Real Estate’s owner(s) or agree with some of the Real Estate’s owner(s) in good faith regarding the amount of just compensation.\n \nCONTRACT COMPLIANCE:  Not applicable.\n \nFISCAL IMPACT: Funding to acquire the Real Estate is available through the Sanitary GO Bonds Fund 6109, Fund Number 6109 pursuant to existing Auditor’s Certificate ACDI001666-10.\n \nEMERGENCY JUSTIFICATION:  Not applicable.\n \nTITLE\n \nTo authorize the City Attorney to file complaints in order to immediately appropriate and accept the remaining fee simple and lesser real estate necessary to timely complete the Blueprint Miller Kelton Bedford Project; to authorize an expenditure of $12,775.00 from existing ACDI001666-10. ($12,775.00)\n \nBODY\n \nWHEREAS, the City intends to make, improve, or repair certain public sewer infrastructure by completing the Blueprint Miller Kelton Bedford Project (CIP 650870-101201, CIP 650870-162001, & 690236-100120) (“Public Project”); and\n                     \nWHEREAS, the City intends for the City Attorney to acquire the necessary fee simple title and lesser real estate located in the vicinity of Miller Avenue, Kelton Avenue, Newton Street, and Bedford Avenue; and\n \nWHEREAS, the City, pursuant to the passage of Ordinance Number 2759-2020 and the adoption of Resolution Number 0062X-2022, intends to authorize the City Attorney to spend City funds and file the necessary complaints to appropriate and accept title to the remainder of the Real Estate; and\n \nWHEREAS, the City intends for the Real Estate’s acquisition to help make, improve, or repair certain portions of the public sewer infrastructure of Miller Avenue, Kelton Avenue, Newton Street, and Bedford Avenue and now, therefore:\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     That the fee simple and lesser real estate associated with the project parcel numbers listed in Section Three (3) of this ordinance (“Real Estate”) are (i) fully described in Resolution 0062X-2022 and incorporated into this ordinance for reference as if rewritten, and (ii) to be appropriated and accepted for the public purpose of the Department of Public Utilities (“DPU”) timely completing the Blueprint Miller Kelton Bedford Project (CIP 650870-101201, CIP 650870-162001, & 690236-100120) (“Public Project”).\n \nSECTION 2.                     That the City declares, pursuant to the City's power and authority under the Ohio Constitution, Ohio Revised Code Sections 715.01, 717.01, 719.01, and 719.02, the City's Charter, and Columbus City Code Chapter 909, the appropriation of the Real Estate is necessary for the Public Project, because the City was unable to locate the Real Estate’s owner(s) or agree in good faith with the Real Estate’s owner(s) regarding the amount of just compensation to be paid by the City for the Real Estate.\n \nSECTION 3.                     That the City declares that the fair market value of the Real Estate as follows:\n \nPUBLIC PROJECT PARCEL NUMBER(S) (FMVE)\nREAL ESTATE OWNER\nOWNER ADDRESS\n \nPARCEL 16 T-FMVE $300\nThongbay Sivanthaphanith\n587 S. 22nd Street  \nColumbus, Ohio  43205\n \nPARCEL 20A T-FMVE $844\nExtreme Equity Enterprise LLC\n3094 Aleshire Drive\nDublin, Ohio  43017\nAttn: Yassine Khetab\n \nPARCEL 22-T FMVE $496\nKyle G. Richards\n751 Linwood Avenue\nColumbus, Ohio  43205\n \nPARCEL 23-T FMVE $698\nSeventeen Estates LLC\nc/o Ryan Rice \n3932 Redbud Road\nGlen Allen, VA 23060\n \nPARCEL 24-T FMVE $1,242\nSoroush Firouzmandi as Trustee for the Soroush Firouzmandi Family Trust\n1266 E. Livingston Avenue\nColumbus, OH 43205\n \nPARCEL 25-T, 26-T FMVE $3,614\nWY Investment LLC\nc/o Marshall McCormick, Reg. Agent \n1515 Bethel Road Ste. 200\nColumbus, OH 43220\n \nAnd \n \nBlackstone Dwellings LLC\nc/o Jeff Kowalczuk \n605 N. High Street, Ste. 263\nColumbus, OH 43215\n \nPARCEL 27-T FMVE $869\nChristian Cisneros and Kristen Paige\n789 Kimball Pl.\nColumbus, Ohio  43205\n \nPARCEL 33 T-FMVE $512\nLouella Hodnett\n776 Kimball Place \nColumbus Ohio 43205 \n \nPARCEL 39 T - FMVE  $1,117\nBuckeye Supreme Investments, LLC\n3561 Mountview Road\nColumbus, Ohio 43221 \n \nDavide V. Cugini, Esq. \n35 N. Fourth Street, Suite 100\nColumbus, Ohio 43215\n \nPARCEL 40 T- FMVE $3,083\nDorothy P. Hanley, Trustee\n670 Miller Avenue\nColumbus, Ohio 43205\n \nSECTION 4.                     That the City Attorney is authorized to file petitions necessary to appropriate the Real Estate in the appropriate court of common pleas and impanel a jury to inquire and assess the amount of just compensation for the Real Estate.\n \nSECTION 5.                     That the Real Estate’s acquisition for the Public Project is required to make, improve, or repair certain portions of the public sewer infrastructure of Miller Avenue, Kelton Avenue, Newton Street, and Bedford Avenue and associated appurtenances.\n \nSECTION 7.  That the City Attorney, in order to pay for the Real Estate’s acquisition and appropriation costs for the Public Project, is authorized to spend up to Twelve Thousand Seven Hundred Seventy-Five 00/100 U.S. Dollars ($12,775.00), or so much as may be needed from existing Auditor’s Certificate ACDI001666-10.       \n \nSECTION 8.                     That the City Auditor is authorized to make any accounting changes to revise the funding source associated with this ordinance.\n \nSECTION 9. That this ordinance shall take effect and be in full force and effect from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 58,
    "meeting_date": "2022-10-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Property & Real Estate"
    ]
  }
}