{
  "success": true,
  "vote": {
    "id": 4857,
    "item_number": "CA-8",
    "title": "To amend the 2022 Capital Improvement budget; to authorize the Director of Public Service to expend up to $132,533.00 to reimburse the Street Construction, Maintenance and Repair Fund for costs associated with sign, signal, and permanent pavement marking application and bikeway improvements; and to declare an emergency.  ($132,533.00)",
    "description": "Explanation\n1.  BACKGROUND\nThe Department of Public Service is engaged in traffic sign and signal installation, permanent pavement marking application, engineering, roadway improvement and design and construction on behalf of the Department of Development.  Project costs incurred by the operating fund are salaries, overtime, materials and other direct costs.  These costs are capital eligible and doing so is consistent with earlier efforts by the division to reimburse its operating fund when the operating fund incurred expenses more appropriate to capital improvement funding.  The Division of Traffic Management, provided services related to traffic signs, signals, permanent pavement marking applications, and bikeway improvements for UIRF funded Department of Development projects.  The Traffic Management Division budgeted the additional costs within the division’s operating fund (the Street Construction, Maintenance and Repair Fund) with planned reimbursement with UIRF capital funds. \n \nThis ordinance authorizes the expenditure of up to $132,533.00 or so much thereof as may be necessary for that purpose. \n \n2.  FISCAL IMPACT\nFunding for this expenditure is available within Fund 7704, the Streets and Highways Bond Fund.  It is necessary to amend the 2022 Capital Improvement Budget to establish sufficient budget authority and align spending in the proper project.  Creation of an Auditor’s Certificate for Direct Invoicing will be used to reimburse the Street Construction, Maintenance and Repair Fund for the capitalized costs.\n \n3.  EMERGENCY DESIGNATION\nThe division requests emergency action designation to allow the reimbursement of these operating expenses at the earliest possible time to provide adequate operating resources for the Street Construction, Maintenance and Repair Fund. \n \n4.  MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis expenditure is for reimbursement from another city department and as such is not an expenditure that falls under this program.\n \nTitle\nTo amend the 2022 Capital Improvement budget; to authorize the Director of Public Service to expend up to $132,533.00 to reimburse the Street Construction, Maintenance and Repair Fund for costs associated with sign, signal, and permanent pavement marking application and bikeway improvements; and to declare an emergency.  ($132,533.00)\n \nBody\nWHEREAS, the Department of Public Service employs personnel that are engaged in traffic sign, signal, permanent pavement marking application, and bikeway improvements on behalf of the Department of Development and incurs various salary and material expenses within its operating fund associated with capital projects; and  \n \nWHEREAS, these costs can be capitalized; and \n \nWHEREAS, the 2022 revenue estimate for the Street Construction, Maintenance and Repair Fund reflects and assumes this revenue; and\n \nWHEREAS, it is necessary to amend the 2022 Capital Improvement Budget to establish authority within the correct project; and \n \nWHEREAS, it is necessary to authorize this expenditure in order to provide adequate operating resources; and\n \nWHEREAS, this expenditure is a reimbursement from another city department and as such is not an expenditure that falls under the Minority and Woman Owned Business Enterprise & Small Local Business Enterprise Program; and    \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to authorize reimbursement to the Street Construction Maintenance and Repair Fund at the earliest possible time to provide adequate operating resources for the Street Construction, Maintenance and Repair Fund, thereby preserving the public health, peace, property, safety and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2022 Capital Improvements Budget authorized by ordinance 1896-2022 be amended as follows to establish  sufficient authority for this project:\n \nFund / Project  / Project Name / Current  / Change /C.I.B. as Amended\n7704 / P440005-100000 / UIRF - Urban Infrastructure Recovery Fund (59-12) (Voted Carryover) / $5,631,609.00 / ($132,533.00) / $5,499,076.00\n \n7704 / P440005-102006 / UIRF - Hilltop Bikeways (Voted Carryover) / $0.00 / $132,533.00 / $132,533.00\n \nSECTION 2.  That the expenditure of $132,533.00, or so much thereof as may be needed, is hereby authorized in Fund 7704 (Streets and Highways Bond Fund), Dept-Div 5912 (Design and Construction), Project P440005-102006 (UIRF - Hilltop Bikeways), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance., per the accounting codes attached to this ordinance.  \n \nSECTION 3.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 6.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 59,
    "meeting_date": "2022-10-17",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services",
      "Public Works"
    ]
  }
}