{
  "success": true,
  "vote": {
    "id": 487,
    "item_number": "CA-38",
    "title": "To amend the 2020 Capital Improvement Budget;  to authorize the transfer of funds within the Development Taxable Bonds Fund; to authorize the Director of Public Service to enter into a professional services contract with Korda/Nemeth Engineering, Inc. for the Economic and Community Development - 3P GE North Market project; to authorize the expenditure of up to $750,000.00 from the Development Taxable Bonds Fund to pay for this contract; and to declare an emergency. ($750,000.00)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Service to enter into a professional services contract with Korda/Nemeth Engineering, Inc. in the amount of up to $750,000.00 for the Economic and Community Development - 3P GE North Market project.\n \nThe intent of this project is to provide the City of Columbus, Department of Public Service, additional resources that are necessary to perform professional engineering and survey services as well as provide technical expertise.  It is anticipated the initial tasks to be issued under this contract will be focused on utility relocations in the Arena and Convention Center Districts of the City around the existing North Market building.  This area was the subject of a utilities master plan that will be used for the basis of the scope of improvements.\nThe Department of Public Service, Office of Support Services, solicited Requests for Proposals for the Economic and Community Development - 3P GE North Market contract.  The project was formally advertised on the Vendor Services and Bonfire web sites from January 13, 2021, to February 3, 2021.  The City received three (3) responses.  All proposals were deemed responsive and were fully evaluated when the Evaluation Committee met on February 10, 2021.  The responding firms were:  \nCompany Name                                                      City/State            Majority/MBE/MBR/F1/AS1/PHC\nKorda/Nemeth Engineering, Inc.                                                               Columbus, OH                                                                MAJ\nms consultants, inc.                                                                                    Columbus, OH                                                                MAJ\nStantec Consulting Services                                                               Columbus, OH                                                               MAJ\n \nKorda/Nemeth Engineering, Inc. received the highest score by the evaluation committee and will be awarded the Economic and Community Development - 3P GE North Market contract.  \n \nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against Korda/Nemeth Engineering, Inc.\n \n2.  CONTRACT COMPLIANCE\nKorda/Nemeth Engineering, Inc.’s contract compliance number is CC004467 and expires 04/30/2021.  \n \n3.  FISCAL IMPACT\nFunding for this contract is available within Fund 7739, the Development Taxable Bonds Fund.  An amendment to the 2020 Capital Improvement Budget is required to establish sufficient budget authority for the project.  A transfer of cash and appropriation between projects in the Development Taxable Bonds Fund is necessary to establish sufficient cash for the proper project.\n \n4. EMERGENCY DESIGNATION\nEmergency action is requested to expedite this contract to complete the project in a timely manner, to ensure the safety of the travelling public.\n \nTitle\nTo amend the 2020 Capital Improvement Budget;  to authorize the transfer of funds within the Development Taxable Bonds Fund; to authorize the Director of Public Service to enter into a professional services contract with Korda/Nemeth Engineering, Inc. for the Economic and Community Development - 3P GE North Market project; to authorize the expenditure of up to $750,000.00 from the Development Taxable Bonds Fund to pay for this contract; and to declare an emergency. ($750,000.00)\n \nBody\nWHEREAS, there is a need to enter into a professional services contract to provide for professional engineering and survey services in and around the Arena and Convention Center Districts of the City; and\n \nWHEREAS, the Department of Public Service, Office of Support Services, solicited Requests for Proposals for the Economic and Community Development - 3P GE North Market project; and\n \nWHEREAS, Korda/Nemeth Engineering, Inc. submitted the best overall proposal for this project; and\n \nWHEREAS, it is necessary to enter into a contract with Korda/Nemeth Engineering, Inc. for the provision of professional engineering consulting services described above in the amount of up to $750,000.00; and\n \nWHEREAS, it is necessary to authorize an amendment to the 2020 Capital Improvement Budget for the purpose of providing sufficient spending authority for the aforementioned project expenditure; and\n \nWHEREAS, it is necessary to authorize a transfer of funds within fund 7739, Development Taxable Bonds Fund to establish sufficient cash to pay for the project; and\n \nWHEREAS, it is necessary to expend funds to pay for the work performed; and \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to authorize the Director of Public Service to enter into contract with Korda/Nemeth Engineering, Inc. in order to provide funding for Economic and Community Development - 3P GE North Market so that upcoming street improvements may proceed as soon as possible, to ensure the safety of the traveling public thereby preserving the public health, peace, property, safety and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the 2020 Capital Improvements Budget authorized by ordinance 2521-2020 be amended as follows to establish  sufficient authority for this project:\n \nFund / Project / Project Name / C.I.B. / Change / C.I.B. as Amended\n7739 / P441768-100000 / North Market Streetscape (Councilmanic SIT Supported) / $4,000,000.00 / ($750,000.00) / $3,250,000.00\n                     \n7739 / P590415-100026 / Economic and Community Development - 3P GE North Market (Councilmanic SIT Supported) / $0.00 / $750,000.00 / $750,000.00\n \nSECTION 2.  That the transfer of $750,000.00, or so much thereof as may be needed, is hereby authorized within Fund 7739 (Development Taxable Bonds Fund), from Dept-Div 4402 (Economic Development), Project P441768-100000 (North Market Streetscape), Object Class 06 (Capital Outlay) to Dept-Div 5912 (Design and Construction), Project P590415-100026 (Economic and Community Development - 3P GE North Market ), Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That the Director of Public Service be, and hereby is, authorized to enter into a professional services contract with Korda/Nemeth Engineering, Inc. at 1650 Watermark Drive, Suite 200, Columbus, Ohio 43215, for the Economic and Community Development - 3P GE North Market project in an amount up to $750,000.00.\n \nSECTION 4.  That the expenditure of $750,000.00, or so much thereof as may be needed, is hereby authorized in Fund 7739 (Development Taxable Bonds Fund), Dept-Div 5912 (Design and Construction), Project P590415-100026 (Economic and Community Development - 3P GE North Market ), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 5.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 7.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 8.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 8,
    "meeting_date": "2021-03-22",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}