{
  "success": true,
  "vote": {
    "id": 4890,
    "item_number": "SR-2",
    "title": "To authorize the issuance of limited tax bond anticipation notes in an amount not to exceed $24,300,000.00 for the purpose of financing the costs of constructing the Starling Street Parking Garage; to authorize the appropriation of $1,585,185.44 in the Columbus Downtown TIF Fund, Fund 4453; to authorize the transfer of $1,585,185.44 from the Columbus Downtown TIF Fund to the Mobility Debt Retirement Fund; to authorize the transfer of $348,201.82 within the Mobility Debt Retirement Fund; to authorize an expenditure of $27,348,800.00 from the Mobility Enterprise Fund and Mobility Debt Retirement, collectively; and to declare an emergency. ($24,300,000.00).\r\n\r\nSection 44-1(b)",
    "description": "Explanation\n \nBACKGROUND:\nThis ordinance authorizes the issuance of limited tax bond anticipation notes in an amount not to exceed $24,300,000.00 to refund outstanding bond anticipation notes issued for the purpose of financing the costs of constructing the Starling Street Parking Garage.  The original note was issued in 2020 in the amount of $32,500,000.  Proceeds from the 2022 note sale will be used to provide for the payment of a portion of the 2021 notes that will mature on November 17, 2022. \n                     \nFISCAL IMPACT:  A note in an amount not to exceed $24,300,000 will be issued.  This ordinance also includes additional monies to provide for the cost of advertising, printing and legal services and other costs incidental thereto, currently estimated not to exceed $40,000.00.  Additional funds to pay down a portion of the existing note will be used from the Downtown TIF fund 4453 and the Mobility Enterprise Fund.  It is the intent that the debt service associated with the issuance of the notes will come from revenues generated from the operation of the city's existing parking garages and future revenues generated from the Starling Street Parking Garage.\n \nTitle\nTo authorize the issuance of limited tax bond anticipation notes in an amount not to exceed $24,300,000.00 for the purpose of financing the costs of constructing the Starling Street Parking Garage; to authorize the appropriation of $1,585,185.44 in the Columbus Downtown TIF Fund, Fund 4453; to authorize the transfer of $1,585,185.44 from the Columbus Downtown TIF Fund to the Mobility Debt Retirement Fund; to authorize the transfer of $348,201.82 within the Mobility Debt Retirement Fund; to authorize an expenditure of $27,348,800.00 from the Mobility Enterprise Fund and Mobility Debt Retirement, collectively; and to declare an emergency. ($24,300,000.00).\n \nSection 44-1(b) \nBody\n \nWHEREAS, City Council (the “Council”) of the City of Columbus, Ohio (the “City”) has previously authorized an agreement with Capital South Community Urban Redevelopment Corporation for planning, design and construction of a parking facility containing approximately 1,400 parking spaces and known as the Starling Street Garage Project (the “Project”); and\nWHEREAS, Council has issued notes dated November 17, 2021, in anticipation of the issuance of bonds described herein, in the aggregate principal amount of $27,200,000.00, which notes will mature on November 17, 2022 (the “Outstanding Notes”); and \nWHEREAS, it appears advisable in lieu of issuing bonds at this time to issue new notes in anticipation of the issuance of bonds, and to retire a portion of the Outstanding Notes under authority of the general laws of the State of Ohio, and in particular Section 133.23 of the Ohio Revised Code; and                     \nWHEREAS, the City Auditor has certified to this Council that the estimated life of the improvement stated above which is to be financed from the proceeds of bonds and notes hereinafter referred to exceeds five (5) years, the maximum maturity of bonds being thirty (30) years and notes being eighteen (18) years; and \nWHEREAS, an emergency exists in the usual daily operations of the City Auditor’s Office in that it is immediately necessary to authorize the issuance of notes in order to refund the existing notes prior to maturity for the immediate preservation of the public peace, property, health or safety; NOW, THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSection 1.                                          It is hereby declared necessary to issue bonds (the “Bonds”) of the City, in the maximum principal sum of $24,300,000.00, for the purpose of paying costs of the Project.\nSection 2.                     The Bonds shall be dated prior to the maturity date of the Notes (as defined herein), shall bear interest at the maximum average annual interest rate presently estimated to be six per centum (6.00%) per annum, payable semiannually until the principal sum is paid or provision has been duly made therefore and shall mature in thirty (30) annual installments.  \nSection 3.                     It is necessary to issue and this Council hereby determines that notes shall be issued in anticipation of the issuance of the Bonds.\nSection 4.                     Such anticipatory notes (the “Notes”) shall be in the amount of $24,300,000 or such lesser amount as shall be determined by the Director of Finance and Management or City Auditor and certified to this Council, which sum does not exceed the amount of the Bonds.  The Notes shall bear interest at such rate per annum as shall be determined by the City Auditor and certified to this Council, provided that such rate shall not exceed six per centum (6.00%) per annum, based on a 360-day year of twelve 30-day months, payable at maturity.  The Notes shall be issued as fully registered notes in book-entry form only, in such denominations as shall be determined by the City Auditor and shall be numbered as determined by the City Auditor.\nSection 5.                     There shall be and is hereby levied annually on all the taxable property in the City, in addition to all other taxes and within the ten mill limitation, a direct tax (the “Debt Service Levy”) for each year during which any of the Notes are outstanding, for the purpose of providing, and in an amount which is sufficient to provide, funds to pay interest upon the Notes as and when the same falls due and to provide a fund for the repayment of the principal of the Notes at maturity or upon redemption.  The Debt Service Levy shall not be less than the interest and sinking fund tax required by Article XII, Section 11 of the Ohio Constitution.\nSection 6.                     The Debt Service Levy shall be and is hereby ordered computed, certified, levied and extended upon the tax duplicate and collected by the same officers, in the same manner, and at the same time that taxes for general purposes for each of such years are certified, extended and collected.  The Debt Service Levy shall be placed before and in preference to all other items and for the full amount thereof.  The funds derived from the Debt Service Levy shall be placed in a separate and distinct fund, which shall be irrevocably pledged for the payment of the premium, if any, and interest on and principal of the Notes and Bonds when and as the same falls due. Notwithstanding the foregoing, if the City determines that funds will be available from other sources for the payment of the Notes in any year, including amounts determined by the City Auditor to be available for such purpose in the Mobility Enterprise Fund, Fund 6500, the Mobility Debt Retirement Fund, Fund 6520, or the Columbus Downtown TIF Fund, Fund 4453, or any subfunds of the foregoing, the expenditure of which is hereby authorized, the amount of the Debt Service Levy for such year shall be reduced by the amount of funds which will be so available, and the City shall appropriate such funds to the payment of the Notes and Bonds in accordance with law.\nSection 7.                     The Notes shall be designated “City of Columbus, Ohio Starling Street Garage Limited Tax Notes, Series 2022 (federally taxable)” or as otherwise provided in the Certificate of Award defined in Section 11 hereof.\nSection 8.                     The Notes shall be executed by the City Auditor and the Mayor of the City, in their official capacities, provided that any of those signatures may be a facsimile, shall be payable as to both principal and interest upon presentation and surrender of the Notes at the principal office of the Note Registrar, and shall express upon their faces the purpose for which they are issued and that they are issued pursuant to this Ordinance. No Note shall be valid or become obligatory for any purpose or shall be entitled to any security or benefit under this Ordinance unless and until a certificate of authentication, as printed on the Note, is signed by the Note Registrar (as defined in Section 9 hereof) as authenticating agent.  Authentication by the Note Registrar shall be conclusive evidence that the Note so authenticated has been duly issued and delivered under this Ordinance and is entitled to the security and benefit of this Ordinance.\nThe principal of and interest on the Notes shall be payable in lawful money of the United States of America without deduction for the services of the Note Registrar as paying agent.  The principal of and interest on the Notes shall be payable upon presentation and surrender of the Notes at their maturity at the principal office of the Note Registrar.\n \nSection 9.                                          The City Auditor is hereby appointed to act as the authenticating agent, note registrar, transfer agent and paying agent (collectively, the “Note Registrar”) for the Notes.  So long as any of the Notes remain outstanding, the City will cause to be maintained and kept by the Note Registrar, at the principal office of the Note Registrar, all books and records necessary for the registration, exchange and transfer of the Notes as provided in this Section (the “Note Register”).  Subject to the provisions of Section 10 hereof, the person in whose name any Note shall be registered on the Note Register shall be regarded as the absolute owner thereof for all purposes.  Payment of or on account of the principal of and premium, if any, and interest on any Notes shall be made only to or upon the order of that person.  Neither the City nor the Note Registrar shall be affected by any notice to the contrary, but the registration may be changed as herein provided.  All payments shall be valid and effectual to satisfy and discharge the liability upon the Notes, including the interest thereon, to the extent of the amount or amounts so paid.  \n \n                     Any Note may be transferred only on the Note Register upon presentation and surrender thereof at the principal office of the Note Registrar, together with an assignment executed by the registered owner or by a person authorized by the owner to do so by a power of attorney in a form satisfactory to the Note Registrar.  Upon that transfer, the Note Registrar shall complete, authenticate and deliver a new Note or Notes of any authorized denomination or denominations equal in the aggregate to the unmatured principal amount of the Note surrendered, and bearing interest at the same rate and maturing on the same date.\n \n                     The City and the Note Registrar shall not be required to transfer or exchange any Note for a period of fifteen (15) days next preceding the date of its maturity.\n \n                     In all cases in which Notes are exchanged or transferred hereunder, the City shall cause to be executed and the Note Registrar shall authenticate and deliver Notes in accordance with the provisions of this Ordinance.  The exchange or transfer shall be without charge to the owner; except that the City and the Note Registrar may make a charge sufficient to reimburse them for any tax or other governmental charge required to be paid with respect to the exchange or transfer.  The City or the Note Registrar may require that those charges, if any, be paid before it begins the procedure for the exchange or transfer of the Notes.  All Notes issued upon any transfer or exchange shall be valid obligations of the City, evidencing the same debt, and entitled to the same benefits under this Ordinance, as the Notes surrendered upon that transfer or exchange.\n \n                     If at any time the City Auditor determines that it is in the best interests of the City that a bank or other appropriate financial institution experienced in providing the services of authenticating agent, note registrar, transfer agent and paying agent should serve as Note Registrar, or co-Note Registrar in addition to the Note Registrar, then the Director of Finance and Management or the City Auditor shall, and each is hereby authorized to, execute on behalf of the City a Note Registrar Agreement with such entity, pursuant to which such bank or financial institution shall agree to serve as Note Registrar or co-Note Registrar for the Notes.  If at any time such bank or financial institution shall be unable or unwilling to serve as Note Registrar or co-Note Registrar, or the City Auditor or the Director of Finance and Management, in such officers’ discretion, shall determine that it would be in the best interest of the City for such functions to be performed by another party, the City Auditor or the Director of Finance and Management may, and each is hereby authorized and directed to, enter into an agreement with another banking association or other appropriate institution experienced in providing such services, to perform the services required of the Note Registrar or co-Note Registrar hereunder.  Each such successor Note Registrar (or co-Note Registrar) shall promptly advise all noteholders of the change in identity and its address.\n \nSection 10.                                          If determined by the City Auditor or Director of Finance and Management to be appropriate for the sale of the Notes, such Notes may be initially issued to a Depository (as defined herein) for use in a book-entry system (each as hereinafter defined), and the provisions of this Section shall apply notwithstanding any other provision of this Ordinance:  (i) there shall be a single Note, (ii) the Note shall be registered in the name of the Depository or its nominee, as registered owner, and immobilized in the custody of the Depository; (iii) the beneficial owners in book-entry form shall have no right to receive Notes in the form of physical securities or certificates; (iv) ownership of beneficial interests in any Note in book-entry form shall be shown by book-entry on the system maintained and operated by the Depository, and transfers of the ownership of beneficial interests shall be made only by the Depository and by book-entry; and (v) the Notes as such shall not be transferable or exchangeable, except for transfer to another Depository or to another nominee of a Depository, without further action by the City.  Principal of and premium, if any, and interest on the Notes in book-entry form registered in the name of a Depository or its nominee shall be payable in next day funds delivered to the Depository or its authorized representative (i) in the case of interest, on each Interest Payment Date, and (ii) in all other cases, upon presentation and surrender of Notes as provided in this Ordinance.\n \n                     The Note Registrar may enter into an agreement with the beneficial owner or registered owner of a Note in the custody of a Depository providing for making all payments to that owner of principal of and premium, if any, and interest on that Note or any portion thereof (other than any payment of the entire unpaid principal amount thereof) at a place and in a manner (including wire transfer of federal funds) other than as provided above in this Ordinance, without prior presentation or surrender of the Note, upon any conditions which shall be satisfactory to the Note Registrar and the City.  That payment in any event shall be made to the person who is the registered owner of the Note on the date that principal is due, or, with respect to the payment of interest, as of the applicable date agreed upon as the case may be.  The Note Registrar will furnish a copy of each of these agreements, certified to be correct by the Note Registrar, to other paying agents for Notes and to the City.  Any payment of principal, premium or interest pursuant to such an agreement shall constitute payment thereof pursuant to, and for all purposes of, this Ordinance.\n \n                     The City Auditor, as Note Registrar, is authorized and directed to execute, acknowledge and deliver, in the name of and on behalf of the City, the letter agreement among the City, the Note Registrar (if City Auditor is not then serving as Bond Registrar) and The Depository Trust Company, as Depository, to be delivered, in connection with the issuance of the Notes to the Depository for use in a book-entry system.\n \n                     If any Depository determines not to continue to act as a depository for the Notes for use in a book-entry system, the City and the Note Registrar may attempt to have established a securities depository/book-entry relationship with another qualified Depository under this Ordinance.  If the City and the Note Registrar do not or are unable to do so, the City and the Note Registrar, after the Note Registrar has made provision for notification of the beneficial owners by the then Depository, shall permit withdrawal of the Notes from the Depository, and authenticate and deliver Note certificates in fully registered form to the assigns of the Depository or its nominee, all at the cost and expense (including costs of printing definitive Notes), if the event is not the result of action or inaction by the City or the Note Registrar, of those persons requesting such issuance.\n \n                     For purposes of this Ordinance the following terms shall have the following meanings:\n \n                     “Book-entry form” or “book-entry system” means a form or system under which (i) the beneficial right to payment of principal of and interest on the Notes may be transferred only through a book-entry and (ii) physical Notes in fully registered form are issued only to a Depository or its nominee as registered owner, with the Notes “immobilized” to the custody of the Depository, and the book-entry is the record that identifies the owners of beneficial interests in those Notes.\n \n                     “Depository” means any securities depository that is a clearing agency under federal law operating and maintaining, together with its participants, a book-entry system to record beneficial ownership of Notes, and to effect transfers of Notes, in book-entry form, and includes The Depository Trust Company (a limited purpose trust company), New York, New York, and its nominees.\n \nSection 11.                                          The City Auditor and the Director of Finance and Management, or either of them individually, are authorized and directed to cause the Notes to be sold by either competitive sale or by negotiated sale including, if determined by the City Auditor or Director of Finance and Management, to be sold at private sale to the City’s Treasury Investment Board.  In the event that the Notes are sold by competitive sale, a Notice of Sale shall be published in the form and manner as shall be approved by the City Auditor or the Director of Finance and Management.  After publication of such Notice of Sale, the Notes may be awarded and sold to such purchaser (the “Competitive Purchaser”) as shall offer, in the opinion of the City Auditor or the Director of Finance and Management, the best rate of interest on the Notes.\n \nIn the event that the Notes are sold on a negotiated basis, the Notes shall be sold to the purchaser or purchasers (collectively, the “Negotiated Purchaser,” and together with the Competitive Purchaser, the “Original Purchaser”) designated in the Certificate of Award (as defined herein).  The City Auditor and the Director of Finance and Management, or either of them individually, are authorized and directed, in the event that the Notes are sold on a negotiated basis, to execute on behalf of the City a Note Purchase Agreement or term sheet with the Negotiated Purchaser (which agreement may be combined with the purchase agreement for the purchase of other general obligation bonds or notes authorized by separate ordinances of this Council), setting forth the conditions under which the Notes are to be sold and delivered, which agreement shall be in such form and shall contain such terms, covenants and conditions not inconsistent with this Ordinance and permitted by applicable law as shall be approved by the City Auditor or the Director of Finance and Management and approved as to form by the City Attorney.\n                     The City Auditor and the Director of Finance and Management, or either of them individually, are authorized and directed to execute on behalf of the City a Certificate of Award (the “Certificate of Award”) setting forth the Original Purchaser for the Notes, the aggregate principal amount of the Notes to be issued, the dated date of the Notes, the Purchase Price, the Specified Interest Rate, the Maturity Date, (all as hereinafter defined) and shall include such additional information as shall be required by the terms of this Ordinance.\n                     As used in this Section 11 hereof:\n \n                     “Certificate of Award” means the Certificate of Award authorized by this Section 11 to be executed by the Director of Finance and Management or the City Auditor setting forth and determining such terms and other matters pertaining to the Notes, their issuance, sale or delivery, as are authorized and directed to be determined therein by this Ordinance. \n \n                     “Maturity Date” means the maturity date for the Notes as set forth in the Certificate of Award.\n \n                     “Original Purchaser” means such purchaser or purchasers as are identified in the Certificate of Award.\n \n                     “Purchase Price” means that amount which is to be determined in the Certificate of Award, but such amount is to be no less than 100% of the aggregate principal amount of the Notes, together with accrued interest on the Notes from their date to the date of their delivery and payment therefor.\n \n                     “Specified Interest Rate” means the interest rate at which the Notes bear interest, which rate is to be determined in the Certificate of Award.\n \n                     The Mayor, the City Auditor and the Clerk of Council are authorized and directed to make the necessary arrangements on behalf of the City to establish the date, location, procedure and conditions for the delivery of the Notes to the Original Purchaser.  Those officers are further directed to take all steps necessary to effect due execution, authentication and delivery of the Notes under the terms of this Ordinance and the Certificate of Award.  Further, such officers are hereby authorized and directed to take such action and to execute and deliver, on behalf of the Council, such additional instruments, agreements, certificates, and other documents as may be in their discretion necessary or appropriate in order to carry out the intent of this Ordinance.  Such documents shall be in the form not substantially inconsistent with the terms of this Ordinance, as they in their discretion shall deem necessary or appropriate.\n \n                     The distribution of an Official Statement of the City, in preliminary and final form, relating to the original issuance of the Notes is hereby authorized (which Official Statement may be the same offering document used in connection with the sale of certain general obligation bonds authorized by separate ordinances of this Council),  and the Director of Finance and Management and the City Auditor, or either of them acting alone, are hereby authorized and directed to negotiate, prepare and execute, on behalf of the City and in their official capacity, the Official Statement and any supplements thereto as so executed in connection with the original issuance of the Notes and are further authorized and directed to advise the Original Purchaser in writing regarding limitations on the use of the Official Statement and any supplements thereto for purposes of marketing or reoffering the Notes as deemed necessary or appropriate to protect the interests of the City.  The Director of Finance and Management, the City Auditor, the City Attorney and any other official of the City are each authorized to execute and deliver, on behalf of the City and in their official capacities, such certificates in connection with the accuracy of the Official Statement, in either preliminary or final form, and any supplements thereto as may, in their judgment, be necessary or appropriate.\n \n                     The proceeds from the sale of the Notes, except accrued interest, if any, shall be deposited in the City Treasury, and allocated to a subfund of the Mobility Debt Retirement Fund, Fund 6520, and be used to provide a portion of the amount necessary to retire the Outstanding Notes.\n \n                     Any premium received from the sale of the Notes shall be deposited in the City Treasury and shall be credited to such funds and used for such purposes as shall be specified in the Certificate of Award.  All moneys necessary to carry out the purpose of this Ordinance, including principal of and interest on the Notes, are hereby deemed appropriated and authorized for expenditure by the City Auditor.  \n \n                     The City hereby covenants, pursuant to Ohio Revised Code Section 133.05(B)(7), to appropriate annually from lawfully available municipal income taxes, and to continue to levy and collect municipal income taxes adequate to produce, amounts necessary to meet the debt charges on the Bonds in each year until full payment is made.\n \n                     This Council further authorizes the expenditure of a sum not to exceed $40,000 to be paid from Special Income Tax Fund, Fund 4430, the Mobility Enterprise Fund, Fund 6500, Mobility Debt Retirement Fund, Fund 6520, or from the Columbus Downtown TIF Fund, Fund 4453, or any subfunds of the foregoing, as determined by the City Auditor, to pay costs of issuance of the Notes, which costs of issuance shall include, but shall not be limited to, the fees and expenses of the City’s bond counsel, the fees and expenses of the City’s municipal advisor, rating agency fees, the fees and expenses associated with the sale of the Notes and printing fees, which and amount is hereby appropriated such for such purpose.  In the alternative, the City Auditor is hereby authorized to pay the costs of issuance of the Notes from the proceeds of the sale of the Notes.\n \n                     This Council further authorizes the appropriation, transfer and expenditure of a sum not to exceed $2,900,000 to be paid from either or a combination of the Mobility Enterprise Fund, Fund 6500, Mobility Debt Retirement Fund, Fund 6520, and the Columbus Downtown TIF Fund, Fund 4453, or any subfunds of the foregoing, as determined by the City Auditor, to pay off a portion of the Outstanding Notes. \n \nIf the Notes are sold in a transaction subject to Rule 15c2-12(b)(5) adopted by the Securities Exchange Commission under the Securities Exchange Act of 1934, as the same may be amended from time to time (the “Rule”), then the City Auditor and Director of Finance and Management, or either of them individually, are hereby authorized and directed to execute and deliver, in accordance with Section 323.07(a)(7) of the Columbus City Code and for the benefit of the noteholders, a Continuing Disclosure Certificate in such form as is approved by the officer executing such certificate, as necessary to assist the Original Purchaser in complying with the Rule.  The approval of such Continuing Disclosure Certificate shall be conclusively evidenced by the execution of such certificate by the City Auditor or Director of Finance and Management.\n \nSection 12.                                          The Mayor, City Auditor, the Director of Finance and Management, and Clerk of Council, or any of them individually, are hereby authorized and directed to take such action and to execute and deliver, on behalf of the Council, such additional instruments, agreements, certificates, and other documents as may be in their discretion necessary or appropriate in order to carry out the intent of this Ordinance.  Such documents shall be in the form not substantially inconsistent with the terms of this Ordinance, as they in their discretion shall deem necessary or appropriate.\n                     Except for the procedure for authenticating the Notes set forth in Section 8 herein, documents (including this Ordinance) executed, scanned and transmitted electronically and electronic and digital signatures shall be deemed original signatures for said transcript of the Notes, for the purposes of this Ordinance, and for all matters related thereto, with any such scanned, electronic, and digital signatures having the same legal effect as original signatures.\nSection 13.                                          It is hereby found and determined that all acts, conditions and things necessary to be done precedent to and in the issuing of the Notes in order to make them legal, valid and binding obligations of the City have happened, been done and been performed in regular and due form as required by law; that the Notes are the full general obligation of the City and the full faith, credit and revenue of the City are hereby irrevocably pledged for the prompt payment of the principal and interest thereof at maturity; and that no limitation of indebtedness or taxation, either statutory or constitutional, has been exceeded in issuing the Notes.\nSection 14.                     It is hereby found and determined that all formal actions of this Council concerning and relating to the adoption of this ordinance were adopted in an open meeting of this Council, and that all deliberations of this Council and of any of its committees that resulted in such formal action, were in meetings open to the public, in compliance with all legal requirements including Section 121.22 of the Ohio Revised Code.\nSection 15.                     The Clerk of Council is hereby directed to forward certified copies of this ordinance to the Auditors of Franklin, Fairfield and Delaware Counties, Ohio.\nSection 16.                     In accordance with Sections 22 and 44-1(b) of the Charter of the City of Columbus, Ohio, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten (10) days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 59,
    "meeting_date": "2022-10-17",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Economic Development",
      "Emergency Services"
    ]
  }
}