{
  "success": true,
  "vote": {
    "id": 4957,
    "item_number": "2",
    "title": "To honor and celebrate November 11th, 2022 as Veterans Day and the month of November as Veterans and Military Families Month.\r\n\r\nTo declare the week of November 7th as Veterans Week in the city of Columbus and honor and    celebrate the month of November as Veterans and Military Families Month.",
    "description": "Title\n \nTo honor and celebrate November 11th, 2022 as Veterans Day and the month of November as Veterans and Military Families Month.\n \nTo declare the week of November 7th as Veterans Week in the city of Columbus and honor and    celebrate the month of November as Veterans and Military Families Month.\n \nBody\n \nWHEREAS, Congress approved an act on May 13th, 1938, that the eleventh of November should be a legal holiday and be known as Armistice Day. In order to expand the significance of that commemoration, Congress, by an act approved the name change of the holiday to Veterans Day on June 1st, 1954; and\n \nWHEREAS, November is National Veterans and Military Families Month; and\n \nWHEREAS, there are many challenges that Veterans face after they leave the military including unemployment, relationship with themselves, homelessness, physical handicaps, poor mental health; and\n \nWHEREAS, according to the Census Bureau in the state of Ohio the unemployment rate for veterans is 3.1 and there are approximately 1,236 homeless veterans; and\n \nWHEREAS, Columbus, Ohio is strengthened by the over 60,000 military veterans who make this city our home, they contribute to the rich economy, culture, and life in the city; and\n \nWHEREAS, MILVETS a 501(c)(3) charitable organization supports and sponsors Veterans activities through their Armed Forces Day luncheon, The Veterans Day Parade, and providing 11 scholarships to ROTC, JROTC, Veterans and children/grandchildren of Veterans; and\n \nWHEREAS, this Council honors the strength and sacrifices of the families, caregivers, and survivors of our veterans and our current service members; and\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: \n \nThat this Council does hereby honor and celebrate November 11th, 2022 as Veterans Day and the month of November as Veterans and Military Families Month and applauds MILVETS for their commitment to support Veterans in Columbus.\n \nThat this Council does declare the week of November 7th as Veterans Week in the city of Columbus and honor and celebrate the month of November as Veterans and Military Families Month and applauds MILVETS for their commitment to support Veterans in Columbus.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 61,
    "meeting_date": "2022-11-07",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}