{
  "success": true,
  "vote": {
    "id": 4992,
    "item_number": "CA-34",
    "title": "To authorize the Director of the Department of Public Utilities to enter into a two (2) year professional services agreement with Dynotec, Inc. for the Near North & East Area Large Diameter Rehabilitation - Phase 3- Franklin Park Area & Goodale Park Area; to amend the 2022 Capital Improvement Budget; to authorize the transfer within, and the expenditure of $698,084.13 from the Sewer G.O. Bond Fund. ($698,084.13)",
    "description": "Explanation\n \n1. BACKGROUND: This legislation authorizes the Director of Public Utilities to enter into a contract for the Near North & East Area Large Diameter Rehabilitation - Phase 3- Franklin Park Area & Goodale Park Area, CIP 650725-100018. This project will provide the design for rehabilitation of approximately 4,900 linear feet of combined sewer, ranging in diameters from 39 to 60-inch, and twenty two (22) associated manholes in addition to five (5) cross bore removals. Approximately 2,500 linear feet of the sewers to be rehabilitated are located in the Near East area near Franklin Park, and 2,400 linear feet of the sewers are located in the Goodale Park area.\nPlanning Area - 99 - Citywide\n \n2. PROCUREMENT:  The Division advertised for a Request for Proposals (RFP’s) for the subject services on the City’s Vendor Services website and the Bonfire website and were opened on September 2, 2022 in accordance with the overall provisions of Section 329 of the Columbus City Codes. The Division of Sewerage and Drainage received three (3) responses. The proposals were evaluated by the Evaluation Committee and scored them based on the criteria within Columbus City Codes Chapter 329.  The Department of Public Utilities recommends the agreement be awarded to Dynotec, Inc.\n \n1.                     Dynotec, Inc.\n2.                     Stantec Consulting Services Inc.\n3.                     VS Engineering, Inc.\n \n \n3. CONTRACT COMPLIANCE:  31-1319961 | MBE | EXP 4/18/2024 | Vendor # 005053\n \n4. TIMELINE:  The contract duration is for two (2) years, starting upon the date of Contract Execution with the estimated ending date of December 2024. \n5. EMERGENCY DESIGNATION:  An emergency designation is not requested at this time. \n6. ECONOMIC IMPACT: The rehabilitation is required to restore the hydraulic capacity of existing infrastructure and to rehabilitate the sewer trunk mains so as to extend the assets remaining useful life while minimizing the risk of asset failures.\n7. FUTURE MODIFICATIONS / RENEWALS: No contract modifications are anticipated at this time; however, construction exigency might later compel modification of this contract, if unforeseen difficulties are encountered.\n8. FISCAL IMPACT: This ordinance authorizes the transfer within, and the expenditure of $698,084.13 within the Sewer G.O. Bond Fund, as well as an amendment to the 2022 Capital Improvements Budget.\n \nTitle\n \nTo authorize the Director of the Department of Public Utilities to enter into a two (2) year professional services agreement with Dynotec, Inc. for the Near North & East Area Large Diameter Rehabilitation - Phase 3- Franklin Park Area & Goodale Park Area; to amend the 2022 Capital Improvement Budget; to authorize the transfer within, and the expenditure of $698,084.13 from the Sewer G.O. Bond Fund. ($698,084.13)\n \nBody\n \nWHEREAS, Requests for Proposals were opened on September 2, 2022 pursuant to the overall requirements within Columbus City Code 329 and Dynotec, Inc. was selected based upon the City’s Request for Proposal evaluation process; and\n \nWHEREAS, it is necessary to authorize the Director of Public Utilities to enter into a professional engineering service agreement with Dynotec, Inc. for the Near North & East Area Large Diameter Rehabilitation - Phase 3- Franklin Park Area & Goodale Park Area, CIP 650725-100018; and\n \nWHEREAS, it is necessary to authorize a transfer within and an expenditure of $698,084.13 from the Sewer G. O. Bond Fund 6109, for the Division of Sewerage and Drainage; and\n \nWHEREAS, it is necessary to authorize an amendment to the 2022 Capital Improvements Budget; and\n \nWHEREAS, It has become necessary in the usual daily operation of the Department of Public Utilities, Division of Sewerage and Drainage, to authorize the Director of Public Utilities to enter into a professional engineering service agreement with Dynotec, Inc. for the Near North & East Area Large Diameter Rehabilitation - Phase 3- Franklin Park Area & Goodale Park Area, CIP 650725-100018 for the preservation of the public health, peace, property, safety and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Public Utilities is hereby authorized to enter into a two (2) year professional engineering service agreement with Dynotec, Inc., 2931 E. Dublin-Granville Road. Suite 200\nColumbus, OH 43231, for the Near North & East Area Large Diameter Rehabilitation - Phase 3- Franklin Park Area & Goodale Park Area, CIP 650725-100018 in accordance with the terms and conditions as shown in the agreement on file in the office of the Division of Sewerage and Drainage.\n \nSECTION 2. That the expenditure of $698,084.13 is hereby authorized from the Sewer General Obligations Bond Fund.\n \nSECTION 3. That the transfer of $698,084.13 is hereby authorized from within the Sewer General Obligations Bond Fund.\n \nSECTION 4. That the 2022 Capital Improvement Budget is amended as per the accounting codes as attached to this ordinance.\n \nSECTION 5. That the said firm, Dynotec, Inc., shall perform the work to the satisfaction of the Director of Public Utilities and the Administrator of the Division of Sewerage and Drainage.\n \nSECTION 6.  That the City Auditor is hereby authorized to transfer any unencumbered balance in the project account to the unallocated balance within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project; except that no transfer shall be made from a project by monies from more than one source. \n \nSECTION 7. That the City Auditor is authorized to establish proper project accounting numbers as appropriate.\n \nSECTION 8.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 9.  That the funds necessary to carry out the purpose of this Ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 10.   That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 61,
    "meeting_date": "2022-11-07",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}