{
  "success": true,
  "vote": {
    "id": 5050,
    "item_number": "CA-14",
    "title": "To authorize the appropriation of $60,300.00 from the unappropriated balance of the Columbus City Schools, Telephone Services subfund, to the Department of Technology, Information Services Division, Information Services Operating fund, Telephone Services subfund; to authorize the Director of the Department of Finance and Management, on behalf of the Department of Technology, to associate all General Budget Reservations resulting from this ordinance with the appropriate Universal Term Contract/ Purchase Agreement for professional services to manage and upgrade Columbus City Schools’ Cisco voice-over-internet-protocol (VOIP) environment; to authorize the expenditure of $60,300.00 from the Department of Technology, Information Services Operating fund, Columbus City Schools Telephone Services subfund; and to declare an emergency. ($60,300.00)",
    "description": "Explanation\nThis ordinance authorizes the Director of the Department of Finance and Management, on behalf of the Department of Technology (DoT), to associate all General Budget Reservations resulting from this ordinance with the appropriate Purchase Agreement (PA) for professional services needed to manage and upgrade the Columbus City Schools’ Cisco voice-over-internet-protocol (VOIP) environment. \nPer ordinance 2557-2017 (and exhibits) passed by City Council on October 30, 2017, this on-going project is a collaborative partnership between the City of Columbus and Columbus City Schools (CCS). Over the past several years, as the city has expanded and upgraded its VOIP solution, services and equipment have been made available to CCS. CCS, in turn, reimburses the city for incurred costs, including maintenance and license renewals, phone and data charges, staff augmentation, etc. When received, these funds are deposited into a special subfund, created expressly to account for the project’s revenues and expenditures. The moneys for the above-described services are available in this special subfund for this purpose.\nThis phase of the city’s project with CCS involves upgrading CCS’ VOIP environment from version 11.5 to version 14.x, thus ensuring that CCS will retain current voicemail and email functionality. These professional services will be procured from pre-established universal term contract/purchase agreement PA005605- CDWG, expiring 1-30-2025.\nThis ordinance also authorizes the appropriation of $60,300.00 in the Information Services Operating Fund, Columbus City Schools (CCS) Telephone Services subfund. These are a portion of funds that CCS has most recently submitted to the City of Columbus, Department of Technology (DoT) to pay for supplies, services and capital equipment associated with the Voice-over-Internet-Protocol (VOIP) telephone project.\nFinally, this ordinance also authorizes the expenditure of $60,300.00 from the Information Services Fund, Columbus City Schools Telephone Services subfund for above-described purpose. \nFISCAL IMPACT\nFunds for the above-described purchase, once appropriated, are budgeted and available in the Information Services Operating fund, Columbus City Schools Telephone Services subfund.\nCONTRACT COMPLIANCE\nCDW Government\nVendor # - 034427\nCC # - 36-4230110, Expires 1/15/2023\nEMERGENCY\nThis ordinance is being submitted as an emergency measure to ensure that funds are in place prior to the City Auditor’s year-end closing.\n \nTitle\nTo authorize the appropriation of $60,300.00 from the unappropriated balance of the Columbus City Schools, Telephone Services subfund, to the Department of Technology, Information Services Division, Information Services Operating fund, Telephone Services subfund; to authorize the Director of the Department of Finance and Management, on behalf of the Department of Technology, to associate all General Budget Reservations resulting from this ordinance with the appropriate Universal Term Contract/ Purchase Agreement for professional services to manage and upgrade Columbus City Schools’ Cisco voice-over-internet-protocol (VOIP) environment; to authorize the expenditure of $60,300.00 from the Department of Technology, Information Services Operating fund, Columbus City Schools Telephone Services subfund; and to declare an emergency. ($60,300.00)\n \nBody\nWHEREAS, on October 31, 2017, the City of Columbus and Columbus City Schools entered into a collaborative partnership for a Voice-over-Internet-Protocol solution with the passage of ordinance 2557-2017; and\nWHEREAS, pursuant to the above noted ordinance and all attachments and exhibits, Columbus City Schools periodically provides funds to the City of Columbus for incurred costs; and\nWHEREAS, these funds are deposited into a special subfund, created expressly for the purpose of accounting for the project’s revenues and expenditures; and\nWHEREAS, there are currently sufficient moneys in the above-mentioned special subfund to appropriate $60,300.00 for the purpose described in the background of this ordinance; and\nWHEREAS, the Department of Technology desires to procure professional services via an established purchase agreement with CDWG to manage and upgrade the Columbus City Schools’ Cisco voice-over-internet-protocol (VOIP) environment; and\nWHEREAS, Purchase Agreement PA005605 with CDW Government was established by ordinance 3266-2021 on December 13, 2021 to facilitate purchases as described above; and\nWHEREAS, it is necessary to authorize the Director of Finance and Management, on behalf of the Department of Technology, to associate all General Budget Reservations resulting from this ordinance with the appropriate Purchase Agreement; and\nWHEREAS, an emergency exists in the usual daily operation of the Department of Technology in that it is immediately necessary to authorize the Director of the Department of Finance and Management, on behalf of the Department of Technology, to associate all General Budget Reservations resulting from this ordinance with the appropriate Purchase Agreement to ensure that funds are in place prior to the City Auditor’s year-end closing all for the immediate preservation of the public health, peace, property, safety and welfare; NOW, THEREFORE:\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1. That the City Auditor be and is hereby authorized and directed to appropriate $60,300.00 to the Department of Technology, Information Services Division, Information Services Operating Fund, Columbus City Schools (CCS) Telephone Services subfund, as follows in the attachment to this ordinance. (See 2947-2022EXP)\nSECTION 2. That the Finance and Management Director, on behalf of the Department of Technology, be and is hereby authorized to associate all General Budget Reservations resulting from this ordinance with the appropriate, previously established purchase agreement with CDWG to procure professional services to manage and upgrade the Columbus City Schools’ Cisco voice-over-internet-protocol environment; and\n SECTION 3. That the total expenditure of $60,300.00, or so much thereof as may be necessary, is hereby authorized as provided on the attachment to this ordinance. (see 2947-2022EXP)\nSECTION 4. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\nSECTION 5. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\nSECTION 6. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure, and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 62,
    "meeting_date": "2022-11-14",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}