{
  "success": true,
  "vote": {
    "id": 5112,
    "item_number": "SR-3",
    "title": "To authorize the Director of Finance and Management to enter into contract with Ourisman Ford of Manassas, on behalf of the Recreation and Parks Department, for the purchase of equipment; to authorize the expenditure of $118,313.73 from the Recreation and Parks Voted Bond Fund; to waive the competitive bidding provisions of Columbus City Code Chapter 329; and to declare an emergency. ($118,313.73)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Director of Finance and Management to enter into contract with Ourisman Ford of Manassas, on behalf of the Recreation and Parks Department, for the purchase of one chipper truck for the Forestry Section. The amount being authorized by this ordinance is $118,313.73. \n \nLast summer, in 2021, the Purchasing Office solicited bids for the purchase of one chipper truck and the award was made, in the amount of $116,121.50, following formal bid procedures in accordance with City Code 329. Unfortunately, the Forestry Section is still waiting on delivery of this vehicle due to delays in availability of parts from manufacturers and it is unknown when this vehicle will be delivered. Recently in 2022, the Purchasing Office solicited bids for the purchase of six new chipper trucks following the Best Value Procurement method for formal bids in accordance with City Code 329.  The award for these six trucks is still pending and range in unit price from $156,468.00 to $167,430.00. The expected delivery timeframe for these six trucks is not until the last quarter of 2023.  \n \nAs a result of these delays in the formal procurement of new chipper trucks, it is necessary to waive competitive bidding provisions of City Code 329 in order to enter into contract with Ourisman Ford of Manassas for the immediate purchase of one chipper truck. The Forestry section has an immediate need to purchase a chipper truck because the increasing number of large work vehicles that are out-of-commission from breakdowns and unscheduled maintenance is preventing staff from performing necessary work.  The City Purchasing Office and the Division of Fleet Management have acknowledged delays in delivery of new equipment and parts necessary to complete repairs on existing equipment. The City Forester has located multiple trucks from national distributors that would meet the City’s needs that are immediately available for purchase and delivery. Pricing was received for three available chipper trucks and it was determined that the pricing was in line with what we have been quoted for similar vehicles through the formal bidding process. Most importantly, these available chipper trucks are available for immediate delivery. This truck will be ordered immediately upon the approval of this ordinance and resulting purchase order. The existing chipper truck that this new one will replace is 16 years old and will be retired from our fleet as soon as we are able to get more chipper trucks in service. \n \nVendor Bid/Proposal Submissions (ODI designation status):\n \nThe City Forester gathered multiple quotes from distributors for Chipper Trucks that will meet the immediate needs of the Forestry Section. The City Forester has recommended the purchase of one chipper truck that is immediately available for purchase and delivery. Four (4) quotes were received. Ourisman Ford of Manassas was the lowest and most responsive bidder that did meet specifications. The lowest quote was for a Chevy 5500 that was determined to have a Gross Vehicle Weight Rating (GVWR) that is too low and not adequate for safety reasons.\n \nJim Reed's Truck Sales, Inc. (MAJ): 2022 Freightliner M2, 26k GVWR regular cab, 14' chipper body, air brakes: $121,190.00\nJim Reed’s Truck Sales, Inc. (MAJ): 2023 Freightliner M2, 26k GVWR extended cab, 14' chipper body, air brakes: $137,190.00\nOurisman Ford of Manassas (MAJ): 2023 F65F Regular Cab 26k GVWR, 14' chipper body, hydraulic brakes: $118,313.73\nCustom Truck One Source (MAJ): Chevy 5500 regular cab, 23k GVWR, 11.5' chipper body, hydraulic brakes $99,750\n \nPrincipal Parties: \nMon Mothma, LLC DBA Ourisman Ford of Manassas\n8980 Mathis Avenue\nManassas, Virginia  20110\nDavid Powers, (703) 366-3310\nTax ID: 87-3328608\n \nEmergency Justification: Emergency action is requested in order to have equipment delivered and available as soon as possible in order to allow the Forestry Section to perform necessary work, including hazardous tree removals and pruning for the safety of Columbus residents. The availability of chipper trucks needed to keep the Forestry Section operating has been greatly impacted by delays in the delivery of new equipment and parts necessary to complete repairs on existing equipment caused by the global supply chain issues.  \n \nBenefits to the Public: Parkland and street trees maintained by the Forestry Section enhance the quality of life of our citizens. The equipment will allow for the continued upkeep of city parkland and trees, including hazardous tree removals and pruning for the safety of Columbus residents\n \nCommunity Input/Issues: The community has expressed a desire for safe and well-maintained city parkland and street trees.  \n \nArea(s) Affected:  Citywide (99)\n \nMaster Plan Relation:  This purchase will support the mission of the Recreation and Parks Master Plan by helping to ensure that trees and parks remain safe and well maintained.\n \nFiscal Impact: $118,313.73 is budgeted and available from within the Voted Recreation and Parks Bond Fund 7702 to meet the financial obligations of this expenditure. An existing Auditor’s Certificate (ACPR002359), authorized by Ordinance 2040-2021 for the Urban Forestry Master Plan, will be used to fund this expenditure.\n \nTitle\n \nTo authorize the Director of Finance and Management to enter into contract with Ourisman Ford of Manassas, on behalf of the Recreation and Parks Department, for the purchase of equipment; to authorize the expenditure of $118,313.73 from the Recreation and Parks Voted Bond Fund; to waive the competitive bidding provisions of Columbus City Code Chapter 329; and to declare an emergency. ($118,313.73)\n \nBody\n \nWHEREAS, it is necessary to authorize the Director of Finance and Management to enter into contract with Ourisman Ford of Manassas on behalf of the Recreation and Parks Department for the purchase of equipment; and\n \nWHEREAS, it is in the best interest of the City of Columbus to waive the competitive bidding provisions of Columbus City Code Chapter 329 to enter into this contract; and\n \nWHEREAS, it is necessary to authorize the expenditure of $118,313.73 from the Recreation and Parks Voted Bond Fund 7702; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Recreation and Parks Department in that it is immediately necessary to authorize the Director of Finance and Management to enter into contract with Ourisman Ford of Manassas in order to have equipment delivered and available as soon as possible so the Forestry Section can perform necessary work, including hazardous tree removals and pruning for the safety of Columbus residents, and the availability of chipper trucks needed has been greatly impacted by delays in the delivery of new equipment and parts necessary to complete repairs on existing equipment caused by the global supply chain issues; NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Finance and Management is hereby authorized to enter into contract with Ourisman Ford of Manassas, on behalf of the Recreation and Parks Department, for the purchase of one chipper truck for the Forestry Section.\n \nSECTION 2. That this Council finds it in the best interest of the City of Columbus to waive the competitive bidding provisions of Columbus City Code Chapter 329 to enter into this contract.\n \nSECTION 3. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 4. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contract or contract modifications associated with this ordinance. \n \nSECTION 5. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 6. That the expenditure of $118,313.73 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Voted Recreation and Parks Bond Fund 7702. $118,313.73 is hereby authorized from an existing Auditor’s Certificate (ACPR002359), authorized by Ordinance 2040-2021 for the Urban Forestry Master Plan, to fund this expenditure.\n \nSECTION 7. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 62,
    "meeting_date": "2022-11-14",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}