{
  "success": true,
  "vote": {
    "id": 5119,
    "item_number": "SR-10",
    "title": "To authorize and direct the City Auditor to set up a certificate in the amount of $1,945,483.00 for the purchase of equipment for the Division of Refuse Collection; to authorize and direct the Director of Public Service and the Director of Finance and Management, on behalf of the Division of Refuse Collection, to enter into various contracts for the purchase of equipment; to authorize the expenditure of $1,945,483.00 from the Division of Refuse Collection General Fund; and to declare an emergency. ($1,945,483.00)",
    "description": "Explanation\n \n1. BACKGROUND\nThis ordinance authorizes the City Auditor to set up a certificate in the amount of $1,945,483.00 for the purchase of equipment for the Division of Refuse Collection.  All bids will be obtained and contracts awarded in compliance with the relevant provisions of the Columbus City Code, Chapter 329. This ordinance will set up all of the funding required to enter into contracts with the vendors on an as-needed basis. Competitive bids will be solicited and opened by the Division of Refuse Collection and Purchasing Office or obtained through current, pending or future universal term contracts established by Finance and Management. Brass tags for equipment to be purchased will be submitted to the Division of Fleet Management, and all specifications for equipment to be purchased and brass tagged will be approved by the Division of Fleet Management prior to acquisition.  \n \n2. FISCAL IMPACT\nThis ordinance will encumber funds from the Division of Refuse Collection General Fund 1000, Object Level 06, and Main Account 66520, balance of $1,945,483.00 ($1,945,483.00).\n \n3. EMERGENCY JUSTIFICATION\nEmergency action is requested in order to expedite ordering of essential equipment for the Division of Refuse Collection. It has been realized that, due to supply chain concerns impacting equipment globally, some equipment orders are projected to take a year or more to be fulfilled. This ordinance is establishing the funding required for the equipment being purchased and will allow the Department of Public Service to order equipment needed as soon as it becomes available. \n \nTitle\n \nTo authorize and direct the City Auditor to set up a certificate in the amount of $1,945,483.00 for the purchase of equipment for the Division of Refuse Collection; to authorize and direct the Director of Public Service and the Director of Finance and Management, on behalf of the Division of Refuse Collection, to enter into various contracts for the purchase of equipment; to authorize the expenditure of $1,945,483.00 from the Division of Refuse Collection General Fund; and to declare an emergency. ($1,945,483.00)\n \nBody\n \nWHEREAS, it is necessary to authorize the City Auditor set up a certificate in the amount of $1,945,483.00 for the purchase of equipment for the Division of Refuse Collection; and\n \nWHEREAS, it is necessary to authorize the Director of Finance and Management to enter into various contracts for the purchase of equipment on behalf of the Division of Refuse Collection; and\n \nWHEREAS, the Purchasing Office will solicit competitive bids to acquire various equipment for the Division of Refuse Collection in accordance with the relevant provisions of the Columbus City Code, Chapter 329; and\n \nWHEREAS, brass tags for equipment to be replaced will be submitted to the Division of Fleet Management, and all specifications for equipment to be purchased and brass tagged will be approved by the Division of Fleet Management prior to acquisition;\n \nWHEREAS, funding is budgeted and available from within the Division of Refuse Collection General Fund 1000 to meet the financial obligations of these various expenditures; and\n \nWHEREAS, it is necessary to authorize the expenditure of $1,945,483.00 from the Division of Refuse Collection General Fund 1000; and\n \nWHEREAS, it has been realized that, due to supply chain concerns impacting equipment globally, some equipment orders are projected to take a year or more to be fulfilled, so it is necessary to establish the funding required for the equipment being purchased and will allow the Department of Public Service to order equipment needed as soon as it becomes available; and \n \nWHEREAS, an emergency exists in the usual daily operations of the Department of Public Service, Division of Refuse Collection, in that it is immediately necessary to authorize the Director of Finance and Management, on behalf of the Division of Refuse Collection, to enter into various contracts for the purchase of equipment in order to have it delivered and available as soon as possible, all for the preservation of public health, peace, property, safety, and welfare; NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the City Auditor is hereby authorized to set up a certificate in the amount of $1,945,483.00 for the purchase of equipment for the Division of Refuse Collection.\n \nSECTION 2. That the Director of Public Service and the Director of Finance and Management are hereby authorized to enter into contracts for the purchase of equipment on behalf of the Division of Refuse Collection in accordance with the relevant provisions of the Columbus City Code Chapter 329.\n \nSECTION 3. That the brass tags for equipment to be replaced will be submitted to the Division of Fleet Management, and all specifications for equipment to be purchased and brass tagged will be approved by the Division of Fleet Management prior to acquisition.\n \nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \nSECTION 6. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\nSECTION 7. That the expenditure of $1,945,483.00 or so much thereof as may be necessary, be and is hereby authorized from the Division of Refuse Collection General Fund 1000 per the accounting codes in the attachment to this ordinance. \n \nSECTION 8.  That this Council hereby recognizes that this ordinance does not identify specific contractors or vendors for the expenditure purposes authorized herein and hereby delegates sole and final contracting decisions relative to the determination of lowest, best, most responsive and most responsible vendor(s), pursuant to city code, to the Director of Finance and Management and the Director of Public Service. \n \nSECTION 9.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten (10) days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 62,
    "meeting_date": "2022-11-14",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Economic Development"
    ]
  }
}