{
  "success": true,
  "vote": {
    "id": 5134,
    "item_number": "CA-5",
    "title": "To authorize the Director of Development to amend the Jobs Growth Incentive AGREEMENT with SK Food Group, Inc. to include an additional site at which eligible New Employees, as defined in the AGREEMENT can first be employed, to revise the project scope related to projected net new employment, payroll and investment, to extend the length of the incentive term by one (1) year, to reset the start date of the incentive term and to declare an emergency.",
    "description": "Explanation\n \nBACKGROUND: The City of Columbus (“CITY”) entered into a Jobs Growth Incentive Agreement (hereinafter “AGREEMENT”) with SK Food Group, Inc. (also referred to as the “GRANTEE”) effective March 29, 2022.  Columbus City Council approved the AGREEMENT by Ordinance Number 2751-2021, adopted November 15, 2021, and granted a dual-rate financial incentive based on an amount equal to (i) thirty percent (30%) of the City of Columbus income tax withheld on the Columbus payroll of New Employees at the Project Site and (ii) thirty-five percent (35%) of the City of Columbus income tax withheld on the Columbus payroll of those New Employees at the Project site who are also City of Columbus residents at the end of each calendar year, commencing on January 1, 2022 for five (5) consecutive years thereafter (i.e. January 1, 2022 through December 31, 2026) based on the investment of approximately $18,000,000.00 comprised of approximately $10,000,000.00 in leasehold improvements, $8,000,000.00 in machinery and equipment and entering into a long-term lease agreement to establish new operations (the “PROJECT”) at a vacant industrial warehouse consisting of approximately 144,000 square feet at 2955-3035 Charter Street, Columbus, Ohio 43228 (the “PROJECT SITE”) and create 305 net new full-time permanent positions with projected cumulative annual payroll at the end of the five (5) year term of approximately $13,341,917.00.\n \nBased on correspondence between the CITY and the GRANTEE, the GRANTEE has advised the CITY of having issues with the owner of the PROJECT SITE which have delayed the start of the PROJECT.  Additionally, the GRANTEE has also advised the CITY of their intent to expand the scope of the PROJECT to include an additional location at which to establish additional operations by entering into a long term lease at 2099 Wright Brothers Avenue, Columbus, Ohio 43217 which they project will result in an additional 35 net new employees, an additional projected $1,745,000.00 in commensurate payroll and an additional investment of approximately $7,100,000.00 comprised of $700,000.00 in leasehold improvements, $6,000,000.00 in machinery and equipment and $400,000.00 in IT expenditures.  The CITY has agreed, based on the additions to the scope of the PROJECT, to (i) add 2099 Wright Brothers Avenue, Columbus, Ohio 43217 to the PROJECT SITE, (ii) to revise the project scope related to projected net new employment, payroll and investment, (iii) to revise the length of the incentive term from five (5) years to six (6) years, and (iv) to reset the start date of the incentive term to commence on January 1, 2023 and for six (6) consecutive years thereafter (i.e. January 1, 2023 through December 31, 2028).\n \nThis legislation is being presented as an emergency measure in order for this amendment to be legislated in as expedient manner as possible so that this amendment to the AGREEMENT might be fully executed prior to the commencement of the PROJECT so that the GRANTEE is able to move forward with PROJECT as described in the AGREEMENT.\n \nFISCAL IMPACT: No funding is required for this legislation.\n \n \nTitle\n \nTo authorize the Director of Development to amend the Jobs Growth Incentive AGREEMENT with SK Food Group, Inc. to include an additional site at which eligible New Employees, as defined in the AGREEMENT can first be employed, to revise the project scope related to projected net new employment, payroll and investment, to extend the length of the incentive term by one (1) year, to reset the start date of the incentive term and to declare an emergency.\n \n \nBody\n \nWHEREAS,                     Columbus City Council approved a Jobs Growth Incentive Agreement (the “AGREEMENT”) with SK Food Group, Inc. (also referred to as the “GRANTEE”) by Ordinance Number 2751-2021 on November 15, 2021 with the AGREEMENT having been made and entered into effective March 29, 2022; and\n \nWHEREAS,                     the AGREEMENT granted a dual-rate financial incentive based on an amount equal to (i) thirty percent (30%) of the City of Columbus income tax withheld on the Columbus payroll of New Employees at the Project Site and (ii) thirty-five percent (35%) of the City of Columbus income tax withheld on the Columbus payroll of those New Employees at the Project site who are also City of Columbus residents at the end of each calendar year, commencing on January 1, 2022 for five (5) consecutive years; and\n \nWHEREAS,                     in the AGREEMENT, the GRANTEE committed to the investment of approximately $18,000,000.00 comprised of approximately $10,000,000.00 in leasehold improvements, $8,000,000 in machinery and equipment and entering into a long-term lease agreement on in establishing new operations (the “PROJECT”) at a vacant industrial warehouse consisting of approximately 144,000 square feet at 2955-3035 Charter Street, Columbus, Ohio 43228 (the “PROJECT SITE”) and create 305 net new full-time permanent positions with projected cumulative annual payroll at the end of the five (5) year term of approximately $13,341,917.00; and\n \nWHEREAS,                     based on correspondence between the CITY and the GRANTEE, the GRANTEE has advised the CITY of having issues with the owner of the PROJECT SITE which have delayed the start of the PROJECT; and\n \nWHEREAS,                     the GRANTEE has also advised the CITY of their intent to expand the scope of the PROJECT to include an additional location at which to establish additional operations by entering into a long term lease at 2099 Wright Brothers Avenue, Columbus, Ohio 43217 which they project will result in an additional 35 net new employees, an additional projected $1,745,000.00 in commensurate payroll and an additional investment of approximately $7,100,000.00 comprised of $700,000.00 in leasehold improvements, $6,000,000.00 in machinery and equipment and $400,000.00 in IT expenditures; and\n \nWHEREAS,                     the CITY has agreed, based on the additions to the scope of the PROJECT, to (i) add 2099 Wright Brothers Avenue, Columbus, Ohio 43217 to the PROJECT SITE, (ii) to revise the project scope related to projected net new employment, payroll and investment, (iii) to revise the length of the incentive term from five (5) years to six (6) years, and (iv) to reset the start date of the incentive term to commence on January 1, 2023 and for six (6) consecutive years thereafter (i.e. January 1, 2023 through December 31, 2028); and\n \nWHEREAS,                     an emergency exists in the usual daily operation of the Columbus Department of Development in that it is immediately necessary to authorize the Director to amend the Jobs Growth Incentive Agreement with SK Foods, Inc. to include an additional site at which eligible New Employees, as defined in the AGREEMENT can first be employed, to revise the project scope related to projected net new employment, payroll and investment, to extend the term of the AGREEMENT by one (1) additional year and to reset the start date of the incentive term in order to remain in compliance with the obligations and commitments as described in the AGREEMENT prior to the commencement of the PROJECT as described in the AGREEMENT, such action being necessary for the immediate preservation of the public peace, property, health or safety.\n \nNOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF COLUMBUS\n \nSECTION 1.                     That the Director of Development is authorized to amend the Jobs Growth Incentive Agreement with SK Foods Group, Inc. (the AGREEMENT) to add 2099 Wright Brothers Avenue, Columbus, Ohio 43217 as an additional site at which eligible New Employees, as defined in the AGREEMENT, can first be employed.\n \nSECTION 2.                     That the Director of Development is authorized to revise the project scope related to projected net new employment and payroll by increasing the number of projected net new full-time positions by an additional 35 net new positions with a commensurate increase in projected net new payroll by approximately $1,745,000.00.\n \nSECTION 3.                     That the Director of Development is authorized to revise the project scope related to projected investment by an additional investment of approximately $7,100,000.00 comprised of $700,000.00 in leasehold improvements, $6,000,000.00 in machinery and equipment and $400,000.00 in IT expenditures.\n \nSECTION 4.                     That the Director of Development is authorized to revise the length of the incentive term from five (5) years to six (6) years.\n \nSECTION 5.                     That the Director of Development is authorized to reset the start date of the incentive term to commence on January 1, 2023 and for six (6) consecutive years thereafter (i.e. January 1, 2023 through December 31, 2028).\n \nSECTION 6.                     That the amendment to the City of Columbus Jobs Growth Incentive Agreement be signed by SK Food Group, Inc. within ninety (90) days of passage of this ordinance, or this ordinance and the incentive authorized herein shall be null and void.\n \nSECTION 7.                     That for reasons stated in the preamble hereto, which is hereby made a part hereof, the ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after the passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 63,
    "meeting_date": "2022-11-21",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Economic Development",
      "Emergency Services"
    ]
  }
}