{
  "success": true,
  "vote": {
    "id": 514,
    "item_number": "SR-2",
    "title": "To authorize the Director of the Department of Finance and Management to enter into a Memorandum of Understanding (MOU) with the Franklin County Board of Commissioners that outlines the terms for the purchase of property for the future construction of a new building to house the Municipal Court operations and City offices associated with the Court; and to declare an emergency.",
    "description": "Explanation\n \nBackground: This legislation authorizes the Director of the Department of Finance and Management to enter into a Memorandum of Understanding (MOU) with the Franklin County Board of Commissioners that outlines the mutually agreed upon terms for inclusion in a future real estate purchase contract for the City’s acquisition of property identified as Franklin County Parcels 010-66679 and 010-066874, located at the southeast corner of Mound and High Streets. The City will acquire the site for the future construction of a new facility to house the operations of the Municipal Court and Municipal Court Clerk and other City offices associated with the Court. Municipal Court operations are currently located at 375 S. High Street in a county-owned building that was built in 1979 and leased by the City. \n \nWhile the current building would require major upgrades in technology, security and space, it has been determined that it is in the best interest of the City to construct a new facility to support the operations of the Court and the offices associated with its work. The location of the new facility at this site will ensure continued connectivity between the municipal and county court systems and the offices located at the City Hall Campus.\n \nEmergency action is requested to allow the parties to engage in the Memorandum of Understanding at the earliest time available to allow the City to move forward with necessary contracts to design and construct the new Municipal Court facility.\n \nFiscal Impact: No funding is required for this legislation. However, the City and County have mutually agreed to a purchase cost of $7,000,000.00 and that this amount to be a fair amount for the purchase of the land.  The City will pay the County in two (2) installments. Half of the purchase price or $3,500,000.00 will be paid March 1, 2022 and the other $3,500,000.00 will be paid at closing, which shall be at substantial design completion or September 1, 2024, whichever is earliest.\n \n \nTitle\n \nTo authorize the Director of the Department of Finance and Management to enter into a Memorandum of Understanding (MOU) with the Franklin County Board of Commissioners that outlines the terms for the purchase of property for the future construction of a new building to house the Municipal Court operations and City offices associated with the Court; and to declare an emergency.  \n \nBody\n \nWHEREAS, the City currently leases a building located at 375 S. High for the Franklin County Municipal Court and associated city operations; and\n \nWHEREAS, the existing building does not serve the operational needs of the present day Court; and \n \nWHEREAS, after significant study and discussion, it has been determined that it is in the best interest of the City to construct a new facility to support the operations of the Court and the offices associated with its work; and\n \nWHEREAS, a suitable site, located at the southeast corner of Mound and High Streets, owned by the Franklin County Board of Commissioners, has been identified for construction of the new court facility; and \n \nWHEREAS, the City and the Franklin County Board of Commissioners desire to enter into a Memorandum of Understanding (\"MOU\") that outlines their mutual understanding and the terms for inclusion in a future real estate purchase contract to acquire the site at Mound and High Streets; and \n \nWHEREAS, the City and County have mutually agreed to a purchase cost of $7,000,000.00 and, \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Finance and Management, in that it is immediately necessary to authorize the Director to enter into the Memorandum of Understanding without delay so that planning and other actions can begin, thereby preserving the public health, peace, property, safety and welfare; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  The Director of the Department of Finance and Management is hereby authorized to execute a Memorandum of Understanding with Franklin County Board of Commissioners outlining the terms and conditions to be incorporated into a future real estate purchase contract for acquiring those properties identified as Franklin County Parcels 010-66679 and 010-066874, located at the southeast corner of Mound and High Streets, for the future construction of a new municipal court facility.\n \nSECTION 2. That the City and County mutually agree to that the purchase of the property, known currently as Dorrian Commons will be purchased by the City in the amount of $7,000,000.00. The City will pay the County in two (2) installments. Half of the purchase price or $3,500,000.00 will be paid March 1, 2022 and the other $3,500,000.00 will be paid at closing, which shall be at substantial design completion or September 1, 2024, whichever is earliest.\n \nSECTION3.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approve nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 8,
    "meeting_date": "2021-03-22",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Emergency Services",
      "Property & Real Estate"
    ]
  }
}