{
  "success": true,
  "vote": {
    "id": 5185,
    "item_number": "SR-3",
    "title": "To authorize the Director of the Department of Development to enter into an Enterprise Zone Agreement with Broughton Investment, LLC and Xtreme Express, LLC (collectively, known as the “Enterprise”) for a tax abatement of seventy-five percent (75%) for a period of ten (10) consecutive years in consideration of the Enterprise investing approximately $11 million in real property improvements, the retention of eighty-one (81) full-time jobs with an estimated annual payroll of approximately $3.83 million and the creation of fifty (50) net new full-time permanent positions with an estimated annual payroll of approximately $2,649,700 at the Project Site.",
    "description": "Explanation\n \nBACKGROUND:  The Director of the Department of Development is requesting authorization to enter into an Enterprise Zone Agreement on behalf of the City with Broughton Investment, LLC (“Broughton Investment”) and Xtreme Express, LLC (“Xtreme Express”), (collectively, the “Enterprise”). The Ohio Enterprise Zone law Section 5709.62(C) of the Ohio Revised Code authorizes the City to enter into Council-approved tax abatement agreements between the City and qualifying companies. \n \nBroughton Investment is a real estate holding company owned by Brad Kitchen, President of Alterra Real Estate Advisors, and a commercial real estate broker which provides commercial real estate brokerage, property management services, and investment opportunities, to clients in Columbus, Ohio and throughout the US. \n \nFounded in 2014, Xtreme Express is a premier logistics firm based in Columbus, Ohio.  The company has been servicing Central Ohio residents and businesses since 2014 as their express and dedicated delivery experts. Xtreme Express utilizes the latest technology and equipment to offer one-hour and same-day services throughout the Midwest. \n \nThe Enterprise is proposing to invest a total project cost of approximately $14 million, which includes $11 million in real property improvements to construct and expand its existing warehouse distribution facility of approximately 42,965 sq. ft. by another 120,000 sq. ft. (the “Facility”) at 6611 Broughton Avenue, Columbus, Ohio 43213, parcel number 010-241763 (the “Project Site”).  Xtreme Express will be the tenant and employer of record, and enter into a lease agreement with Broughton Investment, the property owner.  Additionally, Xtreme Express will retain eighty-one (81) full-time jobs with annual payroll of approximately $3.83 million and create fifty (50) net new full-time permanent positions with an estimated annual payroll of approximately $2,649,700 at the proposed Project Site (“New Employees”).     \n \nThe Director of the Department of Development is recommending that Council approve a 75%/10-year Enterprise Zone tax abatement on real property improvements made by the Enterprise at the Project Site, in consideration of it creating, or causing to be created, the New Employees. \n \nThe Columbus City Schools District has been advised of this project.\n \nThis legislation is presented as 30-day legislation.\n \nFISCAL IMPACT:  \n \nNo funding is required for this legislation.  \n \n \nTitle\n \nTo authorize the Director of the Department of Development to enter into an Enterprise Zone Agreement with Broughton Investment, LLC and Xtreme Express, LLC (collectively, known as the “Enterprise”) for a tax abatement of seventy-five percent (75%) for a period of ten (10) consecutive years in consideration of the Enterprise investing approximately $11 million in real property improvements, the retention of eighty-one (81) full-time jobs with an estimated annual payroll of approximately $3.83 million and the creation of fifty (50) net new full-time permanent positions with an estimated annual payroll of approximately $2,649,700 at the Project Site.\n \n \nBody\n \nWHEREAS, the Columbus City Council authorized the designation of the City of Columbus  Enterprise Zone by legislation, Ordinance Number 779-85, dated April 22, 1985; and subsequently amended the Zone by Ordinance Nos. 2722-85 in 1986; 2080-89 in 1989; 1949-92, 2690-92 and 2249-92 in 1992; 1079-94 and 1228-94 in 1994; 2196-95 and 2817-95 in 1995; 0533-99 in 1999; 1785-00 in 2000; 1464-02 in 2002; 0225-03 in 2003; 0032-2012 in 2012; 1442-2020 in 2020, 0279-2021 in 2021; and 0736-2022 in 2022; and\n \nWHEREAS, the Director of the Development Department of the State of Ohio (“ODOD”) has determined that the Columbus Enterprise Zone (the “Zone”), as amended by the aforementioned Ordinances, continues to contain the characteristics set forth in Section 5709.61(A) of the Ohio Revised Code. The Director of ODOD has recertified this  Zone in 1986, December 20, 1989, September 28, 1992, October 22, 1992, December 17, 1992, May 31, 1994, June 24, 1994, June 16, 1995, October 5, 1995, December 19, 1995, April 1, 1999, September 25, 2000, January 27, 2003, August 19, 2003, April 3, 2012, September 18, 2020, May 20, 2021, and most recently on May 17, 2022 as an “urban jobs and enterprise zone” under Chapter 5709 of the Ohio Revised Code; and\n \nWHEREAS, Broughton Investment is a real estate holding company owned by Brad Kitchen, President of Alterra Real Estate Advisors, and a commercial real estate broker which provides commercial real estate brokerage, property management services, and investment opportunities, to clients in Columbus, Ohio and throughout the US; and\n \nWHEREAS, founded in 2014, Xtreme Express is a premier logistics firm based in Columbus, Ohio.  The company has been servicing Central Ohio residents and businesses since 2014 as their express and dedicated delivery experts. Xtreme Express utilizes the latest technology and equipment to offer one-hour and same-day services throughout the Midwest; and\n \nWHEREAS, Broughton Investment, LLC and Xtreme Express, LLC (collectively, known as the “Enterprise”) has submitted a proposal (“Proposal”) to invest approximately $11 million in real property improvements (the “Project”) to expand its existing industrial warehouse and distribution facility of approximately 42,965 sq. ft. by another 120,000 sq. ft. (the “Facility”) at 6611 Broughton Avenue, Columbus, Ohio, 43213, identified as parcel number 010-241763 (the “Project Site”). The Enterprise anticipates that the Project will retain eighty-one (81) full-time positions with an annual payroll of approximately $3.83 million and will create fifty (50) net new full-time permanent positions at the Facility with an estimated annual payroll of approximately $2,649,700 (“New Employees”); and \n \nWHEREAS, Broughton Investment, LLC will own the property while Xtreme Express, LLC will be the tenant and employer of record, and will enter into a long-term lease agreement with Broughton Investment, LLC to lease the Facility at the Project Site; and \n \nWHEREAS, after reviewing and investigating the Proposal submitted by the Enterprise, the  Director of the Department of Development believes that the Enterprise has demonstrated that it is qualified by financial responsibility and business experience to create and preserve employment opportunities in the Columbus Enterprise Zone and improve the City’s economic climate; and\n \nWHEREAS, the Director of the Department of Development is recommending that City Council approve a 10-year, 75% abatement on the assessed valuation of the Project Site due to construction of the $11 million addition, to incentivize the Enterprise to expand the Class A distribution and warehouse facility in the City’s Northeast corridor; and\n \nWHEREAS, the Columbus City School District has been advised of this project; and\n \nWHEREAS, the City desires to enter into  an agreement with the Enterprise in order to incentivize  economic growth and create employment opportunities for its citizens, and for the preservation of public health, peace, property and safety. \n \nNOW, THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     That Columbus City Council, having reviewed the proposal, finds that the Enterprise is qualified by financial responsibility and business experience to create and preserve employment opportunities in the City of Columbus Enterprise Zone and improve the City’s economic climate pursuant to Revised Code Section 5709.62(C). \n \nSECTION 2.                     That City Council finds and determines (1) that the Enterprise will create, or cause to be created, the New Employee positions in the State and City; (2) that the Project is economically sound and will benefit the people of the State and City by increasing opportunities for employment and strengthening the economy of the State and City; and (3) that receiving the aforementioned tax abatement is a critical factor in the decision by representatives for Broughton Investment, LLC and Xtreme Express, LLC, collectively, the Enterprise hereunder, to go forward with constructing the Project.\n \nSECTION 3.                     Based on this determination, City Council approves and authorizes a 10-year, 75% abatement on the increase in assessed valuation of real property on the Project Site, contingent upon the Enterprise investing approximately $11 million in real property improvements by constructing an addition of approximately 120,000 square-foot Class A distribution and warehouse facility at 6611 Broughton Avenue, Columbus, Ohio 43213, identified as parcel number 010-241763, the retention of eighty-one (81) full-time jobs with an estimated annual payroll of approximately $3.83 million and the creation fifty (50) net new full-time permanent positions with an estimated annual payroll of approximately $2,649,700 at the Project Site.\n \nSECTION 4.                     The Director of the Department of Development, for and in the name of the City, is authorized to enter into an Enterprise Zone Agreement with the Enterprise in a form substantially similar to the one attached hereto as Exhibit “A” with such changes, amendments or edits thereto, that are not inconsistent with the terms of this Ordinance, or adverse to the City. Such authorized amendment includes assignment of the Agreement from the Enterprise to a Related Member as defined in R.C. Section 5709.61(W), or to a Successor Enterprise as defined by R.C. Section 5709.61(Y). The Director of the Department of Development also is authorized to execute any other agreements or sign any documents necessary to effectuate the Agreement and the Exemption provided therein, and approved as to Form by the City Attorney, if required.\n \nSECTION 5.                     That the City and the Enterprise must execute the attached Enterprise Zone Agreement within ninety (90) days of this Ordinance’s passage, or this Ordinance, and the authorization to enter into the tax abatement agreement, is null and void.\n \nSECTION 6.                     That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 63,
    "meeting_date": "2022-11-21",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Economic Development"
    ]
  }
}