{
  "success": true,
  "vote": {
    "id": 5198,
    "item_number": "SR-16",
    "title": "To amend Ordinance #1652-2022, passed October 17, 2022 by editing Chapter 2550 to reinstate the ability of the Division of Police to issue hazardous material citations:, to correct a typographical error in order to mirror the Code of Federal Regulations and to make changes to reflect the correct section number of the fire code; and to declare an emergency.",
    "description": "Explanation\n \nBACKGROUND:  Ordinance #1652-2022, passed  October  17, 2022 enacted and amended various chapters of Title 25 - Fire Prevention Code of the City of Columbus to ensure alignment with the Ohio Fire Code, establish an appeals process for review of violations, and  established a new fee structure for certain permits, inspections, modifications and rates. However, this ordinance, 1652-2022 Section 2550.02 needs amended to; first, reinstate the ability of the Division of Police to issue hazardous material citations for all violations of this chapter. This change simply restores the prior status quo enforcement ability of Columbus Police which was inadvertently left out of ordinance 1652-2022. Second, the underlined proposed language of Section 2550.04 adds language to correct a typographical error in order to mirror the Code of Federal Regulations (CF). Again, this restores the prior status quo.  The underlined proposed  language of Section 2550.0.13.1 simply corrects an error by referencing the correct section number. This amendment does not alter any other requirements established by Ordinances #1652-2022.\n \nEMERGENCY DESIGNATION:    The Department of Public Safety requests emergency legislation to allow the Division of Police to continue with the issuance of hazardous material citations.\n \nTitle\n \nTo amend Ordinance #1652-2022, passed October 17, 2022 by editing Chapter 2550 to reinstate the ability of the Division of Police to issue hazardous material citations:, to correct a typographical error in order to mirror the Code of Federal Regulations and to make changes to reflect the correct section number of the fire code; and to declare an emergency.\n \n \nBody\n \nWHEREAS, Ordinance #1652-2022, passed  October  17, 2022 enacted and amended various chapters of Title 25 - Fire Prevention Code of the City of Columbus to ensure alignment with the Ohio Fire Code, establish an appeals process for review of violations, and  established a new fee structure for certain permits, inspections, modifications and rates, and\n \nWHEREAS, Ordinance, #1652-2022 Section 2550.02 needs amended to reinstate the ability of the Division of Police to issue hazardous material citations for all violations of this chapter, and\n \nWHEREAS, this change restores the prior status quo enforcement ability of Columbus Police which was inadvertently left out of ordinance 1652-2022, and\n \nWHEREAS, Section 2550.04 adds language to correct a typographical error in order to mirror the Code of Federal Regulations as well as restores the prior status quo that was inadvertently left out of ordinance #1652-2022, and \n \nWHEREAS,  the proposed  language of Section 2550.0.13.1 corrects an error by referencing the correct section number, and\n \nWHEREAS, all other aspects of Ordinance #1652-2022,  passed October 17, 2022 are unaffected by this amendment and remain in effect and all of Chapter 2550 are included below for consistency, and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Safety in that it is immediately necessary to authorize the Division of Police to continue to issue hazardous material citations without interruption, thereby preserving the public health, peace, property, safety, and welfare; NOW, THEREFORE \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the recently revised Columbus Fire Code, as adopted by Ordinance #1652-2022, passed on October 17, 2022, is hereby revised by edits to Chapter 2550 as follows:\n \nChapter 2550 - HAZARDOUS MATERIALS \n2550.01 Scope. This chapter of the Columbus Fire Prevention Code shall include in its entirety, and as changed from time to time, the OFC Rule 50, OAC 1301:7-7-50, Hazardous Materials. The following revisions and additions, if any, apply to this Article. \n2550.02 Enforcement. The Columbus Division of Police shall have the authority to enforce this chapter and issue citations for violations.\n \n2550.03 Hazardous Material Reporting. This chapter of the Columbus Fire Prevention Code shall include in its entirety, and as changed from time to time, the Ohio Fire Code (2017) Appendix H, Hazardous Materials Management Plan (HMMP) and Hazardous Materials Inventory Statement (HMIS) Instructions.\n2550.04 HAZARDOUS MATERIALS TRANSPORTATION.\n2550.04.1 Scope. The purpose and intent of this section is to protect the public health, safety, and welfare from the potential hazards of fire, explosion, and exposure to toxic substances that accompany a hazardous materials incident by regulating the transportation of hazardous materials in and through the City of Columbus. \n2550.04.2 General. This chapter shall apply to all hazardous materials as defined herein which are transported in and through the city of Columbus, and shall be in addition to all other sections of this code, and all other provisions of the Columbus City Ordinances regarding hazardous substances or materials, or any rules or regulations of other city departments, boards or commissions pertaining thereto. For the purpose of this chapter any area located within the boundaries of the outerbelt, I-270, shall be considered to be either a point of origin or destination (delivery point) within the city. \n2550.04.3 Adoption and incorporation of Federal Regulations. Title 49 of the Code of Federal Regulations, (49 CF) Subchapter C - Hazardous Materials Regulations, Part 171 - General                      Information, Regulations, and Definitions; Part 172 - Hazardous Materials Tables and Hazardous Materials Communications Regulations; Part 173 - Shippers - General Requirements for Shipments and Packagings; and Part 177 - Carriage By Public Highway, governing the transportation of hazardous materials in commerce on highways are hereby adopted by the City of Columbus to ensure the application of those requirements to the city's streets. \n2550.04.4 Conflict. When any provisions of this chapter is found to be in conflict with the regulations adopted, the provision which establishes the higher standard for the promotion and                      protection of the safety and welfare of the public shall prevail. \n2550.04.5 Adoption and incorporation of the Federal Motor Carrier Safety Regulations. The                      requirements of the Federal Motor Carrier Safety Regulations 49 CF Part 397 - Transportation of Hazardous Materials; Driving and Parking Rules, Section 397.3, 397.5, 397.7, 397.9 and 397.21 are                      adopted as referred to and as modified herein. \n2550.04.6 Hazardous materials subject to regulation. Transportation in commerce within the City of Columbus of the hazardous materials required to be placarded and / or marked by 49 CF, Part 172, Subpart F - Placarding, shall be subject to the regulations set forth in Sections 2550.04.7 through 2550.04.21 herein in addition to those regulations adopted in Sections 2550.04.3 and 2550.04.5 above. \n2550.04.7 - Restrictions on the use of city streets for the transportation of hazardous materials. For the purpose of applying 49 CF Section 397.9(a) of the regulations adopted in Section 2550.04 herein to the City of Columbus, the following restrictions are adopted. \n2550.04.8 Major thoroughfares. Those portions of major thoroughfares as defined in Section                      2550.04.13 which lie inside Interstate 270 (the outerbelt) are conclusively presumed to be routes of the materials specified in Section 2550.04.6 is prohibited where there is neither a point of origin nor destination (delivery point) within the city. \n2550.04.9 City streets. The use of city streets for the transportation of the materials specified in Section 2550.04.6, is prohibited whether there is neither a point of origin or destination (delivery point) within the city. \n2550.04.10 Point of origin nor destination. Where there is neither a point of origin nor destination (delivery point) within the city the materials specified in Section 2550.04.6, shall be transported around the heavily populated areas of the City of Columbus by using Interstate 270. \n2550.04.11 Prohibited time. The use of city streets in the downtown area, as defined in 2550.04.11.1 for the transportation of the materials specified in Section 2550.04.6 is prohibited during the hours between 6:00 a.m. and 8:00 p.m. daily except Saturdays, Sundays, and holidays. \n2550.04.11.1 Downtown area. The downtown area is defined as the area bounded by,                      but not including, the Innerbelt on the North, East, and South, and State Route 315 on the West; more specifically by Interstate 71 on the East, by Interstate 70 on the South, by State Route 315 on the West, and by Interstate 670 on the North. \nExceptions to the restrictions listed in 2550.04.6 will be made by permit issued on application to the chief of the division of fire in accordance with the procedures of Section 2550.04.15, herein.                                           \n2550.04.12 Additional permitting. Authority to require permits for transportation of hazardous materials outside the downtown area. \n2550.04.12.1 Special Precautions. The fire chief may require permits for the                      transportation of hazardous materials, as specified in Section 2550.04.6 in areas outside of the downtown area (as defined in Section 2550.04.11.1 when, due to the nature of the particular hazardous material, the routes of travel and parts of the city involved, special                      precautions may be required. \n2550.04.13 Regulations concerning the operation of motor vehicles carrying hazardous materials. The following regulations shall apply to the transportation in Columbus of the materials specified in Section 2550.04 above: \n2550.04.13.1 Traffic Violations. Transporters of hazardous materials shall comply with 49 CF 397.3 while operating within the city. Traffic violations involving moving or parking infractions shall be treated as violations of these regulations and shall be subject to the penalties of Section 2550.15 Section 2550.04.21 herein. \n2550.04.13.2 49 CF. Transporters of hazardous materials shall comply with applicable rules of 49 CF 397.5, 397.7 and 397.21 while operating within the city. \n2550.04.14 Use of major thoroughfares. Transporters of hazardous materials shall use only major thoroughfares, as defined in Section 2550.04.14.1, to reach their destinations. When a destination is not on a major thoroughfare, said transporters will use major thoroughfares to a point as close as possible to the destination. Before using non-major thoroughfare routes said transporters shall  comply with the provisions of 49 CF 397.9. \n                     2550.04.14.1 Use of major thoroughfares. For the purposes of Chapter 2550.04, the following are considered to be major thoroughfares: \n                                          1. Interstate 70. \n                                          2. Interstate 71. \n                                          3. Interstate 670. \n                                          4. U.S. Route 33. \n                                          5. State Route 161. \n                                          6. State Route 315. \n                                          7. Broad Street. \n                                          8. High Street.                       \n2550.04.15 Permits. The following procedure shall apply to the granting of permits to operate in exception to the regulations set forth herein: \n2550.04.15.1 Application. Application for a permit shall be made to the fire chief on the forms provided and accompanied by a fee of one hundred fifty dollars ($150.00) plus ten dollars ($10.00) per each vehicle listed on the application. All applications shall be acted on within thirty (30) days of submission to the fire chief and timely notice of approval or denial shall be given to the applicant. \n2550.04.15.2 Single permit. A single permit shall be granted to a transporter (carrier, trucking company, etc.) for the hazardous materials identified in Section 2550.04.6. \n2550.04.15.3 Rejected applications. Permits denied by the fire chief shall be subject to review by a hearing before the Director of Public Safety on approval by the applicant made to said Director within thirty (30) days of the receipt of notice of denial. \n2550.04.15.4 Approval. Permits will be granted only where the following criteria are met as determined by the fire chief: \n2550.04.15.4.1 Need. Compelling need is shown, that is, the applicant must show that delivery or pick-up of the hazardous material identified in Section 2550.04.6                      can be made only by entering the area defined by Section2550.04.11.1 during the time period identified in Section 2550.04.11.\n2550.04.15.4.2 Public Interest. Transportation of the hazardous material is in the public interest. \n2550.04.15.4.3 Conditions. Permits issued shall set forth conditions such as routes and other special precautions as determined by the fire chief. \n2550.04.15.5 Renewal. Permits shall be granted for a period of one (1) year and be renewed upon application unless revoked for cause after a hearing before the Director of Public Safety. \n2550.04.15.6 Revocable. Permits shall be revocable and nontransferable. \n2550.04.16 Reporting requirements. Incidents involving hazardous materials occurring within the city of Columbus and required to be reported by 49 CF 171.15 shall be reported immediately by the carrier to the division of fire by telephone using the Fire Alarm Office Number (614) 221-2345, and the fire chief shall file a standing request with the Materials Transportation Bureau/U.S. DOT for routine mailing to the Division of fire of a copy of the written report required by 49 CF 171.16. \n                     2550.04.17 Suspension of operations. The fire chief may temporarily suspend the operation notice whenever road, weather, traffic, or other hazardous circumstances warrant that action. \n                     2550.04.18 Suspension of regulations.  The fire chief shall have the authority to suspend these regulations in whole or part, when extenuating circumstances severely limit transit. \n2550.04.19 Civil liability. In addition to the criminal penalty provided by Section 2550.04.15.10, in the event of a hazardous materials incident, as described in 49 CF Section 171.16, requiring the response of the division of fire and/or others to control said incident, the transporter (carrier, trucking company, etc.) shall be liable to the city for the payment of all costs and expenses of the division of fire incurred in and about the use of employees, apparatus and materials in the control and/or neutralization of said incident. The amount of such costs and expenses shall be determined by the Director of Public Safety and shall be collected by him in a civil action wherein the city shall be plaintiff and the transporter shall be                      defendant. This responsibility is not conditioned upon evidence of willfulness or negligence on the part of the transporter. \n2550.04.15.19.1 Violation. This section shall apply only if the transporter is in violation of the provisions of this chapter. \n2550.04.20 Separability. If any portion of this chapter or any section or part of a section shall be declared by a court of competent jurisdiction to be invalid, such declaration shall be limited solely to that portion, section or part of section that was directly involved in the controversy before the court upon which judgment was rendered and shall not affect or impair the validity of the remainder of the chapter. \n2550.04.21 Penalty. Any person who violates any provision of this chapter shall be deemed guilty of a misdemeanor of the first degree. Each violation shall be treated separately. When a violation is a continuing one, each day of the violation constitutes a separate offense. \nSECTION 2.  That previously existing Sections 2550.04.6 and 2550.04.13.1 are hereby repealed.\nSECTION 3. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 63,
    "meeting_date": "2022-11-21",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services",
      "Health & Safety"
    ]
  }
}