{
  "success": true,
  "vote": {
    "id": 5212,
    "item_number": "2",
    "title": "To Congratulate and Recognize the East High School Football Team for a Successful Season",
    "description": "Title\n \nTo Congratulate and Recognize the East High School Football Team for a Successful Season\n \nBody\n \nWHEREAS, the East High School Football Team enjoyed a historic 2022 season with a record of 10-2 which included a trip to the Division IV Regional Semifinals; and\n \nWHEREAS, the East High School Football Team were the Columbus City Schools City League North Co-Champions and averaged over 40 points per game; and\n \nWHEREAS, the East High School Football Team was ranked ninth in the State of Ohio and seeded third in state playoffs (which is the highest in school history); and\n \nWHEREAS, the East High School Football Team qualified for its first state playoffs since 1999, hosted and won two playoff games; and\n \nWHEREAS, the East High School Football Coach Michael D. Bell received the Central District “Coach of the Year” honors; and\n \nWHEREAS, the East High School Football Team and its staff continues to build on the school’s athletic and academic legacy, members of the team received the following honors: All- District 1st Team: Wayne “Tre” Lindsey III, Taizaun Burns and Caedon “CJ” Swanson, All District Honorable Mention: Solomon Vaughn, Junior Breaston, Julian Albano, Anthony Shields, and a number of All State mentions that will soon be released; and \n \nWHEREAS, East High School prides itself on producing well-rounded students through athletics, the 26 member team produced 15 scholar-athletes with a 3.0 GPA or higher, and 7 scholar-athletes with a 2.5 GPA or higher; and  \n \nWHEREAS, while falling short of its ultimate goal, the East High School 2022 Football Team inspired the hearts of many, defying the odds and representing the Columbus City Schools City League and the Capital City with honor, discipline and sportsmanship; now, therefore\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: That we do hereby recognize and congratulate the East High School Football Team for a successful season and for representing the City of Columbus at the 2022 Division IV State Championship Regional Semifinals.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 64,
    "meeting_date": "2022-12-05",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}