{
  "success": true,
  "vote": {
    "id": 524,
    "item_number": "SR-12",
    "title": "To appropriate and transfer funds between the Brewery District I TIF Debt Service Fund and the Brewery District I TIF Capital Fund and between the Waggoner Road TIF Debt Service Fund and the Waggoner Road TIF Capital Fund; to appropriate and transfer funds between projects within the Morse Road TIF Capital Fund; to appropriate funds within the Brewery I TIF Capital Fund, the Waggoner Road Capital Fund, and the Morse Road TIF Capital Fund; to authorize the Director of Public Service to enter into contract with Double Z Construction Company for the King Lincoln District - Long Street, Garfield Avenue, Monroe Avenue and Talmadge Street project; to authorize the expenditure of up to $3,602,619.72 from the Brewery I TIF Capital Fund, the Morse Road TIF Capital Fund, and the  Waggoner Road Capital Fund to pay for the project; and to declare an emergency.  ($3,602,619.72)",
    "description": "Explanation\n1.  BACKGROUND\nBy Ordinance 1486-2019, City Council authorized the City to enter into an Economic Development Agreement dated June 18, 2019 (the “EDA”) with DEL Partners, LLC (the “Developer”) to memorialize their understanding and agreements with respect to the approximately $20,000,000 redevelopment of  the Developer’s ±2.31 acres of real property in the King Lincoln District (the “Project Site”). Pursuant to the EDA, the City and the Developer agreed to partner on the construction of public infrastructure improvements on and near the Project Site. Pursuant to the EDA, this ordinance authorizes the Director of Public Service to enter into contract with Double Z Construction Company for the King Lincoln District - Long Street, Garfield Avenue, Monroe Avenue and Talmadge Street project (P441770-100000, the “Streetscape Improvements”) and to provide payment for construction, construction administration, and inspection services.  \n \nThis contract for the Streetscape Improvements includes reconstructing Long Street from Garfield Avenue to Monroe Avenue, the first east-west alley north of Long Street from Garfield Avenue to Talmadge Street, and Talmadge Street from the first alley north of Long Street to approximately 150 feet north.  Garfield Avenue from Long Street to Mayme Moore Place and Monroe Avenue from Long Street to approximately 300 feet north of Long Street will be resurfaced.  Other work includes:  storm sewer, water main, sidewalks, street lighting, electric duct bank, and communications duct bank, and other work as may be necessary to complete the contract in accordance with the plans and specifications set forth in the Bid Submittal Documents.\n \nThe estimated Notice to Proceed date is March 26, 2021.  The project was led by the Office of Support Services through Vendor Services and Bid Express.  Three bids were received on January 21, 2021, (all majority) and tabulated as follows:   \n      \nCompany Name                                                      Bid Amount                                  City/State                                      Majority/MBE/FBE     \nDouble Z Construction Company                     $3,275,108.84                                          Columbus, OH                                          Majority\nComplete General Construction Co.                     $3,540,462.37                                          Columbus, OH                                          Majority\nDanbert, Inc.                                                                                    $3,669,757.48                                          Plain City, OH                                          Majority\n \nAward is to be made to Double Z Construction Company as the lowest responsive and responsible and best bidder for their bid of $3,275,108.84.  The amount of construction administration and inspection services will be $327,510.88.  The total legislated amount is $3,602,619.72. Furthermore, by Ordinance 1786-00 and ORC 5709.40(B), the City established the Brewery District I TIF; by Ordinance 2179-01 and ORC 5709.40(B) established the Morse Road TIF; and by Ordinance 1721-02 and ORC 5709.40(C) established the Waggoner Rd TIF to use each for public infrastructure improvements. Section 6 of House Bill 384 enacted by the 131st General Assembly and Ordinance 1555-2007 allows revenues generated from certain TIFs like the Brewery District I, Morse Road, and Waggoner Road TIFs to be used remotely from the TIF areas for certain public infrastructure improvements. Those funds from the Brewery District I, Morse Road, and Waggoner Road TIFs will be appropriated, transferred, and expended to finance the $3,602,619.72 of Streetscape Improvements on or near the Project Site in accordance with those laws.\n \nSearches in the System for Award Management (Federal) and the Findings for Recovery list (State) produced no findings against Double Z Construction Company\n \n2. CONTRACT COMPLIANCE INFORMATION\nThe contract compliance number for Double Z Construction Company is CC005966 and expires 06/10/2021.\n \n3. PRE-QUALIFICATION STATUS\nDouble Z Construction Company and all proposed subcontractors have met code requirements with respect to pre-qualification, pursuant to relevant sections of Columbus City Code Chapter 329.\n \n4.  FISCAL IMPACT\nThe Brewery District I TIF Debt Service Fund, Fund 4409, is contributing $1,994,140.04 to the project.  It is necessary to appropriate and transfer the $1,994,140.04 from Fund 4409 to the Brewery District I District TIF Capital Fund, Fund 7740, and then to appropriate and authorize expenditure of the funds.\n \nThe Morse Road TIF Capital Fund, Fund 7414, is contributing $1,172,416.49 to the project.  It is necessary to appropriate the funds, authorize a transfer between projects within Fund 7414, and authorize expenditure of the funds.\n \nThe Waggoner TIF Debt Service Fund, Fund 4410, is contributing $436,063.19 to the project.  It is necessary to appropriate and transfer the $436,063.19 from Fund 4410 to the Waggoner Rd Capital Fund, Fund 7410, and then to appropriate and authorize the expenditure of the funds.\n \n5.  EMERGENCY DESIGNATION\nEmergency action is requested in order to complete needed improvements at the earliest possible time to ensure the safety of the traveling public.\n \nTitle\nTo appropriate and transfer funds between the Brewery District I TIF Debt Service Fund and the Brewery District I TIF Capital Fund and between the Waggoner Road TIF Debt Service Fund and the Waggoner Road TIF Capital Fund; to appropriate and transfer funds between projects within the Morse Road TIF Capital Fund; to appropriate funds within the Brewery I TIF Capital Fund, the Waggoner Road Capital Fund, and the Morse Road TIF Capital Fund; to authorize the Director of Public Service to enter into contract with Double Z Construction Company for the King Lincoln District - Long Street, Garfield Avenue, Monroe Avenue and Talmadge Street project; to authorize the expenditure of up to $3,602,619.72 from the Brewery I TIF Capital Fund, the Morse Road TIF Capital Fund, and the  Waggoner Road Capital Fund to pay for the project; and to declare an emergency.  ($3,602,619.72)\n \nBody\nWHEREAS, pursuant to Ordinance 1486-2019, City Council authorized the City to enter into an Economic Development Agreement dated June 18, 2019 (the “EDA”) with DEL Partners, LLC (the “Developer”) to memorialize their understanding and agreements for public infrastructure improvements with respect to the approximately $20,000,000 redevelopment of the Developer’s ±2.31 acres of real property in the King Lincoln District (the “Project Site”); and\n \nWHEREAS, pursuant to the EDA, the Department of Public Service is engaged in the King Lincoln District - Long Street, Garfield Avenue, Monroe Avenue and Talmadge Street project (P441770-100000), the “Streetscape Improvements”) on or near the Project Site; and  \n \nWHEREAS, the work for the Streetscape Improvements consists of reconstructing Long Street from Garfield Avenue to Monroe Avenue, the first east-west alley north of Long Street from Garfield Avenue to Talmadge Street, and Talmadge Street from the first alley north of Long Street to approximately 150 feet north.  Garfield Avenue from Long Street to Mayme Moore Place and Monroe Avenue from Long Street to approximately 300 feet north of Long Street will be resurfaced; other work includes:  storm sewer, water main, sidewalks, street lighting, electric duct bank, and communications duct bank, and other work as may be necessary to complete the contract in accordance with the plans and specifications set forth in the Bid Submittal Documents; and\n \nWHEREAS, Double Z Construction Company will be awarded the contract for the Streetscape Improvements; and \n \nWHEREAS, the Department of Public Service requires funding to be available for the Streetscape Improvements for construction expense along with construction administration, and inspection services; and\n \nWHEREAS, by Ordinance 1786-00 and ORC 5709.40(B), the City established the Brewery District I TIF; by Ordinance 2179-01 and ORC 5709.40(B) established the Morse Road TIF; and by Ordinance 1721-02 and ORC 5709.40(C) established the Waggoner Rd TIF to use each for public infrastructure improvements; and\n \nWHEREAS, City Council by Ordinance 1555-2017 passed June 19, 2017 determined, pursuant to Section 6 of House Bill 384 enacted by the 131st General Assembly, that satisfactory provision had been made for the public improvement needs of the Brewery District I, Morse Road, and Waggoner Road TIFs; and\n \nWHEREAS, this Council further determined that certain public improvements like the Streetscape Improvements and identified generally on Exhibit B of Ordinance 1555-2017 (the “Neighborhood Public Improvements”) will be in support of urban redevelopment within the meaning of Section 5709.41 of the Ohio Revised Code; and\n \nWHEREAS, it is necessary for Council to authorize transfer of funds between projects within the Morse Road TIF Capital Fund (7414), to establish sufficient cash to pay for the Streetscape Improvements Public Service will administer; and\n \nWHEREAS, it is necessary for Council to appropriate and transfer cash for Department of Public Service use from the Brewery District TIF Debt Service Fund (4409) to the Brewery District I TIF Capital Fund (7740) in order to allow Public Service to administer financial requirements of the Streetscape Improvements within Fund 7740; and \n \nWHEREAS,  it is necessary for Council to appropriate and transfer cash for Department of Public Service use from the Waggoner TIF Debt Service Fund (4410) to the Waggoner Road TIF Capital Fund (7410) in order to allow Public Service to administer financial requirements of the Streetscape Improvements within Fund 7410; and \n \nWHEREAS, funds must be appropriated within the Waggoner Road TIF Capital Fund; the Morse Road TIF Capital Fund; and the Brewery I TIF Capital Fund and be authorized for expenditure for the Streetscape Improvements; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to authorize the Director to enter into contract with Double Z Construction Company to ensure the safety of the traveling public, thereby preserving the public health, peace, property, safety and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2020, the sum of $1,994,140.04 is appropriated in Fund 4409 (Brewery District I TIF Debt Service Fund), Dept-Div 4402 (Economic Development), in Object Class 10 (Transfer Out) per the account codes in the attachment to this ordinance.\nSECTION 2.  That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2020, the sum of $1,172,416.49 is appropriated in Fund 7414 (Morse Road TIF Capital Fund), Dept-Div 5912 (Design and Construction), Project P441770-100000 (King Lincoln District - Long Street, Garfield Avenue, Monroe Avenue and Talmadge Street), in Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\nSECTION 3.  That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2020, the sum of $436,063.19 is appropriated in Fund 4410 (Waggoner TIF Debt Service Fund), Dept-Div 4402 (Economic Development), in Object Class 10 (Transfer Out) per the account codes in the attachment to this ordinance.\nSECTION 4.  That the transfer of $1,994,140.04 or so much thereof as may be needed, is hereby authorized from Fund 4409 (Brewery District I TIF Debt Service Fund), Dept-Div 4402 (Economic Development) to Fund 7740 (Brewery District I TIF Capital Fund), Dept-Div 5912 (Design and Construction) per the account codes in the attachment to this ordinance.\n \nSECTION 5.  That the transfer of $1,172,416.49, or so much thereof as may be needed, is hereby authorized within Fund 7414 (Morse Road TIF Capital Fund), from Dept-Div 5912 (Design and Construction), Project Project P414001-100000 (Morse Road TIF), Object Class 06 (Capital Outlay) to Dept-Div 5912 (Design and Construction), Project P441770-100000 (King Lincoln District - Long Street, Garfield Avenue, Monroe Avenue and Talmadge Street), in Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\nSECTION 6.  That the transfer of $436,063.19 or so much thereof as may be needed, is hereby authorized from Fund 4410 (Waggoner TIF Debt Service Fund), Dept-Div 4402 (Economic Development) to Fund 7410 (Waggoner Road TIF Capital Fund), Dept-Div 5912 (Design and Construction) per the account codes in the attachment to this ordinance.\n \nSECTION 7.  That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2020, the sum of $1,994,140.04 is appropriated in Fund 7740 (Brewery District I TIF Capital Fund),, Dept-Div 5912 (Design and Construction), Project P441770-100000 (King Lincoln District - Long Street, Garfield Avenue, Monroe Avenue and Talmadge Street), in Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\nSECTION 8.  That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2020, the sum of $436,063.19 is appropriated in Fund 7410 (Waggoner Road TIF Capital Fund), Dept-Div 5912 (Design and Construction), Project P441770-100000 (King Lincoln District - Long Street, Garfield Avenue, Monroe Avenue and Talmadge Street), in Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\nSECTION 9.  That the Director of Public Service be and is hereby authorized to enter into a construction services contract with Double Z Construction Company, 2550 Harrison Road, Columbus, Ohio,  43204, for the King Lincoln District - Long Street, Garfield Avenue, Monroe Avenue and Talmadge Street project (P441770-100000) in the amount of up to $3,275,108.84 in accordance with the specifications and plans on file in the Office of Support Services, which are hereby approved; and to pay for necessary construction administration and inspection costs associated with the project up to a maximum of $327,510.88, for a total expenditure of up to $3,602,619.72.\n \nSECTION 10.  That for the purposes stated herein, the expenditure of $1,994,140.04, or so much thereof as may be needed, is hereby authorized in Fund 7740 (Brewery District I TIF Capital Fund),  Dept-Div 5912 (Design and Construction), Project P441770-100000 (King Lincoln District - Long Street, Garfield Avenue, Monroe Avenue and Talmadge Street), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 11.  That for the purposes stated herein, the expenditure of $1,172,416.49, or so much thereof as may be needed, is hereby authorized in Fund 7414 (Morse Road TIF Capital Fund), Dept-Div 5912 (Design and Construction), Project P441770-100000 (King Lincoln District - Long Street, Garfield Avenue, Monroe Avenue and Talmadge Street), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 12.  That for the purposes stated herein, the expenditure of $436,063.19, or so much thereof as may be needed, is hereby authorized in Fund 7410 (Waggoner Road TIF Capital Fund), Dept-Div 5912 (Design and Construction), Project P441770-100000 (King Lincoln District - Long Street, Garfield Avenue, Monroe Avenue and Talmadge Street), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 13.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 14.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 15.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 16.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten (10) days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 8,
    "meeting_date": "2021-03-22",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Economic Development"
    ]
  }
}