{
  "success": true,
  "vote": {
    "id": 5242,
    "item_number": "CA-27",
    "title": "To authorize the Director of Public Service, or a designee, to offer certain incentive payments and/or other forms of remuneration to facilitate and support the mobilization of independent contractors to aid in City snow removal and de-icing operations this winter; to authorize the expenditure of $25,000.00 from the Street Construction Maintenance and Repair Fund for that purpose; and to declare an emergency.",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Service, or a designee, to expend up to $25,000.00 to facilitate and support the mobilization and deployment of independent contractors for the provision of snow removal and de-icing during episodes of heavy snowfall this winter. \nThe Department of Public Service administers a variety of municipal services within the City of Columbus necessary to public health and safety, including snow removal and de-icing during inclement weather. With more than 90,000 lane miles of roadways to service each winter, the Department of Public Service seeks the assistance of other jurisdictions and independent contractors to supplement City crews on local roadways. \nThis year, the Department of Public Service hopes to be able to engage and deploy more independent contractors by offering certain incentive payments, including sign-on bonuses in the amount of up to $3,000.00, and/or other forms of remuneration, including non-refundable deposits, to those contractors who contractually agree to support the City during snow removal and de-icing operations. \n2.  FISCAL IMPACT\nFunding in the amount of $25,000.00 is available within the Street Construction Maintenance and Repair Fund to support the proposed expenditure. \n3.  EMERGENCY DESIGNATION\nEmergency action is requested to ensure the Department of Public Service has the assistance it needs to make City roadways passable and safe in a timely and efficient manner in the aftermath of major snow events. \n4.  MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nWhile the entities with which the Department of Public Service expects to contract are characterized as small businesses, the value of the resulting contracts will be below the threshold at which MBE/WBE/SLBE program requirements would apply. \n \nTitle\nTo authorize the Director of Public Service, or a designee, to offer certain incentive payments and/or other forms of remuneration to facilitate and support the mobilization of independent contractors to aid in City snow removal and de-icing operations this winter; to authorize the expenditure of $25,000.00 from the Street Construction Maintenance and Repair Fund for that purpose; and to declare an emergency. \nBody\nWHEREAS, the Department of Public Service administers a variety of municipal services within the City of Columbus necessary to public health and safety, including snow removal and de-icing during inclement weather; and \nWHEREAS, since 2009, the Department of Public Service has solicited independent contractors to assist in said activities during episodes of heavy snowfall; and \nWHEREAS, again there exists a need to engage and deploy independent contractors for the provision of snow removal and de-icing to supplement City crews in the aftermath of major snow events; and \nWHEREAS, the purpose of this legislation is to authorize the Director of Public Service, or a designee, to expend up to $25,000.00 to offer certain incentive payments, including sign-on bonuses in the amount of up to $3,000.00, and/or other forms of remuneration, including non-refundable deposits, as may be necessary to those contractors who agree to support the City during snow removal and de-icing operations; and \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to authorize this legislation to ensure the assistance it needs to make City roadways passable and safe in a timely and efficient manner in the aftermath of major snowfalls, thereby preserving the public health, peace, property, safety and welfare; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Service, or a designee, is hereby authorized to offer certain incentive payments, including sign-on bonuses in the amount of up to $3,000.00, and/or other forms of remuneration, including non-refundable deposits, as may be necessary to facilitate and support mobilization and deployment of independent contractors for the provision of snow removal and de-icing to supplement City crews in the aftermath of major snow events this winter. \nSECTION 2.  That the expenditure of up to $25,000.00, or so much thereof as may be needed, is hereby authorized in Fund 2265 (Street Construction Maintenance and Repair Fund), Dept-Div 59-11 (Division of Infrastructure Management), in Object Class 03 (Services), per the accounting codes in the attachment to this ordinance. \nSECTION 3.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 64,
    "meeting_date": "2022-12-05",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Economic Development"
    ]
  }
}