{
  "success": true,
  "vote": {
    "id": 5265,
    "item_number": "CA-50",
    "title": "To authorize the Director of Finance and Management to enter into a contract with Jerry Pate Turf & Irrigation, Inc. dba Century Equipment, Inc. to purchase Electric Utility Carts for the Division of Water; to authorize the expenditure of $51,908.74 from the Water Operating Fund; and to declare an emergency.  ($51,908.74)",
    "description": "Explanation\n \nBACKGROUND:  The purpose of this legislation is to authorize the Director of Finance and Management on behalf of the Director of Public Utilities to enter into a contract to purchase Electric Utility Carts for the Division of Water with Century Equipment, Inc.  The Electric Utility Carts will be used by the HAP Cremean Water Plant Maintenance Section staff for general repairs and upkeep to the plant.  One unit is replacing BT-23663 and the other is an expansion unit.  This purchase has been approved by the Division of Fleet Management.  \n  \nThe Purchasing Office advertised and solicited competitive bids in accordance with the relevant provisions of City Code Chapter 329 (RFQ022904).  Seventy-seven (77) bidders were solicited and one (1) bid was received and was opened on October 13, 2022.  \n \nThis company is not debarred according to the Excluded Parties listing of the Federal Government and is not listed in the Auditor of State database for Findings for Recovery.\n \nEMERGENCY DESIGNATION:  Emergency designation is requested to avoid any price increase due to rising material costs. \n \nSUPPLIER:  Jerry Pate Turf & Irrigation, Inc. dba Century Equipment, Inc., 59-3472632, (MAJ), expires 1/14/24, Majority Vendor.  \n \nFISCAL IMPACT:  $51,908.74 is required for this purchase. \n \n$0.00 was expended for a similar purchase in 2021.\n$0.00 was expended for a similar purchase in 2020.\n \nTitle\n \nTo authorize the Director of Finance and Management to enter into a contract with Jerry Pate Turf & Irrigation, Inc. dba Century Equipment, Inc. to purchase Electric Utility Carts for the Division of Water; to authorize the expenditure of $51,908.74 from the Water Operating Fund; and to declare an emergency.  ($51,908.74)\n \nBody\n \nWHEREAS, the Purchasing Office advertised and solicited competitive bids for the Electric Utility Carts and Jerry Pate Turf & Irrigation, Inc. dba Century Equipment, Inc. was the only bidder; and \n \nWHEREAS, it is necessary for the Division of Water to purchase of Utility Carts the Electric Utility Carts will be used by the HAP Cremean Water Plant Maintenance Section staff for general repairs and upkeep to the plant.\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Utilities in that it is immediately necessary to authorize the Director of Finance and Management to enter into a contract with Jerry Pate Turf & Irrigation, Inc., in accordance with the terms, conditions and specifications of Solicitation Number: RFQ022904 on file in the Purchasing Office to avoid an additional price increase due to rising material costs; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Finance and Management Director is authorized to enter into a contract with Jerry Pate Turf & Irrigation, Inc. dba Century Equipment, Inc., 4199 Leap Rd., Hilliard, OH 43026 for the purchase of Electric Utility Carts for the Division of Water, in accordance with the specifications on file in the Purchasing Office.\nSECTION 2.  That the expenditure of $51,908.74 or as much thereof as may be needed, is hereby authorized in Fund 6000 (Water Operating) in object Class 06 Vehicles per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 64,
    "meeting_date": "2022-12-05",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}