{
  "success": true,
  "vote": {
    "id": 5288,
    "item_number": "CA-73",
    "title": "To authorize the Finance and Management Director to associate all General Budget Reservations resulting from this ordinance with HighCom for the purchase of protective wear and accessories for the Division of Police from existing Universal Term Contracts; to authorize the expenditure of $166,3787.40 from the General Fund and the Law Enforcement Seizure Fund; and to declare an emergency. ($166,378.40)",
    "description": "Explanation\n \n \nBACKGROUND:   The Division of Police needs to procure protective wear for police officers.This ordinance will enable the Division to purchase these uniforms from HighCom in accordance with the Universal Term Contracts established for this purpose by the Purchasing Office. \n \nBid Information: The Purchasing Office has set up purchase agreements for the purchase of protective wear with HighCom. \n \nThis company is not debarred according to the Federal excluded parties listing or prohibited from being awarded a contract according to the Auditor of State unresolved findings for recovery certified search.\n \nContract Compliance No.:   HighCom Armor Solutions Inc. CC-025243 \n \nEmergency Designation: Emergency legislation is requested because the Division needs to place orders for protective gear for current personnel in ACT, SWAT, and IN/TAC. \n \nFISCAL IMPACT:  This ordinance authorizes an expenditure of $166,378.40 from the Division of Police’s general fund and the law enforcement seizure fund for the purchase of protective wear. \n \nTitle\n \nTo authorize the Finance and Management Director to associate all General Budget Reservations resulting from this ordinance with HighCom for the purchase of protective wear and accessories for the Division of Police from existing Universal Term Contracts; to authorize the expenditure of $166,3787.40 from the General Fund and the Law Enforcement Seizure Fund; and to declare an emergency. ($166,378.40)\n \nBody\n \nWHEREAS, the Purchasing Office has set up purchase agreements for the purchase of protective wear, with HighCom; and,\n \nWHEREAS, the Division of Police has an immediate need for protective wear for current personnel in ACT, SWAT, and IN/TAC; and,\n \nWHEREAS, an emergency exists in the usual daily operation in the Division of Police, Department of Public Safety, in that it is immediately necessary to authorize the Finance and Management Director to associate all General Budget Reservations within this ordinance to the existing Universal Term Contracts with HighCom for the purchase of protective wear and accessories for the safety of current employees in ACT, SWAT, and IN/TAC, for the preservation of the public health, peace, property, safety, and welfare; now, therefore:\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Finance and Management be and is hereby authorized to associate all General Budget Reservations resulting from this ordinance with the appropriate Universal Term Contract Purchase Agreement with HighCom for the purchase of accessories, and protective wear for current sworn personnel for the Division of Police.\n \nSECTION 2. That the expenditure of $166,378.40, or so much thereof as may be needed, is hereby authorized in the general fund in Object Class 02-Materials and Supplies per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such account codes as necessary. \n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance and to make any accounting changes necessary to ensure that this contract is properly accounted for and recorded accurately on the City's financial records.\n \nSECTION 5. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 64,
    "meeting_date": "2022-12-05",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}