{
  "success": true,
  "vote": {
    "id": 5341,
    "item_number": "SR-36",
    "title": "To amend sections 2303.05, 2303.14, 2323.11, and 2323.20; to enact sections 2323.191, 2323.32, and 2323.321, and to repeal existing sections 2303.05, 2303.14, 2323.11, and 2323.20 of Columbus City Codes to effectuate common sense gun reform; and to declare an emergency.",
    "description": "Explanation\n \nOn August 4, 2019, in Dayton, Ohio just a short drive down the road, an armed gunman headed to the Oregon Entertainment District armed with a semi-automatic firearm equipped with a 100-round drum magazine and proceeded to carry out a mass shooting in which 9 people were killed and 27 were injured in just thirty seconds. Since then numerous additional mass shootings have taken place. \nColumbus has not been immune to gun violence, it has long plagued our city, robbing us of our most valuable asset, our people. We have seen how gun violence has ripped through our communities especially among our youth. Last year alone, 91% of homicides in Columbus were committed with a firearm. Gun control simply cannot wait. This legislation will effectuate common sense gun reform in our community thereby creating a safer Columbus.\n \nTitle\n \nTo amend sections 2303.05, 2303.14, 2323.11, and 2323.20; to enact sections 2323.191, 2323.32, and 2323.321, and to repeal existing sections 2303.05, 2303.14, 2323.11, and 2323.20 of Columbus City Codes to effectuate common sense gun reform; and to declare an emergency.\n \n \nBody\n \nWHEREAS, more Ohioans died from firearms in 2021 than almost any year on record, according to Ohio Department of Health data; and\n \nWHEREAS, despite this fact, the Ohio legislature has steadily relaxed state gun laws; and \n \nWHEREAS, the Columbus Division of Police has arrested 36% more juveniles for gun violations this year than in 2021; and \n \nWHEREAS, 13% of the juveniles that were arrested for guns in 2022 brought the firearm with them to school; and \n \nWHEREAS, gun violence has continually plagued our city, robbing us of our most valuable assets, our people; and\n \nWHEREAS, the Mayor of Columbus has declared gun violence a public health crisis; and \n \nWHEREAS, in 2021, 91% of homicides in Columbus were committed with a firearm; and\n \nWHEREAS, the safety of residents is of paramount importance; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Columbus City Council in that it is immediately necessary to authorize the effectuation of common sense gun reform in our community to create a safer Columbus, thereby preserving the public health, peace, property, safety, and welfare; NOW THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSection 1. That sections 2303.05, 2303.14, 2323.11, and 2323.20 of the Columbus City Codes are hereby amended as follows:\n \n2303.05 - Negligent homicide.\n(A)No person shall negligently cause the death of another or the unlawful termination of another's pregnancy by means of a deadly weapon or dangerous ordnance as defined in Section 2923.11 of the Ohio Revised Code.2323.11.\n \n(B)Whoever violates this section is guilty of negligent homicide, a misdemeanor of the first degree.\n \n(C)Any instrumentality that has been used in a violation of this section shall be seized and is subject to forfeiture pursuant to Chapter 2981 of the Ohio Revised Code.\n \n(D) For purposes of this section, storing or leaving a deadly weapon or dangerous ordnance in a manner or location in the person's residence where the person knows or reasonably should know a minor is able to gain access to the deadly weapon or dangerous ordnance constitutes a substantial lapse from due care.  \n \n(E) There shall be a rebuttable presumption that a person exercised due care with respect to a deadly weapon that is a firearm where, by a preponderance of the evidence, it is shown that the person stored the firearm using safe storage as defined in Chapter 2323. \n \n2303.14 - Negligent assault.\n(A)No person shall negligently, by means of a deadly weapon or dangerous ordnance as defined in Section 2923.11 of the Revised Code 2323.11, cause physical harm to another.\n \n(B)Whoever violates this section is guilty of negligent assault, a misdemeanor of the third degree.\n \n(C)Any instrumentality that has been used in a violation of this section shall be seized and is subject to forfeiture pursuant to Chapter 2981 of the Ohio Revised Code.\n \n(D) For purposes of this section, storing or leaving a deadly weapon or dangerous ordnance in a manner or location in the person's residence where the person knows or reasonably should know a minor is able to gain access to the deadly weapon or dangerous ordnance constitutes a substantial lapse from due care.  \n \n(E) There shall be a rebuttable presumption that a person exercised due care with respect to a deadly weapon that is a firearm where, by a preponderance of the evidence, it is shown that the person stored the firearm using safe storage as defined in Chapter 2323. \n \n2323.11 - Definitions.\nAs used in sections 2323.11 to 2323.5455 of the Columbus City Codes:\n(A)\"Deadly weapon\" means any instrument, device, or thing capable of inflicting death, and designed or specially adapted for use as a weapon, or possessed, carried, or used as a weapon.\n \n(B)(1)\"Firearm\" means: (a) any deadly weapon capable of expelling or propelling one or more projectiles by the action of an explosive or combustible propellant; or (b) the frame or receiver of any such weapon as defined in 27 CFR §487.12. \"Firearm\" includes an unloaded firearm, and any firearm that is inoperable but that can readily be rendered operable.\n(2)When determining whether a firearm is capable of expelling or propelling one or more projectiles by the action of an explosive or combustible propellant, the trier of fact may rely upon circumstantial evidence, including, but not limited to, the representations and actions of the individual exercising control over the firearm.\n \n(C)\"Handgun\" means any of the following:\n(1)Any firearm that has a short stock and is designed to be held and fired by the use of a single hand;\n(2)Any combination of parts from which a firearm of a type described in division (C)(1) of this section can be assembled.\n \n(D)\"Semi-automatic firearm\" means any firearm designed or specially adapted to fire a single cartridge and automatically chamber a succeeding cartridge ready to fire, with a single function of the trigger.\n \n(E)\"Automatic firearm\" means any firearm designed or specially adapted to fire a succession of cartridges with a single function of the trigger.\n \n(F)\"Sawed-off firearm\" means a shotgun with a barrel less than eighteen inches long, or a rifle with a barrel less than sixteen inches long, or a shotgun or rifle less than twenty-six inches long overall. \"Sawed-off firearm\" does not include any firearm with an overall length of at least twenty-six inches that is approved for sale by the federal bureau of alcohol, tobacco, firearms, and explosives under the \"Gun Control Act of 1968,\" 82 Stat. 1213, 18 U.S.C. 921(a)(3), but that is found by the bureau not to be regulated under the \"National Firearms Act,\" 68A Stat. 725 (1934), 26 U.S.C. 5845(a).\n \n(G)\"Zip-gun\" means any of the following:\n(1)Any firearm of crude and extemporized manufacture;\n(2)Any device, including without limitation a starter's pistol, that is not designed as a firearm, but that is specially adapted for use as a firearm;\n(3)Any industrial tool, signaling device, or safety device, that is not designed as a firearm, but that as designed is capable of use as such, when possessed, carried, or used as a firearm.\n \n(H)\"Explosive device\" means any device designed or specially adapted to cause physical harm to persons or property by means of an explosion, and consisting of an explosive substance or agency and a means to detonate it. \"Explosive device\" includes without limitation any bomb, any explosive demolition device, any blasting cap or detonator containing an explosive charge, and any pressure vessel that has been knowingly tampered with or arranged so as to explode.\n \n(I)\"Incendiary device\" means any firebomb, and any device designed or specially adapted to cause physical harm to persons or property by means of fire, and consisting of an incendiary substance or agency and a means to ignite it.\n \n(J)\"Ballistic knife\" means a knife with a detachable blade that is propelled by a spring-operated mechanism.\n \n(K)\"Dangerous ordnance\" means any of the following, except as provided in division (L) of this section:\n(1)Any automatic or sawed-off firearm, zip-gun, or ballistic knife;\n(2)Any explosive device or incendiary device;\n(3)Nitroglycerin, nitrocellulose, nitrostarch, PETN, cyclonite, TNT, picric acid, and other high explosives; amatol, tritonal, tetrytol, pentolite, pecretol, cyclotol, and other high explosive compositions; plastic explosives; dynamite, blasting gelatin, gelatin dynamite, sensitized ammonium nitrate, liquid-oxygen blasting explosives, blasting powder, and other blasting agents; and any other explosive substance having sufficient brisance or power to be particularly suitable for use as a military explosive, or for use in mining, quarrying, excavating, or demolitions;\n(4)Any firearm, rocket launcher, mortar, artillery piece, grenade, mine, bomb, torpedo, or similar weapon, designed and manufactured for military purposes, and the ammunition for that weapon;\n(5)Any firearm muffler or suppressor;\n(6)Any combination of parts that is intended by the owner for use in converting any firearm or other device into a dangerous ordnance.\n \n(L)\"Dangerous ordnance\" does not include any of the following:\n(1)Any firearm, including a military weapon and the ammunition for that weapon, and regardless of its actual age, that employs a percussion cap or other obsolete ignition system, or that is designed and safe for use only with black powder;\n(2)Any pistol, rifle, or shotgun, designed or suitable for sporting purposes, including a military weapon as issued or as modified, and the ammunition for that weapon, unless the firearm is an automatic or sawed-off firearm;\n(3)Any cannon or other artillery piece that, regardless of its actual age, is of a type in accepted use prior to 1887, has no mechanical, hydraulic, pneumatic, or other system for absorbing recoil and returning the tube into battery without displacing the carriage, and is designed and safe for use only with black powder;\n(4)Black powder, priming quills, and percussion caps possessed and lawfully used to fire a cannon of a type defined in division (L)(3) of this section during displays, celebrations, organized matches or shoots, and target practice, and smokeless and black powder, primers, and percussion caps possessed and lawfully used as a propellant or ignition device in small-arms or small-arms ammunition;\n(5)Dangerous ordnance that is inoperable or inert and cannot readily be rendered operable or activated, and that is kept as a trophy, souvenir, curio, or museum piece.\n(6)Any device that is expressly excepted from the definition of a destructive device pursuant to the \"Gun Control Act of 1968,\" 82 Stat. 1213, 18 U.S.C. 921(a)(4), as amended, and regulations issued under that act.\n(7) Any firearm with an overall length of at least twenty-six inches that is approved for sale by the federal bureau of alcohol, tobacco, firearms, and explosives under the \"Gun Control Act of 1968,\" 82 Stat. 1213, 18 U.S.C. 921(a)(3), but that is found by the bureau not to be regulated under the \"National Firearms Act,\" 68A Stat. 725 (1934), 26 U.S.C. 5845(a).\n \n(M)\"Explosive\" means any chemical compound, mixture, or device, the primary or common purpose of which is to function by explosion. \"Explosive\" includes all materials that have been classified as division 1.1, division 1.2, division 1.3, or division 1.4 explosives by the United States department of transportation in its regulations and includes, but is not limited to, dynamite, black powder, pellet powders, initiating explosives, blasting caps, electric blasting caps, safety fuses, fuse igniters, squibs, cordeau detonant fuses, instantaneous fuses, and igniter cords and igniters. \"Explosive\" does not include \"fireworks,\" as defined in section 3743.01 of the Revised Code, or any substance or material otherwise meeting the definition of explosive set forth in this section that is manufactured, sold, possessed, transported, stored, or used in any activity described in section 3743.80 of the Revised Code, provided the activity is conducted in accordance with all applicable laws, rules, and regulations, including, but not limited to, the provisions of section 3743.80 of the Revised Code and the rules of the fire marshal adopted pursuant to section 3737.82 of the Revised Code.\n \n(N)\"Large capacity magazine\" means any magazine, belt, drum, feed strip, clip or other similar device that has the capacity of, or can be readily restored or converted to accept, thirty (30) or more rounds of ammunition for use in a firearm.  A “large capacity magazine” does not include any of the following:\n(1) A feeding device that has been permanently altered so that it cannot accommodate more than thirty rounds of ammunition;\n(2) A .22 caliber tube ammunition feeding device;\n(3) A tubular magazine that is contained in a lever-action firearm;\n(4) A magazine that is permanently inoperable. \n \n(O) “Safe storage” means:\n(1) a device that, when installed on a firearm, is designed to prevent the firearm from being operated without first deactivating the device;\n(2) a device incorporated into the design of the firearm that is designed to prevent the operation of the firearm by anyone not having access to the device; or\n(3) a safe, gun safe, gun case, lock box, or other device that is designed to be or can be used to store a firearm and that is designed to be unlocked only by means of a key, a combination, or other similar means. \n \n \n2323.20 - Unlawful transactions in weapons; failure to report loss.\n(A)No person shall do either of the following:\n(1) Manufacture, possess for sale, sell, or furnish to any person other than a law enforcement agency for authorized use in police work, any brass knuckles, cestus, billy, blackjack, sandbag, switchblade knife, springblade knife, gravity knife, or similar weapon.Recklessly sell, lend, give, or furnish a firearm to another person if the seller or furnisher knows, or has reason to know, that the person purchasing or attempting to purchase the firearm is doing so for, on behalf of, or at the request or demand of any other person that meets the criteria of one or more provisions of section 2923.13 of the Revised Code or section 2323.13 of the Columbus City Codes pertaining to weapons under disability.\n \n(2) Recklessly purchase or attempt to purchase any firearm for, on behalf of, or at the request or demand of any other person knowing or having reasonable cause to believe that such other person meets the criteria of one or more provisions of section 2923.13 of the Revised Code or section 2323.13 of the Columbus City Codes pertaining to weapons under disability.\n \n(B)No person shall knowingly fail to report to law enforcement authorities forthwith the loss or theft of any firearm or dangerous ordnance in the person's possession or under the person's control.\n \n(C)Whoever violates division (A) of this section is guilty of unlawful transactions in weapons, a misdemeanor of the second first degree. Whoever violates division (B) of this section is guilty of failure to report loss of a firearm or dangerous ordnance, a misdemeanor of the fourth degree.\n \n(D)Any instrumentality that has been used in a violation of this section shall be seized and subject to forfeiture pursuant to Chapter 2981 of the Ohio Revised Code.\n \nSection 2.  That new sections 2323.191, 2323.32, and 2323.321 are hereby enacted, to read as follows:\n \n2323.191 Negligent Storage of a Firearm\n(A)(1) No person shall negligently store or leave a firearm in a manner or location in the person's residence where the person knows or reasonably should know a minor is able to gain access to the firearm. \n \n(2)(a) This section does not apply to a person who stores or leaves a firearm in the person's residence if the firearm is kept in safe storage. \n(b) This section does not apply to a person who stores or leaves a firearm in the person's residence if a minor gains access to the firearm as a result of any other person's unlawful entry into the person's residence. \n \n(B)(1) Whoever violates this section is guilty of criminally negligent storage of a firearm.  Except as provided in divisions (B)(2) or (B)(3) of this section, criminally negligent storage of a firearm is a misdemeanor of the fourth degree. \n \n(2) If a minor gains access to a firearm as the result of a violation of this section, except as provided in division (B)(3) of this section, a violation of this section is a misdemeanor of the third degree. \n \n(3) If a minor gains access to a firearm as a result of a violation of this section and uses the firearm to cause any personal injury or death, other than in self-defense, a violation of this section is a misdemeanor of the first degree. \n \n(C) Nothing in this section prohibits a person who is in the person's residence from carrying a firearm on the person's person or placing a firearm in a location that is under the person's immediate control.\n \n(D) This section shall not apply if the circumstances indicate that the firearm was unlawfully furnished to the minor, violation of which would be prosecuted under applicable state law. \n \n(E) Any instrumentality that has been used in a violation of this section shall be seized and is subject to forfeiture pursuant to Chapter 2981 of the Ohio Revised Code.\n \n \n2323.32 - Unlawful possession of a large capacity magazine\n(A) No person shall knowingly possess, purchase, keep for sale, offer or expose for sale, transfer, distribute, or import a large capacity magazine.\n \n(B)(1) This section does not apply to either of the following:\n \n(a) An officer, agent, or employee of this or any other state, a political subdivision of this or any other state, or the United States; members of the armed forces of the United States or the organized militia of this or any other state; and law enforcement officers to the extent that the officer, agent, employee, or member is authorized to possess, purchase, keep for sale, offer or expose for sale, transfer, distribute, or import large capacity magazines and is acting within the scope of the officer's, agent's, employee's, or member’s duties;\n \n(b) Any person who is employed in this state, who is authorized to carry concealed weapons or dangerous ordnances or is authorized to carry handguns, and who is subject to and in compliance with the requirements of section 109.801 of the Revised Code, and is acting within the scope of the employee's duties unless the appointing authority of the person has expressly specified that the exemption provided in division (B)(1)(b) of this section does not apply to the person;\n \n(2) This section does not apply to a large capacity magazine which belongs to a firearm or which is possessed by the owner of a firearm which is registered with federal authorities under the National Firearms Act (26 U.S.C.A. Secs. 5801-5871) or has been rendered totally inoperable or inert and the firearm cannot be readily rendered operable or activated and which is kept as a trophy, souvenir, curio or museum piece.\n \n(3) This section does not apply to importers, manufacturers, and dealers of large capacity magazines that are licensed under the \"Gun Control Act of 1968,\" 82 Stat. 1213, 18 U.S.C. 923, and any amendments or additions thereto or reenactments thereof;\n \n(4) This section does not apply to carriers, warehouses, and others engaged in the business of transporting or storing firearms for hire, with respect to large capacity magazines lawfully transported or stored in the usual course of business and in compliance with the laws of this state and applicable federal law.\n \n(C) Whoever violates this section is guilty of unlawful carry or possession of a large capacity magazine, a misdemeanor punishable by up to one year in jail with a mandatory minimum jail term of at least one hundred eighty (180) consecutive days during which mandatory jail term the defendant shall not be eligible for work release and up to a $1500 fine.\n \n(D) It is an affirmative defense to a violation of this section that the person knowingly possessed, kept for sale, transferred, distributed, or imported a large capacity magazine solely for the purpose of transporting the large capacity magazine in a motor vehicle for an otherwise lawful purpose through the municipal limits of the city.  This defense shall only apply if the large capacity magazine is not on the actor's person or within the passenger area of the motor vehicle.\n \n(E)Any instrumentality that has been used in a violation of this section shall be seized and is subject to forfeiture pursuant to Chapter 2981 of the Ohio Revised Code.\n \n2323.321 Alternate large capacity magazine provision if Ohio Revised Code Section 9.68 is reinstated.\nIf a court of competent jurisdiction reinstates Ohio Revised Code Section 9.68 which governs the regulation of firearms by a political subdivision or if the definition of “Large capacity magazine” in Section 2323.11 of the Columbus City Codes is declared by a court of competent jurisdiction to be unconstitutional or otherwise invalid, then the definition of a “Large capacity magazine” under Section 2323.11 shall be as follows:\n \n“Large capacity magazine” means any magazine, belt, drum, feed strip, clip or other similar device that has the capacity of, or can be readily restored or converted to accept, one hundred (100) or more rounds of ammunition for use in a firearm other than a handgun.  A “large capacity magazine” does not include any of the following:\n(1) A feeding device that has been permanently altered so that it cannot accommodate more than one hundred rounds of ammunition;\n(2) A .22 caliber tube ammunition feeding device;\n(3) A tubular magazine that is contained in a lever-action firearm;\n(4) A magazine that is permanently inoperable. \n \nSection 3. That existing sections 2303.05, 2303.14, 2323.11, and 2323.20 are hereby repealed.\n \nSection 4. That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 64,
    "meeting_date": "2022-12-05",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services"
    ]
  }
}