{
  "success": true,
  "vote": {
    "id": 5356,
    "item_number": "0",
    "title": "To authorize the Director of Public Utilities to enter into contract with SGI Matrix, LLC for Security System Parts, Installation, Maintenance, Monitoring, Repair and Support Services for the various facilities of the Department of Public Utilities; to waive the competitive bidding provisions of the City Code; and to authorize the expenditure of $212,000.00 ($104,000.00 from Electricity Operating Fund, $100,000.00 from the Sewerage and Drainage Operating Fund and $8,000.00 from the Department Operating Fund). ($212,000.00)",
    "description": "Explanation\n \nThis legislation authorizes the Director of Public Utilities to enter into contract with SGI Matrix, LLC for the purpose of providing Parts, Installation, Maintenance, Monitoring, Repair and Support Services for both new installations and existing security equipment for the various locations of the Department of Public Utilities.  The Department of Public Utilities currently uses the Frontier access control system to secure many of its facilities.  This contract provides for the parts, service and maintenance of all access control products under the Frontier Security brand including but not limited to Badge Readers, Reader Control Modules, Serial Boards, Reader Distribution Panels, Matrix Subsystem Gateways, Door Controllers, Building Controller Items and all associated connections.  Batteries and Building Controllers are considered Consumables and therefore not covered under the maintenance services.  Building Controllers are considered end-of-life items and must be replaced with new installs rather than be repaired.  This agreement provides for the repair/replacement and servicing of all accessible components and devices, emergency service calls and 24 hours a day, 7 days a week telephone support, panel and peripheral component replacement for the various electronic systems.\n \nSGI Matrix, LLC has installed all of the badge readers and has maintained the software, subsystem, and building controllers since the systems were installed at the various Department of Public Utilities facilities.  SGI Matrix utilizes KNS Services as a subcontractor on the project to run cabling and place the equipment, but SGI Matrix, LLC will provide installation, final hook-up, test and programming of devices. \n \nDue to the proprietary nature of the security software and compatibility of existing security equipment, it is in the best interest of the City to waive the provisions of competitive bidding and enter into contract with SGI Matrix, LLC. Due to supply chain issues, quotes will be obtained before orders will be placed.\n \nThis contract will be for one year from the date of execution, with the option to renew annually based upon mutual agreement, budgeted funds, and approval by City Council. If unforeseen issues or difficulties are encountered that would require additional funding, a modification would be requested.\n \nSUPPLIER: SGI Matrix, LLC. CC No. 81-3876225, Vendor#019553, expiration date 3/9/2023.\n \nFISCAL IMPACT:  $212,000.00 is budgeted and needed for this service.\n$52,251.96 was spent in 2021\n$43,014.26 was spent in 2020\n \nTitle\n \nTo authorize the Director of Public Utilities to enter into contract with SGI Matrix, LLC for Security System Parts, Installation, Maintenance, Monitoring, Repair and Support Services for the various facilities of the Department of Public Utilities; to waive the competitive bidding provisions of the City Code; and to authorize the expenditure of $212,000.00 ($104,000.00 from Electricity Operating Fund, $100,000.00 from the Sewerage and Drainage Operating Fund and $8,000.00 from the Department Operating Fund). ($212,000.00)\n \nBody\n \nWHEREAS, the Department of Public Utilities is in need of establishing a new contract with SGI Matrix, LLC for the purpose of providing parts, installation, maintenance, monitoring, repair  and support services for both new installations and existing security equipment for the various locations of the Department of Public Utilities; and \n \nWHEREAS, due to the proprietary nature of the security software and compatibility with existing security equipment,  it is in the City’s best interest to waive competitive bidding relevant to provisions of Chapter 329 of City Code and enter into a contract with SGI Matrix, LLC; and\n \nWHEREAS, this contract provides for the parts, service and maintenance of all access control products under the Frontier Security brand including, but not limited to, Badge Readers, Reader Control Modules, Serial Boards, Reader Distribution Panels, Matrix Subsystem Gateways, Door Controllers, Building Controller Items and all associated connections.  Batteries and Building Controllers are considered Consumables and therefore not covered under the maintenance services.  Building Controllers are considered end-of-life items and must be replaced with new installs, rather than be repaired; and\n \nWHEREAS, the agreement provides for the repair/replacement and servicing of all accessible components and devices, emergency service calls and 24 hours a day, 7 days a week telephone support, panel and peripheral component replacement for the various electronic systems; and\n \nWHEREAS, the term of this contract will be for the period of one (1) year from the date of execution by the City of Columbus. If unforeseen issues or difficulties are encountered that would require additional funding, a modification would be requested and is subject to and conditioned upon the approval of City Council, and appropriation and certification of funds by the City Auditor; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities to authorize the Director of Public Utilities to enter into contract with SGI Matrix, LLC for Security System Parts, Installation, Maintenance, Monitoring, Repair and Support Services for the various facilities of the Department of Public Utilities; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Utilities be and is hereby authorized to enter into contract with SGI Matrix, LLC for Security System Parts, Installation, Maintenance, Monitoring, Repair and Support Services for the various facilities of the Department of Public Utilities, in accordance with the terms and conditions as shown in the agreement on file in the office of the Department of Public Utilities.\n \nSECTION 2.  That said firm shall conduct the work to the satisfaction of the Director of Public Utilities.\n \nSECTION 3. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 5.  That this Council finds it in the City's best interest to waive the competitive bidding provisions of Chapter 329 of the City Code for the new contract with SGI Matrix, LLC.\n \nSECTION 6.  That the expenditure of $212,000.00 or so much thereof as may be needed, be and the same hereby is authorized in fund 03 Services ($104,000.00 from Electricity Operating Fund, $100,000.00 from the Sewerage and Drainage Operating Fund and $8,000.00 from the Department Operating Fund). ($212,000.00)\n \nSECTION 7.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 65,
    "meeting_date": "2022-12-12",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}