{
  "success": true,
  "vote": {
    "id": 5368,
    "item_number": "0",
    "title": "To amend the 2022 Capital Improvement Budget; to authorize the City Auditor to appropriate and transfer funds from the Special Income Tax to the Affordable Housing Taxable Bond Fund; to authorize the Director of the Department of Development to enter into a grant agreement in an amount up to $2,550,000.00 with Columbus Housing Partnership, Inc for Easton Place Homes Phase II development; to authorize the appropriation and expenditure of $2,550,000.00 within the Affordable Housing Taxable Bond Fund; and to declare an emergency. ($2,550,000.00) (AMENDED BY ORDINANCE 2011-2023 PASSED JULY 31, 2023) BA",
    "description": "Explanation\n \nBACKGROUND\nThis legislation authorizes the Director of the Department of Development to enter into a grant agreement with Columbus Housing Partnership, Inc., a non-profit entity, for Easton Place Homes Phase II development.  \nEaston Place Homes Phase II is a proposed 100-unit apartment development for families located at Easton Square Place and Charter Oak Way in Columbus, Ohio. The 4.65-acre parcel will be split to create lots on which approximately 200 units of affordable housing will be developed in three phases. Easton Place Homes Phase II is located directly south of the market rate townhomes facing Easton Way, which is the southern boundary of the premier retail/restaurant/entertainment district in Columbus. Major employers, such as JPMorgan Chase and Huntington Bank, employ thousands within walking distance-census data from 2018 indicates 24,000 jobs within a mile of the site-making this an extremely convenient location in all respects. \nThe property will consist of four 3-story apartment buildings with a combination of townhomes and stacked flats. Easton Place Phase II will offer a mix of 24 one-bedroom, 59 two-bedroom, and 17 three-bedroom apartments. Community space includes a community room with kitchenette, fitness room and management office. Easton Place will serve a mix of income levels from 30% AMI to 60% AMI. Depending on final utility allowances, net rents for the different unit sizes are estimated at $360-830 for one-bedroom, $430-995 for two-bedroom and $485-1135 for three-bedroom apartments. \nEaston Place Homes Phase 1 has secured Low Income Housing Tax Credits and OHFA HDAP funds, along with additional private loans and City HOME funds to fund this Phase’s Total Development Cost of $14,992,121.00.  In addition to the City’s Capital funds, Phase II has also secured 4% tax credits from OHFA in 2021, along with OHFA HDAP, and County HOME funds and other private loans.  Phase 3 is still in the process of getting State resources.\n \nEaston Place Homes is owned and developed by Homeport and The Georgetown Company.  Homeport is a non-profit housing developer based in Columbus, Ohio. Since its inception in 1987, Homeport has given greater security, opportunity and dignity to thousands of low income people by building quality, affordable homes, primarily financed with private investment leveraged by Federal tax credits. Homeport has established itself as the largest locally focused nonprofit producer of affordable housing and related services in the region. For more than 30 years Homeport has participated in the development, sale or preservation of more than 4,000 units of housing in Central Ohio.\nThe original ordinance 1821-2022 passed on July 11, 2022 authorized the Director to enter into a development agreement for the total contract amount of $4,800,000.00 and a grant agreement for $2,250,000.00 coming from the 2021 Capital Budget with Easton Loop Apartments II, LLC.  Upon further discussion, the correct recipient should have been Columbus Housing Partnership, Inc. dba Homeport so an amendment to the original ordinance was established and was authorized by ordinance 2484-2022 and passed on September 19, 2022.  The original ordinance established an ACPO007959 in the amount of $2,250,000.00 utilizing Affordable Housing bond funds coming from the 2021 Capital Budget.  \nThis project has not yet closed on its financing.  This ordinance will allow for the establishment of the remaining $2,550,000.00 from the City’s 2022 Capital Budget through a bond agreement funded temporarily with the Special Income Tax Fund until bonds are issued. A Housing Development Agreement was not established and is no longer needed. This project would complete a bond agreement for the total amount of established funds, $4,800,000.00, $2,250,000.00 coming from the 2021 Capital Budget and $2,550,000.00 coming from the 2022 Capital Budget. \n \nEmergency action is requested to maintain the closing schedule of the project and to mitigate construction cost increases.\n \nFISCAL IMPACTS\nThis ordinance authorizes an expenditure of $2,550,000.00 in the Affordable Housing Bond Fund. It is necessary to certify the requisite funds in the amount of $2,550,000.00 against the Special Income Tax Fund. An amendment to the 2022 Capital Improvement Budget is required to establish sufficient budget authority within the proper project.\nCONTRACT COMPLIANCE:  the vendor number is 004842 and expires 03/14/24.\n \n \nTitle\n \nTo amend the 2022 Capital Improvement Budget; to authorize the City Auditor to appropriate and transfer funds from the Special Income Tax to the Affordable Housing Taxable Bond Fund; to authorize the Director of the Department of Development to enter into a grant agreement in an amount up to $2,550,000.00 with Columbus Housing Partnership, Inc for Easton Place Homes Phase II development; to authorize the appropriation and expenditure of $2,550,000.00 within the Affordable Housing Taxable Bond Fund; and to declare an emergency. ($2,550,000.00) (AMENDED BY ORDINANCE 2011-2023 PASSED JULY 31, 2023) BA\n \n \nBody\n \nWHEREAS, the Director of the Department of Development desires to enter into a grant agreement with Columbus Housing Partnership, Inc for Easton Place Homes Phase II development; and\nWHEREAS Easton Place Homes Phase II is a proposed 100-unit apartment development for families located at Easton Square Place and Charter Oak Way in Columbus, Ohio, and will offer a mix of 24 one-bedroom, 59 two-bedroom, and 17 three-bedroom apartments; and\n \nWHEREAS, Easton Place will serve a mix of income levels from 30% AMI to 60% AMI. Depending on final utility allowances, net rents for the different unit sizes are estimated at $360-830 for one-bedroom, $430-995 for two-bedroom and $485-1135 for three-bedroom apartments; and\n \nWHEREAS, In addition to the City’s Capital funds, Phase II has also secured 4% tax credits from OHFA in 2021, along with OHFA HDAP, and County HOME funds and other private loans; and\n \nWHEREAS, The original ordinance 1821-2022 passed on July 11, 2022 authorized the Director to enter into a development agreement for the total contract amount of $4,800,000.00 and a grant agreement for $2,250,000.00 coming from the 2021 Capital Budget with Columbus Housing Partnership, Inc; and\n \nWHEREAS, This ordinance will allow for the establishment of $2,550,000.00 from the City’s 2022 Capital Budget through a bond agreement funded temporarily with the Special Income Tax Fund until bonds are issued, with a Housing Development Agreement no longer needed; and\n \nWHEREAS, the City’s obligation to provide financial assistance as set forth herein is contingent upon the subsequent adoption of appropriate legislation by Columbus City Council authorizing such assistance; and\n \nWHEREAS, it is necessary to amend the 2022 Capital Improvement Budget to establish authority within the correct project; and\n \nWHEREAS, it is necessary to transfer funds from the Special Income Tax Fund to fund this project; and\n \nWHEREAS, the City will reimburse the Special Income Tax Fund; and\n \nWHEREAS, this transfer should be considered as a temporary funding method; and\n \nWHEREAS, the aggregated principal amount of obligations which the City will issue to finance this project is presently expected not to exceed $2,550,000.00; and\n \nWHEREAS, the City anticipates incurring Original Expenditures (as defined in Section 1.150-2(c) of the Treasury Regulations (the “Treasury Regulations”) promulgated pursuant to the Internal Revenue Code of 1986, as amended with respect to the project described in this ordinance (the “Project”); and\n \nWHEREAS, the City's agreement to provide financial assistance as set forth herein is contingent upon authorization pursuant to subsequent passage of appropriate legislation by Columbus City Council; \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to enter into agreement with Columbus Housing Partnership, Inc to maintain the closing schedule of the project and to mitigate construction cost increases; now therefore; NOW, THEREFORE,\n \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \n \nSECTION 1.                     That the 2022 Capital Improvements Budget authorized by ordinance 1896-2022 be amended as follows to establish sufficient authority for this project:\n \nFund / Project / Project Name / Current / Change /C.I.B. as Amended\n \n7779 / P782012-100000 / Affordable Housing Funds (Voted 2019 SIT Supported) / $15,500,000 / ($2,550,000.00) / $12,950,000.00\n \n7779 / P782035-100000 / Easton Place Homes II / $0.00 / $2,550,000.00 / $2,550,000.00 \nSECTION 2.                      That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2022, the sum of $2,550,000.00 is appropriated in Fund 4430 (Special Income Tax), Dept-Div 2201 (City Auditor) in Object Class 10 (Transfer Out Operating) and in Fund 7779 (Affordable Housing Taxable Bond Fund), Dept-Div 44-10 (Housing Division), Project P782035-100000 (Easton Place Homes II), in Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\nSECTION 3. That the transfer of $2,550,000.00, or so much thereof as may be needed, is hereby authorized from Fund 4430 (Special Income Tax Fund), Dept-Div 2201 (City Auditor) to Fund 7779 (Affordable Housing Taxable Bond Fund), Dept-Div 44-10 (Housing Division) per the account codes in the attachment to this ordinance.\nSECTION 4.  That the Director of the Department of Development be and is hereby authorized to enter into a grant agreement for up to $2,550,000.00 on behalf of the City with the Columbus Housing Partnership, Inc for Easton Place Homes Phase II development.\nSECTION 5. That the expenditure of $2,550,000.00 to the Columbus Housing Partnership, Inc, or so much thereof as may be needed, is hereby authorized in Fund 7779 (Affordable Housing Taxable Bond Fund), Dept-Div 44-10 (Housing Division), in object class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\nSECTION 6. That upon obtaining other funds for this project for the Department of Development, the City Auditor is hereby authorized and directed to repay the Special Income Tax Fund the amount transferred under Section 3.\nSECTION 7. That the City intends that this ordinance constitute an “official intent” for purposes of Section 1.150-2(e) of the Treasury Regulations, and that the City reasonably expects to reimburse itself for certain Original Expenditures incurred with respect to the Project from the proceeds of obligations to be issued by the City in a principal amount currently estimated to be $2,550,000.00 (the “Obligations”).\nThe City intends to make a reimbursement allocation on its books for the Original Expenditures not later than eighteen months following the later to occur of the date of the Original Expenditure to be reimbursed or the date the Project for which such Original Expenditures were made is “placed in service” within the meaning of Treasury Regulations Section 1.150-2(c). Upon the issuance of the Obligations, the proceeds of such Obligations shall be used to reimburse the fund from which the advance for costs of the Project will be made.\nSECTION 8. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\nSECTION 9. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\nSECTION 10. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 65,
    "meeting_date": "2022-12-12",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}