{
  "success": true,
  "vote": {
    "id": 5387,
    "item_number": "CA-8",
    "title": "To authorize the Director of the Department of Development to enter into a grant agreement with Building 1267 LLC in an amount up to $3,000.00 for exterior renovations of 1267 W. Broad Street; to allow reimbursement for expenses incurred prior to the purchase order; to authorize a transfer between the Economic Development Division’s General Fund object classes of $3,000.00; and to authorize the expenditure of up to $3,000.00 from the General Fund; and to declare an emergency. ($3,000.00)",
    "description": "Explanation\n \nBackground:  This legislation authorizes the Director of the Department of Development to enter into a grant agreement in an amount up to $3,000.00 with Building 1267 LLC and to allow reimbursement of expenses incurred prior to the purchase order date. \n \nBuilding 1267  LLC entered into a grant agreement, approved by Ordinance 0571-2019 in the amount of $15,560.00, with the City of Columbus on October, 28, 2019 to provide/interior exterior renovations for 1267 W. Broad Street  under the City’s Neighborhood Commercial Revitalization (NCR) Interior/Exterior Grant Program.  The services outlined in the agreement were a new heliflix system, tuck pointing, stucco work, and painting.\n \nSubsequent to the agreement, Building 1267 LLC decided only to provide exterior renovation services which included tuck pointing, stucco work, and painting.     The grant agreement was amended to reflect a cost of service of $3,000.00 instead of the $15,560.00.  The exterior services of tuck pointing, stucco work, and painting, however, were not performed prior to the contract end date of October 28, 2020, and Building 1267 LLC was not reimbursed for serviced performed.      \n \nEmergency action is requested in order to provide funding to continue work to minimize disruption to the business owner.     \n \n \nFiscal Impact:   Funding for the grant agreement is available within the Division of Economic Development 2022 General Fund Budget in an amount up to $3,000.00    \n \nContract Compliance:  The contract compliance number is 030581 and it expires on 2/17/24.\n \nTitle\n \nTo authorize the Director of the Department of Development to enter into a grant agreement with Building 1267 LLC in an amount up to $3,000.00 for exterior renovations of 1267 W. Broad Street; to allow reimbursement for expenses incurred prior to the purchase order; to authorize a transfer between the Economic Development Division’s General Fund object classes of $3,000.00; and to authorize the expenditure of up to $3,000.00 from the General Fund; and to declare an emergency. ($3,000.00)\n \n \nBody\n \nWHEREAS, Building 1267 LLC entered into a grant agreement, approved by Ordinance 0571-2019 in the amount of $15,560.00,  with the City of Columbus, on October 28 2019, to provide  interior/exterior renovations for 1267 W. Broad Street under the  City’s Neighborhood Commercial Revitalization (NCR) Interior/Exterior Grant Program; and   \n \nWHEREAS, Subsequent to the agreement, Building 1267 LLC decided only to provide exterior renovation services which included tuck pointing, stucco work, and painting.    The grant agreement was amended to reflect a cost of service of $3,000.00 instead of the $15,560.00.  \n \nWHEREAS, the exterior renovation services of tuck pointing, stucco work, and, painting, however,  were not performed prior to the contract end date of October 28, 2020 and Building 1267 LLC was not reimbursed for exterior renovations services performed; and \n \nWHEREAS, the City of Columbus is committed to provide renovation services to businesses in the Neighborhood Commercial Revitalization Areas (NCR) under the Interior/Exterior Grant Program; and \n \nWHEREAS, it is necessary to enter into contract with Building 1267 LLC and to allow reimbursement for expenses incurred for  services performed at 1267 W. Broad Street prior to the purchase order; \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to authorize the Director to execute a grant agreement with Building 1267 LLC to provide funding to continue work to minimize disruption to the business owner thereby preserving the public health, peace, property, safety, and welfare; and NOW THEREFORE: \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     That the Director of the Department of Development is authorized to enter into a grant agreement in an amount up to $3,000.00 with Building 1267 LLC. under the City’s Neighborhood Commercial Revitalization (NCR) Interior/Exterior Grant Program for exterior renovations completed at 1267 W. Broad Street and is allowed to reimburse for expenses incurred prior to the purchase order date.  \n \nSECTION 2.   That the transfer of $3,000.00 or so much thereof as may be needed, is hereby authorized within Fund 1000 (General Fund), from Dept-Div 44-02 (Economic Development), object class 03 (Services) to Object Class 05 (Other) per the accounting  codes in the attachment to this ordinance.    \n \nSECTION 3.                     That for the purpose stated in Section 1, the expenditure of $3,000.00 or so much thereof as may be needed, is hereby authorized in Fund 1000 (General Fund),  Dept-Div 44-02 (Economic Development),  to Object Class 05 (Other) per the accounting codes in the attachment to this ordinance. \n \nSECTION 4.                     That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.   That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.    \n \nSECTION 6.   That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be enforced from and after its approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 65,
    "meeting_date": "2022-12-12",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Economic Development"
    ]
  }
}