{
  "success": true,
  "vote": {
    "id": 552,
    "item_number": "CA-9",
    "title": "To authorize the Director of Public Utilities to execute a planned modification of the 2020-2022 Construction Administration/Inspection Services Agreement with DLZ Ohio, Inc. for multiple Department of Public Utilities projects; to authorize the expenditure of up to $217,647.54 from the Electricity General Obligation Bond Fund; to authorize a transfer of up to $30,901.38 and expenditure of up to $111,156.48 from the Sewer General Obligation Bond Fund 6109; and to authorize an amendment to the 2020 Capital Improvements Budget.  ($328,804.02 )",
    "description": "Explanation\n \n1.0 BACKGROUND:  This legislation authorizes the Director of Public Utilities to execute a planned modification to the 2020 - 2022 Construction Administration/Inspection (CA/CI) Services agreement with DLZ Ohio, Inc.\n \nFunding for this modification will be for five projects including:\nDivision of Power/SMART Street Lighting CIP# 670878-100000 $153,402.87\nDivision of Power/UIRF East Fifth Avenue Decorative Street Lighting CIP# 440007-100022 $64,244.67\nDivision of Sewerage & Drainage/Blueprint W Franklinton Lining CIP#650875-100005 $30,901.38\nDivision of Sewerage & Drainage/Clintonville 1 Cooke / Glenmont CIP#650871-110171 $30,255.10\nDivision of Sewerage & Drainage/General CA/CI Services CIP#650800-100038 $50,000.00\n  \n \n1.1. Amount of additional funds to be expended:  $217,647.54\nOriginal Agreement Amount:              $1,227,027.50                     PO218447, PO218448, PO218450, PO218451, PO218452\nModification 1                                      $   54,610.00     PO228293\nModification 2                                      $ 668,555.17     PO238163\nModification 3                                      $   66,002.17     PO253702\nModification 4                                      $1,335,502.54  Pending\nModification 5                                      $  328,804.02 \nTotal (Orig. + Mods)                            $3,680,501.40  \n                                                               \n1.2. Reasons additional goods/services could not be foreseen:   \nThis is a three-year agreement for fiscal years 2020 - 2022 and modifications were anticipated and explained in the original legislation under Ordinance No. 0052-2020.\n \n1.3. Reason other procurement processes are not used:  \nThis is a multi-year contract that will be modified as required to provide construction administration / inspection services for construction projects that bid during the three year (2020-2022) timeframe.    \n \n1.4. How cost of modification was determined:\nThe cost of Modification No. 5 was determined by negotiations between DLZ Ohio, Inc. and the Department of Public Utilities.\n \n2.0 ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT:  \nThis contract provides administration and inspection oversight of DOSD Stormwater construction projects to ensure that work is consistent with and conforms to plans and specifications, and that the construction and any associated issues are handled efficiently and in the best interest of the City of Columbus.\n \n3.0 FUTURE MODIFICATION(S):  The Department anticipates requesting additional future modifications to this contract as new construction projects begin during 2020, 2021, and 2022.\n \n4.0 EMERGENCY DESIGNATION:   Emergency designation is not requested.\n \n5.0 FISCAL IMPACT:  This ordinance authorizes the expenditure of up to $217,647.54 from the Electricity G.O. Bond Fund 6303; the transfer within of up to $30,901.38 and expenditure of up to $111,156.48 from the Sewer General Obligation Fund 6109; and an amendment to the 2020 Capital Improvement Budget.  \n \n \nTitle\n \nTo authorize the Director of Public Utilities to execute a planned modification of the 2020-2022 Construction Administration/Inspection Services Agreement with DLZ Ohio, Inc. for multiple Department of Public Utilities projects; to authorize the expenditure of up to $217,647.54 from the Electricity General Obligation Bond Fund; to authorize a transfer of up to $30,901.38 and expenditure of up to $111,156.48 from the Sewer General Obligation Bond Fund 6109; and to authorize an amendment to the 2020 Capital Improvements Budget.  ($328,804.02 )\n \n \nBody\n \nWHEREAS, Ordinance No. 0052-2020, passed February 10, 2020, authorized the original agreement for Construction Administration / Inspection Services for 2020 - 2022 for Department of Public Utilities capital improvements projects with DLZ Ohio, Inc.; and\n \nWHEREAS, Ordinance No. 0851-2020, passed May 4, 2020, authorized Modification No. 1 for Construction Administration / Inspection Services for 2020 - 2022 for Department of Public Utilities capital improvements projects with DLZ Ohio, Inc.; and \n \nWHEREAS, Ordinance No. 1459-2020, passed July 20, 2020, authorized Modification No. 2 for Construction Administration / Inspection Services for 2020 - 2022 for Department of Public Utilities capital improvements projects with DLZ Ohio, Inc.; and\n \nWHEREAS, Ordinance No. 2652-2020, passed December 7, 2020, authorized Modification No. 3 for Construction Administration / Inspection Services for 2020 - 2022 for Department of Public Utilities capital improvements projects with DLZ Ohio, Inc.; and\n \nWHEREAS, Ordinance No. 0030-2021, passed March 1, 2021, authorized Modification No. 4 for Construction Administration / Inspection Services for 2020 - 2022 for Department of Public Utilities capital improvements projects with DLZ Ohio, Inc.; and\n \nWHEREAS, it is necessary to authorize the Director of the Department of Public Utilities to execute a contract modification (No. 5) to the 2020 - 2022 Construction Administration/Inspection Services Agreement with DLZ Ohio, Inc., for the Division of Power’s SMART Street Lighting Project, and the East Fifth Avenue Decorative Street Lighting Project; and\n \nWHEREAS, it is necessary to authorize the expenditure of up to $217,647.54 from the Electricity G.O. Bond Fund 6303; and \n \nWHEREAS, it is necessary to authorize the transfer of up to $30,901.38 and expenditure of up to $111,156.48 from the Sanitary General Obligation Bond Fund 6109; and\n \nWHEREAS, it is necessary to authorize an amendment to the 2020 Capital Improvements Budget for the purpose of providing sufficient spending authority for the aforementioned project expenditures; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities, to authorize the Director of Public Utilities to modify an existing construction administration/inspection contract with DLZ Ohio, Inc.to provide for additional projects, for the preservation of the public health, peace, property and safety; now therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Utilities is hereby authorized to modify and increase the 2020 - 2022 Construction Administration/Inspection Services Agreement with DLZ Ohio, Inc., 6121 Huntley Road, Columbus, Ohio 43229 (FID #31-1268980); in the amount of up to $328,804.02; in accordance with the terms and conditions of the contracts on file in the offices of the Division of Power and Division of Sewerage & Drainage.\n \nSECTION 2. That the expenditure of up to $217,647.54 is authorized from the Electricity G.O. Bond Fund 6303, per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That the transfer within of up to $30,901.38 and expenditure of up to $111,156.48 is authorized from the Sanitary General Obligation Bond Fund 6109, per the accounting codes in the attachment to this ordinance. \n \nSECTION 4. That the 2020 Capital Improvements Budget is amended per the funding template attachment to this ordinance. \n \nSECTION 5.  That the funds necessary to carry out the purpose of this Ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.  That the City Auditor is hereby authorized and directed to transfer any unencumbered balance in the project account to the unallocated balance within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies no longer required for said project; except that no transfer shall be made from a project account by monies from more than one source.\n \nSECTION 7.  That the City Auditor is authorized to establish proper project accounting numbers as appropriate.\n \nSECTION 8.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this Ordinance.\n \nSECTION 9. That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 9,
    "meeting_date": "2021-03-29",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}