{
  "success": true,
  "vote": {
    "id": 605,
    "item_number": "CA-10",
    "title": "To authorize the Directors of the Department of Technology and the Department of Public Utilities to modify a contract for professional services with Hansen Banner, LLC., in accordance with the sole source provisions of the Columbus City Code; and to authorize the expenditure of $600,000.00 (which includes contingency funds in the amount of $50,000.00) from the Department of Technology, Information Services Operating Fund. ($600,000.00)",
    "description": "Explanation\n \nBACKGROUND: \nThis ordinance authorizes the Directors of the Departments of Technology (DoT) and Public Utilities (DPU) to modify a contract agreement with Hansen Banner, LLC for professional services for the Enhanced Metering Project (EMP) to upgrade and enhance its water, sewer, and power metering which will consist of the implementation of an automated meter infrastructure system to provide meter readings associated with the Columbus Utility Billing System (CUBS), in the amount of $600,000.00 (which includes contingency funds in the amount of $50,000.00).  The project will also include the installation, via meter exchange, of the existing power, sewer, and water meters and all the software required to operate the system, and to interface with the Columbus Utility Billing Systems (CUBS) and City software applications.  The coverage term period is one (1) year from the date of a purchase order certified/confirmed by the City Auditor's Office.  In 1994, the Department of Public Utilities initiated a contract (CT-15918) for software and services related to the Water and Sewer Information Management System (WASIMS) with SCT Utility Systems.  Section 12 of the original contract provided for modifications and changes in scope of service.  SCT Utility Systems later changed their name to Indus Utility Systems, then to its current name Hansen Banner, LLC. \n \nThis modification for integration(s) will allow the City of Columbus to reduce the number of end users of the BannerCX system (Columbus Utility Billing System - CUBS) who need access to the Classic Banner Oracle Forms, thereby allowing Oracle licensing costs to be reduced.  The City of Columbus Customer Service and Billing departments use Hansen's BannerCX 5.1 as the key system of record for the Enhanced Metering Project and will issue work orders to the AMI vendor for all work to be performed.  As such, several interfaces will need to be developed for use during and after the AMI installation project.  The development of three (3) of the integrations will be required to support the Enhanced Metering Project (EMP). \n \nThe contract agreement was most recently authorized by authority of Ordinance No. 1550-2020, passed July 20, 2020 through purchase order PO238353.  This modification will provide for additional professional services to enhance/upgrade the CUBS system.  \n \n \n1.   Amount of additional funds to be expended: $600,000.00\nOriginal contract amount: $1,186,330.00\nAmount of original contract, renewals and modifications: $14,692,728.48\nThis ordinance modification: $600,000.00\nTotal aggregate contract: $15,292,728.48\n \n2.   Reason additional goods/services could not be foreseen:\nThe need for this modification was known, but the scope of work and the associated cost was not known at the time of the last contract modification.\n \n3.   Reason other procurement processes are not used:\nIt is not feasible to bid for an alternate service since Hansen developed the software for the CUBS and Enhanced Metering Project (EMP) system.  The company has developed custom software for the City and is the only company who can support these customizations. \n \n4.   How cost of modification was determined:\nThe City of Columbus and Hansen Banner, LLC negotiated the cost of services shown in the Hansen Banner, LLC Statement of Work (SOW(s)) for these professional/upgrade services.\n \nThis ordinance also requests approval to continue services provided by Hansen in accordance with sole source procurement provisions of Section 329 of the Columbus City Code; as it has been determined Hansen is the sole distributor of the software products associated with the CUBS system, and does not utilize distributors or resellers to provide maintenance and support, or professional services for its software products.\n \n \nFISCAL IMPACT: \nIn 2019 and 2020, $346,307.12 and $1,316,607.05, respectively was legislated for maintenance, support, and upgrades.  The cost associated with this contract modification (2021) with Hansen Banner LLC., is $600,000.00 (which includes contingency funds in the amount of $50,000.00).  The funds are identified and available within the Department of Technology, Information Services Operating Fund - DPU's direct charge budget. The aggregate contract total amount including this request is $15,292,728.48.    \n \nCONTRACT COMPLIANCE:   \nVendor Name:   Hansen Banner, LLC                CC#: 46 - 5651020                     Expiration Date: 08/13/2022\n      (City Vendor Account / DAX Acct. ID: 008834)\n \nTitle\n \nTo authorize the Directors of the Department of Technology and the Department of Public Utilities to modify a contract for professional services with Hansen Banner, LLC., in accordance with the sole source provisions of the Columbus City Code; and to authorize the expenditure of $600,000.00 (which includes contingency funds in the amount of $50,000.00) from the Department of Technology, Information Services Operating Fund. ($600,000.00)\n \nBody\n \nWHEREAS, it is necessary to authorize the Directors of the Departments of Technology and Public Utilities to modify a contract agreement with Hansen Banner, LLC., for professional services for the Columbus Utility Billing System (CUBS); and.   \n \nWHEREAS, it is necessary to modify this contract to increase funds by $600,000.00 (which includes contingency funds in the amount of $50,000.00) for additional professional services from Hansen Banner, LLC., for the Enhanced Metering Project (EMP) to enhance/upgrade/integrate the CUBS system and the Hansen Banner software in the Columbus Utility Billing system (CUBS) for DPU.  The coverage term period is one (1) year from the date of a purchase order certified/confirmed by the City Auditor's Office; and\n \n \nWHEREAS, this modification for integration(s) will allow the City of Columbus to reduce the number of end users of the BannerCX system (Columbus Utility Billing System - CUBS) who need access to the Classic Banner Oracle Forms, thereby allowing Oracle licensing costs to be reduced.  The City of Columbus Customer Service and Billing departments use Hansen's BannerCX 5.1 as the key system of record for the Enhanced Metering Project and will issue work orders to the AMI vendor for all work to be performed.  As such, several interfaces will need to be developed for use during and after the AMI installation project.  The development of three (3) of the integrations will be required to support the Enhanced Metering Project (EMP); and\n \nWHEREAS, the contract agreement was most recently authorized by authority of Ordinance No. 1550-2020, passed July 20, 2020 through purchase order PO238353; and   \n \nWHEREAS, Hansen Banner, LLC., is the sole distributor of the software products associated with the CUBS system, and does not utilize distributors or resellers to provide maintenance and support, or professional services for its software products; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities to authorize the Directors of the Department of Technology and the Department of Public Utilities to modify a contract for professional services with Hansen Banner, LLC to support the Columbus Utility Billing System (CUBS) in order to maintain uninterrupted services from the supplier, thereby preserving the public health, peace, property, safety, and welfare; NOW, THEREFORE: \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1: That the Directors of the Department of Technology and the Department of Public Utilities be, and are hereby, authorized to modify a contract with Hansen Banner, LLC. for additional professional services for the Enhanced Metering Project (EMP) to upgrade the CUBS system and the Hansen Banner, LLC software in the amount of $600,000.00 (which includes contingency funds in the amount of $50,000.00).  The coverage term period is one (1) year from the date of a purchase order certified/confirmed by the City Auditor's Office.\n \n \nSECTION 2: That the expenditure of $600,000.00 or so much thereof as may be necessary, is hereby authorized to be expended from the Department of Technology, Information Services operating fund, per the account codes in the attachment to this ordinance. (see attachment 0668-2021 EXP)\n \n \nSECTION 3: That the City Auditor is authorized to make any changes to revise the funding source for any contract or contract modifications associated with this ordinance.\n \n \nSECTION 4:  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \n \nSECTION 5:  That this ordinance modification is in accordance with the sole source provisions of the City of Columbus Code Chapter 329.\n \n \nSECTION 6: That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 10,
    "meeting_date": "2021-04-05",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}