{
  "success": true,
  "vote": {
    "id": 6222,
    "item_number": "CA-34",
    "title": "To authorize the Director of Recreation and Parks to enter into contract with EMH&T to provide architectural and engineering services for the Mock Park and Anheuser Busch Park Development Project; to authorize the transfer of $522,529.91 within the Recreation and Parks Voted Bond Fund; to authorize the amendment of the 2022 Capital Improvements Budget; to authorize the expenditure of $465,800.00 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($465,800.00)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Director of the Recreation and Parks Department to enter into contract with Evans, Mechwart, Hableton, and Tilton (EMH&T) to provide architectural and engineering services for the Mock Park and Anheuser Busch Park Development Project. The contract amount is $419,800.00, with a contingency of $46,000.00, for a total of $465,800.00 being authorized by this ordinance.\n \nAnheuser Busch Sports Park, located at 4990 Olentangy River Road, currently features eight regulation ball diamonds with ample parking. The park is also home to the Bill McDonald Athletic Complex on the north side of the park as well as multiple athletic fields. The Recreation and Parks Department is proposing to add four pickleball courts in place of one soccer field, relocating that soccer field to one of the existing ball diamonds. Preliminary programming of the pickleball courts indicates that there will also be a need for new fencing, storage, utility improvements, lighting, and parking. \n \nMock Park, located at 2520 Mock Road, currently features a walking loop, playground equipment, an open shelter, basketball courts, tennis courts, and parking. The Recreation and Parks Department is proposing to add a three season sports facility to Mock Park, including 12 pickleball courts. Preliminary programming shows the updated park will also need additional parking, lighting, fencing, storage, and a concession area with a water station. The Department envisions that this facility will be used for local, regional, and national pickleball tournaments. The current vehicle access routes and parking facilities are inadequate to accommodate the proposed volume of these improvements. Therefore, improvements will be needed to promote safe and efficient access and egress within the park. The Department also intends on adding utility improvements to the park, such as lighting for fields and lots, electrical hook-ups for food trucks, and restrooms.\n \nVendor Bid/Proposal Submissions (ODI designation status):\n \nProposals were advertised through Vendor Services, in accordance with City Code Chapter 329, on November 8, 2022 and received by the Recreation and Parks Department on November 29, 2022. Proposals were received from the following companies:\n \nEMH&T (MAJ)\nLatus Studio (MAJ)\nStar Consultants (MBE)\n \nOf note, professional services contracts are quality based selections and not based on price. Costs were not requested nor where they part of this evaluation. \n \nIn accordance with City Code, a selection team evaluated the proposals and recommended EMH&T be selected to perform the work.  The firm was chosen based on their referenced projects, experience, qualifications, availability, timeline, and project approach.\nPrincipal Parties: \nEvans, Mechwart, Hableton, and Tilton, Inc. DBA EMH&T\n5500 New Albany Road \nColumbus, Ohio 43054\nJim Dziatkowicz, (614) 775-4703\nContract Compliance Number, Tax ID: 004214, 31-0685594\nContract Compliance Expiration Date: November 16, 2024\n \nEmergency Justification: Emergency action is requested to ensure the consultant team is provided enough time to have plans ready to bid for construction by fall of 2023 as it is the intent of the Recreation and Parks Department that the improved Anheuser Busch Park be open for use by spring of 2024 so the community can receive the improvements at the earliest practical time.\n \nBenefits to the Public: This project benefits the public by significantly enhancing the pickleball amenities and programs the City can offer to the public. Additionally, these improvements set up the City to be a major destination for pickleball programs and tournaments for all levels of play, from recreational to professional.\n \nCommunity Input/Issues: Input for this improvement project was primarily gathered through the Columbus Community Sports Park feasibility study conducted by Conventions, Sports and Leisure International (CSL) and managed by the Recreation and Parks Department in summer of 2021. Input was also gathered from internal Columbus Recreation and Parks Department stakeholders and the Mayor’s Office.  \n \nArea(s) Affected: Northwest (34) and Northeast (41)\n \nMaster Plan Relation: This project will support the Recreation and Parks Master Plan by updating sports related parks, expanding amenities to appeal to a more diversified audience, and updating five neighborhood parks per year.\n \nFiscal Impact: $465,800.00 is budgeted and available from within the Recreation and Parks Voted Bond Fund 7702 and 7712 to meet the financial obligations of this contract.\n \nTitle\n \nTo authorize the Director of Recreation and Parks to enter into contract with EMH&T to provide architectural and engineering services for the Mock Park and Anheuser Busch Park Development Project; to authorize the transfer of $522,529.91 within the Recreation and Parks Voted Bond Fund; to authorize the amendment of the 2022 Capital Improvements Budget; to authorize the expenditure of $465,800.00 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($465,800.00)\n \nBody\n \nWHEREAS, it is necessary to authorize the Director of Recreation and Parks to enter into contract with EMH&T to provide architectural and engineering services for the Mock Park and Anheuser Busch Park Development Project; and\n \nWHEREAS, it is necessary to authorize the transfer of $522,529.91 within the Recreation and Parks Voted Bond Fund 7702 and 7712; and\n \nWHEREAS, it is necessary to authorize the amendment of the 2022 Capital Improvements Budget Ordinance 1896-2022 in order to provide sufficient budget authority for this and future projects; and\n \nWHEREAS, it is necessary to authorize the expenditure of $465,800.00 from the Recreation and Parks Voted Bond Fund 7702 and 7712; and\n \nWHEREAS, community input for these improvements was gathered in 2021 and the funding for this project was just recently authorized. The community has been waiting for these improvements and without this design contract in place as soon as possible, these needed improvements will not be completed in a manner that would benefit the park users and community; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department in Recreation and Parks in that it is immediately necessary to authorize the Director to enter into contract with EMH&T so design can be completed and plans ready to bid for construction by fall of 2023 before the onset of the winter season to allow construction to proceed at the earliest practical time so the community can receive the improvements, for the public health, safety and welfare; NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Recreation and Parks be and is hereby authorized to enter into contract with EMH&T to provide architectural and engineering services for the Mock Park and Anheuser Busch Park Development Project.\n \nSECTION 2. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 4. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 5. That the transfer of $522,529.91 or so much thereof as may be needed, is hereby authorized between projects within the Recreation and Parks Voted Bond Fund 7702 and 7712 per the account codes in the attachment to this ordinance.\n \nSECTION 6. That the 2022 Capital Improvements Budget Ordinance 1896-2022 is hereby amended as follows in order to provide sufficient budget authority for this ordinance and future projects.\nFund / Project / Project Name / Current / Change / Amended\n \nFund 7702 / P512006-100000 / Big Walnut Trail - Elk Run to Winchester Pike (Voted Carryover) / $0 / $84,679 / $84,679 (to match cash)\nFund 7702 / P512019-100000 / Dry Run Stream Restoration (Voted Carryover) / $0 / $35 / $35 (to match cash)\nFund 7702 / P512020-100000 / New Development - General Design & Construction Management (Voted Carryover) / $108,000 / $21,055 / $129,055 (to match cash)\nFund 7702 / P512024-100000 / Stockbridge Elementary School Demolition (Voted Carryover) / $0 / $20,055 / $20,055 (to match cash)\n \nFund 7702 / P512006-100000 / Big Walnut Trail - Elk Run to Winchester Pike (Voted Carryover) / $84,679 / ($84,679) / $0\nFund 7702 / P512019-100000 / Dry Run Stream Restoration (Voted Carryover) / $35 / ($35) / $0\nFund 7702 / P512020-100000 / New Development - General Design & Construction Management (Voted Carryover) / $129,055 / ($21,055) / $108,000\nFund 7702 / P512024-100000 / Stockbridge Elementary School Demolition (Voted Carryover) / $20,055 / ($20,055) / $0\nFund 7712 / P512004-100000 / Community Sports Park (Voted Carryover) / $396,706 / ($396,706) / $0\n \nFund 7702 / P512000-100000 / New Development - Misc. (Voted Carryover) / $2,924,050 / $56,730 / $2,980,780\nFund 7702 / P512004-202204 / Busch Park and Mock Park Improvements (Voted Carryover) / $0 / $69,094 / $69,094\nFund 7712 / P512004-202204 / Busch Park and Mock Park Improvements (Voted Carryover) / $0 / $396,706 / $396,706\n \nSECTION 7. For the purpose stated in Section 1, the expenditure of $465,800.00 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Recreation and Parks Voted Bond Fund 7702 and 7712 in object class 06 Capital Outlay per the accounting codes in the attachments to this ordinance.\n \nSECTION 8. That for the reasons stated in the preamble hereto, which is hereby made a part hereof,, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 74,
    "meeting_date": "2023-04-03",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}