{
  "success": true,
  "vote": {
    "id": 6227,
    "item_number": "CA-39",
    "title": "To authorize an amendment to the 2022 Capital Improvement Budget; to authorize a transfer of cash and appropriation within the Sanitary Bond Fund; to authorize the Director of Public Utilities to renew and increase a professional services contract with RAMA Consulting for the Blueprint Columbus Public Information Outreach Project; to authorize an expenditure of up to $462,098.61 from the Sanitary Bond Fund to pay for the contract renewal; and to declare an emergency.  ($462,098.61)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Utilities to renew and increase a professional services contract with RAMA Consulting for the Blueprint Columbus Public Information Outreach Project, CIP 650004-100005, in an amount up to $462,098.61, to pay for continuation of services.\n \nThe services provided in the Blueprint Columbus Public Information Outreach Project consist of: supporting the implementation of Blueprint Columbus in multiple project areas; educating and informing residents about Blueprint Columbus and the problem being addressed; providing adequate notification and keeping residents in project areas apprised of work being performed in their neighborhood; advising the City regarding residents’ concerns; and providing training or additional support for contractors and City field and other staff as needed.\n \nThe Community Area for this project is “99-Citywide” since the project spans more than one Community Area.\n \n1.1 Future Renewals/Modifications:  The original contract authorized by Ordinance No. 3157-2021 projected needing services through 2032.  Renewals are anticipated every few years to add funds to continue services.\n   \n1.2 Amount of additional funds to be expended:  $462,098.61\n      Original Contract                                                                               $360,450.51 (ORD 3157-2021; PO306242)\n                     Renewal No. 1 (Current)                                                              $462,098.61\n                     Future Renewals (Estimated amount)                        $2,687,901.39                                                               \n                     TOTAL ESTIMATED COST                                              $3,510,450.51\n \n1.3 Reason other procurement processes are not used:  Substantial information and knowledge has been developed by the consultant through work performed during the first years of the contract.  If the work to be performed under this renewal was to be bid out separately, tasks already completed would be performed repetitively causing delays and incurring additional cost.  \n \n1.4 How the cost of renewal was determined:  Through negotiations between RAMA Consulting and the Department of Public Utilities.\n \n2.  ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT\nAdministration of the Blueprint Columbus Public Information Outreach Project contract ensures community input is received and utilized to design the best solutions for unique neighborhood needs. Not only does this help Blueprint develop comprehensive solutions for our community, it also helps create an efficient process that reduces excessive costs resulting from engineering redesigns and timeframe extensions associated with addressing resident concerns through a less formal process.\n \n3.  CONTRACT COMPLIANCE INFORMATION\nRAMA Consulting’s contract compliance number is CC-001370 and expires 09/13/23.\n \nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) are not required for this contract renewal as no Federal or State funds will be expended on the contract.\n \n4.  MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract was put in place prior to the implementation of the City of Columbus MBE/WBE Program and is not subject to the requirements of that program.  RAMA Consulting is classified as an MBE company by the City’s Office of Diversity and Inclusion.  Per the Utilization Plan submitted with this ordinance, RAMA consulting plans to perform all needed services on this contract, so the anticipated contract spend is 100% MBE.\n \n5.  FISCAL IMPACT\nFunds are available and appropriated within the Sanitary Bond Fund, Fund 6109.  An amendment to the 2022 Capital Improvement Budget is needed to align budget authority with the proper project.  A transfer of cash and appropriation within the Sanitary Bond Fund is also needed to align cash and appropriation with the proper project.\n \n6.  EMERGENCY DESIGNATION\nEmergency designation is requested so as not to cause delays in consent order timelines for Blueprint projects.\n \nTitle\nTo authorize an amendment to the 2022 Capital Improvement Budget; to authorize a transfer of cash and appropriation within the Sanitary Bond Fund; to authorize the Director of Public Utilities to renew and increase a professional services contract with RAMA Consulting for the Blueprint Columbus Public Information Outreach Project; to authorize an expenditure of up to $462,098.61 from the Sanitary Bond Fund to pay for the contract renewal; and to declare an emergency.  ($462,098.61)\n \nBody\nWHEREAS, there is an existing professional services contract with RAMA Consulting for the Blueprint Columbus Public Information Outreach Project; and\n \nWHEREAS, it is necessary to authorize a contract renewal and increase contract funding to pay for additional contract services; and \n \nWHEREAS, the 2022 Capital Improvement Budget must be modified to align budget authority with the proper project; and\n \nWHEREAS, it is necessary to authorize a transfer of cash and appropriation within the Sanitary Bond Fund, Fund 6109, to align cash and appropriation with the proper project; and\n \nWHEREAS, funds must be expended from the Sanitary Bond Fund, Fund 6109, to pay for the contract renewal; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Utilities in that it is immediately necessary to execute the contract renewal so as not to cause delays in consent order timelines for Blueprint projects, thereby preserving the public health, peace, property, safety, and welfare; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2022 Capital Improvement Budget authorized by Ordinance 1896-2022 be amended as follows to establish sufficient budget authority for this project:\n \nFund / Project Number / Project Name (Funding Source) / Current Authority / Revised Authority / Change \n6109 / 650870-109152 / Blueprint 5th Ave by Northwest - Edgehill - Meadow (Voted Sanitary Carryover) / $150,000.00 / $0.00 / ($150,000.00)\n6109 / 650870-100701 / Blueprint Linden - Hudson - McGuffey (Voted Sanitary Carryover) / $735,367.00 / $735,366.00 / ($1.00)\n6109 / 650870-109151 / Blueprint 5th Ave by Northwest - Northwest - Sunrise - Glenn (Voted Sanitary Carryover) / $150,755.00 / $0.00 / ($150,755.00)\n6109 / 650876-122991 / Volunteer Sump Pump Program \"2022\" (Voted Sanitary Carryover) / $3,077,681.00 / $3,077,680.00 / ($1.00)\n6109 / 650870-110166 / Blueprint Olde Beechwold Area - Integrated Solutions (Voted Sanitary Carryover) / $180,840.00 / $19,497.00 / ($161,343.00)\n \n6109 / 650004-100005 / Blueprint Columbus Public Information Outreach 2022 (Voted Sanitary Carryover) / $0.00 / $462,099.00 / $462,099.00\n \nSECTION 2.  That the transfer of $462,098.61, or so much thereof as may be needed, is hereby authorized between projects within the Sanitary Bond Fund, Fund 6109, per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That the Director of Public Utilities is hereby authorized to renew and increase the professional services contract with RAMA Consulting, 897 E. 11th Avenue, Suite 100, Columbus, Ohio, 43211, for the Blueprint Columbus Public Information Outreach Project contract, in an amount up to $462,098.61.\n \nSECTION 4.  That an expenditure of $462,098.61, or so much thereof as may be needed, is hereby authorized from the Sanitary Bond Fund, Fund 6109, to pay for this contract renewal, per the accounting codes in the attachment to this ordinance. \n \nSECTION 5.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 7.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 8.  That for the reasons stated in the preamble hereto, which is made a part hereof, this Ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten (10) days after passage if the Mayor neither approves nor vetoes this Ordinance.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 74,
    "meeting_date": "2023-04-03",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}