{
  "success": true,
  "vote": {
    "id": 6255,
    "item_number": "CA-67",
    "title": "To authorize the Executive Director of the Civil Service Commission to increase the current contract with Mount Carmel Health Providers, Inc. for the administration of pre-employment physicals and cardiovascular stress testing of public safety recruits; to authorize the additional expenditure of $200,000.00 from the General Fund; and to declare an emergency ($200,000.00).",
    "description": "Explanation\nThe Civil Service Commission needs to increase the maximum authorized expenditure in the current contract with Mount Carmel Health Providers, Inc. and encumber said funds for pre-employment physicals and cardiovascular stress testing of public safety recruits in preparation for upcoming Police and Fire Academy classes. \n \nThe Civil Service Commission needs to increase the maximum authorized expenditure in the current contract with Mount Carmel Health Providers, Inc. in order to add funds for upcoming medical screening services. Funding is typically added annually or prior to each academy class.  The academy classes identified for 2023 so far are three (3) Police Officer classes totaling 170 recruits (57/57/56), and three Firefighter classes totaling 135 recruits (50/35/50).  Because, historically, it has taken two candidates completing medical evaluation to render one passing candidate for appointment to the academy, we anticipate the first wave of 2023 medical expenditures beyond the original $40,000.00 appropriation to be an additional $200,000.00, for a total 2023 appropriation to date of $240,000.00.\n \nBid Information: In 2022, the City of Columbus Civil Service Commission published a Request for Proposals (RFQ 023538) for these services and accepted proposals through December 2, 2022. Three proposals were submitted by the deadline.  An evaluation committee reviewed these proposals in accordance with the criteria set forth in the RFQ and the Executive Director selected and executed a contract with the selected vendor, Mount Carmel Health Providers, Inc., via Ordinance 3084-2022.\n \nEmergency designation: Emergency legislation is requested in order to continue to schedule police and fire candidates for pre-employment physicals and cardiovascular stress testing in preparation for upcoming recruit classes.\n \nContract Compliance Number: CC005227, expires 10/4/2023. \n \nFISCAL IMPACT: Funding for this wave of services is budgeted in the Civil Service Commission’s 2023 General Fund budget. \n \n \nTitle\nTo authorize the Executive Director of the Civil Service Commission to increase the current contract with Mount Carmel Health Providers, Inc. for the administration of pre-employment physicals and cardiovascular stress testing of public safety recruits; to authorize the additional expenditure of $200,000.00 from the General Fund; and to declare an emergency ($200,000.00).\n \n \nBody\nWHEREAS, the City of Columbus Civil Service Commission accepted proposals from qualified companies for medical services; and\n \nWHEREAS, the Civil Service Commission awarded the contract to Mount Carmel Health Providers, Inc. based upon the submissions of RFQ 023538; and\n \nWHEREAS, for 2023, Forty Thousand Dollars ($40,000.00) have been previously authorized to Mount Carmel Health Providers for the pre-employment physicals and cardiovascular stress testing of public safety recruits services per Ordinance 3084-2022; and\n \nWHEREAS it is now necessary to increase the current contract with Mount Carmel Health Providers, Inc. in order to continue scheduling public safety recruits in preparation for upcoming academy classes; and,\n \nWHEREAS an emergency exists in the usual daily operation of the Civil Service Commission, in that it is immediately necessary to authorize the Executive Director to increase the contract with Mount Carmel Health Providers, Inc. in order to continue scheduling public safety for pre-employment physicals and cardiovascular stress testing in preparation for upcoming academy classes, and thereby preserving the public peace, property, health, safety and welfare; now therefore:\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Executive Director of the Civil Service Commission be and is hereby authorized to increase the current contract with Mount Carmel Health Providers, Inc. for the purpose of administering pre-employment physicals and cardiovascular stress tests to public safety recruits for the Department of Public Safety’s police and fire entry-level sworn positions.\n \nSECTION 2. That the additional expenditure of $200,000.00 or so much thereof as may be needed, is hereby authorized in Fund 1000 General Fund in Object Class 03 per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 74,
    "meeting_date": "2023-04-03",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}