{
  "success": true,
  "vote": {
    "id": 6271,
    "item_number": "SR-4",
    "title": "To authorize the Director of Recreation and Parks to enter into contract with Righter Company for the Champions Bridge Superstructure Replacement and Alum Creek Stream Bank Stabilization Project; to authorize the transfer of $1,672,960.98 within the Recreation and Parks Voted Bond Fund, to authorize the amendment of the 2022 Capital Improvements Budget; to authorize the expenditure of $1,675,320.00 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($1,675,320.00)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Director of the Recreation and Parks Department to enter into contract with Righter Company for the Champions Bridge Superstructure Replacement and Alum Creek Stream Bank Stabilization Project. The contract amount is $1,325,320.00, with a contingency of $200,000.00, for a total of $1,525,320.00. An additional $150,000.00 is being authorized for interdepartmental inspections and fees for a total of $1,675,320.00 being authorized by this ordinance.\n \nThe Champions Bridge is located along the Alum Creek Trail between the Easton Soccer Fields and the seventh hole on Champions Golf Course. In 2015, when the false decking was removed from the bridge, the deck deflected leaving an uneven ride and feel over the bridge. At that time, an investigation was performed and it was determined that that bridge had to be load posted which prohibited emergency vehicles from crossing the bridge. It was determined to be safe for pedestrians and remained open.  The bridge, however, does not function per its intended design. An error in the design of the bridge is the sole cause for the deflections and movement of the structure when in use. The City Attorney’s Office, along with the Defendant’s legal counsel, have been working for several years to mitigate this issue. For the safety of the trail users, it was decided that the bridge needed to be mitigated and that the damages would be pursued concurrently with construction activities and perhaps after completion.\n \nOrdinance 1075-2022 approved a contract with GPD Group to provide the professional design services associated with preparing construction documents for the Champions Bridge. A contract with Prime AE Group to provide design services related to the Alum Creek Stream Bank Stabilization Project was authorized by Ordinance 3293-2021. This stream bank is just north of the Champions Bridge. With direction and guidance from the City Attorney Office, these projects are being combined since their schedules are concurrent. The damages associated with the bridge portion of the project will move forward into litigation and recovery. \n \nWith the suggestion and cooperation from the City Attorney’s Office, the Recreation and Parks Department wishes to waive bidding and have Righter Company facilitate the replacement of the superstructure of this bridge. This bridge was originally constructed by the Righter Company and it is a complicated structure. Its mitigation, performed by Righter Company, will best serve the City’s interests, both with cost and schedule.  \n \nPrincipal Parties: \nRighter Company, Inc.\n2424 Harrison Road\nColumbus, Ohio 43204\nMike Killilea, (614) 272-9700                                                   \nContract Compliance Number, Tax ID: 004433, 31-0889208\nContract Compliance Expiration Date: November 22, 2023\n \nEmergency Justification: Emergency action is requested in the interest of public safety, as it is imperative that the bridge be corrected to accommodate emergency vehicle access to the Alum Creek Trail at this location. \n \nBenefits to the Public: Safety for users of the Alum Creek Trail will be improved, especially on the section of the trail between the Easton Soccer Fields and Ohio Dominican University. \n \nCommunity Input/Issues: The community expects safety concerns to be addressed in a timely manner. \n \nArea(s) Affected: Northeast (41)\n \nMaster Plan Relation: This project will support the Recreation and Parks Master Plan by maintaining a trail system that is safe for users.\n \nFiscal Impact: $1,675,320.00 is budgeted and available from within the Recreation and Parks Voted Bond Fund 7702 to meet the financial obligations of this contract. \n \nTitle\n \nTo authorize the Director of Recreation and Parks to enter into contract with Righter Company for the Champions Bridge Superstructure Replacement and Alum Creek Stream Bank Stabilization Project; to authorize the transfer of $1,672,960.98 within the Recreation and Parks Voted Bond Fund, to authorize the amendment of the 2022 Capital Improvements Budget; to authorize the expenditure of $1,675,320.00 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($1,675,320.00)\n \nBody\n \nWHEREAS, it is necessary to authorize the Director of Recreation and Parks to enter into contract with Righter Company for the Champions Bridge Superstructure Replacement and Alum Creek Stream Bank Stabilization Project; and\n \nWHEREAS, it is necessary to authorize the transfer of $1,672,960.98 within the Recreation and Parks Voted Bond Fund 7702; and\n \nWHEREAS, it is necessary to authorize the amendment of the 2022 Capital Improvements Budget Ordinance 1896-2022 in order to provide sufficient budget authority for this and future projects; and\n \nWHEREAS, it is necessary to authorize the expenditure of $1,675,320.00 from the Recreation and Parks Voted Bond Fund 7702; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Recreation and Parks Department in that it is immediately necessary to authorize the Director to enter into contract with Righter Company in the interest of public safety, as it is imperative that the bridge be corrected to accommodate emergency vehicle access to the Alum Creek Trail at this location, all for the preservation of the public health, peace, property, safety, and welfare and, NOW, THEREFORE \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Recreation and Parks be and is hereby authorized to enter into contract with Righter Company for the Champions Bridge Superstructure Replacement and Alum Creek Stream Bank Stabilization Project.\n \nSECTION 2. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 4. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 5. That the transfer of $1,672,960.98 or so much thereof as may be needed, is hereby authorized between projects within the Recreation and Parks Bond Fund 7702 per the account codes in the attachment to this ordinance.\n \nSECTION 6. That the 2022 Capital Improvements Budget Ordinance 1896-2022 is hereby amended as follows in order to provide sufficient budget authority for this ordinance and future projects.\n \nFund / Project / Project Name / Current / Change / Amended\n \nFund 7702 / P510020-100000 / Park Improvements (Voted Carryover) / $1,425,500 / ($672,961) / $752,539\nFund 7702 / P512000-100000 / New Development - Misc. (Voted Carryover) / $3,924,050 / ($1,000,000) / $2,924,050\n \nFund 7702 / P512029-100000 / Champions Bridge Replacement (Voted Carryover) / $2,360 / $1,672,961 / $1,675,321\n \nSECTION 7. For the purpose stated in Section 1, the expenditure of $1,675,320.00 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Recreation and Parks and Voted Bond Fund 7702 in object class 06 Capital Outlay per the accounting codes in the attachments to this ordinance.  \n \nSECTION 8. That for the reasons stated in the preamble hereto, which is hereby made a part hereof,, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 74,
    "meeting_date": "2023-04-03",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}