{
  "success": true,
  "vote": {
    "id": 6277,
    "item_number": "SR-10",
    "title": "To authorize the appropriation and expenditure of up to $1,250,000.00 of 2021 and 2022 HOME Investment Partnerships Program (HOME) grant funds from the U.S. Department of Housing and Urban Development; to authorize the Director of the Department of Development to enter into a commitment letter, loan agreement, promissory note, mortgage, and restrictive covenant with Poplar Fen Place LLC for the Poplar Fen Place project; and to declare an emergency. ($1,250,000.00).",
    "description": "Explanation\n \nBACKGROUND:  This ordinance authorizes the appropriation and expenditure of up to $1,250,000.00 of 2021 and 2022 HOME Investment Partnerships Program (HOME) grant funds from the U.S. Department of Housing and Urban Development (HUD) and to enter into a commitment letter, loan agreement, promissory note, mortgage, and restrictive covenant with Poplar Fen Place LLC for the Poplar Fen Place project.\n \nPoplar Fen Place will be placed on a 6.4-acre site on Chatterton Road in southeast Columbus. The proposed three-story, elevator-served building is “L” shaped with an entrance off Chatterton Road and green space in the rear. Poplar Fen Place will share a driveway with Marsh Brook Place, a 40-unit PSH development for Transition Aged Youth, but the buildings will not be connected.  Poplar Fen Place will provide forty-four (44) one-bedroom units of permanent supportive housing prioritized for individuals over the age of 55 who meet the State of Ohio’s Permanent Supportive Housing Policy Framework.  Of the forty-four units, thirty-five (35) will prioritize individuals who meet the HUD definition of homelessness and the remaining nine (9) units will be targeted for use by individuals who have a severe mental health diagnosis.   \n \nCommunity Housing Network (CHN), the developer of Poplar Fen Place, has been providing affordable housing to individuals experiencing homelessness, mental illness, addiction, and trauma related issues since 1987.  CHN will utilize rent subsidies for all forty-four (44) units in the property, which will allow residents with incomes below 30% AMI to afford this housing.  It is estimated that eight units will be supported by HOME funds.\n \nCHN’s on-site staff will orient tenants to living in a supportive housing program; assist them with housing-related issues; and provide crisis intervention, conflict resolution, and daily assistance. In addition, residents will also be referred to other agencies for medical and dental needs, material needs, and legal assistance. \n \nCHN will enter into an annually-renewable contract with National Church Residences Permanent Supportive Housing Services (NCRPSHS) to provide accredited supportive services at the new facility. National Church Residences has been providing affordable housing and supportive services for almost 60 years.  NCRPSHS will provide residents with services that include, but are not limited to, on-going assessments, case management, psychiatric services, medication monitoring, health services, employment services, individual counseling, and substance abuse treatment. NCRPSHS will also help residents link to services tailored for seniors to provide the care they need to stay independently housed in their own home at Poplar Fen Place and avoid a nursing home or assisted living.  NCRPSHS have a proven track record of successful Medicaid, Medicare, 3rd Party Payer billing, and utilization. \n \nPoplar Fen Place’s building amenities will include an occupational therapy/physical therapy room, service partner offices, laundry room, community room with full kitchen, and a Medical Suite with an exam room.  \n \nThis legislation represents appropriation for a part of the HOME portion of the City's HUD 2021 and 2022 Annual Action Plans, per Ordinances 2345-2020 and 2800-2021, respectively.\n \nEmergency action is requested to allow for the developer to maintain the project schedule as the developer's equity closing date is May 15, 2023, and the developer cannot close on their equity commitment without the City's HOME loan agreements.\n \nContract Compliance:  the vendor number is 044448 and expires 2/22/2025.\n \nFiscal Impact: $708,967.79 is available from the 2021 HOME grant (G452000) and $541,032.21 is available from the 2022 HOME grant (G442102).  \n \nThe commitment of funds through this legislation is conditioned on compliance with HUD’s environmental review requirements. The funding from HOME Fund (2201) is only authorized if all HOME review and comment requirements have been met prior to any commitment of funds, as approved by the Responsible Entity Agency Official. An Authorization to Utilize Grant Funds will be received by the City from HUD in advance of the execution of documents for this project.\n \n \nTitle\n \nTo authorize the appropriation and expenditure of up to $1,250,000.00 of 2021 and 2022 HOME Investment Partnerships Program (HOME) grant funds from the U.S. Department of Housing and Urban Development; to authorize the Director of the Department of Development to enter into a commitment letter, loan agreement, promissory note, mortgage, and restrictive covenant with Poplar Fen Place LLC for the Poplar Fen Place project; and to declare an emergency. ($1,250,000.00).\n \n \nBody\n \nWHEREAS, the City of Columbus is a participating jurisdiction of the U.S. Department of Housing and Urban Development; and\n \nWHEREAS, the City of Columbus is the recipient of HOME Investment Partnerships funds from the U.S. Department of Housing and Urban Development; and\n \nWHEREAS, the Columbus City Council has approved the City's 2021 and 2022 Annual Action Plans, per Ordinances 2345-2020 and 2800-2021, respectively; and\n \nWHEREAS, the commitment of $1,250,000 of 2021 and 2022 HOME grant funds for the Poplar Fen Place project is only authorized when all HOME review and comment requirements have been met, as approved by the Director of Finance and Management, and conditioned on the approval of the environmental review and the release of funds from HUD; and \n \nWHEREAS, the Director of the Department desires to support the Poplar Fen Place project with HOME funds; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to authorize the Director to enter into an agreement with Poplar Fen Place LLC and appropriate and expend said funds to allow for the developer to maintain the project schedule as the developer's equity closing date is May 15, 2023, and the developer cannot close on their equity commitment without the City's HOME loan agreements; and NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2023, the sum of $708,967.79 is appropriated in Fund 2201 (HOME), from Dept-Div 44-10 (Housing), G452000 (2021 HOME), object class 05 (Other Expenses) per the account codes in the attachment to this ordinance.\n \nSECTION 2.  That the expenditure of $708,967.79 or so much thereof as may be needed, is hereby authorized in Fund 2201 (HOME), Dept-Div 4410 (Housing), G452000 (2021 HOME), object class 05 (Other Expenses) per the account codes in the attachment to this ordinance.\n \nSECTION 3. That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2023, the sum of $541,032.21 is appropriated in Fund 2201 (HOME), from Dept-Div 44-10 (Housing), G442102 (2022 HOME), object class 05 (Other Expenses) per the account codes in the attachment to this ordinance.\n \nSECTION 4.  That the expenditure of $541,032.21 or so much thereof as may be needed, is hereby authorized in Fund 2201 (HOME), Dept-Div 4410 (Housing), G442102 (2022 HOME), object class 05 (Other Expenses) per the account codes in the attachment to this ordinance.\n \nSECTION 5.  That the Director of Development is hereby authorized to enter into a commitment letter, loan agreement, promissory note, mortgage, and restrictive covenant with Poplar Fen Place LLC for the Poplar Fen Place project, with HOME funds up to $1,250,000.00.\n                     \nSECTION 6.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n                                          \nSECTION 7.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 8.  That, at the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements.\n \nSECTION 9.  The commitment of funds through this legislation is conditioned on compliance with HUD’s environmental review requirements. The funding from HOME Fund (2201) is only authorized if all HOME review and comment requirements have been met prior to any commitment of funds, as approved by the Responsible Entity Agency Official. An Authorization to Utilize Grant Funds will be received by the City from HUD in advance of the execution of documents for this project.\n \nSECTION 10.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 74,
    "meeting_date": "2023-04-03",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}