{
  "success": true,
  "vote": {
    "id": 6336,
    "item_number": "CA-33",
    "title": "To authorize the Director of the Department of Development to execute a Data Transfer and Use Agreement with Princeton University’s Department of Sociology’s Eviction Lab in order to provide Emergency Rental Assistance recipient data from the city to the Eviction Lab in response to the U.S. Department of Housing and Urban Development’s Notice of Funding Opportunity titled, “FY 2022 Impact Evaluation of the Emergency Rental Assistance (ERA) Program”; and to declare an emergency. ($0.00)",
    "description": "Explanation\n \nBACKGROUND:  This legislation authorizes the Director of the Department of Development to execute a Data Transfer and Use Agreement with Princeton University’s Department of Sociology’s Eviction Lab in order to provide Emergency Rental Assistance recipient data from the city to the Eviction Lab in response to the U.S. Department of Housing and Urban Development’s (HUD) Notice of Funding Opportunity (\"NOFO\") titled, “FY 2022 Impact Evaluation of the Emergency Rental Assistance (ERA) Program” (FR-6600-N-83).\n \nIn May 2022, HUD announced the availability of $2,000,000.00 for the research project titled \"Impact Evaluation of the Emergency Rental Assistance (ERA) Program.” HUD expected to make approximately four awards from the funds available under this NOFO. The objective of the NOFO is to fund rigorous evaluations of the impact of ERA funding on housing stability outcomes. HUD’s primary outcome of interest is evictions, but applicants could propose other housing stability measures. The research funded under this NOFO will advance scientific knowledge and produce policy-relevant evidence on the impact of the ERA program on evictions and may inform the development of future approaches to helping families maintain housing stability and avoid eviction.\n \nPrinceton University’s Department of Sociology’s Eviction Lab was one of the four selected recipients to receive HUD funding for this research. The Eviction Lab principal investigator in turn selected Columbus as one of the entitlement jurisdictions from which to receive ERA recipient data.  \n \nEmergency action is requested in order to allow the transfer of data from the city to the Eviction Lab as soon as possible to allow the researchers ample time to collect, evaluate, and collate the data in order to meet the project deadline established by HUD.\n \n \nTitle\n \nTo authorize the Director of the Department of Development to execute a Data Transfer and Use Agreement with Princeton University’s Department of Sociology’s Eviction Lab in order to provide Emergency Rental Assistance recipient data from the city to the Eviction Lab in response to the U.S. Department of Housing and Urban Development’s Notice of Funding Opportunity titled, “FY 2022 Impact Evaluation of the Emergency Rental Assistance (ERA) Program”; and to declare an emergency. ($0.00)\n \n \nBody\n \nWHEREAS, the federal government funded the Emergency Rental Assistance Program (\"ERA Program\") in response to the COVID-19 epidemic; and\n \nWHEREAS, the City received approximately $80 million of ERA funds to date with an additional $35 million possibly in the future; and\n \nWHEREAS, HUD announced a Notice of Funding Opportunity (\"NOFO\") to study ERA funding’s impact on housing stability and eviction; and \n \nWHEREAS, Princeton University’s Eviction Lab was awarded HUD funding to conduction research on this topic; and \n \nWHEREAS, the City of Columbus was chosen by the Eviction Lab as an entitlement jurisdiction from whom data could be supplied; and \n \nWHEREAS, in order to supply ERA recipient data to the Eviction Lab, the Director of the Department of Development needs to execute a Data Transfer and Use Agreement; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development to allow the transfer of data from the City to the Eviction Lab as soon as possible to allow the researchers ample time to collect, evaluate, and collate the data in order to meet the project deadline established by HUD; for the immediate preservation of the public peace, health, safety, property, and welfare; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Development is authorized and directed to execute a Data Transfer and Use Agreement with Princeton University’s Department of Sociology’s Eviction Lab in order to provide Emergency Rental Assistance recipient data from the City to the Eviction Lab in response to the U.S. Department of Housing and Urban Development’s (HUD) NOFO titled, “FY 2022 Impact Evaluation of the Emergency Rental Assistance (ERA) Program” (FR-6600-N-83).\n \nSECTION 2.  That for the reasons stated in the preamble hereto, which is made a part hereof, this ordinance is declared to be an emergency measure which shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes it.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 75,
    "meeting_date": "2023-04-17",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}