{
  "success": true,
  "vote": {
    "id": 6344,
    "item_number": "CA-41",
    "title": "To authorize the Board of Health to enter into a not-for-profit contract with The Breathing Association for a tobacco cessation multi-media campaign for the period of March 1, 2023 to February 29, 2024; to authorize the expenditure of $500,000.00 from the Health Special Revenue Fund; and to declare an emergency.  ($500,000.00)",
    "description": "Explanation                                           \n \nBACKGROUND:  The purpose of this ordinance is to authorize the expenditure and payment of $500,000.000 to The Breathing Association for the purpose of funding a multi-media campaign aimed at increasing awareness of tobacco cessation programs in the City of Columbus for the period of March 1, 2023 to February 29, 2024. The Breathing Association is a Not for Profit vendor.\n \nPursuant to City Code 329.30, Columbus Public Health negotiated a not-for-profit contract with The Breathing Association to develop and implement a multi-media campaign focused on awareness of and participation in existing cessation programs in Columbus, including the Ohio Tobacco Quit Line. Targeted populations include middle and high school nicotine users, African American smokers, low-income neighborhoods with high density of tobacco retailers, and LGBTQ tobacco users. The goal is to capture people’s attention at the moment of motivation to quit and help guide them to resources. The Breathing Association has the resources and expertise to facilitate this campaign above and beyond the capabilities of Columbus Public Health staff alone.\nThis ordinance is submitted as an emergency in order to avoid a delay in payment to the vendor for this essential tobacco cessation awareness campaign and for the immediate preservation of the public health and safety due to the dangers of tobacco in our communities.\nFISCAL IMPACT:  Funding to provide these services is budgeted in the 2023 Health Special Revenue Fund, No. 2250. ($500,000.00)\n \nTitle\n \nTo authorize the Board of Health to enter into a not-for-profit contract with The Breathing Association for a tobacco cessation multi-media campaign for the period of March 1, 2023 to February 29, 2024; to authorize the expenditure of $500,000.00 from the Health Special Revenue Fund; and to declare an emergency.  ($500,000.00)\n \nBody\n \nWHEREAS, the Board of Health has a need to enter into a not-for-profit contract with The Breathing Association for a tobacco cessation multi-media campaign for the period of March 1, 2023 to February 29, 2024; and,\n \nWHEREAS, The Breathing Association has the expertise and resources to effectively execute the contracted services; and,\n \nWHEREAS, $500,000.00 from the Health Special Revenue Fund has been budgeted to cover the expense of these services; and,\n \nWHEREAS, an emergency exists in that it is immediately necessary to authorize the Board of Health to enter into a contract with The Breathing Association in order to avoid a delay in payment to the vendor for this essential tobacco cessation awareness campaign and for the immediate preservation of the public health and safety due to the dangers of tobacco in our communities; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Board of Health is hereby authorized and directed to enter into a not-for-profit contract with The Breathing Association in an amount not to exceed $500,000.00 for the period of March 1, 2023 to February 29, 2024.\n \nSECTION 2.  That the expenditure of $500,000.00 or so much thereof as may be needed, is hereby authorized in Fund 2250 (Health Special Revenue Fund), Dept-Div 5001 (Health Department), in object class 03 (Services) per the accounting codes in the attachment to the ordinance.\n \nSECTION 3.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary\nSECTION 4.  That for reasons stated in the preamble hereto, which is hereby made a part thereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 75,
    "meeting_date": "2023-04-17",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}