{
  "success": true,
  "vote": {
    "id": 6347,
    "item_number": "CA-45",
    "title": "To authorize the Director of the Department of Public Safety to make payment to Jordan Thompson for inadvertently delaying the beginning date of his wage increase for his duties as a Student Intern (Cadet) for the Division of Police; to authorize the expenditure of $576.53 from the General Fund; and to declare an emergency. ($576.53)",
    "description": "Explanation\n \n1. BACKGROUND\nThis ordinance authorizes the Director of the Department of Public Safety to make payment to Division of Police Student Intern (Cadet) Jordan Thompson as back payment for work performed as a Cadet.  Student Interns in the Divisions of Police and Fire, also referred to as Cadets, were awarded a wage increase effective January 8, 2023.  However, Jordan Thompson's increase was not effective until February 5, 2023. This was an inadvertent omission and this legislation is requesting to pay back total wages of  $490.87 owed to the cadet from the period 1/8/2023 to 2/5/2023. Wages for the Cadets were increased from $14.93 to $18.50 effective 1/8/2023. \n \nFISCAL IMPACT:  This ordinance authorizes the payment of $490.87 as back payment to Jordan Thompson for the inadvertent omission from wage increases awarded to all Police and Fire Cadets effective 1/8/2023. Fringes associated to this back pay amounts to $85.66 for a total legislated amount of $576.53.\n \nEMERGENCY DESIGNATION: This legislation is presented as an emergency measure to ensure fairness and equity for Jordan Thompson in the shortest possible time.\n \nTitle\n \nTo authorize the Director of the Department of Public Safety to make payment to Jordan Thompson for inadvertently delaying the beginning date of his wage increase for his duties as a Student Intern (Cadet) for the Division of Police; to authorize the expenditure of $576.53 from the General Fund; and to declare an emergency. ($576.53)\n \nBody\n \nWHEREAS, the Department of Public Safety, Division of Police inadvertently delayed the beginning date of the wage increase for Jordan Thompson a Columbus Division of Police Cadet by 137.5 hours, and\n \nWHEREAS, the Department of Public Safety now wishes to make a lump-sum back payment to the Cadet for the wage increase omission between 1/8/2023 and 2/5/2023 for his duties as a Police Cadet, and\n \nWHEREAS, an emergency exists in the usual daily operations of the Department of Public Safety in that it is immediately necessary to ensure fairness and equity for Jordan Thompson by compensating him for the delay in awarding him a pay increase already given to his colleagues and ensure that he diligently continues his duties as a Columbus Police Cadet to authorize the Director to make payment for same, for the preservation of the public health, peace, property, safety, and welfare; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Department of Public Safety is hereby authorized to make payment to JordanThompson for 137.5 hours of time that was inadvertently omitted from his wages for duties performed as a Columbus Police Cadet.\n \nSECTION 2. That the expenditure of $576.53, or so much thereof as may be needed, is hereby authorized in the General Fund in Object Class 01 (Personnel) per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or 10 days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 75,
    "meeting_date": "2023-04-17",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services"
    ]
  }
}