{
  "success": true,
  "vote": {
    "id": 6362,
    "item_number": "SR-3",
    "title": "To amend the 2022 Capital Improvement budget; to authorize the transfer of funds within the Streets and Highways Bond Fund; to appropriate funds within the Federal Transportation Grants Fund and the OPWC Grants and Loans Fund; to authorize the Director of Public Service to enter into contract with Double Z Construction Company for the Intersection - Broad Street at James Road project; to authorize the expenditure of an amount not to exceed to $6,410,130.38 from  the Federal Transportation Grants Fund, the OPWC Grants and Loans Fund and the Streets and Highways Bond Fund for the project; to repay any unused grant funds at the end of the grant period; and to declare an emergency. ($6,410,130.38)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Service to contract with Double Z Construction Company for the Intersection - Broad Street at James Road project and to provide payment for construction, construction administration and inspection services.  \n \nThis project consists of widening James Road, both north and south of Broad Street, for an approximate total of 1288 feet to construct left and right turn lanes. Other improvements include replacing the traffic signal, relocating city power poles and power lines, as well as constructing a concrete median, asphalt pavement, curb and gutter, curb and gutter inlets, storm sewer, underground detention, curb ramps, erosion control, pavement markings, signs, signal interconnect/ITS, lighting while maintaining vehicular and pedestrian traffic, and other work as may be necessary to complete the contract in accordance with the plans and specifications set forth in the Bid Submittal Documents.\n \nOrdinance No. 2338-2018 authorized the Director of Public Service, on behalf of the City of Columbus, to submit applications to and execute grant agreements with the Ohio Department of Transportation relative to the Highway Safety Improvement Program, accepted and expended awarded grant funds, and issued refunds, if necessary, for the Intersection Improvements - Broad Street at James Road.\n \nOrdinance No. 2223-2021 authorized the Director of Public Service to submit applications for the Local Transportation Improvement Program and State Capital Improvement Program and to execute project agreements for approved projects; authorized the Director of Public Service and the Director of Finance and Management to submit loan documents and borrow money from the Ohio Public Works Commission for projects as awarded under the State Capital Improvement Program; authorized the Director of Finance and Management and City Auditor, as appropriate, to sign for funding use certification, local match availability, and to certify loan portion repayment for the Intersection - Broad St at James Rd.\n \nThe estimated Notice to Proceed date is April 28, 2023.  The project was let by the Office of Support Services through Vendor Services and Bid Express.  Two bids were received on February 23, 2023, (both majority) and tabulated as follows:   \n      \nCompany Name                                                                           Bid Amount                     City/State       Majority/ODICertification\nDouble Z Construction Company                                                               $5,827,391.25                     Columbus, OH                                          MAJ\nComplete General Construction Company                                          $6,202,172.02                     Columbus, OH                                           MAJ\n \nAward is to be made to Double Z Construction Company as the lowest responsive and responsible and best bidder for their bid of $5,827,391.25.  The amount of construction administration and inspection services will be $582,739.13.  The total legislated amount is $6,410,130.38. \n \nSearches in the System for Award Management (Federal) and the Findings for Recovery list (State) produced no findings against Double Z Construction Company.\n \nAs part of their bid Double Z Construction Company has proposed the following subcontractors to work on the project:\n \nCompany Name                                                  City/State                                                               Majority/ODI Certification      \nThe Shelly Company                                                               Thornville, Ohio                                                                                    MAJ                     \nDanbert Electrical                                                                                    Plain City, Ohio                                                                                    MAJ                     \nFollow the River Designs                                          McConnelsville, Ohio                                                               MAJ                     \nWL Markers                                                                                    Columbus, Ohio                                                                                    MAJ                     \nHurts Trucking                                                                                    Marysville, Ohio                                                               MBE                     \nPaul Peterson Company                                                               Columbus, Ohio                                                                                    MAJ                     \nGriffin Pavement Striping                                          Columbus, Ohio                                                                                    MAJ                     \n \n2. CONTRACT COMPLIANCE INFORMATION\nThe contract compliance number for Double Z Construction Company is CC005966 and expires 06/29/2023.\n \n3. PRE-QUALIFICATION STATUS\nDouble Z Construction Company and all proposed subcontractors have met code requirements with respect to pre-qualification, pursuant to relevant sections of Columbus City Code Chapter 329.\n \n4.  FISCAL IMPACT\nPartial funding for this project is a reimbursable budgeted expense of $3,973,221.31 within the Federal Transportation Grant Fund, Fund 7765, Grant #G592104 (Broad St at James Rd 110388).  Funds need to be appropriated.\nAdditional funding for this project is a reimbursable budgeted expense of $1,162,279.00 within the OPWC Grants and Loans Fund, Fund 7763, Grant #G592205 (Broad St at James Rd DCZ05).  Funds need to be appropriated.\nThe remaining balance of $1,274,630.07 is available and appropriated within the Streets and Highways Bond Fund, Fund 7704.  An amendment to the 2022 Capital Improvement Budget and a transfer of cash and appropriation is necessary to align spending with the proper project.\n5. EMERGENCY DESIGNATION\nEmergency action is requested in order to complete needed improvements at the earliest possible time and meet the requirements of the start date for the Ohio Public Works Commission funding award to avoid penalty and to ensure the safety of the traveling public.\nTitle\nTo amend the 2022 Capital Improvement budget; to authorize the transfer of funds within the Streets and Highways Bond Fund; to appropriate funds within the Federal Transportation Grants Fund and the OPWC Grants and Loans Fund; to authorize the Director of Public Service to enter into contract with Double Z Construction Company for the Intersection - Broad Street at James Road project; to authorize the expenditure of an amount not to exceed to $6,410,130.38 from  the Federal Transportation Grants Fund, the OPWC Grants and Loans Fund and the Streets and Highways Bond Fund for the project; to repay any unused grant funds at the end of the grant period; and to declare an emergency. ($6,410,130.38)\n \nBody\nWHEREAS, the Department of Public Service is engaged in the Intersection - Broad Street at James Road project (\"Project\"); and  \n \nWHEREAS, the work for this Project consists of widening James Road, both north and south of Broad Street, for an approximate total of 1288 feet to construct left and right turn lanes. Other improvements include replacing the traffic signal, relocating city power poles and power lines, as well as constructing a concrete median, asphalt pavement, curb and gutter, curb and gutter inlets, storm sewer, underground detention, curb ramps, erosion control, pavement markings, signs, signal interconnect/ITS, lighting while maintaining vehicular and pedestrian traffic; and other work as may be necessary to complete the contract in accordance with the plans and specifications set forth in the Bid Submittal Documents; and\n \nWHEREAS, it is recommended that Double Z Construction Company will be awarded the contract for the Project; and \n \nWHEREAS, the Department of Public Service requires funding to be available for the Project for construction expense along with construction administration and inspection services; and\n \nWHEREAS, Federal Transportation Grant Fund and OPWC Grants and Loans Fund will be used to pay for a portion of this Project; and\n \nWHEREAS, it is necessary to amend the 2022 Capital Improvement Budget to establish authority within the correct Project; and \n \nWHEREAS, it is necessary for Council to authorize a transfer of funds and appropriation within Fund 7704, the Streets and Highways Bond Fund, to establish sufficient cash to pay for the Project; and\n \nWHEREAS, funds must be appropriated within the Federal Transportation Grants Fund, and the OPWC Grants and Loans Fund; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to enter into contract with Double Z Construction Company to meet the requirements of the start date for the Ohio Public Works Commission funding award, and to avoid penalty and to ensure the safety of the traveling public, thereby preserving the public health, peace, property, safety and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2022 Capital Improvements Budget authorized by Ordinance No. 1896-2022 is amended as follows to establish sufficient authority for this Project:\n \nFund / Project  / Project Name / Current  / Change /C.I.B. as Amended\n7704 / P531034-100000 / Roadway - Sullivant Avenue - Hague to I70 (Voted Carryover) / $ 1,987,551 / ($1,199,630.07) / $787,921\n \n7704 / P538005-100000 / Intersection - Broad St at James Rd (Voted Carryover) / $75,000 / $1,199,630.07 / $1,274,630\n \nSECTION 2.  That the transfer of $1,199,630.07, or so much thereof as may be needed, is authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5912 (Design and Construction), Project P531034-100000 (Roadway - Sullivant Avenue - Hague to I70), Object Class 06 (Capital Outlay) to Dept-Div 5913 (Traffic Management), Project P538005-100000 (Intersection - Broad St at James Rd), Object Class 06 (Capital Outlay) between projects per the account codes in the attachment to this Ordinance.\n \nSECTION 3.  That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2023, the sum of $ 3,973,221.31 is appropriated in Fund 7765 (Federal Transportation Grants Fund), Dept-Div 5912 (Design and Construction), Grant G592104 (Broad St at James Rd 110388), in Object Class 06 (Capital Outlay) per the account codes in the attachment to this Ordinance.\nSECTION 4.  That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2023, the sum of $1,162,279.00 is appropriated in Fund 7763 (OPWC Grants and Loans Fund), Dept-Div 5912 (Design and Construction), Grant G592205 (Broad St at James Rd DCZ05), in Object Class 06 (Capital Outlay) per the account codes in the attachment to this Ordinance.\nSECTION 5.  That the Director of Public Service be and is hereby authorized to enter into a construction services contract with Double Z Construction Company, located at 2550 Harrison Road, Columbus, Oh 43204, for the Intersection - Broad Street at James Road project (\"Project\") in the amount not to exceed $5,827,391.25 in accordance with the specifications and plans on file in the Office of Support Services, which are hereby approved; and to pay for necessary construction administration and inspection costs associated with the project in an amount not to exceed of $582,739.13.\n \nSECTION 6.  That the expenditure of $3,973,221.31, or so much thereof as may be needed, is authorized in Fund 7765 (Federal Transportation Grants Fund), Dept-Div 5912 (Design and Construction), Grant G592104 (Broad St at James Rd 110388), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this Ordinance.\n \nSECTION 7.  That the expenditure of $1,162,279.00, or so much thereof as may be needed, is authorized in Fund 7763 (OPWC Grants and Loans Fund), Dept-Div 5912 (Design and Construction), Grant G592205 (Broad St at James Rd DCZ05), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this Ordinance.\n \nSECTION 8.  That the expenditure of $1,274,630.07, or so much thereof as may be needed, is authorized in Fund 7704 (Streets and Highways Bond Fund), Dept-Div 5913 (Traffic Management), Project P538005-100000 (Intersection - Broad St at James Rd), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 9.  Funds are deemed appropriated and expenditures and transfers authorized to carry out the purposes of this Ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 10.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 11.  That the City Auditor is authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 12.  At the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements.\n \nSECTION 13.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 75,
    "meeting_date": "2023-04-17",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}