{
  "success": true,
  "vote": {
    "id": 6376,
    "item_number": "SR-17",
    "title": "To amend the 2022 Capital Improvement Budget; to authorize the transfer of funds within the Refuse Bond Fund; to authorize the Director of Finance and Management to establish purchase orders and associate relevant purchase agreements with multiple vendors for the purchase of refuse collection containers and parts; to authorize the expenditure of up to $1,000,000.00 from the Refuse Bond Fund for the purchase of these containers and parts; and to declare an emergency. ($1,000,000.00)",
    "description": "Explanation\n1. BACKGROUND\nThe Department of Public Service, Division of Refuse Collection, utilizes 96 gallon, 300 gallon, 8 cubic-yard, roll-off containers, and other types as-needed, in its mechanized collection system for residential trash collection.  The Division also requires replacement parts for containers that are not covered by warranties.  The Purchasing Office has completed bidding or has established universal term contracts (UTC) for the purchase of these commodities. This legislation authorizes the Director of Finance and Management to establish purchase orders for the Division of Refuse Collection from established Universal Term Contracts (UTC) or completed bids.\n \nThis legislation also authorizes the Finance and Management Director to associate all general budget reservations resulting from this ordinance with the following current, pending and future Universal Term Contract Purchase Agreements listed below for Refuse containers for the Division of Refuse Collection. \n \nThe following Purchase Agreement associations require approval by City Council in order for the division to expend more than $100,000.00, per CCC Sec. 329.19(g): Division of Refuse Collection.\n \nUniversal Term Contract Purchase Agreements:\n \n300 Gal Automated Refuse Containers\n(8)  C.Y. Front Loading Refuse Containers\n96 Gallon Automated Refuse Containers\n64 Gallon Automated Refuse Containers\nRoll-Off Dumpsters\nRight-Of-Way Litter Receptacle and Liners\nContainer Parts\n \n2. FISCAL IMPACT\nFunding in the amount of up to $1,000,000.00 is available, appropriated and budgeted within the Refuse Bond Fund, Fund 7703. It is necessary to amend the 2022 Capital Improvement Budget and transfer cash and appropriation to align budget authority with the proper project. \n \n3.  MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis expenditure is for an equipment purchase and is exempt from the MBE/WBE program. \n \n4. EMERGENCY\nEmergency action is requested to prevent an uninterrupted supply of containers and parts to ensure the continued delivery of refuse collection services to all residents and to maintain the efficient delivery of a valuable public service.\n \nTitle\n To amend the 2022 Capital Improvement Budget; to authorize the transfer of funds within the Refuse Bond Fund; to authorize the Director of Finance and Management to establish purchase orders and associate relevant purchase agreements with multiple vendors for the purchase of refuse collection containers and parts; to authorize the expenditure of up to $1,000,000.00 from the Refuse Bond Fund for the purchase of these containers and parts; and to declare an emergency. ($1,000,000.00)\n \nBody\n \nWHEREAS, the Department of Finance and Management has established citywide UTC contracts or completed formal bids for the purchase of refuse collection containers and replacement parts; and \n \nWHEREAS, the Division of Refuse Collection has a need to purchase additional containers for the collection of refuse throughout the city; and\n \nWHEREAS, it may be necessary to purchase more than $100,000.00 from a UTC established for the purchase of these containers and parts; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Service to authorize the Director of Finance and Management to associate all general budget reservations with the appropriate universal term contracts in accordance with the terms, conditions and specifications of the Universal Term Contract Purchase Agreements, which will be on file in the Purchasing Office; and\n \nWHEREAS, the purchase of these containers and parts constitute a portion of the container replacement program and is a budgeted expense within the Division of Refuse Collection’s Capital Improvement Budget; and\n \nWHEREAS, it is necessary to amend the 2022 Capital Improvement Budget to establish authority within the correct project; and \n \nWHEREAS, it is necessary for Council to authorize a transfer of funds and appropriation within Fund 7703, the Refuse Bond Fund, to establish sufficient cash to pay for the project; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service, Division of Refuse Collection, in that it is immediately necessary to authorize the Director of Finance and Management to establish purchase orders in order to prevent an interruption in the supply of containers and replacement parts that are necessary to ensure the continued delivery of trash collection service to all residents, thereby preserving the public health, peace, property, safety and welfare; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the 2022 Capital Improvement Budget authorized by Ordinance 1896-2022 be amended as follows to establish sufficient authority for this project:  \n \nFund / Project / Project name / Current / Change / C.I.B. as Amended\n7703 / P520001-100000 / 59-02 Mechanized Collection Equipment - (Voted Carryover) / $5,230,001.00 / ($869,192.00) / $4,360,809.00\n \n7703 / P520007-100000 / 59-02 Mechanized Collection Equipment- Containers - (Voted Carryover) / $130,808.00 / $869,192.00 / $1,000,000.00\n \nSECTION 2.  That the transfer of $869,192.22, or so much thereof as may be needed, is hereby authorized within Fund 7703 (Refuse Bond Fund), from Dept-Div 5902 (Refuse Collection), Project P520001-100000 (59-02 Mechanized Collection Equipment), Object Class 06 (Capital Outlay) to Dept-Div 5902 (Refuse Collection), Project P520007-100000 (Mechanized Collection Equipment - Containers), Object Class 06 (Capital Outlay) between projects per the account codes in the attachment to this ordinance.\n \nSECTION 3. That the expenditure of $1,000,000.00, or so much thereof as may be needed, is hereby authorized in Fund 7703 (Voted Carryover), Dept.-Div 5902 (Refuse Collection), Project P520007-100000 (Mechanized Collection Equipment - Containers), in object class 06 Capital Outlay per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That City Council approves the purchase of more than $100,000.00 from an individual universal term contract established for the purchase of refuse containers and replacement parts if the Division of Refuse Collection.\n \nSECTION 5.    That the Finance and Management Director be and hereby is authorized to establish purchase orders totaling $1,000,000.00, per the terms and conditions of existing citywide universal term contracts or soon to be completed contracts with multiple vendors for the purchase of refuse collection containers and replacement parts.\n \nSECTION 6.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 7.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 8.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 9.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 75,
    "meeting_date": "2023-04-17",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}