{
  "success": true,
  "vote": {
    "id": 6398,
    "item_number": "CA-6",
    "title": "To authorize the Director of Finance and Management, on behalf of the Department of Technology, to associate all General Budget Reservations resulting from this ordinance with a pre-established Universal Term Contract/Purchase Agreement with CDW Government, LLC, for the refresh of the original Netapp array shelves; and to authorize the expenditure of $410,573.84 for the above-described purpose from the Department of Technology, Information Services Capital Improvement Fund. ($410,573.84)",
    "description": "Explanation\nThis ordinance authorizes the Director of the Department of Finance and Management, on behalf of the Department of Technology, to associate all General Budget Reservations resulting from this ordinance with a pre-established Universal Term Contract/Purchase Agreement (UTC/PA) with CDW Government, LLC for the refresh of the original Netapp array shelfs. Included in this refresh is the purchase of the requisite hardware; the migration of the encryption management software to CipherTrust Thales; and maintenance and support of the new hardware and software. This application is used by various city departments for the storage, back-up and recovery of mission critical data.\nThe above noted purchase agreement was authorized by Ordinance No. 0193-2022, which passed on February 10, 2022. The contract was modified to extend through May 31, 2024 by Ordinance no. 0111-2023, which passed on February 8, 2023.\nThis ordinance authorizes the expenditure of $410,573.84 from the Department of Technology, Information Services Capital Improvement Fund.\nCONTRACT COMPLIANCE\nVendor: CDW Government, LLC\nDAX#: 007352\nCC#: 36-4230110\nExpires: 3/10/2024\nFISCAL IMPACT\nFunds for the above-described project are budgeted and available in the Department of Technology, Information Services Capital Improvement Fund, Project no. P470047-47-02, Enterprise System Upgrades.\n \nTitle\nTo authorize the Director of Finance and Management, on behalf of the Department of Technology, to associate all General Budget Reservations resulting from this ordinance with a pre-established Universal Term Contract/Purchase Agreement with CDW Government, LLC, for the refresh of the original Netapp array shelves; and to authorize the expenditure of $410,573.84 for the above-described purpose from the Department of Technology, Information Services Capital Improvement Fund. ($410,573.84)\n \nBody\nWHEREAS, on May 1, 2017, Ordinance No. 1094-2017 was passed, establishing a universal term contract/purchase agreement with CDW Government, LLC for the procurement of, among other things, software, licenses, media and/or equipment; and\nWHEREAS, the above-named ordinance was modified and extended by Ordinance No. 0193-2022, passed on February 7, 2022; and\nWHEREAS, this ordinance authorizes the Director of the Department of Finance and Management, on behalf of the Department of Technology, to associate all General Budget Reservations resulting from this ordinance with a pre-established Universal Term Contract/Purchase Agreement with CDW Government, LLC; and\nWHEREAS, it has become necessary in the usual daily operation of the Department of Technology to authorize the Director of the Department of Finance and Management, on behalf of the Department of Technology, to associate all General Budget Reservations resulting from this ordinance with a pre-established Universal Term Contract/Purchase Agreement with CDW Government, LLC for Netapp support, for the preservation of the public health, peace, property and safety; now therefore\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1. That the Finance and Management Director, on behalf of the Department of Technology, is authorized to associate all General Budget Reservations resulting from this ordinance with a pre-established Universal Term Contract/Purchase Agreement with CDW Government, LLC for Netapp support.\nSECTION 2. That the expenditure of $410,573.84 is authorized from the Department of Technology, Information Services Capital Improvement Fund, for the above-mentioned purpose, as shown in the attachment to this ordinance. (see 0834-2023EXP)\nSECTION 3. That the City Auditor is authorized to make any changes to revise the funding source for any contract or contract modifications associated with this ordinance.\nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\nSECTION 5. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\nSECTION 6. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 76,
    "meeting_date": "2023-04-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements"
    ]
  }
}