{
  "success": true,
  "vote": {
    "id": 6432,
    "item_number": "CA-40",
    "title": "To authorize the Director of the Department of Development to execute a Subrecipient Agreement - Not for Profit Service Contract with The Broad Street Presbyterian Church of Columbus, Ohio in an amount up to $47,874.00 of federal Emergency Rental Assistance 2 (ERA 2) - Stable Housing Initiative funds to provide assistance as authorized by the federal Emergency Rental Assistance program; to authorize the Director of Development to modify the terms and conditions of the contract as needed without seeking further City Council approval; to authorize the advancement of funds; to authorize the expenditure of up to $47,874.00 from the Emergency Rental Assistance Funds; and to declare an emergency. ($47,874.00)",
    "description": "Explanation\n \nBACKGROUND:  This legislation authorizes the Director of the Department of Development to execute a Subrecipient Agreement - Not for Profit Service Contract with The Broad Street Presbyterian Church of Columbus, Ohio in an amount up to $47,874.00 of federal Emergency Rental Assistance 2 (ERA 2) - Stable Housing Initiative funds to provide assistance as authorized by the federal Emergency Rental Assistance program.\n \nOrdinance 2275-2021 authorizes the City of Columbus to accept and appropriate up to $39,109,001.91 of federal Emergency Rental Assistance (ERA 2) program funds, as passed by the Consolidated Appropriations Act of 2021.  \n \nOf this amount, $47,874.00 will be used for a contract with The Broad Street Presbyterian Church of Columbus, Ohio who, through their COMPASS-Rental Assistance program, will advertise the program and make program eligibility determinations (as defined by U. S. Treasury) to qualify residents of the local community for funding in order to ensure housing stability and they will, in turn, inform the Tony R Wells Foundation which applications are approved for funding and how much. The Tony R Wells Foundation is acting as a fiscal manager of the funds to be allocated under this contract and will make the payments directly to the recipients.  The U.S. Department of Treasury has encouraged jurisdictions to look at ways to expedite payments by centralizing payment processing as one of their best practices.  A separate piece of legislation will be put forth to enter into a Not for Profit Service Contract with the Tony R Wells Foundation for this purpose.\n \nUnder this contract, the full amount of funding will be used to pay for COMPASS services while funding provided to the Tony R Wells Foundation will include funding for recipients and fee for acting as the fiscal manager.  Of the funds for the recipients, at least 60% of the funding will support households with an AMI at 50% or below and/or have a member of the household who has been unemployed for 90 days and up to 40% of the funding can be used for households with an AMI at 80% or below.\n \nThe Broad Street Presbyterian Church of Columbus, Ohio will manage a program to provide assistance to residents in the local area who qualify for the assistance as provided in the laws regulations and other current guidance provided by the U. S. Department of Treasury.  Assistance may include:  rent, rental arrearages, prospective rent, utility assistance, internet, security deposit, rental fees for storage unit, moving expenses, application fees, hotel or motel for displaced families, and/or eviction related court costs. \n \nIt is expected that the guidance from the U.S. Department of Treasury will continue to be modified while this contract is in effect and it is requested that the Director of the Department of Development be given the authority to modify the terms and conditions of the contract without seeking additional Council Approval in order to align with the most current version of the laws, regulations, and guidance.  If additional funds are needed, Council approval will be requested.\n \nThese services are being contracted out as the department does not have the resources to manage this program internally.\n \nFunds will be advanced based upon an advancement schedule included in the contract.\n \nEmergency action is requested in order to have funding available as soon as possible to assist residents who are displaced and need immediate assistance to provide transitional or new housing to prevent homelessness.\n \nFISCAL IMPACT: Funding is provided to the City of Columbus from the Consolidated Appropriations Act of 2021 passed by Congress and signed into law December 27, 2020, as authorized in Ordinance 2275-2021.\n \nCONTRACT COMPLIANCE:  the vendor’s vendor number is 033793 and expires 9/1/2023.\n \n \nTitle\n \nTo authorize the Director of the Department of Development to execute a Subrecipient Agreement - Not for Profit Service Contract with The Broad Street Presbyterian Church of Columbus, Ohio in an amount up to $47,874.00 of federal Emergency Rental Assistance 2 (ERA 2) - Stable Housing Initiative funds to provide assistance as authorized by the federal Emergency Rental Assistance program; to authorize the Director of Development to modify the terms and conditions of the contract as needed without seeking further City Council approval; to authorize the advancement of funds; to authorize the expenditure of up to $47,874.00 from the Emergency Rental Assistance Funds; and to declare an emergency. ($47,874.00)\n \n \nBody\n \nWHEREAS, the Director of the Department of Development desires to execute a Subrecipient Agreement - Not for Profit Service Contract with The Broad Street Presbyterian Church of Columbus, Ohio in an amount up to $47,874.00 of federal Emergency Rental Assistance 2 (ERA 2) - Stable Housing Initiative funds to provide assistance as authorized by the federal Emergency Rental Assistance program; and\n \nWHEREAS, The Broad Street Presbyterian Church of Columbus, Ohio will partner with the Tony R Wells Foundation to provide this assistance with The Broad Street Presbyterian Church of Columbus, Ohio making the eligibility determination and the Tony R Wells Foundation providing aid directly; and \n \nWHEREAS, it is expected that the guidance from the U.S. Department of Treasury will be modified while this contract is in effect and it is requested that the Director of the Department of Development be given the authority to modify the terms and conditions of the grant agreement without seeking additional Council Approval in order to align with the most current version of the laws, regulations, and guidance; and\n \nWHEREAS, The Broad Street Presbyterian Church of Columbus, Ohio is a non-profit organization, who, through their COMPASS - Rental Assistance program, works with other Faith-Based Organizations, collaborating to prevent homelessness and promote self-sufficiency; and\n \nWHEREAS, the COVID-19 pandemic has resulted in much needed assistance when low income households have seen significant decreases in personal income due to COVID-19 and the public health emergency; and\n \nWHEREAS, expenditure of ERA funding to provide low income households with financial assistance is necessary to address reduced income needed to pay housing stability expenses caused by the COVID-19 public health emergency or they have been displaced due to the impact of COVID-19 on the property owner; and\n \nWHEREAS, such expenditure of funds has not been previously accounted for in the 2023 Budget; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that is requested in order to have funding available as soon as possible to assist residents who are displaced and need immediate assistance to provide transitional or new housing to prevent homelessness, all for the preservation of the public health, peace, property, safety and welfare; and NOW THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Development is hereby authorized to enter into a Subrecipient Agreement - Not for Profit Service Contract with The Broad Street Presbyterian Church of Columbus, Ohio in an amount up to $47,874.00 of federal Emergency Rental Assistance 2 (ERA 2) - Stable Housing Initiative funds to provide assistance as authorized by the federal Emergency Rental Assistance program; is authorized to modify the scope of services of the contract as needed without further City Council approval in order to align with the evolving federal guidance; and is authorized to advance funds per a schedule to be included in the contract.  \n \nSECTION 2.  That the expenditure of $47,874.00 or so much thereof as may be needed is hereby authorized in Fund 2208 (ERA Fund), Dept-Div 44-10 (Housing Division), in object class 03 (Services) per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That this agreement is awarded pursuant to the relevant provisions of Columbus City Code related to Not for Profit Service Contracts.\n \nSECTION 4:  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5:  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this legislation.\n \nSECTION 6:  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 1,
    "absent": 0,
    "meeting_id": 76,
    "meeting_date": "2023-04-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSTAIN"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}