{
  "success": true,
  "vote": {
    "id": 6433,
    "item_number": "CA-41",
    "title": "To authorize the Director of the Department of Development to execute grant agreements in an amount up to $100,000.00 each with Gladden Community House Inc. and United Way of Central Ohio, both not-for-profit, social service agencies, for the provision of human services programming for a 12 month period from January 1, 2023, to December 31, 2023, as part of the Elevate 2.0! Program; to authorize payment for reasonable food and non-alcoholic beverages for participants of programs included in the grant agreements; to authorize the advancement of funds on a pre-determined schedule during the term of the agreement; to authorize the expenditure of up to $200,000.00 from the Hotel Motel Tax Fund; and to declare an emergency. ($200,000.00)",
    "description": "Explanation\n \nBACKGROUND: This legislation authorizes the Director of the Department of Development to execute grant agreements in an amount up to $100,000.00 each with Gladden Community House Inc. and United Way of Central Ohio, both not-for-profit, social service agencies, for the provision of human services programming for a 12 month period from January 1, 2023, to December 31, 2023, as part of the Elevate 2.0! Program.\n \nThe Elevate 2.0! Program is a rebranding of the Department’s Human Services Grant program due to COVID-19.  Prior year investment strategies included:  Income through Employment, Job Quality, Education and Training, Financial Capability, and Stabilization and Resource Support.  COVID-19 significantly impacted not-for-profit organizations and the residents of Columbus.  There was an increase in homelessness, housing instability, lost jobs, increase in violence, and increase in health issues.  Not-for-profit agencies were challenged to address these needs as donations dropped off.  To address these issues, the Department of Development will focus on supporting not-for-profit organizations providing human services programming in the following areas:  Infant Vitality, Homelessness, Housing Stability, Finance Security, Workforce Development, Violence Elimination, Re-entry, Neighborhood Building, and Chronic Disease Prevention. All of the focus areas are tied to Mayor Ginther’s Equity Agenda/Opportunity Rising.\n \nThe Elevate! 2.0 NOFA (Notice of Funding Availability) was made available to local not-for-profit organizations from September 12, 2022, to October 3, 2022. The Department received 142 applications with requests for funding totaling $14,050,000.00.  Proposals were reviewed by a 24 member team. Sixty-six programs were selected for funding in 2023.  \n \nThe awards are given with an anticipated renewal in FY2024 and FY 2025, pending availability of funds and program performance per agreements with each agency.  \n \nThis ordinance includes authorization for nine program areas with two agencies, with authorization for others agreements being submitted as separate pieces of legislation.  Each will be a “grant agreement” with the agency because funding will be advanced to the agency on a predetermined schedule.  Advancement of funds is needed because many of the organizations do not have funding available to be reimbursed for program expenses.   The first advance will occur after confirmation of the Purchase Order.  Before the second advance is made, the agency shall provide reports and documentation indicating how the funds were used to fulfill the scope of services in the grant agreement.  This will continue throughout the term of the grant agreement.  Additionally, some programs/grant agreements may include food and non-alcoholic beverages for participants of the programs.\n \nEmergency action is requested to reimburse for approved expenses incurred since January 1, 2023, to prevent each organization from experiencing a financial hardship.\n \nFISCAL IMPACT: Funding for these expenditures is allocated from the Emergency Human Services Fund 2023 budget (Fund 2231), up to $200,000.00.  Funds were budgeted in object class 03, but will be transferred to object class 05.\n \nCONTRACT COMPLIANCE: Gladden Community House Inc., 006075, and is pending renewal; United Way of Central Ohio, 006101, expires 3/7/2025.\n \nTitle\n \nTo authorize the Director of the Department of Development to execute grant agreements in an amount up to $100,000.00 each with Gladden Community House Inc. and United Way of Central Ohio, both not-for-profit, social service agencies, for the provision of human services programming for a 12 month period from January 1, 2023, to December 31, 2023, as part of the Elevate 2.0! Program; to authorize payment for reasonable food and non-alcoholic beverages for participants of programs included in the grant agreements; to authorize the advancement of funds on a pre-determined schedule during the term of the agreement; to authorize the expenditure of up to $200,000.00 from the Hotel Motel Tax Fund; and to declare an emergency. ($200,000.00)\n \nBody\n \nWHEREAS, the Department of Development issued a NOFA in September 2022 to request applications from not-for-profit organizations to provide services in the following areas:  Infant Vitality, Homelessness, Housing Stability, Finance Security, Workforce Development, Violence Elimination, Re-entry, Neighborhood Building, and Chronic Disease Prevention. All of the focus areas are tied to Mayor Ginther’s Equity Agenda/Opportunity Rising; and\n \nWHEREAS, the Department received 142 applications with requests for funding totaling $14,050,000.00, of which 66 programs were selected for funding in 2023; and\n \nWHEREAS, two organizations are included in this piece of legislation with authorization for other agreements being submitted as separate pieces of legislation; and\n \nWHEREAS, the grant agreements will be funded with Emergency Human Services Funds; and\n \nWHEREAS, the grant agreements will include advance payments to the organizations and some programs will provide reasonable food and non-alcoholic beverages to participants; and \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to authorize the Director to enter into grant agreements with various not-for-profit, social service agencies to reimburse for approved expenses incurred since January 1, 2023, to prevent each organization from experiencing a financial hardship, all for the preservation of the public health, peace, property, safety, and welfare; NOW, THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the transfer of $200,000.00, or so much thereof as may be needed, is hereby authorized within Fund 2231 (Hotel Motel Tax Fund), from Dept-Div 44-01 (Administration), object class 03 (Services) to Dept-Div 44-01 (Administration), object class 05 (Other) per the account codes in the attachment to this ordinance.\n \nSECTION 2.  That for the purpose as stated in Section 3, the expenditure of $200,000.00, or so much thereof as may be necessary is hereby authorized in Fund 2231 (Hotel Motel Bed Tax Fund), Dept. 44-01 (Administration), in Object Class 05 (Other) per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That the Director of the Department of Development is authorized, pursuant to CCC Sec. 111.14, to execute grant agreements in an amount up to $100,000.00 each with Gladden Community House Inc. and United Way of Central Ohio, both not-for-profit social service agencies, for the Elevate 2.0! Program to provide for services for a 12 month period from January 1, 2023, to December 31, 2023 in accordance with the terms of the Elevate! 2.0 Program.\n \nSECTION 4.  Payments are expressly contingent upon the availability of sufficient monies in the Hotel Motel Bed Tax Fund (Fund 2231) to cover the obligation set forth in these agreements and in no case shall payments exceed available cash in this fund. In this event that there is not sufficient cash in the fund to cover the obligation set forth in this contract, the City Auditor shall have the authority to make all necessary adjustments at her discretion.\n \nSECTION 5.                     That the use of grant funds to provide program participants reasonable food and non-alcoholic beverages while participating in program activities constitutes a proper public purpose.\n \nSECTION 6.                       That the advancement of funds on a pre-determined schedule is hereby authorized during the term of the grant agreement.\n \nSECTION 7.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 8.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 9.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 1,
    "absent": 0,
    "meeting_id": 76,
    "meeting_date": "2023-04-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "ABSTAIN"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Community Services",
      "Contracts & Agreements"
    ]
  }
}