{
  "success": true,
  "vote": {
    "id": 6473,
    "item_number": "0",
    "title": "To Honor Clerk Andrea Blevins and the City Clerk’s Office in Celebration of Professional Municipal Clerks Week",
    "description": "Title\nTo Honor Clerk Andrea Blevins and the City Clerk’s Office in Celebration of Professional Municipal Clerks Week\n \nBody\nWHEREAS, the 54th annual Professional Municipal Clerks Week will be celebrated from May 1-6, 2023 and is designated as a time to recognize the hard work and dedication exhibited by municipal clerks; and\nWHEREAS, the Columbus City Clerk performs countless essential duties, including record keeping, maintenance of the Columbus City Code, and preparation of the Council Agenda, City Bulletin, and other official records of the City; and \n \nWHEREAS, the City Clerk also serves as a liaison between the City of Columbus and the public, helping to ensure transparency and accountability while maintaining and promoting the history of local government; and \n \nWHEREAS, Andrea Blevins has dedicated her career to serving the City of Columbus, having first entered the Clerk’s office over 35 years ago and serving as City Clerk since 2003; and\n \nWHEREAS, under her leadership, the Clerk’s office has faithfully maintained the records of City Council, navigated the transition to digital records, and streamlined procedures to ensure efficient operations; and\n \nWHEREAS, the City of Columbus is immensely grateful for the work of Clerk Andrea Blevins and the City Clerk’s office, without whom the work of City Council would not be possible, and thanks them for their service to our community; now, therefore\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: That this Council honors Clerk Andrea Blevins and the City Clerk’s Office in celebration of Professional Municipal Clerks week.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 77,
    "meeting_date": "2023-05-01",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}