{
  "success": true,
  "vote": {
    "id": 6477,
    "item_number": "0",
    "title": "To authorize the Director of the Office of Education to enter into contract with Columbus State Community College for the purpose of providing student support services for those enrolled in the Columbus Promise program; and to authorize an appropriation and expenditure within the Job Growth subfund. ($1,052,652.00)",
    "description": "Explanation\nThis ordinance authorizes the Director of the Office of Education to enter into contract with Columbus State Community College for the purpose of providing student support services for those enrolled in the Columbus Promise program.\n \nThe Columbus Promise program is focused on advancing a college-going culture, eliminating barriers to postsecondary education, providing wraparound support that spans academic needs as well as non-academic issues that affect college-going, and workforce preparation and well-paying internships and employment through Columbus Promise Earn and Learn.\n \nThis ordinance will fund a portion of the staff needed to provide wraparound, holistic success coaching and career preparation which is essential for Columbus Promise to meet its goals of advancing both access and success of Columbus City School graduates, leading to completion of degrees or certifications that will allow students to move on to 4-year baccalaureate study or high-wage jobs. \n \nThe Columbus Promise program seeks to focus on these tangible and measurable outcomes to operationalize its core beliefs:\n1. Increase in preparation for college with a focus on advancing students’ expectations for college-level work, accountability, and navigating college business\n2. Increase in enrollments of first-time, recent Columbus City School graduates\n3. Increase college success metrics related to key milestones like credit completion and course completion, utilization of college holistic support resources, and maintaining Satisfactory Academic Progress\n4. Increases in four-year baccalaureate college attendance through associate degree completion and increase transfer rates; and\n5. Increase in attainment of certificates and credentials as well as securing high-wage jobs upon completion\n \nFunding for this contract is available within the Job Growth subfund.\n \nTitle\nTo authorize the Director of the Office of Education to enter into contract with Columbus State Community College for the purpose of providing student support services for those enrolled in the Columbus Promise program; and to authorize an appropriation and expenditure within the Job Growth subfund. ($1,052,652.00)\n \nBody\nWHEREAS, The Columbus Promise program is focused on advancing a college-going culture, eliminating barriers to postsecondary education; and\n \nWHEREAS, a key component of the Columbus Promise is the provisioning of wraparound support that spans academic needs as well as non-academic issues that affect college-going; and\n \nWHEREAS, this ordinance will fund wraparound, holistic success coaching and career preparation which is essential for Columbus Promise to meet its goals of advancing both access and success of Columbus City School graduates; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Office of Education is hereby authorized to enter into contract with Columbus State Community College for the purpose of providing student support services between June 1, 2023 and May 31, 2025, for those enrolled in the Columbus Promise program.\n \nSECTION 2. That the Auditor is hereby authorized and directed to appropriate $1,052,652.00 within the Job Growth subfund, fund 1000,subfund 100015, to the Office of Education in 03-Services, per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That per the action authorized in Section 1 of this ordinance, the expenditure of $1,052,652.00 within the Job Growth subfund is hereby authorized per the accounting codes in the attachment to this ordinance.\n \nSECTION 4. That this agreement is authorized per the non-profit service contracting provisions of Section 329 of Columbus City Codes.\n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.  That this ordinance shall take effect at the earliest date allowable by law.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 77,
    "meeting_date": "2023-05-01",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements"
    ]
  }
}