{
  "success": true,
  "vote": {
    "id": 6560,
    "item_number": "CA-20",
    "title": "To authorize the City Clerk to enter into a grant agreement with Lesbians Benefiting the Arts for the support of their community events; and to authorize an appropriation and expenditure within the Neighborhood Initiatives subfund; and to declare an emergency. ($9,500.00)",
    "description": "Explanation\nThis ordinance authorizes the City Clerk to enter into a grant agreement with Lesbians Benefiting the Arts, a non profit entity, for the support of their community events, the Summit Station Historical Marker Dedication and the Lesbian/Queer Women's History Event.\n \nLesbians Benefiting the Arts (L.B.A., Inc.) is a not-for-profit, volunteer driven corporation designed to produce events and promote artistic efforts, showcase lesbian / women performers, women’s community, support lesbians / women artists and entrepreneurs and lesbians / women in the arts.  The LBA was founded in 1985 and has produced the Ohio Lesbian Festival for 30+ years.\n \nIn 2022, a small group of former Summit Station patrons worked to obtain a marker of historical significance from Ohio’s Historical Marker program. Under the administration of the Ohio History Connection and with a resolution from Columbus City Council, a historical marker will be placed permanently in front of the space that held Summit Station.  \n \nAs a result of the work on the historical marker several community building events have emerged. These events offer important opportunities for lesbian women to congregate and re-establish relationships that have diminished since the loss of their culturally relevant spaces. The events are as follows:\n \nSummit Station Historical Marker Dedication, June 10, 2023\n \nLesbian/Queer Women's History Event, October 11, 2023\n \nEmergency action is necessary to ensure funding is available for the June 10, 2023 event, with the remainder to fund the planning and execution of the October 11, 2023 event. \nFiscal Impact: Funding is available within the Neighborhood Initiatives subfund.\n \nTitle\nTo authorize the City Clerk to enter into a grant agreement with Lesbians Benefiting the Arts for the support of their community events; and to authorize an appropriation and expenditure within the Neighborhood Initiatives subfund; and to declare an emergency. ($9,500.00)\n \nBody\nWHEREAS, Lesbians Benefiting the Arts is a not-for-profit, 100 % volunteer driven organization that produces the Ohio Lesbian Festival which celebrated its 30-year anniversary in 2019; and\n \nWHEREAS, Lesbians Benefiting the Arts’ mission is to support and promote lesbians and work to build a global women’s community that honors and celebrates all women; and\n \nWHEREAS, these community events offer important opportunities for lesbian women to congregate and re-establish relationships that have diminished since the loss of their culturally relevant spaces; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Clerk's Office in that it is immediately necessary to authorize a grant agreement with Lesbians Benefiting the Arts to fund an upcoming  community event on June 10, 2023, and to plan and help fund the next event on October 11, 2023, thereby preserving the public health, peace, property, safety and welfare;  now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the City Clerk is authorized to enter into a grant agreement with the not-for-profit Lesbians Benefiting the Arts, Inc., for support of their community events; the Summit Station Historical Marker Dedication on June 10, 2023, and the Lesbian/Queer Women's History Event on October 11, 2023. \n \nSECTION 2. That the City Auditor is authorized and directed to appropriate $9,500.00 in the Neighborhood Initiatives subfund, fund 1000, subfund 100018, to Columbus City Council per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That the expenditure of $9,500.00 or so much thereof as may be needed pursuant to the action authorized in SECTION 1, is authorized in the Neighborhood Initiatives subfund, fund 1000, subfund 100018, per the accounting codes in the attachment to this ordinance.\n \nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6. That for the reason stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 78,
    "meeting_date": "2023-05-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}