{
  "success": true,
  "vote": {
    "id": 6567,
    "item_number": "CA-27",
    "title": "To authorize an amendment to the 2022 Capital Improvement Budget; to authorize an appropriation of funds and a transfer of funds and appropriation within the Water Permanent Improvement NonBond Fund; to authorize the Director of Public Utilities to renew the professional engineering services agreement with CHA Consulting for the Hap Cremean Water Plant Lime and Soda Ash Dust Collection System Improvements Project; and to authorize an expenditure not to exceed $269,500.00 from the Water Permanent Improvement NonBond Fund for the project.  ($269,500.00)",
    "description": "Explanation\n1.  BACKGROUND\nThis Ordinance authorizes the Director of Public Utilities to renew the professional engineering services agreement with CHA Consulting for the Hap Cremean Water Plant (HCWP) Lime and Soda Ash Dust Collection System Improvements Project, CIP #690545-100000, in an amount not to exceed $269,500.00.\n \nThis project will make improvements to lime and soda-ash pneumatic conveyance and dust collection at the Hap Cremean Water Plant (e.g., piping, valves, dust collectors, etc.) and lime and soda-ash conveyance support systems (e.g., monitoring system, controls system, etc.). Many of these elements must be controlled for environmental, health, and safety reasons. A majority of the HCWP lime and soda-ash handling equipment, piping and controls are more than thirty years old and are at the end of their useful life.  The frequency of lime/soda-ash dust release problems are increasing, impacting the plant’s ability to safely and properly perform chemical unloading. These improvements were recommended in the previously completed preliminary design phase and documented in the HCWP Lime and Soda Ash Dust Collection System Improvements Basis of Design Report.\n \nWork performed to date includes preliminary design and detailed design services.  This ordinance provides Engineering Services During Construction (ESDC) phase services for the recommended improvements from the Basis of Design Report and Bid Documents.  ESDC phase work will include review of submittals, responding to Requests for Information (RFIs), preparation of Requests for Proposals (RFPs), attending construction review meetings, assisting in negotiations, preparation of standard operating procedures and record documents, and other matters with bid document clarifications as necessary to meet the design intent. \n \nThe improvements are directly related to the HCWP treatment process, which services multiple community planning areas (Planning Area - 99 Citywide).\n \n1.1 Amount of additional funds to be expended:  $269,500.00\nOriginal Contract Amount:                     $131,300.00  (PO181410, Ord. 1373-2019)\nRenewal No. 1:                     $247,500.00  (PO236090, Ord. 1332-2020)\nRenewal No. 2:                      $269,500.00 (Current)\nTotal (Orig. + Renewals)                     $648,300.00\n \n1.2. Reason other procurement processes are not used:  \nThis contract was anticipated to be funded in phases as indicated in the original request for proposals and as stated in Ordinance 1373-2019.  CHA Consultants is familiar with the details of the project and has compiled a Basis of Design Report detailing their findings and recommendations.  The process of selecting and contracting a new consultant team to review documents prepared by CHA Consultants would delay the project and increase engineering and construction costs.\n \n1.3. How cost of renewal was determined:\nThe scope of the construction project was determined based on the assessment of the existing conditions for the HCWP Facility. This assessment was completed as part of the Original Contract (Preliminary Design).  The assessment allowed the consultants to develop a work breakdown structure to estimate project costs.  Negotiations between CHA Consultants and the City of Columbus took place to identify the scope and fee necessary to design the selected improvements. \n \n2. ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT  \nThis project is necessary as reliability in the chemical delivery is vitally important to the lime-soda softening treatment process at HCWP.  Lime and soda-ash dust must be controlled for environmental, health, and safety reasons.  A majority of the HCWP lime and soda-ash handling equipment, piping and controls are more than thirty years old and are at the end of their useful life.  The frequency of lime/soda-ash dust release problems is increasing, impacting the plant’s ability to safely and properly perform chemical unloading.\n \nNo community outreach or input is anticipated because the work will be conducted entirely within the water plant.\n \n3. CONTRACT COMPLIANCE INFO:  CHA Consulting’s contract compliance number is CC000802 and expires on 3/8/25.\n \nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against CHA Consulting, Inc.\n \n4.  MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract was put in place prior to the implementation of the City of Columbus MBE/WBE Program and is not subject to the requirements of that program.  CHA Consulting is classified as an MAJ company by the City’s Office of Diversity and Inclusion.  Per the Utilization Plan submitted with this ordinance, CHA Consulting plans to utilize Advanced Engineering Consultants, an MBE classified company, to perform 15.02% of the dollar amount of the work of this contract renewal, amounting to $40,490.16 of the $269,500.00 renewal amount.\n \n5.  FISCAL IMPACT: There are sufficient funds within the Water Permanent Improvement NonBond Fund, Fund 6008, for this expenditure.  An amendment to the 2022 Capital Improvement Budget is needed to match cash and to align budget authority with the proper project.  It is necessary to appropriate funds within Fund 6008 to align appropriation with cash.  It is also necessary to transfer funds and appropriation between projects in Fund 6008 to align cash and appropriation with the proper project.\n \nTitle\nTo authorize an amendment to the 2022 Capital Improvement Budget; to authorize an appropriation of funds and a transfer of funds and appropriation within the Water Permanent Improvement NonBond Fund; to authorize the Director of Public Utilities to renew the professional engineering services agreement with CHA Consulting for the Hap Cremean Water Plant Lime and Soda Ash Dust Collection System Improvements Project; and to authorize an expenditure not to exceed $269,500.00 from the Water Permanent Improvement NonBond Fund for the project.  ($269,500.00)\n \nBody\nWHEREAS, the Department of Public Utilities is engaged in the Hap Cremean Water Plant Lime and Soda Ash Dust Collection System Improvements Project; and\n \nWHEREAS, Contract PO181410 was authorized by Ordinance 1373-2019 for the Hap Cremean Water Plant Lime and Soda Ash Dust Collection System Improvements Project; and\n \nWHEREAS, Contract Renewal #1 (PO236090, Ordinance 1332-2020) provided detailed design phase services for the recommended improvements from the Basis of Design Report; and\n \nWHEREAS, a planned contract renewal is needed to provide engineering services during construction; and\n \nWHEREAS, it is necessary to authorize the Director of Public Utilities to renew the professional engineering services agreement with CHA Consulting for the Hap Cremean Water Plant Lime and Soda Ash Dust Collection System Improvements Project; and \n \nWHEREAS, an amendment to the 2022 Capital Improvement Budget is needed to align budget authority with the proper project; and\n \nWHEREAS, it is necessary to appropriate funds and transfer cash and appropriation within the Water Permanent Improvement NonBond Fund to align appropriation and cash with the proper project; and\n \nWHEREAS, it is necessary to expend funds from the Water Permanent Improvement NonBond Fund to pay for the contract renewal; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2022 Capital Improvement Budget authorized by Ordinance No. 1896-2022 be amended as follows to establish sufficient budget authority for this project:\n \nFund / Project Number / Project Name (Funding Source) / Current Authority / Revised Authority / Change\n6008 / 690511-100000 / HCWP Intake Structure & Low Head Dam Rehabilitation (Water Perm Improv Carryover) / $0.00 / $73,335.00 / $73,335.00 (to match cash)\n6008 / 690391-100000 / HCWP A & B Raw & Fin. Water Pumps (Water Perm Improv Carryover) / $225,000.00 / $847.00 / $225,847.00 (to match cash)\n6008 / 608999-100000 / 60-09 Unallocated Balance Fd. 608 (Water Perm Improv Carryover) / $92,966.00 / $173,092.00 / $80,126.00 (to match cash)\n \n6008 / 690236-100000 / Water Main Rehabilitation (Water Perm Improv Carryover) / $68,159.00 / $0.00 / ($68,159.00) \n6008 / 608999-100000 / 60-09 Unallocated Balance Fd. 608 (Water Perm Improv Carryover) / $173,09s.00 / $49,296.00 / ($123,796.00)\n6008 / 690537-100001 / Westgate Tank Replacement (Water Perm Improv Carryover) / $3,364.00 / $0.00 / ($3,364.00) \n6008 / 690511-100000 / HCWP Intake Structure & Low Head Dam Rehabilitation (Water Perm Improv Carryover) / $73,335.00 / $0.00 / ($73,335.00)\n6008 / 690391-100000 / HCWP A & B Raw & Fin. Water Pumps (Water Perm Improv Carryover) / $225,847.00 / $225,000.00 / ($847.00)\n \n6008 / 690545-100000 / HCWP Lime & Soda Ash Dust Collection System Imp's (Water Perm Improv Carryover) / $0.00 / $269,500.00 / $269,500.00\n \nSECTION 2.  That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2023, the sum of $241,153.36 is appropriated in Fund 6008 (Water Permanent Improvement NonBond Fund) per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That the transfer of $269,500.00, or so much thereof as may be needed, is authorized in Fund 6008 (Water Permanent Improvement NonBond Fund) per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the Director of Public Utilities is authorized and directed to renew the professional engineering services agreement with CHA Consulting, 471 E. Broad Street, Suite 2010, Columbus, Ohio, 43215, for the Hap Cremean Water Plant Lime and Soda Ash Dust Collection System Improvements Project, in an amount not to exceed $269,500.00.\n \nSECTION 5. That the expenditure of $269,500.00, or so much thereof as may be needed, is authorized in Fund 6008 (Water Permanent Improvement NonBond Fund) per the accounting codes in the attachment to this ordinance.\n \nSECTION 6.  Funds are deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 7.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 8.  That the City Auditor is authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 9.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 78,
    "meeting_date": "2023-05-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}