{
  "success": true,
  "vote": {
    "id": 66,
    "item_number": "SR-5",
    "title": "To authorize the appropriation and transfer of $1,744,169.25 of cash assets from the Neighborhood Stabilization Program 2 to the Community Development Block Grant; and to declare an emergency. ($1,744,169.25)",
    "description": "Explanation\nBACKGROUND:  The City of Columbus maintains a cash balance for program income received through activities related to the Neighborhood Stabilization Program 2 (NSP2) grant program.  The City intends to close out the NSP2 grant with the U.S. Department of Housing and Urban Development (HUD) and transfer the remaining program income balance to the Community Development Block Grant (CDBG) program to fund CDBG eligible activities.  This ordinance authorizes the appropriation of funds from the NSP2 grant and transfer $1,744,169.25 of cash assets from the NSP2 grant to the CDBG program.  \nThe Department of Finance and Management, Division of Grants Management, is responsible for performing the required transactions in the Disaster Recovery Grant Reporting (DRGR) system and the Integrated Disbursement and Information System (IDIS) to properly account for the transfer of program income between the NSP and CDBG grant programs.  The available CDBG program income funds will be available for immediate use in IDIS upon HUD approval.  The Division of Grants Management will report the transferred program income within the available resources in the 2021 Annual Action Plan.\nEMERGENCY DESIGNATION: This ordinance is submitted as an emergency so as to allow these financial transactions to be posted in the City’s accounting system as soon as possible.  Up to date financial posting promotes accurate accounting and financial management.\n \nFISCAL IMPACT: This ordinance authorizes the appropriation and transfer of existing cash assets from the NSP2 grant to the CDBG program. ($1,744,169.25)\n \nTitle\nTo authorize the appropriation and transfer of $1,744,169.25 of cash assets from the Neighborhood Stabilization Program 2 to the Community Development Block Grant; and to declare an emergency. ($1,744,169.25)\n \nBody\nWHEREAS, the City of Columbus is a recipient of Neighborhood Stabilization Program 2 (NSP2) grant funds from the U.S. Department of Housing and Urban Development (HUD); and\n \nWHEREAS, the City has generated program income through carrying out activities related to the NSP2 grant program; and\n \nWHEREAS, City is a current recipient of Community Development Block Grant (CDBG) funds from HUD; and\nWHEREAS, the City intends to close out the NSP2 grant with HUD and transfer the remaining program income to the CDBG program in accordance with HUD rules and regulations; and\nWHEREAS, it is necessary to authorize the appropriation and transfer of cash assets in the amount of $1,744,169.25 from the NSP2 grant to the CDBG program; and\nWHEREAS, an emergency exists in the usual daily operation of the Department of Finance and Management in that it is immediately necessary to transfer cash assets from NSP2 grant program to the CDBG program, for the immediate preservation of the public, health, peace, property, safety and welfare; Now, Therefore;\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Department of Finance and Management, Division of Grants Management, is required to transfer $1,744,169.25 of program income from the Neighborhood Stabilization Program 2 (NSP 2) G451036 in the General Government Grants fund 2220 to the Community Development Block Grant (CDBG) fund 2248, based on federal requirements for grants based accounting and according to the account coding attached to this ordinance.  \n \nSECTION 2.   That the City Auditor is hereby authorized and directed to appropriate and transfer $1,744,169.25 from the General Government Grants Fund, fund 2220, to the Community Development Block Grant, fund 2248, as needed for compliance with Federal laws, rules, and regulations per the accounting codes attached to this ordinance.  \n \nSECTION 3.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all actions authorized in this ordinance.\n \nSECTION 4.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 1,
    "meeting_date": "2021-01-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services",
      "Grants"
    ]
  }
}