{
  "success": true,
  "vote": {
    "id": 6602,
    "item_number": "SR-4",
    "title": "To authorize the Director of the Department of Recreation and Parks to enter into contract with Columbus Urban League for services related to the implementation of the 2023 Neighborhood Violence Intervention Program; to authorize the transfer and appropriation of $859,000.00 from the General Fund to the Recreation and Parks Operating Fund; to authorize the expenditure of $429,500.00 from the Recreation and Parks Operating Fund; to waive the competitive bidding provisions of Columbus City Code; and to declare an emergency. ($429,500.00)",
    "description": "Explanation\n \nThis ordinance will authorize the Director of the Columbus Department of Recreation and Parks to enter into a one-year contract with the Columbus Urban League (CUL) for the amount of $429,500.00; and authorize the transfer and appropriation of $859,000 from the General Fund to the Recreation and Parks Operating Fund. \n \nBackground:  This contract is necessary in order to provide violence interruption and crisis response activities that include responding to specific violent confrontations, working to mediate and diffuse conflict tensions, and actively promoting peace building among our youth. Contractor shall maintain a 24-hour, 7-day-a-week schedule to respond to calls regarding youth violence confrontations such as shootings, aggravated assaults, homicides, and other violent incidents.\n \nThe Contractor shall respond to incidents or conflicts that are within their assigned zone(s) or may impact their assigned zone(s).  The Contractor shall also provide support services to victims' families and friends. Support services will be provided after making initial contact with victims’ families and friends at the scene of an incident, hospital or at a time and location chosen by the victims’ families and friends. Support services can also include Contractor attending funerals, vigils, peace marches, etc. Additionally, Community Intervention Workers shall participate in Neighborhood Violence Interruption (NVI) activities and initiatives focusing on reducing youth violence citywide and improving community collaborations to support the NVI initiative.  The Columbus Urban League will hold a surety bond in the amount of $100,000.00 and Certificate of Insurance as required by the City.  \n \nPrincipal Parties:\nColumbus Urban League  \n788 Mt. Vernon Ave.\nColumbus, Ohio 43203\n(614) 257-6300\nContractor Federal ID #:  31-4379453\n \nAreas Affected: The primary focus areas of Columbus Urban League will be east and south zones. \n \nEmergency Justification: an emergency exists in the usual daily operation of the Department of Recreation and Parks in that the prior contract with CUL has expired and it is immediately necessary to authorize the Director to enter into contract with the Columbus Urban League so that the Neighborhood Violence Intervention Program can continue without interruption.  \n \nBid Waiver Justification: A bid waiver is being requested in order to keep the consistency with the program participants and the vendor (interventionists).  They have been working with the NVI program for several years; they know the program participants, the youth and young adults in the community and have established relationships with them.  It is important to keep the continuity of these relationships and trust.  A new vendor would have to come in and start from the very beginning to obtain this knowledge, understanding, and trust.\n \nFiscal Impact: \nThe amount of $429,500.00 was budgeted for this project in the General Fund. The amount of $859,000.00 must be transferred to the Recreation and Parks Operating Fund 2285 to properly align this and a related expenditure with the Department of Recreation and Parks, who will be managing the contracts with the Columbus Urban League and Community for New Direction for the Neighborhood Violence Intervention Program.\n \nBenefits to the Public:  Providing violence intervention and prevention strategies with a primary focus on 14-23 year-olds. \n \nCommunity Input/Issues:  Addressing need for increased positive youth engagement, development and mentorship to combat youth involved violence. \n \nMaster Plan Relation:  Implementing strategies to vulnerable residents in targeted neighborhoods to ensure equal access to critical resources and opportunities for success for all.\n \nTitle\n \nTo authorize the Director of the Department of Recreation and Parks to enter into contract with Columbus Urban League for services related to the implementation of the 2023 Neighborhood Violence Intervention Program; to authorize the transfer and appropriation of $859,000.00 from the General Fund to the Recreation and Parks Operating Fund; to authorize the expenditure of $429,500.00 from the Recreation and Parks Operating Fund; to waive the competitive bidding provisions of Columbus City Code; and to declare an emergency. ($429,500.00)\n \nBody\n \nWHEREAS, it is necessary to authorize the transfer and appropriation of $859,000.00 from the General Fund 1000-100010 to the Recreation and Parks Operating Fund 2285; and\n \nWHEREAS, this transfer of funds is necessary because oversight of this violence intervention program is shifting from the Department of Public Safety to the Department of Recreation and Parks; and\n \nWHEREAS, it is necessary to authorize the Director of the Department of Recreation and Parks to enter into a contract with the Columbus Urban League for services related to the Neighborhood Violence Intervention (NVI) Program; and\n \nWHEREAS, it is necessary to authorize the expenditure of $429,500.00 from the Recreation and Parks Operating Fund 2285; and\n \nWHEREAS, it is in the best interest of the Department of Recreation and Parks to waive the competitive bidding requirements of Chapter 329 of the Columbus City Code because this vendor has intrinsic knowledge and understanding of the NVI program and its evolution providing continuity of service; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Recreation and Parks in that it is immediately necessary to authorize the Director to enter into contract with Community for New Direction so that the Neighborhood Violence Intervention Program can continue without interruption; NOW,  THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Department of Recreation and Parks is authorized to enter into a one-year contract with the Columbus Urban League for services related to the Neighborhood Violence Intervention Program.\n \nSECTION 2.  That the sum of $859,000.00 or so much thereof as may be necessary, is hereby authorized to be transferred within the General Fund 3001, 1000-1000010 from Services to the Transfer line per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.   That the amount of $859,000.00 or so much thereof as may be necessary, is hereby authorized to be transferred from the General Fund 1000-100010 to the Recreation and Parks Department Operating Fund 5101-03-2285 per the accounting codes in the attachment to this ordinance. \n \nSECTION 4.   That the sum of $859,000.00 or so much thereof as may be necessary, is hereby authorized to be appropriated within the Department Recreation and Parks Operating Fund 2285 per the accounting codes in the attachment to this ordinance.\n \nSECTION 5.  That this Council finds it in the best interest of the City to waive the competitive bidding provisions of City Code Chapter 329 to enter into this contract.\n \nSECTION 6.  That for the purpose stated in Section 1, the expenditure of $429,500.00 or so much thereof as may be necessary, is authorized to be expended from the Recreation and Parks Operating Fund 2285 per the accounting codes in the attachment to this ordinance. \n \nSECTION 7.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this legislation.  \n \nSECTION 8.  That the funds necessary to carry out the purpose of this ordinance are deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 9.  That for the reasons stated in the preamble hereto, which is made a part hereof, this ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten (10) days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 1,
    "absent": 0,
    "meeting_id": 78,
    "meeting_date": "2023-05-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSTAIN"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}