{
  "success": true,
  "vote": {
    "id": 6630,
    "item_number": "CA-12",
    "title": "To amend the 2022 Capital Improvement Budget; to authorize the transfer of funds and appropriation within the Streets and Highways Bond Fund; to authorize the Director of Public Service to enter into a professional services contract with DLZ Ohio, Inc. for the Intersection - High Street at Obetz Road project; to authorize the expenditure of up to $300,000.00 from the Streets and Highways Bond Fund to pay for this contract. ($300,000.00)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Service to enter into professional services contract with DLZ Ohio, Inc. in the amount of up to $300,000.00 for the Intersection - High Street at Obetz Road project.\n \nThe intent of this project is to provide the City of Columbus, Department of Public Service, additional resources to make improvements to traffic and pedestrian operations at the intersection of S. High Street and Obetz Road by upgrading the traffic signal to allow changes in signal operations and extending the southbound left-turn lane. As part of this project, S. High Street will be restriped to two through lanes in each direction between I-270 and Highview Blvd.\n \nThe Department of Public Service, Office of Support Services, solicited Requests for Proposals for the Intersection - High Street at Obetz Road contract.  The project was formally advertised on the Vendor Services and Bonfire web sites from February 22, 2023, to March 23, 2023.  The city received two (2) responses.  All proposals were deemed responsive and were fully evaluated when the Evaluation Committee met on April 3, 2023.  The responding firms were:  \n \nCompany Name                                                               City/State                                                      Majority/ODI Certification\nDLZ Ohio, Inc.                                                                                    Columbus, OH                                                                                    MBE\nE.P. Ferris & Associates, Inc.                                          Columbus, OH                                                                                    MAJ\n \nDLZ Ohio, Inc. received the highest score by the evaluation committee and will be awarded the Intersection - High Street at Obetz Road contract.  \n \nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against DLZ Ohio, Inc.\n \nDLZ Ohio, Inc.’s certification was in good standing at the time the bid was awarded.\n \nAs part of their bid DLZ Ohio, Inc. has proposed the following 2 subcontractors to work on the project:\n \nCompany Name                                                               City/State                                                               Majority/ODI Certification\nSJCA, Inc.                                                                                    Columbus, Ohio                                                               MBE\nLawhon & Associates, Inc.                                          Columbus, Ohio                                                               WBE\n \n2.  CONTRACT COMPLIANCE\nDLZ Ohio, Inc.’s contract compliance number is CC004939 and expires 10/24/24.  \n \n3.  FISCAL IMPACT\nFunding for this contract is available and appropriated within Fund 7704, the Streets and Highways Bond Fund.  An amendment to the 2022 Capital Improvement Budget and a transfer of cash is required to establish sufficient budget authority for the project.\n \n4. MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract was bid with an assigned City of Columbus MBE/WBE Program goal of 7% as provided by the City’s Office of Diversity and Inclusion (ODI).  Failure by the contractor to meet this goal subjects the contractor to the Penalties for Non-Compliance as described in the “City’s Minority and Women-Owned Business Enterprise & Small Local Business Enterprise Program Manual” and in the “City of Columbus MBE/WBE Program Special Provision” that were part of the bid documents for this contract.\n \nTitle\nTo amend the 2022 Capital Improvement Budget; to authorize the transfer of funds and appropriation within the Streets and Highways Bond Fund; to authorize the Director of Public Service to enter into a professional services contract with DLZ Ohio, Inc. for the Intersection - High Street at Obetz Road project; to authorize the expenditure of up to $300,000.00 from the Streets and Highways Bond Fund to pay for this contract. ($300,000.00)\n \nBody\nWHEREAS, there is a need to enter into a professional services contract to make improvements to traffic and pedestrian operations at the intersection of S. High Street and Obetz Road by upgrading the traffic signal to allow changes in signal operations and extending the southbound left-turn lane.; and\n \nWHEREAS, the Department of Public Service, Office of Support Services, solicited Requests for Proposals for the Intersection - High Street at Obetz Road project; and\n \nWHEREAS, DLZ Ohio, Inc. submitted the best overall proposal for this project; and\n \nWHEREAS, it is necessary to enter into a contract with DLZ Ohio, Inc. for the provision of professional engineering consulting services described above in the amount of up to $300,000.00; and\n \nWHEREAS, it is necessary to authorize an amendment to the 2022 Capital Improvement Budget for the purpose of providing sufficient spending authority for the aforementioned project expenditure; and\n \nWHEREAS, it is necessary for Council to authorize a transfer of funds and appropriation within Fund 7704, the Streets and Highways Bond Fund, to establish sufficient cash to pay for the project; and\n \nWHEREAS, this contract opportunity was submitted to the City’s Office of Diversity and Inclusion (ODI) for review and assignment of an MBE/WBE goal prior to bidding; and\n \nWHEREAS, this contract was bid with an assigned City of Columbus MBE/WBE Program goal of 7% as provided by the City’s Office of Diversity and Inclusion (ODI); and\n \nWHEREAS, failure by the contractor to meet this goal subjects the contractor to the Penalties for Non-Compliance; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the 2022 Capital Improvements Budget authorized by ordinance 1896-2022 be amended as follows to establish  sufficient authority for this project:\n \nFund / Project / Project Name / C.I.B. / Change / C.I.B. as Amended\n7704 / P530303-100002 / Wheatland Avenue Improvements (Voted Carryover) / $714,502.00 / ($300,000.00) / $414,502.00\n \n7704 / P538021-100000 / Intersection - High Street at Obetz Road (Voted Carryover) / $0.00 / $300,000.00 / $300,000.00\n \nSECTION 2.  That the transfer of $300,000.00, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5912 (Design and Construction), Project P530303-100002 (Wheatland Avenue Improvements), Object Class 06 (Capital Outlay) to Dept-Div 5912 (Design and Construction), Project P538021-100000 (Intersection - High Street at Obetz Road), Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That the Director of Public Service be, and hereby is, authorized to enter into a professional services contract with DLZ Ohio, Inc. at 6121 Huntley Rd., Columbus, OH  43229, for the Intersection - High Street at Obetz Road project in an amount up to $300,000.00.\n \nSECTION 4.  That the expenditure of $300,000.00, or so much thereof as may be needed, is hereby authorized in Fund 7704 (Streets and Highways Bond Fund), Dept-Div 5912 (Design and Construction), Project P538021-100000 (Intersection - High Street at Obetz Road), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 5.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 7.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 8.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 79,
    "meeting_date": "2023-05-22",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Public Works"
    ]
  }
}