{
  "success": true,
  "vote": {
    "id": 6659,
    "item_number": "CA-41",
    "title": "To reaffirm the role of the Economic Stabilization Fund (\"Rainy Day Fund\") in allowing the City to maintain and continue basic services during an economic downturn, natural disaster, or catastrophe; and to establish as a goal a balance of $114.4 million, ten percent of the Mayor's proposed 2023 budget, in the fund by the end of 2027.",
    "description": "Explanation\nBackground: The City of Columbus established the Economic Stabilization Fund (or \"Rainy Day Fund\") in 1988 to provide for the continuation of basic services during times of economic recession or unexpected revenue loss.   The fund was first utilized in 2003.  During the period from 2003-2009, over $91 million was transferred into the general fund in order to avoid drastic reductions to city services in those years.  \n \nIn 2009, the city made a commitment to the residents of Columbus to restore the fund balance of the Rainy Day Fund to $50 million by 2014, via resolution 0178X-2009.  Having achieved that goal, the Mayor, City Council and the City Auditor set a new goal in 2013, via resolution 0013X-2013, of achieving a fund balance of $75 million by the end of 2018, a goal which the city surpassed.  As such, in 2017, via 0073X-2017, the goal of achieving a fund balance of $80 million by the end of 2020 was established.  Due to the strength of the city’s revenue and sound fiscal stewardship an additional $1,000,000 was deposited to the Rainy Day Fund in 2019 via 2924-2019.  Making this deposit ensured a balance in excess of $80 million, one full year ahead of the intended goal.  In 2019, via resolution 0307X-2019, the city established a new goal of achieving a fund balance of $90 million by the end of 2024.  This goal was accomplished by the end of 2022, two years ahead of schedule.\n \nAs responsible stewards of public funds, the city has an obligation to plan for the economic uncertainty that results from recessions, natural disasters, pandemics, or catastrophes, and to sustain basic city services in the face of such challenges. Through the adoption of this ordinance, the Mayor, the City Auditor, and City Council reaffirm the goals, purposes, and objectives of establishing, maintaining, and protecting the Economic Stabilization (\"Rainy Day\") Fund. \n \nIn addition, this legislation conveys the intent of the City to establish the goal of achieving a balance of $114.4 million, ten percent of the Mayor's proposed 2023 budget, in the fund by the end of 2027.  \n \nTitle\nTo reaffirm the role of the Economic Stabilization Fund (\"Rainy Day Fund\") in allowing the City to maintain and continue basic services during an economic downturn, natural disaster, or catastrophe; and to establish as a goal a balance of $114.4 million, ten percent of the Mayor's proposed 2023 budget, in the fund by the end of 2027.  \n \nBody\nWHEREAS, the City of Columbus established the Economic Stabilization Fund (or \"Rainy Day Fund\") in 1988 (Ordinance 0860-1988, passed April 11, 1988) to provide for the continuation of basic services during times of economic recession or unexpected revenue loss; and \n \nWHEREAS, at different times since its establishment these funds have been utilized due to continuing deteriorating national, state, or local economic conditions; and\n \nWHEREAS, the city has met and surpassed the commitments made in 2009, 2013, and 2017; and\n \nWHEREAS, the 2019 goal of achieving $90 million by the end of 2024 has been met, and now the city intends to achieve a greater fund balance of $114.4 million, ten percent of the Mayor's 2023 proposed budget, by the end of 2027; and\n \nWHEREAS, in keeping with sound financial practices, and consistent with the need to protect city finances during extended economic downturns or times of extreme emergency created by unexpected events, it is important that the city budget and plan for the possibility of future fiscal challenges; and \n  \nWHEREAS, in recognition of the city’s strong fiscal management, the City of Columbus has consistently maintained the highest bond ratings from the three major bond rating agencies; and\n \nWHEREAS, the maintenance of adequate general fund reserves is a key factor used by these rating agencies in determining the overall credit worthiness of a city; now therefore,\n \nBE IT RESOLVED BY THE CITY COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the cash balance in the Economic Stabilization Fund shall reach $114.4 million by the end of 2027.\n \nSECTION 2.  That this resolution shall take effect and be in force from the earliest date allowable by law.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 79,
    "meeting_date": "2023-05-22",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance"
    ]
  }
}