{
  "success": true,
  "vote": {
    "id": 6681,
    "item_number": "SR-13",
    "title": "To authorize an amendment to the 2022 Capital Improvement Budget; to authorize the transfer of cash between projects within the Water PayGo Fund; to authorize the appropriation of funds within the Water Revolving Loan Fund and within the Water PayGo Fund; to authorize a waiver of the competitive bidding requirements for construction; to authorize the Director of Public Utilities to enter into a professional services and construction services contract with Synagro Central  for the Water Treatment Residuals Turnkey Dewatering Services project; and to authorize the expenditure of up to $47,000,000.00 from the Water Revolving Loan Fund and the Water PayGo Fund for the contract.  ($47,000,000.00)",
    "description": "Explanation    \n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Utilities to enter into a contract with Synagro Central for professional services and construction services for the Water Treatment Residuals Turnkey Dewatering Services project, CIP #690540-100002, in an amount up to $47,000,000.00. \n \nThe City of Columbus, Department of Public Utilities, Division of Water (“City”), provides drinking water to approximately 1.2 million residents in the Greater Columbus Area. The City owns and operates three water plants that treat and distribute drinking water to their customers.  As a part of the drinking water treatment process, several water treatment residuals (WTR) products are generated that require handling, management, and beneficial use or disposal.  The City is seeking to improve the sustainability of its current WTR management methods by moving away from a disposal-based operation to one that is entirely or substantially based on beneficial use.  \n \nThis project will design and construct a WTR dewatering facility at the Division of Water’s McKinley Avenue Quarry property that will include handling, dewatering, transportation, beneficial use, and in very limited cases, disposal of WTR.  Synagro Central will be responsible for designing, furnishing, installing, and operating all facilities, equipment, material, consumables, and labor required to provide the requested services. \n \nThe Community Planning Area is “99 - Citywide” since the facility will handle WTR from water plants which serve multiple Columbus communities.\nTIMELINE:  A Notice to Proceed is anticipated to be issued in July of 2023.  Construction substantial completion is estimated to occur in August of 2025, and final completion is estimated to occur the first quarter of 2026.  \n \nESTIMATED COST OF PROJECT:  The contract amount is expected to be $47,000,000.00.  No contract modifications are anticipated at this time; however, design exigency might later compel modification of this contract if unforeseen difficulties are encountered.\n                     \n                     Original Contract                                               $47,000,000.00\n                     Future Anticipated Needs                                               $              0.00\n        CONTRACT TOTAL                                               $47,000,000.00\n \nConstruction Administration / Inspection is anticipated to be performed by Hill International under an existing contract with the Department of Public Utilities.  This amount will be determined and then legislated under a separate ordinance.  \n \n2.  ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT\nThe project will extend the life of the Quarry for residuals disposal and improve the sustainability of the Department of Water’s WTR management methods by diverting a significant portion of the WTR to beneficial uses.  Almost all work will be conducted in areas not accessible to the public, so it is not anticipated community outreach will be conducted for this project. \n3.  BID INFORMATION\nThis project was formally advertised on the Vendor Services and Bonfire websites from 6/10/2021 through 9/3/21.   One proposals was received:\n \nName                                          C.C. No.            Exp. Date                     City/State                Status                     \nSynagro Central, LLC                   CC-010213          7/8/23                                  Baltimore, MD                     MAJ     \n \nThe proposal was deemed responsive.  The evaluation committee reviewed the proposal and recommended the contract for the Water Treatment Residuals Turnkey Dewatering Services project be awarded to Synagro Central.\n \nSynagro Central’s certification was in good standing at the time of the contract award.\n \n4.  WAIVER OF COMPETITIVE BIDDING REQUIREMENTS\nA waiver of the competitive bidding requirements for construction in City Code Chapter 329 is requested.  The residuals pond at the Quarry is filling up faster than anticipated.  This will require construction of this project to be completed sooner than planned.  Due to the need to construct this project as quickly as possible after design is completed, it is felt there is not sufficient time to follow the requirements in City Code to await design to be completed and then bid construction.    \n \n5.  CONTRACT COMPLIANCE INFORMATION\nSynagro Central’s contract compliance number is CC-010213 and expires 7/8/23.  Searches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against Synagro Central. \n \n6.  MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract was bid prior to the implementation of the City of Columbus MBE/WBE Program and is not subject to the requirements of that program.  Synagro Central is classified as a majority company by the City’s Office of Diversity and Inclusion.  No subconsultants or subcontractors have been identified to work on this contract yet. \n \n7.  FISCAL IMPACT\nThis project has been approved for below market-rate loan financing through the Ohio Environmental Protection Agency’s Water Pollution Control Loan Fund (WPCLF) which is administered by the Ohio Water Development Authority (OWDA).  The loan award in the amount of $45,000,000.00 was made in March of 2023 and an OWDA Loan Account number was assigned.  An amendment to the 2022 Capital Improvement Budget is needed to show the actual loan amount.  Funds will need to be appropriated and expended in the Water Revolving Loan Fund, Fund 6011.  The Water Revolving Loan Fund will be used to establish a purchase order which will then be converted to a BRDI by the Auditor’s Office.  \n \nFunding in the amount of $2,000,000.00 is available within the Water PayGo Fund, Fund 6016, for the additional funds needed for this project.  An amendment to the 2022 Capital Improvement Budget is needed to align budget authority with the proper project.  A transfer of cash is needed within the Water PayGo Fund to align cash with the proper project.  The funds will then need to be appropriated.  \n \nTitle\nTo authorize an amendment to the 2022 Capital Improvement Budget; to authorize the transfer of cash between projects within the Water PayGo Fund; to authorize the appropriation of funds within the Water Revolving Loan Fund and within the Water PayGo Fund; to authorize a waiver of the competitive bidding requirements for construction; to authorize the Director of Public Utilities to enter into a professional services and construction services contract with Synagro Central  for the Water Treatment Residuals Turnkey Dewatering Services project; and to authorize the expenditure of up to $47,000,000.00 from the Water Revolving Loan Fund and the Water PayGo Fund for the contract.  ($47,000,000.00) \n \nBody\nWHEREAS, the Department of Public Utilities is engaged in the Water Treatment Residuals Turnkey Dewatering Services project; and\n \nWHEREAS, one proposal for the Water Treatment Residuals Turnkey Dewatering Services project was received and evaluated by the evaluation committee; and\n \nWHEREAS, the evaluation committee recommended Synagro Central be awarded the contract for this project; and \n \nWHEREAS, a waiver of the competitive bidding requirements in City Code Chapter 329 is needed for the construction of this project; and\n \nWHEREAS, it is necessary to authorize the Director of the Department of Public Utilities to enter into a professional services and construction services contract with Synagro Central for the Water Treatment Residuals Turnkey Dewatering Services project; and \n \nWHEREAS, the 2022 Capital Improvements Budget must be modified to align budget authority with the proper project; and\n \nWHEREAS, it is necessary to transfer cash between projects within the Water PayGo, Fund 6016, to align cash with the proper project; and\n \nWHEREAS, funds must be appropriated within the Water Revolving Loan Fund, Fund 6011, and the Water PayGo Fund, Fund 6016; and\n \nWHEREAS, it is necessary to authorize an expenditure of funds within the Water PayGo Fund, Fund 6016, and the Water Revolving Loan Fund, Fund 6011, to pay for the contracted services for the project; now, therefore  \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2022 Capital Improvements Budget authorized by Ordinance 1896-2022 be amended as follows to establish sufficient budget authority for this project:\n \nFund / Project Number / Project Name (Funding Source) / Current Authority/ Revised Authority / Change \n6011 / 690540-100002 / Water Treatment Residuals Turnkey Dewatering Services / (WSRLA Loan) / $0.00 / $45,000,000.00 / $45,000,000.00 (To match loan amount)\n \n6016 / 601699-100000 / 60-09 Unallocated Balance Fd. 6016 (Water PayGo Carryover) / $7,969,773.00 / $6,726,273.00 / ($1,243,500.00) (to match cash)\n6016 / 601699-100000 / 60-09 Unallocated Balance Fd. 6016 (Water PayGo Carryover) / $6,726,273.00 / $4,726,273.00 / ($2,000,000.00)\n6016 / 690540-100002 / Water Treatment Residuals Turnkey Dewatering Services / (Water PayGo Carryover) / $0.00 / $2,000,000.00 / $2,000,000.00\n \nSECTION 2.  That the transfer of $2,000,000.00, or so much thereof as may be needed, is hereby authorized within the Water PayGo Fund, Fund 6016, per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2023, the sum of $2,000,000.00 is appropriated in Fund 6016 (Water PayGo Fund), and the sum of $45,000,000.00 is appropriated in Fund 6011 (Water Revolving Loan Fund, Fund), per the account codes in the attachment to this ordinance\n \nSECTION 4.  That in accordance with Section 329.15 of the Columbus City Code, City Council has determined that it is in the best interest of the City of Columbus that the sections of City Code Chapter 329 relating to competitive bidding requirements for construction be waived and hereby waives said sections.\n \nSECTION 5.  That the Director of Public Utilities is hereby authorized to enter into a professional services and construction services contract for the Water Treatment Residuals Turnkey Dewatering Services project with Synagro Central, 435 Williams Court, Suite 100, Baltimore, MD, 21220, in an amount up to $47,000,000.00, in accordance with the terms and conditions of the contract on file in the Department of Public Utilities.\n \nSECTION 6.  That the expenditure of $47,000,000.00, or so much thereof as may be needed, is hereby authorized to pay for this contract per the accounting codes in the attachment to this ordinance.\n \nSECTION 7.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 8.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 9.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 10.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 79,
    "meeting_date": "2023-05-22",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}