{
  "success": true,
  "vote": {
    "id": 6716,
    "item_number": "CA-17",
    "title": "To extinguish a 0.325 acre portion of right-of-way and transfer the property and control thereof to the Recreation and Parks Department. ($0.00)",
    "description": "Explanation\n1. Background:\nThe Department of Public Service (DPS) received a request from the Recreation and Parks Department (R&P) asking for transfer of an approximate 0.325 acre portion of right-of-way from DPS to R&P's to be combined with R&P's existing Franklin County tax parcel number 010-067083.  The right-of-way area is also known as Glenview Blvd. and is located between N. Eureka Avenue and N. Eldon Avenue.  \n \nExtinguishing the right-of-way and transferring the property will facilitate improvements and enhancements to City owned property. The right-of-way is within R&P's park boundaries and should not exist as right-of-way, but should be under the control of R&P's.  \n \nPer current practice, comments were solicited from interested parties, including City agencies, private utilities and the applicable area commission, before it was determined that, subject to the retention of a general utility easement for those utilities currently located within the right-of-way, the City will not be adversely affected by extinguishing this right-of-way and transferring the property among City Departments.  DPS has agreed to transfer the asset as described and shown within the attached legal description and exhibit and supports extinguishing this property as public right-of-way. \n \nThis request went before the Land Review Commission on December 19, 2019.  After review of the request, the Land Review Commission voted to recommend the above referenced right-of-way be transferred to R&P's at no cost.\n \n2. FISCAL IMPACT:\nThere is no cost to the City to transfer the right-of-way.\n \nTitle\nTo extinguish a 0.325 acre portion of right-of-way and transfer the property and control thereof to the Recreation and Parks Department. ($0.00)\n \nBody\nWHEREAS, Department of Public Service (DPS) received a request from Recreation and Parks Department (R&P) asking for the transfer of an approximate 0.325 acre portion of right-of-way from DPS to the R&P's to be combined with R&P's existing Franklin County tax parcel number 010-067083.  The right-of-way area is also known as Glenview Blvd. and is located between N. Eureka Avenue and N. Eldon Avenue; and\n \nWHEREAS, extinguishing the right-of-way and transferring the property will facilitate improvements and enhancements to City-owned property. This right-of-way is within R&P's park boundaries and should not exist as right-of-way, but should be under the control of R&P's; and \n \nWHEREAS, DPS has agreed to transfer the asset as described and shown within the attached legal description and exhibit and supports extinguishing this property as public right-of-way; and\n \nWHEREAS, per current practice, comments were solicited from interested parties, including City agencies, private utilities and the applicable area commission, before it was determined that, subject to the retention of a general utility easement for those utilities currently located within the right-of-way, the City will not be adversely affected by extinguishing this right-of-way and transferring the property among City Departments; and\n \nWHEREAS, this request went before the Land Review Commission on December 19, 2019; and\n \nWHEREAS, after review of the request, the Land Review Commission voted to recommend the above referenced right-of-way be transferred to R&P's at no cost; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.   That the 0.325 acre portion of right-of-way described and depicted in Exhibit A, which is attached hereto and made a part hereof, is no longer needed as public right of way and can be extinguished.\n \nSECTION 2.   That control of this property shall be transferred from the Public Service Department to the Recreation and Parks Department.\n \nSECTION 3.   That a general utility easement in, on, over, across and through this excess right-of-way shall be, and hereby is, retained for those utilities currently located within said excess right-of-way.\n \nSECTION 4.   That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 80,
    "meeting_date": "2023-06-05",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Parks & Recreation",
      "Property & Real Estate"
    ]
  }
}