{
  "success": true,
  "vote": {
    "id": 6731,
    "item_number": "CA-32",
    "title": "To authorize the Director of the Department of Finance and Management to establish a purchase order with Fyda Freightliner Columbus, Inc. in the amount of $272,228.00 for the purchase of one (1) Single Axle CNG Dump Truck with snow removal equipment from an established Universal Term Contract for the Division of Water; and to authorize the expenditure of $272,228.00 from the Water Operating Fund.  ($272,228.00).",
    "description": "Explanation\nBACKGROUND:  The Purchasing Office has established a Universal Term Contract for Single and Tandem Axle Compressed Natural Gas (CNG) Dump Trucks with Snow Equipment (PA004938).   The Division of Water is requesting the establishment of a purchase order in the amount of $272,228.00 for one (1) Single Axle CNG Dump Truck with snow removal equipment with Fyda Freightliner Columbus, Inc.  This vehicle will be used primarily by the Division of Water, Distribution Maintenance section crew to transport employees, tools, materials, and equipment for maintenance of the City of Columbus waterlines.\n \nThis purchase was approved by Fleet Management and will replace vehicle BT-23531.  In support of the Mayor’s Get Green Columbus initiative, this vehicle is powered by a compressed natural gas (CNG) engine.  \n \nThe company is not debarred according to the Excluded Part Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.\n \nSUPPLIER:     Fyda Freightliner Columbus, Inc., MAJ, 3140789102, expires 4/14/25.\n                     \nFiscal Impact:  $272,228.00 is required and budgeted in the Water Operating Fund to meet the financial obligations of these various expenditures.\n \n$0.00 spent on similar purchases in 2022.\n$215,805.00 was spent on similar purchases in 2021.\n \n \nTitle\n \nTo authorize the Director of the Department of Finance and Management to establish a purchase order with Fyda Freightliner Columbus, Inc. in the amount of $272,228.00 for the purchase of one (1) Single Axle CNG Dump Truck with snow removal equipment from an established Universal Term Contract for the Division of Water; and to authorize the expenditure of $272,228.00 from the Water Operating Fund.  ($272,228.00).\n \n \nBody\n \nWHEREAS, one (1) Single Axle CNG Dump Truck with snow removal equipment is required by the Division of Water.  This vehicle will be used primarily by Division of Water, Distribution Maintenance section crews, to transport employees, tools, materials, and equipment for maintenance of the City of Columbus waterlines; and  \n \nWHEREAS, purchase orders will be issued by the Purchasing Office in accordance with an established Universal Term Contract (PA004938) with Fyda Freightliner Columbus, Inc. on file in the Purchasing Office; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities to authorize the Director of Finance and Management to establish a purchase order with Fyda Freightliner Columbus, Inc. for a Single Axle CNG Dump Truck with snow removal equipment, all for the preservation of public health, peace, property and safety; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Finance and Management be and is hereby authorized to establish a purchase order with Fyda Freightliner Columbus, Inc., 1250 Walcutt Road, Columbus, Ohio 43228 for the purchase of one (1) Single Axle CNG Dump Truck with snow removal from an established Universal Term Contract (PA004938) for the Division of Water.  \n \nSECTION 2.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 3.  That the expenditure of $272,228.00, or so much thereof as may be needed, is hereby authorized from Water Operating Fund in object class 06 Vehicles per the accounting coeds in the attachment to this ordinance.\n \nSECTION 4.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 80,
    "meeting_date": "2023-06-05",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}