{
  "success": true,
  "vote": {
    "id": 6733,
    "item_number": "CA-34",
    "title": "To authorize the Director of the Department of Public Utilities to modify and extend the electric power system maintenance services contract with Roberts Service Group, Inc. for the Department of Public Utilities, Division of Power; and to authorize the expenditure of $900,000.00 from the Electricity Operating Fund. ($900,000.00)",
    "description": "Explanation\n \nThis legislation authorizes the Director of Public Utilities to enter into an unplanned modification of the contract with Roberts Service Group, Inc. for electric power system maintenance services for various Department of Public Utilities facilities.  \n \nThe Department of Public Utilities (DPU) has various electric power equipment at the Division of Sewerage and Drainage (DOSD), the Division of Power (DOP), and the Division of Water (DOW) that requires maintenance services. This equipment is located throughout the facilities associated with DPU’s sewage and storm water collection systems and water distribution system, including at the two (2) Wastewater Treatment Plants, Compost Facility, Sewer Maintenance Operations Center, and three (3) Water Treatment Plants. The equipment is also located at various electric substations that service the City of Columbus and its satellite communities.  \n \nThe work performed under the current contract is for electric power distribution systems and their components that require studies, inspection, testing, maintenance, and repair or replacement, with the majority of the work for industrial equipment and systems ranging from 120V to 15.5 kV. The contract also covers inspection, testing, maintenance, and repair or replacement work on equipment and systems >15.5 kV to 138 kV that requires a contractor or subcontractor with highly specialized experience in high voltage equipment.\n \nThe Department of Public Utilities advertised Request for Proposals for the subject services in the City Bulletin in accordance with the relevant provisions of Chapter 329 of City Code. Two hundred and two (202) vendors were solicited (RFQ10714), and four (4) proposals were received and opened on November 7, 2018. The evaluation and final ranking was based upon the criteria in the Request for Proposal and Roberts Service Group, Inc. was determined to be the most qualified responder to provide the necessary electric power system maintenance services.   \n \nThe original contract, PO153604, was established for a period of one (1) year with three (3) additional one (1) year renewal options contingent upon mutual agreement, availability of funding, and approval by Columbus City Council. This is the third modification and it adds an additional year to the contract to and including July 16, 2024. \n \nThis modification is necessary in order to complete ongoing O’Shaughnessy Dam substation work, as delays in the supply chain and production of essential equipment were not anticipated. The necessary switchgear equipment is currently being manufactured, but installation and commissioning will not be complete by the end of the current contract. Additionally, American Electric Power (AEP) is taking this opportunity to re-open DPU’s entire interconnection agreement as well as requiring a full system study, even though DPU is only restoring the hydro facility to its specified capacity at this time. Negotiation and communication on this interconnection agreement have also not moved as quickly as anticipated. Once an agreement has been reached, our Contractor will install the new power cable to the relocated AEP pad-mounted meter, which AEP has elected to move outside the substation in order to begin the commissioning process. The estimated amount of the modification is $900,000.00. All terms and conditions of the original agreement remain in full force and effect.   \n \n \n1.                     Amount of additional funds:  Total amount of additional funds needed for this contract modification #2 is ADD $900,000.00 Total contract amount including this modification is $7,426,921.00.\n \n2.                     Reason additional funds were not foreseen:  This modification was unplanned because of delays in the supply chain and production of equipment needed to restore the substation that supports the O’Shaughnessy Dam.\n \n3.                     Reason other procurement processes not used:  The time sensitive nature of the repairs and that the work under this modification is within the scope of the original bid contract. No lower pricing/more attractive terms and conditions are anticipated at this time.\n \n4.                     How cost was determined:  The cost to provide Electric Power System Maintenance Services for DPU facilities is in accordance with the terms of the original contract\n \nSUPPLIER:  \n \nRoberts Service Group, Inc. | EIN on file | D365 Vendor #004397 | Expires 10/10/2024\nRoberts Service Group, Inc. holds WBE status.\n \nThe company is not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.\n \nFISCAL IMPACT:  \n \n$900,000.00 is needed and available for this contract modification for the Division of Power.\n \n$123,505.24 has been spent in 2023\n$426,456.44 was spent in 2022 \n$478,925.81 was spent in 2021 \n \n \nTitle\n \nTo authorize the Director of the Department of Public Utilities to modify and extend the electric power system maintenance services contract with Roberts Service Group, Inc. for the Department of Public Utilities, Division of Power; and to authorize the expenditure of $900,000.00 from the Electricity Operating Fund. ($900,000.00)\n \n \nBody\n \nWHEREAS, the Department of Public Utilities has a contract with Roberts Service Group, Inc. for electric power system maintenance services for the various divisions of the Department; and\n \nWHEREAS, the Department advertised Request for Proposals for the subject services in accordance with the relevant provisions of Chapter 329 of City Code, four (4) proposals were received and opened on November 7, 2018, and Roberts Service Group, Inc. was determined to be the most qualified responder to provide the necessary electric power system maintenance services; and\n \nWHEREAS, the existing contract provides maintenance services for electric power distribution systems and their components that require studies, inspection, testing, maintenance, and repair or replacement; and\n \nWHEREAS, the majority of the work is on industrial equipment and systems ranging from 120V to 15.5 KV, though there may also be inspection, testing, maintenance, and repair or replacement work on equipment and systems  >15.5 kV to 138 kV that require a contractor or subcontractor with highly specialized experience in high voltage equipment; and\n \nWHEREAS, the original contract language allowed for a one (1) year contract with the option to renew the agreement for three (3) additional years contingent upon mutual agreement, budgeted funds and approval by City Council; and\n \nWHEREAS, the Department of Public Utilities wishes to increase and extend PO153604 with Roberts Service Group, Inc. for electric power system maintenance services to complete ongoing O’Shaughnessy Dam substation work; and\n \nWHEREAS, the unplanned modification is necessary because of unanticipated delays in the supply chain and production of equipment essential for the Dam’s substation and American Electric Power’s full-system study and reopening of DPU’s interconnection agreement, after which the new power cable will be installed; and\n \nWHEREAS, this contract modification #3 will provide the additional funding and time necessary to finish repair work and installation on the substation supporting the Dam; and\n \nWHEREAS, the vendor has agreed to increase and extend PO153604 and it is in the best interest of the City to exercise this option; and\n \nWHEREAS, that the expenditure of $900,000.00 or so much thereof as may be needed, is hereby authorized in Fund 6300, Electricity Operating Fund, as $500,000.00 from object class 03, Services, and $400,000.00 from object class 02, Materials and Supplies, per the accounting codes in the attachment to this ordinance; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities, Division of Power, to authorize the Director of Public Utilities to increase and extend the current contract for electric power system maintenance services with Roberts Service Group, Inc.; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Utilities is hereby authorized to increase and extend contract No. PO153604 with Roberts Service Group, Inc., 820 North Hague Avenue, Columbus, Ohio 43204, for electric power system maintenance services for the Department of Public Utilities. Total amount of modification #3 is ADD $900,000.00. Total contract amount including this modification is $7,426,921.00. This modification will extend the contract through and including July 16, 2024.\n \nSECTION 2.  That this modification is in accordance with the relevant provisions of Chapter 329 of City Code.\n \nSECTION 3.  That the expenditure of $900,000.00 or so much thereof as may be needed, is hereby authorized in Fund 6300, Electricity Operating Fund, as $500,000.00 from object class 03, Services, and $400,000.00 from object class 02, Materials and Supplies, per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 1,
    "absent": 0,
    "meeting_id": 80,
    "meeting_date": "2023-06-05",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "ABSTAIN"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}