{
  "success": true,
  "vote": {
    "id": 676,
    "item_number": "CA-22",
    "title": "To authorize the amendment of the 2020 Capital Improvement Budget; to authorize the transfer of appropriation and cash between projects in the Information Services Division, Information Services Bond Fund; to authorize the Director of the Department of Technology to enter into contract with CDW Government, LLC for the purchase of Dell Technologies PowerScale file based storage solution; to authorize the expenditure of $961,322.90 for the above-mentioned purpose from the Department of Technology, Information Services Division, Information Services Bond Fund, and to declare an emergency. ($961,322.90)",
    "description": "Explanation\n \nBACKGROUND:  \nThis ordinance authorizes the Director of Department of Technology (DoT) to enter into contract with CDW Government, LLC to acquire a new Dell Technologies PowerScale file based storage solution. This procurement includes redundant hardware, software, (licenses, maintenance and support) for the first 5 years, training, professional services for the project management, installation, configuration, and file migration of the City's legacy file based storage platform. The replacement of the existing legacy file based storage will improve file based storage performance, capacity, security, and ensure that the City continues to keep its critical file based storage infrastructure modern and supported.\nThe legacy file based storage platform being replaced primarily supports user data files for user home directories and for network files shared within and between departments.\nThe total cost of the above-describe procurement is $961,322.90. The term period will be one year from the date of a purchase order confirmed/certified by the Columbus City Auditor’s office. Subject to mutual agreement and approval of proper city authorities this contract can be renewed for one additional year. \nThe Department of Technology, through utilization of a Request for Proposal process, received six (6) proposals from four (4) offerors in response to the filer portion of solicitation number RFQ017029, opened on November 3, 2020. The evaluation process was conducted in two phases. The first phase evaluated offerors on RFP requirements only. All proposals were promoted to phase two. The second phase included a presentation and demonstration of each of the offeror’s proposals. Each proposal was evaluated according to technical requirements, quality, feasibility, competence, relevant project experience, and cost. These evaluation criteria were weighted as indicated in the RFP. At the end of the phase two evaluation process, the offerors associated with the three proposals that had the highest overall total average evaluation score were asked to provide a best and final offer. DoT evaluated the three best and final offers accordingly. Ultimately, the award was made to the vendor with the lowest best overall proposal; CDW Government LLC’s Dell PowerScale proposal.\n \n\n\n\nCDW-G/Dell Technologies Proposal\n\n94.35\n\n\n\nCDW-G/NetApp Option 1 Proposal\n\n90.85\n\n\n\nCDW-G/NetApp Option 2 Proposal\n\n90.72\n\n\n\nPomeroy Proposal\n\n87.18\n\n\n\nTierPoint Proposal\n\n84.79\n\n\n\nCenturyLink/Lumen Proposal\n\n62.22\n\n\n \nThis ordinance also authorizes the amendment of the 2020 Capital Improvement Budget (CIB) with the transfer of appropriation and cash between projects within the Information Services Bond Fund, to accommodate the expenditure authorized by this ordinance. \nFinally, this ordinance authorizes the expenditure of $961,322.90 to facilitate the above-described procurement.\nEMERGENCY\nEmergency action is requested to expedite authorization of this contract to ensure that the City continues to keep its critical file based storage infrastructure modern and supported.\n \n FISCAL IMPACT\nThe funds for this purchase have been identified and are available within the Department of Technology, Information Services Division, Information Services Bond Fund. Both authority and cash are being transferred within the fund, to project number P470047-100000 so that there is sufficient moneys in the project to fund this procurement. A total of $102,337.90 is being transferred from project 470031-100000 (Data Center Facility Upgrades) and $385,000.00 is being transferred from project 470071-100000 (Telephony and IVR Infrastructure). \nCONTRACT COMPLIANCE\nVendor Name: CDW Government, LLC C.C#/F.I/D. #: 36-4230110 Expiration Date: 01/31/2020 (DAX Vendor Acct. #: 007352)\nTitle\nTo authorize the amendment of the 2020 Capital Improvement Budget; to authorize the transfer of appropriation and cash between projects in the Information Services Division, Information Services Bond Fund; to authorize the Director of the Department of Technology to enter into contract with CDW Government, LLC for the purchase of Dell Technologies PowerScale file based storage solution; to authorize the expenditure of $961,322.90 for the above-mentioned purpose from the Department of Technology, Information Services Division, Information Services Bond Fund, and to declare an emergency. ($961,322.90)\n \nBody\nWHEREAS, the Department of Technology has a need to procure a new Dell Technologies PowerScale file based storage solution to include includes redundant hardware, software, licenses, maintenance and support; and\n \nWHEREAS, the Department of Technology solicited proposals for the above-described purchases, they received six (6) proposals from four (4) offerors; and\n \nWHEREAS, following evaluation, it was determined that CDW Government, LLC submitted the lowest and best proposal; and \n \nWHEREAS, an emergency exists in the usual daily operations of the Department of Technology in that it is immediately necessary to authorize the Director of the Department of Technology to enter into contract with CDW Government LLC for the purchase of a new Dell Technologies PowerScale file based storage solution to ensure that the City continues to keep its critical file based storage infrastructure modern and supported, thereby protecting the public health, peace, property, safety, and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS: \n \nSECTION 1:  That the Director of the Department of Technology be and is hereby authorized and directed to enter into contract with CDW Government, LLC for the purchase of Dell Technologies PowerScale file based storage solution at a cost of $961,322.90, for a one year term, starting from the date of a confirmed purchase order by the City Auditor’s Office, with an option to renew for one additional year, subject to mutual agreement and approval of proper city authorities. \n \nSECTION 2:  That the 2020 Capital Improvement Budget is hereby amended as follows to account for appropriations and transfer of funds between projects:\n \nDepartment of Technology, Information Services Dept./Div. 47-02: Fund#:5105|\nInformation Services Bonds Fund/ (Carryover):\nProject Name/Number/Subfund                                                                Current CIB           Revised              Change\n                                                                                                                                                                                                                                  Amount                              Amount              Amount\n47-02 Data Center Facility Upgrades/\n470031 - 100000/5105 carryover                                          $1,417,450                     $1,315,113                     $102,337\n \n47-02 Telephony and IVR Infrastructure/\n470071 - 100000/5105 carryover                                          $930,000                     $545,000                     $385,000\n \n47-02 Enterprise System Upgrades\n470047 - 100000/5105 carryover                                          $473,986                     $961,323                     $487,337\n \nSECTION 3: That the City Auditor is hereby authorized and directed to transfer funds and appropriations within the Information Services Bonds Fund as follows:\nTransfer From:\nDept./Div. 47-02| Fund: 5105| Subfund:  N/A | Project Number: P470031-100000 (Carryover)| Project Name: Data Center Facility Upgrades | Program Code: CW001|Object Class: 06| Main Account: 66000| Amount: $102,336.90\n \nDept./Div. 47-02| Fund: 5105| Subfund:  N/A | Project Number: P470071-100000 (Carryover)| Project Name: Telephony and IVR Infrastructure| Program Code: CW001|Object Class: 06| Main Account|  66000| Amount: $385,000.00 \n \nTransfer To:\nDept./Div. 47 02| Fund: 5105| Subfund:  N/A | Project Number: P470047-100000 (Carryover)| Project Name: Enterprise System Upgrades | Program Code: CW001|Object Class: 06| Main Account|  66530| Amount: $487,336.90\n \nSECTION 4: That the expenditure of $961,322.90 or so much thereof as may be necessary is hereby authorized to be expended as shown in the attachment to this ordinance. (See attachment 0774-2021EXP)\n \nSECTION 5: That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6:  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 7:  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project. \n \nSECTION 8:  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the mayor, or ten days after passage if the mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 11,
    "meeting_date": "2021-04-19",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}