{
  "success": true,
  "vote": {
    "id": 6779,
    "item_number": "SR-5",
    "title": "To adopt the Vision Zero Columbus Action Plan 2.0, as described herein, as the continued framework for reducing traffic deaths and serious injuries to zero; to authorize the Director of Public Service, on behalf of the City of Columbus, to prepare and submit applications for grant opportunities; and to declare an emergency ($0.00)",
    "description": "Explanation\n \n1.  BACKGROUND                     \nThe Department of Public Service is continuing to actively pursue the City initiative to reduce traffic deaths and serious injuries to zero, while increasing safe, healthy, equitable mobility for all through the Vision Zero Columbus Action Plan 2.0.  This ordinance demonstrates the commitment by the City of Columbus and City Council to the overall well-being of the City’s residents. \n \nFatal and serious injury crashes have been on the rise annually.  Every person has the right to get to their destination safely.  The Columbus Vision Zero Action Plan 2.0 is a five-year plan (2023-2028) committed to achieving our goal of zero deaths and serious injuries on Columbus streets by 2035\n \nIn this phase of our Action Plan, pursuit of this goal will be just as strong. More safety-prioritizing strategies are outlined to guide these efforts during the next five years. The Department of Public Service plans to pursue and submit applications for grant opportunities to implement the action plan.  No specific grant opportunities have been identified at this time.\n \nIn this Action Plan 2023-2028, Vision Zero partners have identified many strategies to slow speeds, focus on safe street design, and foster community engagement and a culture change that prioritizes protecting lives above all else, for all forms of travel along our city streets for walking, biking, rolling, driving and using transit. Eliminating the worst crashes is a responsibility shared by our transportation system users, designers and decision makers. \n \n2. FISCAL IMPACT\nNo financial participation is required at this time.  City funds will be approved in the form of design contracts, right of way acquisitions, and/or construction contracts that will be submitted for Council’s approval at a later date\n \n3. EMERGENCY\nEmergency action is requested in order to adopt the Vision Zero Action Plan 2.0 at the earliest possible time in order to continue current initiatives to achieve our committed goal of zero deaths and serious injuries on Columbus streets.\n \nTitle\n \nTo adopt the Vision Zero Columbus Action Plan 2.0, as described herein, as the continued framework for reducing traffic deaths and serious injuries to zero; to authorize the Director of Public Service, on behalf of the City of Columbus, to prepare and submit applications for grant opportunities; and to declare an emergency ($0.00)\n \nBody\n \nWHEREAS, sixty-five percent of fatal and severe injury crashes in the City occur on ten percent of City streets; and\n \nWHEREAS, between 2018 and 2022, fatal injury crashes have increased annually with a total of 310 people killed in crashes on City streets; and\n \nWHEREAS, fatalities and serious injuries on our streets are unacceptable and crashes are preventable; and\n \nWHEREAS, Vision Zero Columbus makes protecting lives the #1 priority of our transportation system; and\n \nWHEREAS, Vision Zero provides a framework for reducing traffic deaths and serious injuries to zero, while increasing safe, healthy, equitable mobility for all; and\n \nWHEREAS, in March 2020 the Mayor announced the intent to pursue Vision Zero for the City of Columbus and to develop an action plan; and\n \nWHEREAS, 2035 has been the year selected to reach the goal of eliminating all fatal and serious injury crashes; and \n \nWHEREAS, this ordinance to adopt the Vision Zero Columbus Action Plan 2.0 is a continued step necessary to meet the goal to eliminate fatal and serious injury crashes; and \n \nWHEREAS, the Mayor’s Office directed a multi-departmental effort spearheaded by the Department of Public Service, along with community representatives and stakeholders to lead this initiative; and\n \nWHEREAS, the Director of Public Service has the authority to apply for grants aligned with the delivery or completion of the Vision Zero Columbus Action Plan 2.0 between April 1, 2023 and March 31, 2028; and\n \nWHEREAS, the Director of Public Service has the authority to make modifications to the Vision Zero Columbus Action Plan 2.0 as necessary; and \n \nWHEREAS,   an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary for the City to adopt the Vision Zero Action Plan 2.0 in order to continue current initiatives and meet grant application deadlines, to ensure the safety of the traveling public thereby preserving the public health, peace, property, safety and welfare; NOW, THEREFORE\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That by the year 2035, the goal is to eliminate all fatal and serious injury crashes on City streets.\n \nSECTION 2.  That Vision Zero Columbus and the goal to eliminate serious crashes has been adopted by the City with the commitments of the Mayor’s Office, the Department of Public Service, Columbus Public Health, the Department of Public Safety, and the Department of Neighborhoods as a necessary step in meeting the 2035 goal;\n \nSECTION 3.  That the Vision Zero Columbus Action Plan 2.0 has been developed for the purpose of continuing to put a plan in motion to meet the 2035 goal, with a focus on being data driven, equitable, and including community input.\n \nSECTION 4.  That key City departments, including Public Service, Public Health, Public Safety, and the Mayor’s Office, are actively engaged as leaders and partners in the process of developing the Vision Zero Columbus Action Plan 2.0, implementing it, and evaluating and sharing progress. \nSECTION 5.  That the Director of Public Service has the authority to apply for grants aligned with the delivery or completion of the Vision Zero Columbus Action Plan 2.0 between April 1, 2023 and March 31, 2028.\nSECTION 6.  That the Director of Public Service has the authority to make modifications to the Vision Zero Columbus Action Plan 2.0 as necessary.\nSECTION 7.  That the Vision Zero Core Team, consisting of City staff , will continue to meet regularly to implement the Action Plan, with semiannual updates and evaluation by the Working Groups and the Executive Advisory Committee.\nSECTION 8.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 80,
    "meeting_date": "2023-06-05",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services",
      "Grants",
      "Public Works"
    ]
  }
}