{
  "success": true,
  "vote": {
    "id": 6802,
    "item_number": "CA-1",
    "title": "To Celebrate Dom Tiberi and His Work with Maria’s Message",
    "description": "Title\nTo Celebrate Dom Tiberi and His Work with Maria’s Message\n \nBody\nWHEREAS, local news station, WBNS-TV, has sponsored the project Maria’s Message since its founding in 2014 by Dom Tiberi, and has since received the 2023 Celebration of Service Award in the TV Large Market category from the National Association of Broadcasters Leadership Foundation; and\n \nWHEREAS, since 1981 he has been an integral part of the community having won four Ohio Emmys during his time at the news station and creating Maria’s Message; and\n \nWHEREAS, one of the leading causes of death for teenage Americans is motor vehicle crashes and Maria’s Message has successfully spread the message of the dangers of distracted driving and the impact that it can have on the lives of young children and teens; and\n \nWHEREAS, he has traveled across Ohio to give presentations on the impact that distracted driving incidents have on the community as well as providing resources to communities to help prevent accidents like this from happening; and\n \nWHEREAS, he has given 150 presentations in relation to this effort and works with 10TV to provide free defensive driving classes for teenagers in the Central Ohio area; and\n \nWHEREAS, Dom Tiberi has placed a special emphasis on providing services to prevent distracted driving accidents from occurring to other families in the same way that he was impacted by increasing public awareness of the level of severity of the issue; now, therefore\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: That this Council hereby recognizes Dom Tiberi for his work with Maria’s Message to improve the safety of everyone in our community.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 81,
    "meeting_date": "2023-06-12",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}