{
  "success": true,
  "vote": {
    "id": 6872,
    "item_number": "SR-10",
    "title": "To provide funding for Columbus Public Health to purchase gun lock boxes; to authorize and transfer appropriations within the Neighborhood Initiatives subfund; to authorize a transfer between funds; to authorize an appropriation and expenditure within the Health Operating Fund; and to declare an emergency. ($45,000.00)",
    "description": "Explanation\n \nThis legislation authorizes an appropriation to Columbus Public Health in support of their purchase of gun lock boxes.\n \nColumbus Public Health provides free gun safes and lock boxes to residents. Firearms are the leading cause of death for American children and teens. In 2022, Columbus Public Health gave away more than 1,000 safe storage lock boxes.\n \nEmergency action is necessary to provide Columbus Public Health with resources to purchase gun lock boxes as soon as possible to address the current and ongoing issues with gun violence.\n \nFiscal Impact: Total appropriation of $45,000 is available within the Neighborhood Initiatives subfund.\n \nTitle\n \nTo provide funding for Columbus Public Health to purchase gun lock boxes; to authorize and transfer appropriations within the Neighborhood Initiatives subfund; to authorize a transfer between funds; to authorize an appropriation and expenditure within the Health Operating Fund; and to declare an emergency. ($45,000.00)\n \nBody\n \nWHEREAS, Firearms are the leading cause of death for American children and teens and in 2022, there were at least 21 unintentional shootings by children in Ohio, resulting in nine deaths and 13 injuries; and\n \nWHEREAS, Columbus Public Health provides free gun safes and lock boxes to residents; and\n \nWHEREAS, in 2023, Columbus Public Health has already provided over 200 lock boxes to Columbus residents; and\n \nWHEREAS, an emergency exists in the usual daily operation of Columbus Public Health in that it is immediately necessary to provide these funds to purchase gun lock boxes to address the current and ongoing issues with gun violence, for the immediate preservation of the public health, peace, property, safety, and welfare; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS: \n \nSECTION 1:  That the City Auditor is hereby authorized and directed to appropriate $45,000.00 within the Neighborhood Initiatives subfund, fund 1000, subfund 100018, per the accounting code in the attachment to this ordinance.\n \nSECTION 2:  That the Auditor is hereby authorized and directed to transfer $45,000.00 from the Neighborhood Initiatives subfund, fund 1000, subfund 100018, to the Health Operating fund, fund 2250, per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That the Auditor is hereby authorized and directed to appropriate $45,000.00 within the Health Operating fund, fund 2250, per the accounting codes in the attachment to this ordinance.\n \nSECTION 4. That the expenditure of up to $45,000 is hereby authorized from the Health Operating Fund per the accounting codes in the attachment to this ordinance.\n \nSECTION 5:  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6:  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this legislation.\n \nSECTION 7:  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 81,
    "meeting_date": "2023-06-12",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services",
      "Health & Safety"
    ]
  }
}