{
  "success": true,
  "vote": {
    "id": 6906,
    "item_number": "CA-24",
    "title": "To authorize the Director of the Department of Public Service to execute agreements with and to accept grant funding from the Ohio Department of Transportation for the Urban Paving FRA-710-0.00 (Busch Blvd & Schrock Rd) PID111560 project; and to declare an emergency.  ($0.00)",
    "description": "Explanation1.  BACKGROUND\nThis ordinance authorizes the Director of Public Service to execute agreements with and to accept grant funds from the Ohio Department of Transportation (ODOT), through the Federal Highway Administration (FHWA).\n \n530282-100154 Urban Paving FRA-710-0.00 (Busch Blvd & Schrock Rd) PID111560: The City of Columbus, Department of Public Service is engaged in the Urban Paving FRA-710-0.00 (Busch Blvd & Schrock Rd) PID111560 project which will consist of mill/resurface, partial/full-depth pavement repairs, ADA ramp upgrades, curb repair, and pavement marking and loop detector replacement along Busch Blvd from SR161 to Schrock Rd, and Schrock Rd from Busch Blvd to pavement change west of the bridge over IR-71.  The total project cost is approximately $3,156,126.00.\n \nThis ordinance will authorize the Director of Public Service to accept and expend grant funds from the Ohio Department of Transportation, to execute those documents necessary to accept the grant, to administer the grant funds in accordance with the terms and conditions of that award, and to refund any unused funds after the grant period ends if final accounting determines a refund is owed. Separate legislation authorizing the encumbrance and expenditure will be submitted to Council for the awarded grant funds and to encumber and expend necessary matching City funds.  \n \n2.  FISCAL IMPACTNo financial participation is required at this time.  Separate legislation authorizing the encumbrance and expenditure of capital funds to support the local share of anticipated project costs will be put forth at a later date as needed.\n \n3.  EMERGENCY DESIGNATIONEmergency action is requested to allow for the execution of necessary grant documents and the acceptance and receipt of grant funding from the Ohio Department of Transportation in accordance with the conditions of award as soon as possible.  \n \nTitle\nTo authorize the Director of the Department of Public Service to execute agreements with and to accept grant funding from the Ohio Department of Transportation for the Urban Paving FRA-710-0.00 (Busch Blvd & Schrock Rd) PID111560 project; and to declare an emergency.  ($0.00)  \n \nBody\nWHEREAS, the Ohio Department of Transportation has awarded grant funding to assist in covering costs associated with the Urban Paving FRA-710-0.00 (Busch Blvd & Schrock Rd) PID111560 project, administered by the City of Columbus, Department of Public Service; and\n \nWHEREAS, this ordinance authorizes the Director of Public Service to execute documents, and any amendments and modifications thereto as may be necessary, with and to accept and expend awarded grant funding from the Ohio Department of Transportation, for the stated purpose; and \n \nWHEREAS, an emergency exists within the Department of Public Service in that it is immediately necessary to authorize the Director to execute the necessary grant documents and the acceptance and receipt of grant funding from the Ohio Department of Transportation in accordance with the conditions of that award as soon as possible, all for the immediate preservation the public health, peace, property, safety and welfare; and NOW THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Service be and is hereby authorized to execute documents, and any amendments and modifications thereto as may be necessary, with the Ohio Department of Transportation to effectuate the acceptance and expenditure of awarded grant funding from the Ohio Department of Transportation for the purpose of supporting the Urban Paving FRA-710-0.00 (Busch Blvd & Schrock Rd) PID111560 project. \n \nSECTION 2.  The Department of Public Service is authorized to issue refunds of awarded or reimbursed grant funds, if necessary, after final accounting is performed or when notified by the Department of Public Service's Division of Design and Construction that a refund can be issued. \n \nSECTION 3.  That at the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements.\n \nSECTION 4.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 82,
    "meeting_date": "2023-06-26",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}