{
  "success": true,
  "vote": {
    "id": 6929,
    "item_number": "CA-47",
    "title": "To authorize and direct the Board of Health to accept a Get Vaccinated Ohio (GVO) grant from the Ohio Department of Health in the amount of $384,508.00; to authorize the appropriation of $384,508.00 to the Health Department in the Health Department Grants Fund; to authorize the Board of Health to enter into a subrecipient agreement with the Franklin County Public Health Department for the provision of immunization services to clients required to meet the deliverables of the grant for the period of July 1, 2023 to June 30, 2024; to authorize the expenditure of $88,989.63 from the Health Department Grants Fund; and to declare an emergency ($384,508.00)",
    "description": "Explanation\n \nColumbus Public Health has been awarded grant funding from the Ohio Department of Health originating from the Centers for Disease Control for the Get Vaccinated Ohio (GVO) Program. This ordinance is needed to accept the funding of $384,508.00 in grant monies for the Get Vaccinated Ohio (GVO) grant program for the period of July 1, 2023 through June 30, 2024. This ordinance also authorizes a subrecipient agreement with Franklin County Public Health for $88,989.63, for the provision of immunization services to clients required to meet the deliverables of the grant for the period of July 1, 2023 through June 30, 2024. \n \nThe GVO program will enable Columbus Public Health to ensure that critical elements of vaccine provided and the vaccine delivery system are adequate; to establish and maintain a high level of awareness and demand for immunizations by parents, particularly racial/ethnic minority parents and other under-served population groups; and to accurately measure the ability of local vaccine providers to raise immunizations levels in children under the age of two toward the goal of 90% coverage.\n \nThe purpose of the subrecipient agreement is to partner with Franklin County Public Health to carry out the deliverables detailed in the Get Vaccinated Ohio (GVO) Program from the Ohio Department of Health. This agreement with Franklin County Public Health is for the period of July 1, 2023 through June 30, 2024. The subrecipient will assist CPH in fulfilling the deliverables of the grant to achieve and maintain 90% vaccination coverage levels for universally recommended childhood vaccines. Contracting with FCPH allows CPH the ability to carry out immunizations service delivery throughout Franklin County in areas other than the City of Columbus jurisdiction. Services to be provided include targeted immunization services to address immunization coverage disparities; conduct immunization provider education and assessments for practices throughout Franklin County in order to promote immunization best practices; conduct School Immunization Assurance; recruit, enroll, and educate providers on the State Immunization Registry (ImpactSIIS); and carry out Perinatal Hepatitis B Case Identification and Follow-up. Franklin County Public Health is public health district organized pursuant to ORC Section 3709. This organization will service the populations that are outside of the City's jurisdiction to carry out the deliverables for the entirety of Franklin County. \n \nThis ordinance is submitted as an emergency to not delay vaccination services to clients and families, and to meet grant deliverables required by the grantor. \n \nFISCAL IMPACT:  The Get Vaccinated Ohio (GVO) grant program is entirely funded by the Ohio Department of Health and does not generate revenue or require a City match.\n \nTitle\n \nTo authorize and direct the Board of Health to accept a Get Vaccinated Ohio (GVO) grant from the Ohio Department of Health in the amount of $384,508.00; to authorize the appropriation of $384,508.00 to the Health Department in the Health Department Grants Fund; to authorize the Board of Health to enter into a subrecipient agreement with the Franklin County Public Health Department for the provision of immunization services to clients required to meet the deliverables of the grant for the period of July 1, 2023 to June 30, 2024; to authorize the expenditure of $88,989.63 from the Health Department Grants Fund; and to declare an emergency ($384,508.00)\n \nBody\n \nWHEREAS, $384,508.00 in grant funds have been made available through the Ohio Department of Health for the Get Vaccinated Ohio Grant Program for the period of July 1, 2023 through June 30, 2024; and,\n \nWHEREAS, it is necessary to accept and appropriate these funds from the Ohio Department of Health for the support of the Get Vaccinated Ohio Grant Program; and,\n \nWHEREAS, it is necessary to authorize the expenditure of $88,989.63 from the Health Department Grants Fund; \n \nWHEREAS, it is necessary that the Board of Health enters into a subrecipient agreement, pursuant to City Code Section 329.30, with Franklin County Public Health for the provision of immunization services to clients required to meet the deliverables of the grant for the period of July 1, 2023 to June 30, 2024; and,\n \nWHEREAS, it is necessary to allow the City Auditor to transfer appropriations between object classes for the Get Vaccinated Ohio (GVO) program as needed upon request by the Columbus Public Health department; \n \nWHEREAS, an emergency exists in the usual daily operation of Columbus Public Health in that it is immediately necessary to accept these grant funds from the Ohio Department Health and to appropriate these funds to Columbus Public Health to avoid delay in client services, all for the immediate preservation of the public health, peace, property, safety and welfare; NOW, THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     That the Board of Health is hereby authorized and directed to accept a grant award of $384,508.00 from the Ohio Department of Health for the Get Vaccinated Ohio (GVO) grant program for the period July 1, 2023 through June 30, 2024.\n \nSECTION 2.  That from the unappropriated monies in the Health Department's Grants Fund, Fund No. 2251, and from all monies estimated to come into said Fund from any and all sources during the grant period, the sum of $384,508.00 and any eligible interest earned during the grant period is hereby appropriated upon receipt of an executed grant agreement to the Health Department, Division No. 5001, according to the attached accounting document.\n \nSECTION 3.  To authorize the Board of Health to enter into a subrecipient agreement for the provision of immunization services to clients required to meet the deliverables of the grant for the period of July 1, 2023 to June 30, 2024. \n \nSECTION 4. That the expenditure of $88,989.63 or so much thereof as may be needed, is hereby authorized in the Health Department, Division No. 5001, per the accounting codes in the attachment to this ordinance.\n \nSECTION 5.  That the City Auditor is hereby authorized to transfer appropriations between object classes for the Get Vaccinated Ohio (GVO) grant program as needed upon request by the Columbus Public Health department.\n \nSECTION 6.  That the monies appropriated in the foregoing Section 2 shall be paid upon the order of the Health Commissioner and that no order shall be drawn or money paid except upon voucher, the form of which shall be approved by the City Auditor.\n \nSECTION 7.  That funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 8.  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 82,
    "meeting_date": "2023-06-26",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}