{
  "success": true,
  "vote": {
    "id": 6936,
    "item_number": "CA-54",
    "title": "To establish a new authorized strength ordinance for various divisions in the City of Columbus; to repeal ordinance 0692-2023; and to declare an emergency. (REPEALED BY ORD. 1619-2023 PASSED 10/16/2023) BA",
    "description": "Explanation\n \nBACKGROUND: This ordinance amends the current authorized strength, as set forth in ordinance 0692-2023.\n \nThe strength levels for most general fund agencies are set to be equal to the 2023 budget as amended by City Council (including the Departments of Health and Recreation and Parks).  Authorized strength levels of smaller non-general fund agencies are set to be equal to the adopted 2023 budget as amended, while the strength levels of certain larger non-general fund agencies may have their strength set slightly higher to allow for flexibility in hiring.  \n \nWithin the City Auditor’s Office a reduction of four full-time positions in the Division of Income Tax will allow for an increase of three full-time positions and two part-time positions in the City Auditor Division. One position is requested for the Municipal Court Judges in response to the newly enacted state record sealing law.  The Municipal Court Clerk requests to move eight full-time positions from the computer fund to the general fund and change one part-time position to full time, resulting in no overall change in Authorized Strength.  The Department of Civil Service requests an increase of two part-time positions to assist in hiring for the Division of Police.  Within the Department of Public Safety, the Division of Police requests two additional full-time civilian positions for the DNA Grant and the Division of Fire requests an increase of one civilian part-time position.  Two full-time positions are requested in the Office of CelebrateOne.  The Office of Violence Prevention request four positions for various operational needs.  One additional full-time position is requested in the Department of the Inspector General to address increasing workload.  The Department of Building and Zoning Services requests an increase of one part-time Office Assistant in Code Enforcement.  In the Department of Development five full-time positions in Administration and one full-time positions in the Division of Housing are requested to account for increased workload.  Within the Department of Finance and Management, the Division of Financial Management will add two part-time positions.  The Department of Recreation and Parks requests to move strength by increasing by one full-time position and decreasing by two part-time positions.  The Department of Public Service requests to increase by three part-time positions in the Division of Infrastructure and two part-time positions in the Division of Traffic.  Within the Department of Public Utilities, Administrative Division 12 additional full-time positions are requested for various programs. The Division of Water will increase by 11 full-time positions in order to address the Smart Meter and lead and copper certification programs.\n \nFiscal Impact: Funds for these strength levels are budgeted and/or the positions will not be filled until revenues have been clearly identified and appropriated.  In all cases, the ability to hire will be monitored by the Division of Finance and Management.  As such, there is no fiscal impact associated with passage of this ordinance.\n \nEmergency Justification: Emergency action is requested to allow for the filling of budgeted vacant positions in certain departments in order to assure the immediate preservation of the public health, safety, and welfare.\n \nTitle\n \nTo establish a new authorized strength ordinance for various divisions in the City of Columbus; to repeal ordinance 0692-2023; and to declare an emergency. (REPEALED BY ORD. 1619-2023 PASSED 10/16/2023) BA \n \nBody\n \nWHEREAS, the Mayor's Executive 2023 budget was submitted to City Council on November 10, 2022 for consideration; and\n \nWHEREAS, City Council adopted said budget on February 13, 2023; and,\n \nWHEREAS, this ordinance repeals authorized strength ordinance 0692-2023; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Finance and Management in that it is immediately necessary to establish a new authorized strength ordinance to provide for the efficient operation of the city, and for the immediate preservation of the public health, peace, property, safety, and welfare; NOW, THEREFORE:\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That pursuant to Section 14 of the City Charter, the maximum number of officers and employees authorized to be employed within the various Departments, Boards and Offices of the City is hereby fixed and established as follows: \n \n-1- Refer to attachment ORD1619-2023currentstrength.xlsx\n-2- Refer to attachment ORD1619-2023previousstrength.xlsx\n \nThe foregoing positions authorized include all positions within each department, division, board, office or commission, whether appointed or elected except the members of any board or commission authorized by charter or ordinance. No Appointing Authority shall appoint full-time or part-time personnel in excess of the maximum permitted by this ordinance unless authorized by ordinance of City Council.\n \nSECTION 2.  Such of the positions within the Division of Fire as the Director of Public Safety and Fire Chief shall designate, shall be within the uniformed ranks and all other positions therein shall be deemed civilian positions, provided there shall not be in excess of five (5) Fire Assistant Chiefs and there shall not be in excess of four (4) Fire Deputy Chiefs; as a normal complement, in excess of thirty-six (36) Fire Battalion Chiefs nor as a temporary complement, in excess of thirty-seven (37) Fire Battalion Chiefs at any one time; sixty-three (63) Fire Captains nor as a temporary complement, in excess of sixty-four (64) Fire Captains at any one time; one (1) Fire Chief; and two-hundred nine (209) Fire Lieutenants.  The complements of fire captains and fire lieutenants are intended to be temporary, subject to review and change at any time. \n \nSuch of the positions within the Division of Police as the Director of Public Safety and the Police Chief shall designate, shall be within the uniformed ranks and all other positions therein shall be deemed civilian positions, provided there shall not be, as a normal complement, in excess of eighteen (18) Police Commanders, nor as a temporary complement, in excess of nineteen (19) Police Commanders at any one time; one (1) Police Chief; four (4) Police Assistant Chiefs; in excess of, as a normal complement, six (6) Police Deputy Chiefs, nor as a temporary complement, in excess of seven (7) Police Deputy Chiefs at any one time;  in excess of, as a normal complement, sixty-three (63) Police Lieutenants, nor as a temporary complement, in excess of sixty-five (65) Police Lieutenants at any one time; in excess of, as a normal complement, two hundred thirty-eight (238) Police Sergeants, nor as a temporary complement, in excess of two hundred forty-two (242) Police Sergeants at any one time.\n \nSECTION 3.  Temporary appointments are not subject to the authorized strength ordinance.  Additionally, limited appointments made to cover full-time and part-time employees on authorized leave (injury, disability or military leave) are not subject to the authorized strength ordinance. Student intern positions are not subject to the authorized strength ordinance.\n \nSECTION 4.  That Ordinance No. 0692-2023 and all other ordinances relative to the authorization of employees for any department, division, board or commission and all other ordinances in conflict herewith be and the same are hereby repealed.\n \nSECTION 5.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 82,
    "meeting_date": "2023-06-26",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services"
    ]
  }
}