{
  "success": true,
  "vote": {
    "id": 6941,
    "item_number": "SR-1",
    "title": "To authorize the Director of the Department of Development to accept and execute a private grant from The Andrew W. Mellon Foundation in an amount up to $2,000,000.00 under their “Monuments Project” program for the City’s Reimagining Columbus project; to authorize the appropriation of up to $2,000,000.00 of The Mellon Foundation grant from the Private Grant Fund, upon receipt of the grant funds as follows:  $250,000.00 for personnel and $750,000.00 for professional services in 2023 and $1,000,000.00 in 2024; and to declare an emergency. ($250,000.00)",
    "description": "Explanation\n \nBACKGROUND: This ordinance authorizes the Director of the Department of Development to accept and execute a private grant from The Andrew W. Mellon Foundation in an amount up to $2,000,000.00 under their “Monuments Project” program for the City’s Reimagining Columbus project and authorizes the appropriation of up to $2,000,000.00 for personnel costs and a professional services contract upon the receipt of the grant funds.\n \nLaunched in 2020, the Monuments Project is a five-year, $250 million commitment by the Mellon Foundation to transform the nation’s commemorative landscape by supporting public projects that more completely and accurately represent the multiplicity and complexity of American stories. The Monuments Project builds on the Mellon Foundation’s efforts to express, elevate, and preserve the stories of those who have often been denied historical recognition and explores a more complete telling of who we are as a nation.   \n \nThrough the Department of Development, the City applied for a grant to engage the community and generate discussion about the city’s namesake, Christopher Columbus, and to assess the future disposition of the Christopher Columbus statue that was created by Edoardo Alfieri and gifted to the City of Columbus by its Sister City of Genoa, Italy in 1955.  Funding through the Monuments Project would enable the City of Columbus to 1) methodically and inclusively host conversations to understand what Columbus residents value most, and how the city’s future symbology and public art landscape can communicate shared values and aspirations, 2) provide the public with opportunities to collaboratively ideate on the future disposition of the Christopher Columbus statue, and with requisite community buy-in, design a new space that allows the public to understand and physically interact with difficult history, and 3) create a replicable model for dealing with difficult topics within the community and pilot new community engagement methodologies, including restorative practices.\n \nThe proposed initiative will collect feedback from community conversations, research into colonial and contemporary history, and best practices in placemaking to cast a vision for how a new statue site should look and feel, how visitors could interact with it, and how the site can support the sharing of personal histories and lived experiences. The City of Columbus does not intend for the statue to return to the City Hall campus; rather, as a grant deliverable, the City will develop a plan to create new public art for the campus, to be funded by future capital funds.\n \nThrough this work, the City sees an opportunity to create a preeminent gathering place for confronting the legacy of Christopher Columbus; a place where we address hard truths about the man and the inordinately sanguine ways we as a society have told his-our-stories.\n \nPublic engagement is key to this project; the process will be designed to support open and inclusive dialogue, healing and truth-telling. The engagement process will be led by a diverse team of experts in public engagement, cultural competency, public art, placemaking, and design and augmented with the perspectives of Advisory Committees composed of local residents and community leaders. The project will use conventional and restorative practices to glean insight and support the sharing of different perspectives and lived experiences.\n \nThe Reimagining Columbus project will document this process through video and photo documentation and white papers, and will host this content online so other communities can understand how this approach may help confront their own difficult histories. All content developed during this process will be shared with the Mellon Foundation and parties interested in replicating Columbus’ successes.  \n \nGrant funding will be used hire a staff person to manage and facilitate the grant and project as well as contract with a consultant who will have the responsibility for project management, community engagement, landscape architecture and oversight of subconsultants.  Separate legislation will be submitted to City Council as required by Columbus City Code.  The term of the grant is from June 1, 2023, to May 31, 2025, with an approximate 3 month closeout period.\n \nThis legislation is submitted as an emergency in order to have the funds available to begin the hiring process and to execute the professional services contract as soon as possible to complete the work during the term of the grant.\n \nFISCAL IMPACT: This legislation requests approval for the Auditor’s Office to appropriate up to $2,000,000.00 from the Private Grant Fund (Fund 2291), grant number to be determined, for this grant.  Funding from this grant will be distributed to the City in two tranches:  one half after execution of the grant agreement (summer 2023) and the remainder in the summer of 2024.  Appropriations are to be made upon receipt of grant funds.  Of the first tranche, $250,000.00 shall be appropriated for personnel costs for the duration of the grant.  The remaining amount, $750,000.00, shall be used for a professional services contract.  Tranche two, $1,000,000.00, shall be used for a modification of the professional services contract.  Additional legislation shall be submitted to authorize the execution and expenditure of funds for the modification.\n \nTitle\n \nTo authorize the Director of the Department of Development to accept and execute a private grant from The Andrew W. Mellon Foundation in an amount up to $2,000,000.00 under their “Monuments Project” program for the City’s Reimagining Columbus project; to authorize the appropriation of up to $2,000,000.00 of The Mellon Foundation grant from the Private Grant Fund, upon receipt of the grant funds as follows:  $250,000.00 for personnel and $750,000.00 for professional services in 2023 and $1,000,000.00 in 2024; and to declare an emergency. ($250,000.00)\n \nBody\n \nWHEREAS, the Department of Development seeks to accept and execute a private grant from The Mellon Foundation in an amount up to $2,000,000.00 under their “Monuments Project” program for the City’s Reimagining Columbus project; and\n \nWHEREAS, grant funding will be used hire a staff person to manage and facilitate the grant and project as well as contract with a consultant who will have the responsibility for project management, community engagement, landscape architecture, and oversight of subconsultants; and\n \nWHEREAS, it is necessary to appropriate the funds received for grant eligible expenditures, personnel and professional services costs, separate legislation will be submitted for a professional contract funded from the grant; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in order to have the funds available to begin the hiring process and to execute the professional services contract as soon as possible to complete the work during the term of the grant, all for the immediate preservation of the public health, property, safety and welfare; NOW, THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. The Director of Department of Development is authorized to accept and execute a private grant from The Andrew W. Mellon Foundation in an amount up to $2,000,000.00 under their “Monuments Project” program for the City’s Reimagining Columbus project.  \n \nSECTION 2. That from the unappropriated monies in Fund 2291 (Private Grant Fund) and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the grant period, up to $2,000,000.00 shall be appropriated upon receipt of an executed grant agreement and receipt of funds in Fund 2291 (Private Grant Fund), Dept-Div 4401 (Admin), Grant number to be determined, per the accounting codes attached to this ordinance.\n \nSECTION 3.  That the monies appropriated in the foregoing Section 2 shall be paid upon the order of the Director of the Department of Development and that no order shall be drawn or money paid except upon voucher, the form of which shall be approved by the City Auditor.\n \nSECTION 4.   At the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements.\n \nSECTION 5.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 7. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 82,
    "meeting_date": "2023-06-26",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}