{
  "success": true,
  "vote": {
    "id": 6955,
    "item_number": "SR-15",
    "title": "To authorize an amendment to the 2022 Capital Improvement Budget; to authorize a transfer of cash and appropriation within the Sanitary Bond Fund; to authorize the Director of Public Utilities to modify and increase the Southwesterly Composting Facility Odor Control Improvements professional services agreement with Hatch Associates Consultants; to authorize an expenditure of up to $1,115,400.00 within the Sanitary Bond Fund to pay for the contract modification; and to declare an emergency.  ($1,115,400.00)",
    "description": "Explanation\n1.                     BACKGROUND\nThis ordinance authorizes the Director of Public Utilities to modify and increase the professional services agreement with Hatch Associates Consultants, Inc. for the Southwesterly Composting Facility Odor Control Improvements project, CIP 650375-100002, in a dollar amount up to $1,115,400.00. \n \nThe Department of Public Utilities, Division of Sewerage and Drainage (DOSD) operates and manages two large municipal wastewater treatment plants (WWTPs). The Compost Facility processes biosolids from both WWTPs by composting under negative aeration and biofiltration. There have been 3 phases of this Contract. The original Contract performed preliminary engineering and equipment upgrades at the Compost Facility. The next phase completed the detailed design providing facility upgrades and expansion. The project was placed on hold at 95% design due to budgetary concerns, and then there was an unplanned modification for redesign, reducing the Construction scope. The redesign is complete, and the designer created the bid package. \n \nThis planned modification is for engineering services during construction.  Construction, Construction Management Services and commissioning of the improvements will be performed by others.\n \nPlanning Area: 99 - City wide\n \n1.1                     Amount of additional funds to be expended: $1,115,400.00\nOriginal Contract                                    $    864,820.00 (ORD. 3053-2016, PO046866)\nRenewal #1                                                                     $ 2,250,500.00 (ORD. 1932-2018, PO135218)\nModification #1                                      $   680,000.00 (ORD. 2683-2020, PO268737)\nModification #2 (current)                       $ 1,115,400.00\nTotal (Original and Modifications)         $ 4,910,720.00\n \n1.2. Reasons additional goods/services could not be foreseen:  \nA decision was made to postpone the Odor Reduction Improvements, however there are several facility components that require immediate replacement to ensure the ongoing regulatory compliance of the Compost Facility. This project will replace and repair critical infrastructure that had been planned to be addressed but cannot wait for the future Odor Reduction Improvements project. Due to the highly complex and technical nature of this wastewater treatment plant infrastructure, it is not reasonable or cost effective to undertake a new procurement to acquire these services. The lengthy process for initiating a new procurement and for a new entity to gain understanding of the project would cause an unacceptable project delay and additional cost.\n \n1.3. Reason other procurement processes are not used:  \nThe funding provided by this contract renewal is for the continuation of the existing work of the Contract. Due to the highly complex and technical nature of this wastewater treatment plant infrastructure, it is not reasonable or cost effective to undertake a new procurement to acquire these services. The lengthy process for initiating a new procurement and for a new entity to gain understanding of the project would cause an unacceptable project delay and additional cost.\n \n1.4. How cost of renewal was determined:\nA cost proposal was provided by Hatch Associates Consultants, Inc. and was reviewed by the Division of Sewerage and Drainage and was deemed acceptable.\n \n2.                     PROJECT TIMELINE: \nThe construction phase for the project is anticipated to be completed in twenty-three (23) months from the date that the construction contract authorization to proceed is given. The Design Professional will begin Services during Construction once this contract renewal is executed, approved and Notice to Proceed is given. Engineering Services during Construction include; Technical Project Representation (TPR) to interpret contract requirements and to verify the construction contractor’s compliance with the project’s technical requirements, start-up and commissioning assistance, and record documentation preparation assistance. Construction Management, Administrative Services, Field Project Representation (FPR) and Materials Testing and Evaluation Services will be performed by others.\n \n3.                     ECONOMIC /ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT\nSouthwest Compost Facility Phase 1 Improvements will replace infrastructure that is at imminent risk of failure which could result in noncompliance with regulations or loss of function of the facility. Improvements will be made under this project to address the short term critical needs and accommodate design of a three pad composting arrangement under the future Phase 2 - Odor Reduction Improvements project.  \n \n4.                     CONTRACT COMPLIANCE INFORMATION\nHatch Associates Consultants, Inc. contract compliance number is CC-025646 and expires 3/8/24.  Hatch Associates Consultants, Inc. certification was in good standing at the time of the contract modification.\n \nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) are not required as there are no Federal or State funds being used for this contract.\n \n5.                     MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract was put in place prior to the implementation of the City of Columbus MBE/WBE Program and is not subject to the requirements of that program.  Hatch Associates Consultants, Inc.  is classified as a majority company by the City’s Office of Diversity and Inclusion.  Hatch Associates Consultants, Inc.  anticipates using two City certified MBE/WBE subconsultants to perform $152,902.46 (19.1%) of the work.   \n \nAs part of their proposal, Brown and Caldwell has proposed the following three subcontractors to perform contract work:\n \nCompany Name                                            City/State                                     ODI Certification Status  \nHDR                                                                                                         Columbus, Ohio                                                                                    MAJ\nDLZ                                                                                                         Columbus, Ohio                                                                                    MBE\n360 Water                                                                                    Columbus, Ohio                                                                                    WBE\n \nThe certification of the above companies was in good standing at the time of this contract modification.\n \n6.                     FISCAL IMPACT\nFunding for this expenditure is available within the Sanitary Bond Fund, Fund, Fund 6109.  An amendment to the 2022 Capital Improvement Budget is needed to align budget authority with the proper project.  A transfer of cash and appropriation is needed to align cash and appropriation with the proper project.\n \n \n7.                     EMERGENCY DESIGNATION\nEmergency designation is requested for this ordinance.  This ordinance is for engineering services during construction and the construction ordinance (1206-2023) has been deemed an emergency and this will need to align with the construction timeline.\n \n \n \nTitle\nTo authorize an amendment to the 2022 Capital Improvement Budget; to authorize a transfer of cash and appropriation within the Sanitary Bond Fund; to authorize the Director of Public Utilities to modify and increase the Southwesterly Composting Facility Odor Control Improvements professional services agreement with Hatch Associates Consultants; to authorize an expenditure of up to $1,115,400.00 within the Sanitary Bond Fund to pay for the contract modification; and to declare an emergency.  ($1,115,400.00)\n \nBody\nWHEREAS, the Department of Public Utilities is engaged in the Southwesterly Composting Facility Odor Control Improvements Project; and\n \nWHEREAS, Contract No. PO046866 for $864,820.00 was authorized by Ord. No. 3053-2016, passed January 9, 2017; and\n \nWHEREAS, Renewal #1 for the project was authorized by Ord. No. 1932-2018, passed July 30, 2018; and\n \nWHEREAS, Modification #1 for the project was authorized by Ord. No. 2683-2020, passed December 14, 2020; and \n \nWHEREAS, a modification to the agreement is necessary to procure Services during Construction (Step 3 Services) for this project, and\n \nWHEREAS, an amendment to the 2022 Capital Improvement Budget is needed to align budget authority with the proper project; and\n \nWHEREAS, it is necessary to authorize the transfer of cash and appropriation between projects within the Sanitary Bond Fund, Fund 6109, to align cash and appropriation with the proper project; and; and\n \nWHEREAS` it is necessary to expend funds to pay for the project; and \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Utilities in that it is immediately necessary to execute the contract modification to align the engineering services needed during construction to the construction timeline, thereby preserving the public health, peace, property, safety, and welfare; now, therefore,\n \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2022 Capital Improvement Budget authorized by Ordinance 1896-2022 be amended as follows to establish sufficient budget authority for this project:\n \nFund / Project Number / Project Name (Funding Source) / Current Authority / Revised Authority / Change\n6109 / 650260-102000 / JPWWTP Small Capital Projects (Voted Sanitary Carryover) / $1.295, 400.00 / $181,000.00 / ($1,115,400.00)\n6109 / 650375-100002 / Compost Facility Odor Control Improvements (Voted Sanitary Carryover) / $557,125.00 / $1,672,525.00 / $1,115,400.00\n \nSECTION 2.  That the transfer of $1,115,400.00, or so much thereof as may be needed, is hereby authorized in Fund 6109 (Sanitary Bond Fund) per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That the Director of Public Utilities is hereby authorized to modify and increase the Southwesterly Composting Facility Odor Control Improvements professional engineering service agreement with Hatch Associates Consultants, Inc., 88 East Broad Street, Suite 1980, Columbus, OH 43215, in the amount of up to $1,115,400.00.\n \nSECTION 4. That the transfer of up to $1,115,400.00 within the Sanitary General Obligation Bond Fund, Fund 6109, is authorized per the accounting codes attached to this ordinance.\n \nSECTION 5. That the expenditure of up to $1,115,400.00 from the Sanitary Bond Fund, Fund 6109, is authorized per the accounting codes attached to this ordinance.\n \nSECTION 6.  Funds are deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 7.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this Ordinance.\n \nSECTION 8. That the City Auditor is hereby authorized and directed to transfer any unencumbered balance in the project account to the unallocated balance within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies no longer required for said project.\n \nSECTION 9.  That for the reasons stated in the preamble hereto, which is made a part hereof, this Ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten (10) days after passage if the Mayor neither approves nor vetoes this Ordinance.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 82,
    "meeting_date": "2023-06-26",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}