{
  "success": true,
  "vote": {
    "id": 6984,
    "item_number": "CA-7",
    "title": "To authorize the Director of the Department of Development to enter into a not-for profit-service contract with the Neighborhood Design Center (NDC) in an amount up to $143,000.00 to provide design services to businesses in the Neighborhood Commercial Revitalization (NCR) districts, as well as businesses throughout the City of Columbus as appropriate,  as part of the NCR Interior/Exterior Renovation Grant program; and to authorize the expenditure of $143,000.00 from the Division of Economic Development’s General Fund budget.  ($143,000.00)",
    "description": "Explanation\n \nBACKGROUND: This legislation authorizes the Director of the Department of Development to enter into not-for profit-service contract with the Neighborhood Design Center (NDC) in an amount up to $143,000.00 to provide design services to businesses in the Neighborhood Commercial Revitalization (NCR) districts as part of the NCR Interior/Exterior Renovation Grant program, as well as businesses throughout the City of Columbus as appropriate.\n  \nNDC, a non-profit organization, provides the design services for the City’s NCR Interior/Exterior Renovation Grant program.  The NCR Areas include Franklinton, Hilltop, Main Street, Parsons Avenue, Long Street, Mount Vernon Avenue and Cleveland Avenue in Linden. Construction funding is provided by the City under a separate ordinance.   The City has been sponsoring this program for about 14 years and NDC has been a partner throughout the program.\n \nThe services included in this agreement cannot be provided by existing city employees because these services are beyond the City’s current staffing capacity to provide. \n \n \nFISCAL IMPACT: Funding for the Neighborhood Design Center in an amount up to $143,000.00 is available in the Division of Economic Development’s 2023 General Fund Budget.  \n \nCONTRACT COMPLIANCE:  The vendor’s contract compliance 006529 is active and expires on 3/16/25.\n \n \nTitle\n \nTo authorize the Director of the Department of Development to enter into a not-for profit-service contract with the Neighborhood Design Center (NDC) in an amount up to $143,000.00 to provide design services to businesses in the Neighborhood Commercial Revitalization (NCR) districts, as well as businesses throughout the City of Columbus as appropriate,  as part of the NCR Interior/Exterior Renovation Grant program; and to authorize the expenditure of $143,000.00 from the Division of Economic Development’s General Fund budget.  ($143,000.00)\n \n \nBody\n \nWHEREAS, the Neighborhood Design Center, a non-profit organization, provides the design services for the City’s Neighborhood Commercial Revitalization districts through the City’s Neighborhood Commercial Revitalization  districts through the City’s Interior/Exterior Renovation Grant program; and \n \nWHEREAS, the Neighborhood Design Center has been established to promote the role of the architect in the development process to provide training for architecture students, to encourage good design in redevelopment and to generate participation in the City's commercial revitalization efforts; and\n \nWHEREAS, it has become necessary in the usual daily operations of the Department of Development to enter into a not-for profit-service contract with the Neighborhood Design Center in order to provide design services; NOW, THEREFORE, \n \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \n \nSECTION 1.                     That the Director of the Department of Development is authorized to enter into not-for profit-service contract with the Neighborhood Design Center in an amount up to $143,000.00 to provide design services to businesses in the Neighborhood Commercial Revitalization (NCR) districts as part of the NCR Interior/Exterior Renovation Grant program.\n \nSECTION 2.                     That the expenditure of $143,000.00 or so much thereof as may be needed, is hereby authorized in Fund 1000 (General Fund), Dept-Div 4402 (Economic Development), in object class 03 (Services) per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.                      That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.                     That this contract is awarded in accordance with the relevant provisions of City Code Chapter 329 relating to nonprofit service contracts.\n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.  \n \nSECTION 6.                      That this ordinance shall take and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 5,
    "noes": 0,
    "abstain": 1,
    "absent": 1,
    "meeting_id": 83,
    "meeting_date": "2023-07-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSTAIN"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Economic Development"
    ]
  }
}