{
  "success": true,
  "vote": {
    "id": 7012,
    "item_number": "CA-35",
    "title": "To authorize an amendment to the 2022 Capital Improvement Budget; to authorize a transfer of cash and appropriation within the Sanitary Bond Fund; to authorize the Director of Public Utilities to enter into a contract modification with T&M Associates for the Blueprint Old Beechwold Area Integrated Solutions project; and to expend up to $66,852.86 from the Sanitary Bond Fund for the project.  ($66,852.86)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of the Department of Public Utilities to enter into a contract modification with T&M Associates, for the Blueprint Old Beechwold Area Integrated Solutions project, CIP #650870-110166, in an amount not to exceed $66,852.86. \n \nThis modification is in conjunction with Blueprint GI pillar/phase that is currently completing construction.  This modification will fund the design and bidding of the next two pillars of Blueprint for the lateral lining and downspout redirection.\n \nThe Community Planning Area is 39 - Clintonville.\n  \n1.1 Amount of additional funds to be expended:  $66,852.86\n \nOriginal Contract                                                             $     387,988.57 (ORD 0693-2017; PO071050/20)\nCurrent Modification                                                        $       66,852.86\nCONTRACT TOTAL                                                     $      454,841.43\n \n1.2. Reason other procurement processes are not used:  \nThis is a contract modification.  T&M Associates has been providing these services under contract with planned modifications to add funding for future years.  Rebidding the contract and using another company would be more expensive as the new company would need to spend time learning and redoing work already performed by T&M Associates.\n \n1.3. How the cost of modification was determined:\nPricing was negotiated using current contracted rates after the scope of work was agreed upon.\n \n2. ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT  \nProposed stormwater system improvements will mitigate street and yard flooding complaints by reduction of impervious area or increased capture of Stormwater runoff via infiltration/retention using Best Management Practices.  \n \n3.  CONTRACT COMPLIANCE INFORMATION\nT&M Associates’ contract compliance number is CC-001614 and expires 5/24/2024.  T&M Associates’ certification was in good standing at the time of the contract modification.  \n \n4.  MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract was put in place prior to the implementation of the City of Columbus MBE/WBE Program and is not subject to the requirements of that program.  T&M Associates is classified as a majority company by the City’s Office of Diversity and Inclusion.  Per the attached Utilization Plan, there are no subcontractors planned to be used on this contract.  The MBE/WBE percentage for this contract modification is 0.0%.\n5. FISCAL IMPACT  \nFunds are appropriated and available within the Sanitary G.O. Fund, Fund 6109, for this expenditure.  An amendment to the 2022 Capital Improvement Budget is needed to align budget authority with the proper project.  A transfer of cash and appropriation between projects within the Sanitary Bond Fund is needed to align cash and appropriation with the proper project.\n \n \nTitle\nTo authorize an amendment to the 2022 Capital Improvement Budget; to authorize a transfer of cash and appropriation within the Sanitary Bond Fund; to authorize the Director of Public Utilities to enter into a contract modification with T&M Associates for the Blueprint Old Beechwold Area Integrated Solutions project; and to expend up to $66,852.86 from the Sanitary Bond Fund for the project.  ($66,852.86)  \n \nBody\nWHEREAS, the Department of Public Utilities is engaged in the Blueprint Old Beechwold Area Integrated Solutions project; and \n \nWHEREAS, Contract PO071050/20 was authorized by Ordinance 0639-2017 for the Blueprint Old Beechwold Area Integrated Solutions project; and\n \nWHEREAS, a contract modification with T&M Associates is needed to provide funding for the work that will be performed this year; and\n \nWHEREAS, it is necessary to authorize an amendment to the 2022 Capital Improvements Budget for the purpose of providing sufficient budget authority for the proper project; and \n \nWHEREAS, a transfer of cash and appropriation between projects within the Sanitary Bond Fund is needed; and\n \nWHEREAS, it is necessary to expend funds to pay for the contract modification; now therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2022 Capital Improvement Budget authorized by Ordinance 1896-2022 be amended as follows to establish sufficient budget authority for this project:\n \nFund / Project Number / Project Name (Funding Source) / Current Authority / Revised Authority / Change \n6109 / 650895-100004 / Community Park / Maple Canyon HSTS Elimination Project (Voted Sanitary Carryover) / $192,839.00 / $125,986.00 / ($66,853.00)\n \n6109 / 650870-110166 / Blueprint Old Beechwold Area Integrated Solutions (Voted Sanitary Carryover) / $0.00 / $66,853.00 / $66,853.00\n \nSECTION 2.  That a transfer of funds between projects within the Sanitary Bond, Fund 6109, is authorized per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That the Director of the Department of Public Utilities be and hereby is authorized to enter into a contract modification of up to $66,852.86 for the Blueprint Old Beechwold Area Integrated Solutions project with T&M Associates, 4675 Lakehurst Court, Suite 250 Columbus, OH 43016; in accordance with the terms and conditions as shown in the agreement on file in the office of the Department of Public Utilities.\n \nSECTION 4.  That the expenditure of up to $66,852.86, or so much thereof as may be needed, is hereby authorized per the accounting codes in the attachment to this ordinance.\n \nSECTION 5.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 7.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 8. That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 83,
    "meeting_date": "2023-07-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}