{
  "success": true,
  "vote": {
    "id": 7015,
    "item_number": "CA-38",
    "title": "To authorize an amendment to the 2022 Capital Improvement Budget; to authorize the transfer of funds within the Sanitary Bond Fund; to authorize the Director of Public Utilities to renew and increase the contract with Glaus, Pyle, Schomer, Burns, and Dehaven, dba GPD Group, for the Sanitary Pump Station Evaluation and Upgrade Program Project; and to authorize an expenditure of up to $300,000.00 within the Sanitary Bond Fund to pay for the contract renewal.  ($300,000.00)",
    "description": "Explanation\n \n1. BACKGROUND:  This ordinance authorizes the Director of Public Utilities to enter into a planned contract renewal for professional engineering services with Glaus, Pyle, Schomer, Burns and Dehaven dba GPD Group, Inc. for the Sanitary Pump Station Evaluation & Upgrade Program, CIP #650660-100000, in an amount up to $300,000.00.\n \nDOSD operates sixteen (16) Stormwater Pump Stations and sixteen (16) Sanitary Pump Stations. There will be two individual programs; one for the Stormwater Pump Stations (Hatch) and one for the Sanitary Pump Stations (GPD). Each program will perform a holistic evaluation of each pump station, assess their structural, mechanical, process, electrical, and I&C components, identify needs and improvements, and identify risks and safety issues. The evaluation and assessments for each pump station will be summarized into a Technical Memorandum (TM). The recommended improvements listed in the Technical Memorandums will be refined into Improvement Plans that will be used by the City to systematically upgrade the pump stations.\n \nGPD began their work after Notice to Proceed (NTP) was given on 1/27/22. The duration of the engineering agreement is expected to be three (3) years. The professional services shall be funded by incremental appropriation, through the use of approximately annual renewals. This is the first of two (2) planned renewals. The second and final renewal is planned for 2024.\n \nThese Sanitary Pump Stations serve multiple planning areas so this project is coded as “99 - Citywide”.\n \n1.1 Amount of additional funds to be expended:  $300,000.00\nOriginal Contract Amount:                         $300,000.00                     (Ord. 3108-2021; PO308140)\nRenewal #1 (current):                                       $300,000.00\nRenewal #2 (future)                                            $300,000.00\nTotal (Orig. + Renewals):                             $900,000.00\n \n1.2. Reason other procurement processes are not used:  \nThe funding provided by this contract renewal is for the continuation of existing and planned work of the project. Due to the highly complex and technical nature of this project, it is not reasonable or cost effective to undertake a new procurement to acquire these services. The lengthy process for initiating a new procurement and for a new entity to gain understanding of the project would cause an unacceptable project delay and additional cost.\n \n1.3. How cost of renewal was determined:\nThe tasks for this Renewal are similar to the tasks of the Original Agreement; so, the costs of this Renewal are similar to the Original Agreement.\n \n2. ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT:  \nThe performance of this projects’ activities to provide specialized professional engineering services to evaluate and provide recommendations for the upgrade of DOSD’s Sanitary Pump Stations is needed to plan improvements to maintain peak operational performance. If left unperformed, the required work could become larger in scope and more expensive and could produce a major impact to the sewer collection systems and the budget. No community outreach is considered for this project.\n \n3. CONTRACT COMPLIANCE INFO:  \nGDP Group’s contract compliance number is CC006560 and expires 5/20/23.\n \nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against Glaus, Pyle, Schomer, Burns and Dehaven dba GPD Group, Inc.\n \n4. MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract was put in place prior to the implementation of the City of Columbus MBE/WBE Program and is not subject to the requirements of that program.  Glaus, Pyle, Schomer, Burns and Dehaven dba GPD Group, Inc. is classified as a majority company by the City’s Office of Diversity and Inclusion.  Glaus, Pyle, Schomer, Burns and Dehaven dba GPD Group, Inc. anticipates performing the work on this contract renewal with the use of sub consultants.  The MBE/WBE percentage for this renewal is expected to be 21.4%.\n \nAs part of their proposal, Glaus, Pyle, Schomer, Burns and Dehaven dba GPD Group has proposed the following three subcontractors to perform contract work:\n \nCompany Name                                            City/State                                     ODI Certification Status\nBlack & Veatch, Inc.                                                                    Columbus, Ohio                                                                                    MAJ\nAdvanced Engineering Consultants                           Columbus, Ohio                                                                                    MBE\nResource International                                                                  Columbus, Ohio                                                                                    WBE\nDynotec, Inc.                                                                                          Columbus, Ohio                                                                                    MBE\n \nThe certification of Glaus, Pyle, Schomer, Burns, and Dehaven dba GPD Group and the above companies was in good standing at the time the bid was awarded.\n \n 5. FISCAL IMPACT\nAn amendment to the 2022 Capital Improvement Budget is needed to align budget authority with the proper project.  A transfer of cash and appropriation is also needed between projects within the Sanitary Bond Fund, Fund 6109, to align cash and appropriation with the proper project.   \n \nTitle\nTo authorize an amendment to the 2022 Capital Improvement Budget; to authorize the transfer of funds within the Sanitary Bond Fund; to authorize the Director of Public Utilities to renew and increase the contract with Glaus, Pyle, Schomer, Burns, and Dehaven, dba GPD Group, for the Sanitary Pump Station Evaluation and Upgrade Program Project; and to authorize an expenditure of up to $300,000.00 within the Sanitary Bond Fund to pay for the contract renewal.  ($300,000.00)\n \nBody\nWHEREAS, the Department of Public Utilities is engaged in the Sanitary Pump Station Evaluation & Upgrade ProgramProject; and\n \nWHEREAS, Contract No. PO308140 was authorized by Ordinance No. 3108-2021, for the Sanitary PUMP STATION Evaluation & Upgrade Program Project; and\n \nWHEREAS, a planned contract renewal is needed for engineering services; and\n \nWHEREAS, it is necessary for Council to authorize the Director of Public Utilities to renew the professional engineering services agreement with Glaus, Pyle, Schomer, Burns and Dehaven dba GPD Group, Inc. for the Sanitary Pump Station Evaluation & Upgrade Program,  Renewal #1 Project; and \n \nWHEREAS, an amendment to the 2022 Capital Improvement Budget is needed to align budget authority with the proper project; and\n \nWHEREAS, it is necessary to transfer funds and appropriation within the Sanitary Bond, Fund 6109, to align cash and appropriation with the proper project; and\n \nWHEREAS, it is necessary to expend funds from the Sanitary Bond Fund to pay for the contract renewal; and now therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2022 Capital Improvement Budget authorized by Ordinance 1896-2022 be amended as follows to establish sufficient budget authority for this project:\n \nFund / Project Number / Project Name / Current / Change / Amended\n6109 / 650354-100000 / SWWTP Post Aeration Diffuser Replacement (Voted Sanitary Carryover) / $668,000.00 / $368,000.00 / ($300,000.00)\n \n6109 / 650660-100000 / Sanitary Pump Station Evaluation & Upgrade Program (Voted Sanitary Carryover) / $0.00 / $300,000.00 / $300,000.00\n \nSECTION 2.  That the transfer of $300,000.00, or so much thereof as may be needed, is hereby authorized between projects between within the Sanitary Bond Fund, Fund 6109, per the account codes in the attachment to this ordinance.  \n \n \nSECTION 3.  That the Director of Public Utilities is hereby authorized to renew and increase the professional engineering services contract with Glaus, Pyle, Schomer, Burns and Dehaven dba GPD Group, Inc., 2 1801 Watermark Dr. Ste. 210, Columbus, Ohio  43215; for the Sanitary Pump Station Evaluation & Upgrade Program Project, in an amount up to $300,000.00.\n \nSECTION 4.  That an expenditure of $300,000.00, or so much thereof as may be needed, is hereby authorized from the Sanitary Bond Fund, Fund 6109, to pay for this contract renewal per the accounting codes in the attachment to this ordinance.\n \nSECTION 5.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 7.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 8.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 83,
    "meeting_date": "2023-07-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}