{
  "success": true,
  "vote": {
    "id": 7037,
    "item_number": "CA-60",
    "title": "To approve Memorandum of Understanding #2023-06 executed between representatives of the City of Columbus and the American Federation of State, County, and Municipal Employees, Local 1632 to amend Appendix A (classification listing) of the Collective Bargaining Agreement, dated April 1, 2021 through March 31, 2024, by increasing the Pay Range of the 911 Emergency Call Taker to 26 to 27 and 911 Emergency Dispatcher to 28 to 29 and to provide for training, retention and recruitment payments for those classifications; and to declare an emergency.",
    "description": "Explanation\n \nSection 32.3 of the Collective Bargaining Agreement with the American Federation of State, County, and Municipal Employees (AFSCME) Local 1632 and the City of Columbus, April 1, 2021 through March 31, 2024, requires that any modifications to the CBA be agreed to by the parties.  Memorandum of Understanding #2023-06 has been executed by the parties to amend Appendix A (classification listing) by increasing the Pay Ranges of certain classifications in the Department of Public Safety and to provide training, recruitment and retention payments for the following classifications:\n \nJob Code                                                                                                         Class Title                                                                                                         Pay Range\n \n3003                                                                                                         911 Emergency Call Taker                                                               20 to 24  26 to 27\n \n3004                                                                                                         911 Emergency Dispatcher                                                               25 to 28  28 to 29\n \n \nConcurrent with the pay range adjustment:\n•                     Incumbent employees in the 911 Emergency Call Taker classification shall advance to Pay Range 26, and retain their current step, on the payday of the subsequent full pay period following City Council’s approval of this MOU.\n•                     Incumbent employees in the 911 Emergency Dispatcher classification who are paid at Pay Ranges 25, 26 and 27, shall advance to Pay Range 28, and retain their current step, on the payday of the subsequent full pay period following City Council’s approval of this MOU.  \n•                     Incumbent employees in the 911 Emergency Dispatcher classification who are paid at Pay Range 28, shall advance to Pay Range 29, and retain their current step, on the payday of the subsequent full pay period following City Council’s approval of this MOU. \n \nTRAINING PAYMENT\nAll full-time employees classified as a 911 Emergency Call Taker and 911 Emergency Dispatcher who teach a class of employees in a classroom setting pursuant to Article 26, Section 26.9 or were assigned a trainee for at least one full-time coaching phase during the period of January 1, 2022 through December 9, 2023 shall receive a one-time lump sum payment of $2,500.00 to be paid in the pay period ending December 23, 2023. \n \nWhereas, the parties agree to enact retention and recruitment payments for employees in the 911 Emergency Call Taker and 911 Emergency Dispatcher as follows:\n \nRETENTION & RECRUITMENT PAYMENT \nAll full-time employees classified as a 911 Emergency Call Taker and 911 Emergency Dispatcher, shall receive payments according to the following schedule: \n \n1.                     All full-time employees classified as 911 Emergency Call Taker and 911 Emergency Dispatcher employed through the pay period including July 8, 2023 shall receive a onetime payment of $1,000.00, less applicable withholdings, to be paid in the subsequent pay period.  \n2.                     All full-time employees classified as 911 Emergency Call Taker and 911 Emergency Dispatcher employed through the pay period including October 14, 2023 shall receive a onetime payment of $1,000.00, less applicable withholdings, to be paid in the subsequent pay period.    \n3.                     All full-time employees classified as 911 Emergency Call Taker and 911 Emergency Dispatcher employed through the pay period ending December 9, 2023 shall receive a onetime payment of $2,000.00, less applicable withholdings, to be paid in the subsequent pay period.   \n \n \nThe passage of this ordinance indicates City Council's approval of Memorandum of Understanding #2023-06, a copy of which is attached hereto.\n \nEmergency action is recommended in order to allow for expedient implementation.  \n \n \nTitle\n \nTo approve Memorandum of Understanding #2023-06 executed between representatives of the City of Columbus and the American Federation of State, County, and Municipal Employees, Local 1632 to amend Appendix A (classification listing) of the Collective Bargaining Agreement, dated April 1, 2021 through March 31, 2024, by increasing the Pay Range of the 911 Emergency Call Taker to 26 to 27 and 911 Emergency Dispatcher to 28 to 29 and to provide for training, retention and recruitment payments for those classifications; and to declare an emergency.  \n \n \nBody\n \nWHEREAS, representatives of the City of Columbus and the American Federation of State, County, and Municipal Employees, Local 1632 entered into Memorandum of Understanding #2023-06, a copy of which is attached hereto, which amends Appendix A of the Collective Bargaining Agreement between AFSCME Local 1632 and the City of Columbus, dated April 1, 2021 through March 31, 2024, by increasing the Pay Range of the 911 Emergency Call Taker to 26 to 27 and the 911 Emergency Dispatcher to 28 to 29 and to provide for training, retention and recruitment payments for those classifications and, \n \nWHEREAS, Memorandum of Understanding #2023-06 amends Appendix A of the Collective Bargaining Agreement as follows:  AFSCME Local 1632 classifications 911 Emergency Call taker will be placed in Pay Range 26 to 27 and 911 Emergency Dispatcher in Pay Range 28 to 29 and training, retention and recruitment payments are provided for those classifications and, \n \nWHEREAS, an emergency exists in the usual operation of the Department of Public Safety in that is immediately necessary to amend the Collective Bargaining Agreement between the City of Columbus and AFSCME Local 1632, dated April 1, 2021 through March 31, 2024, by approving the Memorandum of Understanding #2023-06 in order to allow for expedient implementation and in accordance with the agreement of the parties; thereby preserving the public peace, property, health, safety, and welfare, NOW, THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSection 1.  That Memorandum of Understanding #2023-06 amends Appendix A of the Collective Bargaining Agreement between AFSCME Local 1632 and the City of Columbus dated April 1, 2021 through March 31, 2024 and provides training, retention and recruitment payments.\n \nSection 2.  That City Council, in the best interests of the City, hereby, recognizes and approves Memorandum of Understanding #2023-06, a copy of which is attached hereto, executed between the representatives of the City of Columbus and AFSCME Local 1632.\n \nSection 3.  That for the reasons stated in the preamble hereto, which is hereby made a part of hereof, this ordinance is hereby declared to be an emergency measure, and shall take effect and be in force from and after its passage and approval by the Mayor, or ten (10) days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 83,
    "meeting_date": "2023-07-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}