{
  "success": true,
  "vote": {
    "id": 7043,
    "item_number": "CA-66",
    "title": "To authorize the Director of Finance and Management, on behalf of the Office of Construction Management, to enter into a construction management contract with Gilbane-Smoot Columbus a Joint Venture, to provide Construction Manager at Risk (CMaR) services for the New Municipal Court Building project for Phase 1 work; to authorize an expenditure in an amount not to exceed $84,177.00 within the Construction Management Taxable Bonds Fund; to authorize the transfer of cash and appropriation within the Construction Management Taxable Bonds Fund; to authorize an amendment to the 2023 Capital Improvements Budget; and to declare an emergency.  ($84,177.00)",
    "description": "Explanation\n \n1. BACKGROUND: This Ordinance authorizes the Finance and Management Director to enter into a professional services agreement, on behalf of the Office of Construction Management, with Gilbane-Smoot Columbus a Joint Venture (hereinafter “Gilbane-Smoot\"), to provide Construction Manager at Risk (CMaR) services for the New Municipal Court Building project (\"Project\"), in an amount up to $84,177.00.  This Project will be undertaken in phases, and this legislation is to authorize and appropriate funds for Phase 1 Preconstruction Services with Gilbane-Smoot. Section 329.23(B) permits the City to prepare an invitation for proposals with a construction manager at risk (\"CMaR\"). \n \nAs a CMaR Gilbane-Smoot will be responsible for full construction services for the project, including but not limited to:  design submittal review; preconstruction services; participation in developing the construction budget and updated construction cost estimates; participation in preparing the construction schedule (including identification of significant project milestones for completion of the work); assist subcontractors with prequalification; and regular reporting and management of construction, cost, schedule, and close-out phases of the project.\n \nThis is a large multi-phased project that is estimated to span over 3 years.  At a minimum, the Project will include:\n \nPhase for Site Development / Pre-Construction Services\nPhase for Building Core and Shell\nPhase for Interior Construction\n \nThis Ordinance will provide funding for Phase 1 services to include: program validation, construction schedule development, construction cost estimating, constructability reviews, providing the design team with industry best practices, preliminary site logistics and other construction-related items specific to the downtown location such as traffic management.  Gilbane-Smoot will work with the design team as they develop three (3) design concepts to present to the City.  Each design concept will have a construction estimate. \n \n2.  FUTURE MODIFICATION(S):  Multiple modifications within each phase may be necessary depending on changes to the scope and/or availability of funds.  A future modification of Phase 1 is expected for additional pre-construction services.\n \n3. BID INFORMATION:  The selection of the firm providing the CMaR services has been performed in accordance with the procedures set forth in Columbus City Code, Section 329, “Awarding professional service contracts through Requests for Statement of Qualifications.\"    The project was let by the Office of Construction Management through Vendor Services and Bonfire. Of the 494 vendors solicited, 167 were Minority-owned, 4 were Veteran-owned, 292 were Small Business-owned, and 108 were Women-owned.\n \nTwo (2) Request for Statement of Qualifications (RFSQ) were opened on January 11, 2023, from Majority-designated firms:\n \n1. Gilbane-Smoot Columbus a Joint Venture\n2. Corna-Kokosing Construction Co. / Elford\n \nUpon scoring from the evaluation committee on qualifications, technical proposals, and in-person presentations, the Department of Finance and Management recommends an award be made to Gilbane-Smoot Columbus A Joint Venture based on the criteria included in Columbus City Code, Section 329.23.\n \n4.  CONTRACT COMPLIANCE INFO:  Gilbane-Smoot Columbus a Joint Venture, CC# 044027, expires 1/11/25, Majority-designated\n \nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against Gilbane-Smoot Columbus.\n \nThe ODI goal for this project is 20%.\n \n5. SUBCONTRACTOR PARTICIPATION:  Gilbane-Smoot Columbus proposed 4 MBE-designated subcontractors to meet the 20% ODI goal:\n \nCompany Name                                                  City/State                     ODI Designation      \nMcDaniel's Construction                                                               Columbus/OH                     MBE                                                               \nSessley Building Services                                                                Columbus/OH                     MBE                     \nMoody Nolan                                                                                     Columbus/OH                     MBE                     \nDLZ Ohio                                                                                                         Columbus/OH                     MBE                     \n \nMinority vendor certifications were in good standing at the time the bid was awarded.\n \n6. EMERGENCY DESIGNATION:  Emergency legislation is requested to permit the CMaR to collaborate with the selected design team, Moody-Nolan, LLC, which is under contract with the City and is prepared to collaborate with the CMaR immediately on this pre-construction work that needs to be completed on or before the end of October, 2023. \n \n7. FISCAL IMPACT:  There are sufficient funds within the Construction Management Taxable Bonds Fund - Fund No. 7732, however, an amendment to the 2023 Capital Improvements Budget will be necessary.  The Capital Budget amendment is contingent upon passage of the 2023 Capital Improvements Budget.\n \n \nTitle\n \nTo authorize the Director of Finance and Management, on behalf of the Office of Construction Management, to enter into a construction management contract with Gilbane-Smoot Columbus a Joint Venture, to provide Construction Manager at Risk (CMaR) services for the New Municipal Court Building project for Phase 1 work; to authorize an expenditure in an amount not to exceed $84,177.00 within the Construction Management Taxable Bonds Fund; to authorize the transfer of cash and appropriation within the Construction Management Taxable Bonds Fund; to authorize an amendment to the 2023 Capital Improvements Budget; and to declare an emergency.  ($84,177.00)\n \n \nBody\n \nWHEREAS, this Ordinance authorizes the Finance and Management Director to enter into a construction management contract, on behalf of the Office of Construction Management, with Gilbane-Smoot Columbus a Joint Venture (hereinafter “Gilbane-Smoot\"), to provide Construction Manager at Risk (CMaR) services for the New Municipal Court Building project (\"Project\"), in an amount not to exceed $84,177.00.  This Project will be undertaken in phase. This legislation is to authorize and appropriate funds for Phase 1 Preconstruction Services with Gilbane-Smoot. \n \nWHEREAS, CCC Section 329.23(B) permits the City to prepare an invitation for proposals for a construction manager at risk (\"CMaR\"); and\n \nWHEREAS, the Project was let by the Office of Construction Management through Vendor Services and Bonfire. Of the 494 vendors solicited, 167 were Minority-owned, 4 were Veteran-owned, 292 were Small Business-owned, and 108 were Women-owned; and \n \nWHEREAS, two (2) technical proposals for New Municipal Court Building project were received on January 11, 2023; and\n \nWHEREAS, upon scoring from the evaluation committee on qualifications, technical proposals, and in-person presentations, the Department of Finance and Management recommends an award be made to Gilbane-Smoot Columbus A Joint Venture based on the criteria included in Columbus City Code, Section 329.23; and \n \nWHEREAS, it is necessary to authorize the Director of Finance and Management to award and execute an agreement to Gilbane-Smoot Columbus A Joint Venture for the New Municipal Court Building project; and \nWHEREAS, it is necessary to authorize an expenditure of funds from the Construction Management Taxable Bonds Fund - Fund No. 7732; and  \n \nWHEREAS, it is necessary to authorize a transfer of funds within the Construction Management Taxable Bonds Fund - Fund No. 7732; and  \n \nWHEREAS, it is necessary to authorize an amendment to the 2023 Capital Improvements Budget for the purpose of providing sufficient spending authority for the aforementioned project expenditure; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Finance and Management, Office of Construction Management, in that it is immediately necessary to authorize the Director of Finance and Management to enter into a construction management contract for Construction Manager at Risk (CMaR) services for the New Municipal Court Building project to permit Gilbane-Smooth (the \"CMaR\") to collaborate with the selected design team, Moody-Nolan, LLC, which is under contract with the City and is prepared to collaborate with the CMaR immediately on this pre-construction work that needs to be completed on or before the end of October, 2023, to produce complete and accurate construction estimates for this much needed Courthouse project for the public, for the immediate preservation of the public safety, peace, property and safety; now therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Finance and Management is authorized to enter into a construction management contract, on behalf of the Office of Construction Management, with Gilbane-Smoot Columbus a Joint Venture, to provide Construction Manager at Risk (CMaR) services for the New Municipal Court Building project, in an amount not to exceed $84,177.00 for Phase 1 work.\n \nSECTION 2.  That an expenditure of $84,177.00, or so much thereof as may be needed, is authorized in the Construction Management Taxable Bonds Fund - Fund No. 7732, per the accounting codes in the attachment to this ordinance.  \n \nSECTION 3.  That the 2023 Capital Improvements Budget is amended, in the Construction Management Taxable Bonds Fund - Fund No. 7732, per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the transfer of cash and appropriation is authorized within the Construction Management Taxable Bonds Fund - Fund No. 7732, per the accounting codes in the attachment to this ordinance.  \n \nSECTION 5.  That the funds necessary to carry out the purpose of this Ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.  That the City Auditor is authorized and directed to transfer any unencumbered balance in the project account to the unallocated balance within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies no longer required for said project; except that no transfer shall be made from a project account by monies from more than one source.\n \nSECTION 7.  That the City Auditor is authorized to establish proper project accounting numbers as appropriate.\n \nSECTION 8.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this Ordinance.\n \nSECTION 9.  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 83,
    "meeting_date": "2023-07-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}