{
  "success": true,
  "vote": {
    "id": 7049,
    "item_number": "SR-5",
    "title": "To authorize the Director of Recreation and Parks to enter into a grant agreement with the Ohio Public Works Commission for the Linden Green Line Project and accept a grant in the amount of $2,474,000.00 with a local match of $2,474,000.00; to authorize the appropriation of $2,474,000.00 in the Recreation and Parks Grant Fund 2283; to authorize the amendment of the 2022 Capital Improvements Budget; to authorize the transfer of $2,474,000.00 within the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($4,948,000.00)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Director of the Recreation and Parks Department to enter into a grant agreement with Ohio Public Works Commission (OPWC) for the Linden Green Line Project. This ordinance will also authorize the appropriation of the grant and matching funds.  The grant amount is $2,474,000.00 and the local match amount is $2,474,000.00. There is a total of $4,948,000.00 available for this project being authorized by this ordinance.  \n \nIn March of 2023, the Department applied for 2023 Clean Ohio Green Space Conservation Program grant funds to be used towards fee simple acquisition of an abandoned rail corridor in the Linden and Northland Communities, as authorized by Ordinance 0440-2023. In May of 2023, the Department received notice that the grant was approved.  \n \nThe Linden and Northland Communities of Columbus are one of the region’s most underserved areas for parks, open spaces, and natural areas. The purpose of the Linden Green Line Project is to provide a new approximately 58 acre linear park stretching along seven miles of an abandoned rail corridor, from Windsor Park, near 17th Avenue, to Cooper Park in the Northland Community. The rail corridor is privately owned, for sale, and acquiring the property provides a generational opportunity for over 131,000 residents living nearby to create a unique large-scale linear park through a dense inner city community. The Linden Green Line will utilize the longest abandoned corridor in Columbus, with an average width of 80 feet. The Clean Ohio funds will be used towards the purchase of the property.\n  \nOnce acquired, the Linden Green Line will enter the design and construction phase of what is intended to build the first ever linear park in Central Ohio. Components would include seven miles of 10 foot wide pathway, with the remaining 70 feet of the corridor devoted to restoring a natural area, including forest plantings, native shrubs, wildflowers, and selective open greenspaces. Extensive public engagement will be continued with the community as a first step in developing the project. Based on this feedback and input from key stakeholders, some small-scale amenities, such as play spaces, gathering areas, seating, and exercise equipment are planned to be included. Over 40 access points to the linear park can be made available. Once the corridor is acquired, future preservation projects stretching east and west along the line will be planned and acquired as the linear park advances, enhancing and widening the natural open spaces and connector corridors. For example, the rail corridor crosses several small tributaries to Alum Creek. Several substantial tracts of woodland and greenspace are adjacent to the corridor. The Green Line also passes through the center of what will become one of the region’s premier sports parks. Kilbourne Run Sports Park, now under development by Recreation and Parks, is projected to open in 2025.\n \nPrincipal Parties: \nOhio Public Works Commission\n65 East State Street, Suite 312\nColumbus, Ohio 43215                                                      \nNathaniel Vogt, (614)233-4183                                                                                                      \nContract Compliance Number: 005089\nContract Compliance Expiration Date: N/A (State of Ohio Agency)\n \nEmergency Justification: Emergency action is being requested so that the Director of Recreation and Parks can immediately sign the grant agreement, accept the funding, and complete the acquisition negotiations to meet the purchase contract deadline of September 30, 2023 and the OPWC fiscal deadline of December 31, 2023.\n \nBenefits to the Public: These sites are within rapidly urbanizing areas of the city and preservation of key parkland space is one of the main missions of Recreation and Parks. This project will be providing park space within inner city communities. The preservation of these properties proposed in this project relies heavily upon outside funding assistance to achieve these benefits.\n \nCommunity Input/Issues: The Linden and Northland Communities, affordable housing non-profit organizations, and the City of Columbus Department of Development have been involved, in support of the preparation of the grant, and will continue to be engaged during the planning phase of this project.\n \nArea(s) Affected: \nNorthland (35), North Linden (40), South Linden (45)\n \nMaster Plan Relation: This acquisition will support the Recreation and Parks Master Plan by providing long-term protection to corridors for walking, biking, and outdoor experiences while improving the equitable access to trails and greenways. \n \nFiscal Impact: This ordinance will authorize the appropriation of $2,474,000.00 in grant funds in the Recreation and Parks Grant Fund 2283. This ordinance will also authorize a grant match of $2,474,000.00 from the Recreation and Parks Voted Bond Fund 7702. $2,474,000.00 is budgeted and available from within the Recreation and Parks Voted Bond Fund 7702 to meet the financial obligations of this grant match. There is a total of $4,948,000.00 available for this project. Future legislation will be prepared to expend these funds once acquisition is ready to move forward.\n \nTitle\n \nTo authorize the Director of Recreation and Parks to enter into a grant agreement with the Ohio Public Works Commission for the Linden Green Line Project and accept a grant in the amount of $2,474,000.00 with a local match of $2,474,000.00; to authorize the appropriation of $2,474,000.00 in the Recreation and Parks Grant Fund 2283; to authorize the amendment of the 2022 Capital Improvements Budget; to authorize the transfer of $2,474,000.00 within the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($4,948,000.00)\n \nBody\n \nWHEREAS, Ordinance No. 0440-2023 authorized the Director of Recreation and Parks to apply for funding through the Ohio Public Works Commission’s (OPWC) Clean Ohio Green Space Conservation Program and the OPWC has awarded the City of Columbus a grant for the Linden Green Line Project; and\n \nWHEREAS, it is necessary to authorize and direct the Director of Recreation and Parks to accept a grant in the amount of $2,474,000.00 and enter into an agreement with the Ohio Public Works Commission for the Linden Green Line Project; and\n \nWHEREAS, it is necessary to authorize the appropriation of $2,474,000.00 to the Recreation and Parks Grant Fund; and\n \nWHEREAS, it is necessary to authorize that the 2022 Capital Improvements Budget Ordinance 1896-2022 be amended in order to provide sufficient budget authority for this legislation and future projects; and\n \nWHEREAS, it is necessary to authorize the transfer of $2,474,000.00 within the Recreation and Parks Voted Bond Fund; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Recreation and Parks Department that it is immediately necessary to authorize the Director of Recreation and Parks to immediately sign the grant agreement, accept the funding, and complete the acquisition negotiations to meet the purchase contract deadline of September 30, 2023 and the OPWC fiscal deadline of December 31, 2023., all for the preservation of public health, peace, property, safety, and welfare; NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Recreation and Parks is authorized and directed to accept a grant and enter into a contract with the Oho Public Works Commission for the Linden Green Line Project. The amount of the grant is $2,474,000.00 and requires $2,474,000.00 in City matching funds. There is a total of $4,948,000.00 available for this project. Future legislation will be prepared to expend these funds once acquisition is ready to move forward.\n \nSECTION 2. That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ending December 31, 2023, the sum of $2,474,000.00 is appropriated to the Recreation and Parks Grant Fund 2283 per the account codes in the attachment to this ordinance. Appropriation effective upon receipt of executed grant agreement.\n \nSECTION 3. That at the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements. \n \nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 7. That the transfer of $2,474,000.00 or so much thereof as may be needed, is hereby authorized between projects within the Recreation and Parks Bond Fund 7702 per the account codes in the attachment to this ordinance.\n \nSECTION 8. That the 2022 Capital Improvements Budget Ordinance 1896-2022 is hereby amended as follows in order to provide sufficient budget authority for this ordinance and future projects.\nFund / Project / Project Name / Current Revised Authority / Current Remaining Authority / Change / Amended Revised Authority / Amended Remaining Authority\n \nFund 7702 / P510112-100000; Park Acquisition - Cost Allocation (Voted Carryover) / $909 / $909 / $2,089 / $2,998 / $2,998 (to match cash)\n \nFund 7702 / P510112-100000; Park Acquisition - Cost Allocation (Voted Carryover) / $2,089 / $2,998 / ($2,998) / $0 / $0\nFund 7702 / P512026-100000 / Linview Park (Voted Carryover) / $200,872 / $200,872 / ($68,286) / $132,586 / $132,586\nFund 7702 / P513000-100000; Acquisition - Misc. (Voted Carryover) / $494,716 / $394,716 / ($394,716) / $100,000 / $0\nFund 7702 / P513000-100000; Acquisition - Misc. (Voted 2019 SIT Supported) / $708,000 / $708,000 / ($708,000) / $0 / $0\nFund 7702 / P513000-100000; Acquisition - Misc. (Voted 2022 SIT Supported) / $1,300,000 / $1,300,000 / ($1,300,000) / $0 / $0\n \nFund 7702 / P510928-513000; OPWC - Linden Green Line Grant Match (Voted Carryover) / $0 / $0 / $466,000 / $466,000 / $466,000\nFund 7702 / P510928-513000; OPWC - Linden Green Line Grant Match (Voted 2019 SIT Supported) / $0 / $0 / $708,000 / $708,000 / $708,000\nFund 7702 / P510928-513000; OPWC - Linden Green Line Grant Match (Voted 2022 SIT Supported) / $0 / $0 / $1,300,000 / $1,300,000 / $1,300,000\nSECTION 9. That for the reasons stated in the preamble hereto, which is hereby made a part hereof,, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 83,
    "meeting_date": "2023-07-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}