{
  "success": true,
  "vote": {
    "id": 707,
    "item_number": "SR-11",
    "title": "To authorize the Director of the Department of Development to enter into a grant agreement with the Legal Aid Society of Columbus in an amount up to $400,000.00 in support of the Tenant Advocacy Project (TAP) to provide legal representation to residents facing an eviction; to authorize a transfer of funds between the Basic City Services fund and the general fund; to authorize a appropriation in the general fund to the Department of Development; to authorize the expenditure of up to $400,000.00 in the Department of Development; and to declare an emergency. ($400,000.00)",
    "description": "Explanation\nThis legislation authorizes the Director of the Department of Development to enter into a grant agreement with the Legal Aid Society of Columbus in an amount up to $400,000.00 in support of the Tenant Advocacy Project (TAP) to provide legal representation to residents facing an eviction.  \n \nTenants with legal representation are much more likely to avoid an eviction judgment and keep possession of their homes than unrepresented tenants. In addition to these primary effects, a right to counsel offers several secondary benefits to defendants who are sued for eviction. Attorneys may be able to keep eviction filings off tenants’ records, arrange for alternative housing, negotiate reasonable amounts of time for tenants to move out, reduce or eliminate money owed to the landlord, or help tenants apply for rental assistance.\n \nWith the COVID-19 pandemic causing financial insecurity for many residents of Columbus, eviction filings are rising, and the court is expected to see an increase in eviction hearings for the remainder of 2021. With these grant dollars, The Legal Aid Society of Columbus will be able to staff an additional four TAP attorneys for the remainder of the 2021 calendar year.\n \nEmergency Designation:  Emergency action is requested to ensure that The Legal Aid Society of Columbus can immediately begin providing additional legal counsel at eviction court on behalf of Columbus residents facing eviction.\n \nFiscal Impact: Funding is available within the Basic City Services fund.\n \nTitle\nTo authorize the Director of the Department of Development to enter into a grant agreement with the Legal Aid Society of Columbus in an amount up to $400,000.00 in support of the Tenant Advocacy Project (TAP) to provide legal representation to residents facing an eviction; to authorize a transfer of funds between the Basic City Services fund and the general fund; to authorize a appropriation in the general fund to the Department of Development; to authorize the expenditure of up to $400,000.00 in the Department of Development; and to declare an emergency. ($400,000.00)\n \nBody\nWHEREAS, the COVID-19 pandemic is causing financial insecurity for many residents of Columbus, resulting in a rise in eviction filings, with Municipal Court expecting to see an increase in eviction hearings for the remainder of 2021.\nWHEREAS, low-income residents in the City of Columbus are in need of legal services to assist them in eviction court and the Legal Aid Society of Columbus provides assistance in advocating on behalf of residents facing eviction; and,\nWHEREAS, Columbus City Council is committed to the Legal Aid Society’s Tenant Advocacy Project, which aims to keep residents in their homes, and provide legal counsel for residents facing an eviction; and,\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to authorize a grant agreement with the Legal Aid Society of Columbus to allow it to begin providing additional legal counsel at eviction court on behalf of Columbus residents facing eviction; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS: \n \nSECTION 1:  That the Director of the Department of Development is hereby authorized to enter into a grant agreement with the Legal Aid Society of Columbus in support of the Tenant Advocacy Project.\n \nSECTION 2:  That the Auditor is hereby authorized and directed to appropriate $400,000 within the Basic City Services fund, fund 1000, subfund 100017, per the accounting codes in the attachment to this ordinance.\n \nSECTION 3:  That the Auditor is hereby authorized and directed to transfer $400,000 from the Basic City Services fund, fund 1000, subfund 100017, to the general fund, fund 1000, subfund 100010 per the accounting codes in the attachment to this ordinance.\n \nSECTION 4:  That the Auditor is hereby authorized and directed to appropriate $400,000 in the general fund, fund 1000, subfund 100010, to the Department of Development in object class 03 - services per the accounting codes in the attachment to this ordinance.\n \nSECTION 5:  That the expenditure of $400,000.00 or so much thereof as may be needed is hereby authorized in Fund 1000 (General Fund), Dept-Div 44-10 (Housing Division), in object class 03 (Services) per the accounting codes in the attachment to this ordinance.\n \nSECTION 6:  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this legislation.\n \nSECTION 7:  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n   \nSECTION 8:  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 0,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 11,
    "meeting_date": "2021-04-19",
    "meeting_type": "regular",
    "member_votes": [],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}