{
  "success": true,
  "vote": {
    "id": 7094,
    "item_number": "CA-8",
    "title": "To determine to proceed with acquiring, constructing, installing, equipping, and improving off street parking facilities near the southeast corner of the intersection of West Rich Street and McDowell Street, and acquiring interests in the site thereof, together with all necessary and proper appurtenances, and determining that such action is necessary; and to declare an emergency.",
    "description": "Explanation\n \nBackground:\nThis ordinance declares City Council’s determination to proceed with acquiring, constructing, installing, equipping, or improving off-street parking facilities near the southeast corner of the intersection of West Rich Street and McDowell Street in the East Franklinton area of Columbus.\nPursuant to Ordinance No. 2821-2017, the City and EF Garage, LLC entered into a Contribution Agreement on December 15, 2017 (the “Agreement”), through which the City agreed to contribute $10,000.00 per parking space in a total amount not-to-exceed $2,000,000.00 to EF Garage, LLC for the costs associated with constructing the public parking spaces in the Project and EF Garage, LLC agreed to make annual payments to the City through the form of a 30-Year special assessment in the total amount of $2,631,000.00\nOn July 18, 2022, Council approved Resolution No. 0144X-2022 declaring the necessity of acquiring, constructing, installing, equipping, or improving off-street parking facilities near the southeast corner of the intersection of West Rich Street and McDowell Street and levying a special assessment in order to fund a portion of the costs to construct a parking garage that will include 200 public parking spaces.\nFiscal Impact:  \n \nNo City funding is required for the financing of the project.\n \nEmergency Designation: Emergency action is requested to facilitate the subsequent administrative actions required for the special assessment to be certified to the Franklin County Auditor before the second Tuesday in September for addition to the 2023 property tax bills and commencement of the 30-Year Special Assessment.\n \n \nTitle\n \nTo determine to proceed with acquiring, constructing, installing, equipping, and improving off street parking facilities near the southeast corner of the intersection of West Rich Street and McDowell Street, and acquiring interests in the site thereof, together with all necessary and proper appurtenances, and determining that such action is necessary; and to declare an emergency.\n \n \nBody\n \nWHEREAS, this Council previously adopted Resolution 0144X-2022 (the \"Resolution of Necessity\") on July 18, 2022, which declared the necessity of acquiring, constructing, installing, equipping, and improving off-street parking facilities near the southeast corner of the intersection of West Rich Street and McDowell Street, and acquiring interests in the site thereof, together with all necessary and proper appurtenances, all as shown on the Plans and Specifications on file in the office of the Clerk of Council (the \"Project\"); and\nWHEREAS, the Resolution of Necessity declared the necessity of levying Special Assessments on the Assessed Parcels in proportion to the benefits conferred upon each such Assessed Parcels from the Project in order to pay for a portion of the cost and expense of the Project; and\nWHEREAS, pursuant to the Petition filed with this Council, 100% of the Owners of the Assessed Parcels located within the Project limits have petitioned for, waived any objection to, and recorded a Declaration of Public Parking Covenants on the property acknowledging the Special Assessment, notice of the adoption of this Resolution and the filing of the estimated Special Assessments as otherwise required by Section 170 of the City Charter has been waived by the Petitioners; and\n \nWHEREAS, an emergency exists in the usual daily operation of the City, in that it is necessary to levy the special assessment in order to facilitate the subsequent administrative actions required for the special assessments to be certified to the Franklin County Auditor before the second Tuesday in September for addition to the 2023 property tax bills and commencement of the 30-Year Special Assessment; NOW, THEREFORE\n \n                      BE IT Ordained by the Council of the city of COLUMBUS, that:\n \nSECTION 1. Capitalized terms not otherwise defined herein shall have the meaning assigned to each term in the Petition attached as Exhibit A to the Resolution of Necessity.\n \nSECTION 2. This Council is determined to proceed with the acquisition, construction, installation, equipping and improving of the off-street parking facility located near the southeast corner of the intersection of West Rich Street and McDowell Street, as declared necessary within Resolution 0144X-2022 passed July 18, 2022, in accordance with the Plans and Specifications and Contribution Agreement on file in the office of the Clerk of Council (the “Project”).\n \nSECTION 3. The estimated Special Assessments totaling $2,631,000.00 shall be assessed in accordance with the Resolution of Necessity, and such Special Assessments shall be assessed in the manner set forth in the Resolution of Necessity in proportion to the benefits conferred upon each such Assessed Parcel.\n \nSECTION 4.                     That the City's share in the cost of the improvement shall include the cost of the project’s construction costs.\n \nSECTION 5.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 84,
    "meeting_date": "2023-07-17",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services",
      "Parks & Recreation",
      "Public Works"
    ]
  }
}