{
  "success": true,
  "vote": {
    "id": 7114,
    "item_number": "CA-28",
    "title": "To authorize the Director of Public Utilities to modify and increase the contract with CH2M Hill Engineers for the Blueprint Hilltop - Palmetto/Westgate Project; to authorize an expenditure of up to $605,583.00 within the Sanitary G. O. Bond Fund to pay for the contract modification; and to declare an emergency.  ($605,583.00)",
    "description": "Explanation\n \n1. BACKGROUND:  This ordinance authorizes the Director of Public Utilities to enter into a planned contract modification for professional engineering services during construction with Ch2M Hill Engineers, Inc. (Jacobs) for the Blueprint Hilltop - Palmetto/Westgate, CIP #650870-100801, in an amount up to $605,583.00.\n \nThis project is being completed as part of the City’s Blueprint Columbus program.  This project will construct various types of green infrastructure (GI) throughout the neighborhood which will provide a higher water quality within the region by treating the surface runoff before it discharges to the waterways.  The project will also rehabilitate the existing sanitary sewer laterals and install or redirect new roof downspouts so as to reduce inflow and infiltration (I&I) within the sanitary sewer system which will result in fewer water in basements (WIBs), reduced sanitary sewer flows and decreased sanitary sewer overflows (SSOs).  This contract modification will provide the funding necessary to conduct additional public meetings and outreach, complete the designs of the GI and private property work as well as the assembly of the bid documents for each of the phases.\n \nThe original agreement provided preliminary design services.  This modification will concentrate on completing the project construction plans for the pervious pavement plans, assembling the construction documents, bidding the work, conducting engineering services during construction and completing the private property contracts.  \n \nThe Blueprint Hilltop - Palmetto/Westgate serves multiple planning areas so this project is coded as “53- Greater Hilltop”.\n \n1.1 Amount of additional funds to be expended:  $605,583.00\nOriginal Contract:                                                                                                                               $3,084,058.00 (ORD 2560-2015; PO002730)\nRenewal #1 DOSD:                                                                                                                         $370,000.00 (ORD 1744-2019; PO188236 and PO189731) \nModification #1                                                                                                                                      $605,583.00 (Current ordinance)\nTOTAL                                                                                                                                                         $4,059,641.00\n \n1.2. Reason other procurement processes are not used:  \nRe-bid of the project will likely result in a higher project costs as much of the project history would be lost and would need to be rediscovered by another consultant unless the new RFP were won by the same consultant.  In such a case, we would have missed significant time in acquiring and evaluating the new proposals without significant benefit.  \n \n1.3. How cost of modification was determined:\nA cost estimate for the proposed scope of work was prepared by the consultant and reviewed by Public Utilities.  The total modification includes total labor cost (direct labor multiplied by the hourly cost multiplier).  The remaining budget from the original contract is being reallocated to help cover the work associated with the modification scope.  The amount requested as part of this modification is the amount necessary to cover the gap in funding between what is remaining and what is needed to complete the scope.\n \n2. ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT:  \nThis project is being completed as part of the City’s Blueprint Columbus program.  This project will construct various types of green infrastructure (GI) throughout the neighborhood which will provide a higher water quality within the region by treating the surface runoff before it discharges to the waterways.  The project will also rehabilitate the existing sanitary sewer laterals and install or redirect new roof downspouts so as to reduce inflow and infiltration (I&I) within the sanitary sewer system which will result in fewer water in basements (WIBs), reduced sanitary sewer flows and decreased sanitary sewer overflows (SSOs).\n \n3. CONTRACT COMPLIANCE INFO:  \nCH2M’s contract compliance number is CC006247 and expires 2/22/25.\n \n4. MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract was put in place prior to the implementation of the City of Columbus MBE/WBE Program and is not subject to the requirements of that program.  Ch2M Hill Engineers, Inc. is classified as a majority company by the City’s Office of Diversity and Inclusion.  Ch2M Hill Engineers, Inc. anticipates performing the work on this contract with the use of five subconsultants, two of which are classified as WBE’s by the City’s Office of Diversity and Inclusion and one of which was classified as an MBE at the time of the original contract implementation.  The overall MBE/WBE percentage on this contract is expected to be about 13%.   \n \nAs part of their proposal, Ch2M Hill Engineers has proposed the following three subcontractors to perform contract work:\n \nCompany Name                                            City/State                                     ODI Certification Status\nStrand Associates                                                                    Columbus, Ohio                                                                                    MAJ\nResource International                                                            Columbus, Ohio                                                                                    WBE\nPrime AE Group                                                                      Columbus, Ohio                                                                                    MBE*\nColdwater Consulting                                                              Columbus, Ohio                                                                                    WBE\nDreir & Maller                                                                                 Renyoldsburg, Ohio                                                                          MAJ\n \n*Prime AE Group is currently classified as an MAJ by the City’s Office of Diversity and Inclusion.  Prime AE was classified as an MBE at the time of the original contract award and their spend will count as MBE spend through the completion of the contract.\n \nThe certification of Ch2M Hill Engineers and the above companies was in good standing at the time the bid was awarded.\n \n 5. FISCAL IMPACT\nFunds are available, appropriated, and budgeted within the Sanitary Bond Fund, Fund 6109, for this expenditure.\n \n6.  EMERGENCY DESIGNATION \nEmergency designation is requested for this ordinance.  This contract is required to comply with a consent order regarding sanitary sewers.   \n \nTitle\nTo authorize the Director of Public Utilities to modify and increase the contract with CH2M Hill Engineers for the Blueprint Hilltop - Palmetto/Westgate Project; to authorize an expenditure of up to $605,583.00 within the Sanitary G. O. Bond Fund to pay for the contract modification; and to declare an emergency.  ($605,583.00)\n \nBody\nWHEREAS, the Department of Public Utilities is engaged in the Blueprint Hilltop - Palmetto/Westgate Project; and\n \nWHEREAS, Contract No. PO002730 was authorized by Ordinance No. 2560-2015, for the Blueprint Hilltop - Palmetto/Westgate Project; and\n \nWHEREAS, Contract Renewal #1 PO188236; PO189731 was authorized by Ordinance No. 1744-2017, was needed for detailed design and bidding services; and\n \nWHEREAS, a planned contract modification is needed for engineering services during construction; and\n \nWHEREAS, it is necessary for Council to authorize the Director of Public Utilities to modify the professional engineering services agreement with CH2M Hill Engineers, Inc. for the Blueprint Hilltop - Palmetto/Westgate Project; and \n \nWHEREAS, it is necessary to expend funds from the Sanitary Bond Fund to pay for the contract modification; \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Utilities in that it is immediately necessary to execute the contract modification to allow compliance with a consent order concerning sanitary sewers, thereby preserving the public health, peace, property, safety, and welfare; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Utilities is hereby authorized to modify and increase the professional engineering services contract with CH2M Hill Engineers, Inc., 2 Easton Oval Suite# 500\nColumbus, OH 43219; for Blueprint Hilltop - Palmetto/Westgate Project, in an amount up to $605,583.00.\n \nSECTION 2.  That an expenditure of $605,583.00, or so much thereof as may be needed, is hereby authorized from the Sanitary Bond Fund, Fund 6109, to pay for this contract modification per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 6.  That for the reasons stated in the preamble hereto, which is made a part hereof, this Ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten (10) days after passage if the Mayor neither approves nor vetoes this Ordinance.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 84,
    "meeting_date": "2023-07-17",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}