{
  "success": true,
  "vote": {
    "id": 7115,
    "item_number": "CA-29",
    "title": "To authorize the Director of the Department of Building and Zoning Services to refund overpayments to MS Consultants, Inc. for building permits; and to authorize an expenditure in the Development Services Fund for that purpose. ($84,361.60)",
    "description": "Explanation\n \nBACKGROUND\nThe purpose of this ordinance is to authorize an expenditure to return funds overpaid by MS Consultants, Inc. to the City of Columbus’ Department of Building and Zoning Services for permits. In 2022, MS Consultants electronically submitted two commercial alteration permits indicating the area of work as the entire building. These calculations billed the maximum fee of $50,000.00 each for a total of $100,000.00, which MS Consultants paid. Upon further review, the department found that the actual square footage of work for each permit was much less, and the charges for the permits should have been $6,518.00 and $6,514.00 respectively. The Director of the Department of Building and Zoning Services desires to refund this overpayment less an administrative fee equal to 20% of the value of the permits.\nNo vendor or individual business relationship is established by this legislation.\nFISCAL IMPACT\nFunding in the amount of $84,361.60 is available in Fund 2240, the Development Services Fund, to refund this overpayment to MS Consultants, Inc.\n \nTitle\n \nTo authorize the Director of the Department of Building and Zoning Services to refund overpayments to MS Consultants, Inc. for building permits; and to authorize an expenditure in the Development Services Fund for that purpose. ($84,361.60)\n \nBody\n \nWHEREAS, the Department of Building and Zoning Services has determined that MS Consultants, Inc. overpaid for two building permits by $84,361.60; and\nWHEREAS, the Director of the Department of Building and Zoning Services desires to return this overpayment to MS Consultants, Inc., less an administrative fee equal to 20% of the value of the permits, as permitted and provided by Columbus City Code Section 4113.19; and \nWHEREAS, this Ordinance authorizes the return of the aforementioned sum to MS Consultants, Inc in accordance with the department’s refund policy; and \nWHEREAS, funds for this expense are available in the Development Services Fund; now therefore\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1. That the Director of the Department of Building and Zoning Services is authorized to refund to MS Consultants, Inc. the sum of $84,361.60, which is the amount it overpaid for two building permits, as permitted and provided by CCC Section 4113.19.\nSECTION 2.  That the expenditure of $84,361.60, or so much thereof as may be needed, is authorized in Fund 2240 (Development Services Fund), Dept-Div 43-01 (Division of Building and Zoning), in Object Class 05 (Other) per the account codes in the attachment to this Ordinance.\nSECTION 3. That expenditures are authorized to carry out the purposes of this Ordinance.\nSECTION 4. That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 84,
    "meeting_date": "2023-07-17",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Planning & Development"
    ]
  }
}