{
  "success": true,
  "vote": {
    "id": 714,
    "item_number": "3",
    "title": "To recognize and applaud Hope For The Day and thank the organization for their advocacy and outreach - empowering and educating communities with proactive conversations regarding mental health and suicide prevention.",
    "description": "Title\n \nTo recognize and applaud Hope For The Day and thank the organization for their advocacy and outreach - empowering and educating communities with proactive conversations regarding mental health and suicide prevention. \n \nBody\n \nWHEREAS, September is known globally as “Suicide Prevention Month”, the National Suicide Prevention + Action Month Proclamation was created to raise the visibility of the mental health resources and suicide prevention services available in our community - the goal is to speak openly about the importance of mental health and the impacts of suicide to help remove the surrounding stigmas, and to direct those in need to the appropriate support services; and  \n \nWHEREAS, The National Suicide Prevention + Action Month Proclamation (NSPAMP), created by the United City of Yorkville's Alderman Joel Frieders, as an annual proclamation to start  the conversation around suicide and mental health in cities around the country  and empowers them to share national and local suicide prevention and mental health resources and information; and  \n \nWHEREAS, The NSPAMP has been adopted by over 400 cities and 40 counties in 39 different states and has been read by elected officials representing millions of Americans: and  \n \nWHEREAS, suicidal thoughts can affect anyone regardless of age, gender, race, orientation, income level, religion, or background; and according to the American Foundation for Suicide Prevention (AFSP), Suicide is the 10th leading cause of death among adults, and the 2nd leading cause of death among individuals between the ages of 10 and 34 in the US; and  \n \nWHEREAS, more than 47,000 people died by suicide across the United States in 2017, which, according to the CDC, was more than twice the number of homicides, with an average of 129 suicides completed daily, which includes active military and veterans accounting for 13.5% of all suicides nationally: and  \n \nWHEREAS, each and every suicide directly impacts a minimum of 100 individuals, including family, friends, co-workers, neighbors, and community members: and  \n \nWHEREAS, global organizations like Hope For The Day (HFTD) and our local partners,  like NAMI Franklin County and others are on the front lines of a war that many still refuse to discuss, as suicide and mental health remain too uncomfortable to talk about; and  \n \nWHEREAS, every member of our community should understand that throughout life’s struggles we all need the occasional reminder that we are all fighting our own battles; and  \n \nWHEREAS,  this Council encourages each resident to take the time to check in with their family, friends, and neighbors on a regular basis and to honestly communicate their appreciation for their existence by any gesture they deem appropriate. A simple phone call, message, handshake, or hug can go a long way towards helping someone realize that suicide is not the answer; now, therefore,  \n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: \n \nThat this Council does recognize and applaud Hope For The Day and thank the organization for their advocacy and outreach - empowering and educating communities with proactive conversations regarding mental health and suicide prevention.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 12,
    "meeting_date": "2021-04-26",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Health & Safety",
      "Ordinances & Resolutions"
    ]
  }
}