{
  "success": true,
  "vote": {
    "id": 7188,
    "item_number": "CA-10",
    "title": "To amend Ordinance No. 3097-2015 to add the former Kroger Bakery and Ford Motor Company Branch Assembly Plant site and other parcels surrounding the existing Milo-Grogan TIF to that TIF area; to declare the nonresidential improvements to said parcels to be a public purpose and exempt from real property taxation for the same exemption percentage and term as the existing Milo-Grogan TIF parcels; to require the owner(s) of said parcels to make service payments in lieu of taxes; to require the distribution of the applicable portion of those service payments to the Columbus City School District; and to deposit the remainder of those service payments into the Milo-Grogan TIF Fund and used to finance certain public infrastructure improvements as provided by R.C. 5709.40(A)(8).",
    "description": "Explanation\n \nBackground: Around the time Rogue Fitness planned to consolidate production and administrative operations at the former Timken Co. site southwest of Cleveland Avenue and 5th Avenue, City Council passed Ordinance No. 3097-2015 (the “Original TIF Ordinance”) on December 14, 2015 to establish a non-school tax increment financing (TIF) area pursuant to R.C. Section 5709.40(B) on the Timken Co. site and in the vicinity of the Milo-Grogan neighborhood (the “Milo-Grogan TIF”). The non-school portion of those service payments in lieu of taxes (the “Service Payments”) paid to the City for deposit into the Milo-Grogan TIF Fund created by the Original TIF Ordinance are to be used to finance public infrastructure improvements benefiting the Milo-Grogan TIF parcels in anticipation of new developments around the neighborhood. The Service Payments were previously authorized by Ordinance No. 1417-2021, passed on June 15, 2021 by City Council, to finance approximately $145,000 of now completed new public sidewalk and street tree installation along Reynolds Avenue east of Cleveland Avenue to support a new 192-unit multi-family project and the existing single family homes adjacent to it. \n \nNow, Half Baked Holdings, LLC (the “Developer”) is redeveloping the former Kroger Bakery site on Cleveland Avenue (the “Site”) directly south of the Milo-Grogan TIF into a mixed-use development which the Developer expects to consist of approximately 40,300 square feet of office, 9,600 square feet of retail, 363 multi-family units, 401 garage parking spaces, and an urban green space (collectively, the “Project”). Pursuant to Ordinance No. 0508-2021 passed on March 8, 2021 by City Council, the City entered the southern manufacturing building on the Site, which is also the former Ford Motor Company Branch Assembly Plant, on the Columbus Register of Historic Properties. \n \nTo further support the preservation of the now vacant, historical Site, and repurposing it for the Project, this ordinance will amend the Original TIF Ordinance and declare non-residential improvements to certain parcels of real property to be a public purpose by adding the Site and other parcels surrounding the Milo-Grogan TIF to the same 30-year, 100% exemption term as the currently exempted parcels under the Original TIF Ordinance. The Columbus City School District will receive, in the same manner, as provided in Original TIF Ordinance, all amounts that it would have received in real property taxes had the Milo-Grogan TIF exemption not been granted for the improvements on the Site and other surrounding parcels. The City is submitting a separate ordinance for City Council consideration to authorize the City to enter into a TIF Agreement with the Developer, to use the Service Payments for the reimbursement of certain public infrastructure improvements, as defined by R.C. 5709.40(A)(8).\n \nFiscal Impact: No funding is required for this legislation.  The City is foregoing real property tax revenue that it would have received from the redevelopment of the Site and other parcels surrounding the existing Milo-Grogan TIF parcels. Instead, the non-school portion of that revenue will be diverted to the Milo-Grogan TIF Fund.\n \n \n \nTitle\n \nTo amend Ordinance No. 3097-2015 to add the former Kroger Bakery and Ford Motor Company Branch Assembly Plant site and other parcels surrounding the existing Milo-Grogan TIF to that TIF area; to declare the nonresidential improvements to said parcels to be a public purpose and exempt from real property taxation for the same exemption percentage and term as the existing Milo-Grogan TIF parcels; to require the owner(s) of said parcels to make service payments in lieu of taxes; to require the distribution of the applicable portion of those service payments to the Columbus City School District; and to deposit the remainder of those service payments into the Milo-Grogan TIF Fund and used to finance certain public infrastructure improvements as provided by R.C. 5709.40(A)(8).\n \n \nBody\n \nWHEREAS, pursuant to R.C. Section 5709.40(B) and Ordinance No. 3097-2015 (the “Original TIF Ordinance”) passed December 14, 2015, City Council established a non-school tax increment financing (TIF) area generally bounded on all sides by the railroads surrounding the Milo-Grogan neighborhood (the “Milo-Grogan TIF”); and\n \nWHEREAS, directly south of the Milo-Grogan TIF, Half Baked Holdings, LLC (the “Developer”) is redeveloping the former Kroger Bakery site on Cleveland Avenue (the “Site”) into a mixed-use development that the Developer expects to consist of approximately 40,300 square feet of office, 9,600 square feet of retail, 363 multi-family units, 401 garage parking spaces, and an urban green space (collectively, the “Project”); and\n \nWHEREAS, Ordinance No. 0508-2021, passed on March 8, 2021 by City Council, authorized the City to enter the southern manufacturing building on the Site, which is also the former Ford Motor Company Branch Assembly Plant, on the Columbus Register of Historic Properties; and\n \nWHEREAS, to help preserve the historic Site and repurpose it for the Project, the City is requesting to amend the Original TIF Ordinance to add the Site and certain additional surrounding parcels as depicted on Exhibit A attached hereto (collectively, the “Additional TIF Parcels”) to the existing Milo-Grogan TIF to receive a one-hundred percent exemption on the nonresidential improvements to the Additional TIF Parcels for the same thirty-year exemption term as the existing parcels of the Milo-Grogan TIF (with each of the Additional TIF Parcels now being included as a “Parcel” and collectively included with the “Parcels” as defined in and for purposes of the Original TIF Ordinance and this Ordinance); and\n \nWHEREAS, the City has determined that the applicable portion of the service payments in lieu of taxes shall be paid directly to the Columbus City School District (the “School District”) in an amount equal to the real property taxes that the School District would have been paid if the nonresidential improvements to the Parcels had not been exempted from taxation; and\n \nWHEREAS, the remaining non-school service payments in lieu of taxes from the Additional TIF Parcels (the “Service Payments”) will be distributed to the City for deposit into the tax increment equivalent fund created for the Milo-Grogan TIF by the Original TIF Ordinance (the “Milo-Grogan TIF Fund”) to be used for certain public infrastructure improvements, as defined in R.C. 5709.40(A)(8); and\n \nWHEREAS, notice of this proposed legislation has been delivered to the School District in accordance with and within the time periods prescribed in R.C. Sections 5709.40 and 5709.83, as applicable; and\n \nWHEREAS, the City is submitting a separate ordinance for City Council consideration to authorize the City to enter into a TIF Agreement with the Developer to use the non-school Service Payments from the Parcels for the reimbursement of certain public infrastructure improvements, as defined by R.C. 5709.40(A)(8), thereby preserving the public health, peace, safety and welfare; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                      Amendment to the Original TIF Ordinance.  This Council finds and declares that one hundred percent (100%) of the increase in assessed value of each Additional TIF Parcel as identified in Exhibit A, attached hereto and incorporated herein, subsequent to the effective date of this Ordinance (which increase in assessed value is hereinafter referred to as the “Improvement,” as defined in Section 5709.40(A) of the Ohio Revised Code) to be a public purpose and shall be exempt from taxation for a period commencing with the first tax year that begins after the effective date of this Ordinance and in which an Improvement first appears on the tax list and duplicate. Pursuant to this finding, Exhibit A to the Original TIF Ordinance, is repealed and replaced with Exhibit A attached hereto, to add the Additional TIF Parcels to the Milo-Grogan TIF (collectively, the “Parcels”).\n \nSECTION 2.                      Parcels of the Milo-Grogan TIF.  In consideration of Section 1 above, this Council finds and determines that the Improvements to the Parcels, shall receive the same 100% exemption and 30-year term as the currently exempted parcels under the Original TIF Ordinance. Additionally, such exemption and the payment obligations for the Parcels are subject and subordinate to any tax exemption applicable to the Improvement pursuant to Section 140.08 or Section 5709.12 and 5709.121 or under Sections 3735.65 through 3735.70 or Sections 5709.61 through 5709.69 or Section 5709.87 of the Ohio Revised Code.\n \nSECTION 3.  Milo-Grogan TIF Fund. The non-school Service Payments from the Parcels shall be distributed to the City for deposit into the Milo-Grogan TIF Fund, along with the existing collection of non-school service payments in lieu of taxes in that fund, to be used for the costs of certain public infrastructure improvements benefiting the Site and Project, as defined in R.C. 5709.40(A)(8).\n \nSECTION 4                     No Other Modifications.  That except as provided herein, all other provisions of the Original TIF Ordinance shall remain in full force and effect. It is the intent of this Council that the Original TIF Ordinance and this Ordinance be construed together as a single instrument.\n \nSECTION 5.                     Further Authorizations.  This Council ratifies the delivery of the notice of this Ordinance to the School District pursuant to Section 5709.40 and Section 5709.83 of the Ohio Revised Code; hereby authorizes and directs the Director of the Department of Development, the City Clerk, or other appropriate officers of the City or their designees to deliver a copy of this Ordinance and status reports to the Ohio Department of Development pursuant to R.C. Section 5709.40(I); to make such arrangements as are necessary and proper for the collection of the service payments in lieu of taxes from the TIF Parcels; and further authorizes those same officials of the City and their designees to execute such other agreements and instruments and to take all actions necessary to implement this Ordinance.\n \nSECTION 6.                     Effective Date.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 85,
    "meeting_date": "2023-07-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Economic Development",
      "Housing"
    ]
  }
}