{
  "success": true,
  "vote": {
    "id": 7194,
    "item_number": "CA-16",
    "title": "To authorize the Director of the Department of Technology to enter into a renewal of the previous contract with Softchoice LLC for Cisco SmartNet maintenance services, to authorize the expenditure of $298,036.80 from the Department of Technology, Information Services Division, Information Services Operating Fund; and to declare an emergency. ($298,036.80)",
    "description": "Explanation\nThis legislation authorizes the Director of the Department of Technology (DoT) to enter into contract renewal with Softchoice LLC for Cisco SmartNet maintenance services to support citywide Metronet hardware. The Metronet is a critical component of the computing infrastructure of the city. SmartNet supports data transfer needs for imaging applications as well as other city applications such as e-mail, CUBS (utility billing), purchasing/procurement/accounting systems, payroll/personnel, VOIP telephone service, WiFi access, and geographic information systems (GIS).\nRFQ019686, was previously awarded to Softchoice LLC in 2021 for $236,597.59. The term of the original contract was one year with options to renew for three (3) additional one-year terms. The cost for this year’s Cisco SmartNet maintenance services is $298,036.80. This ordinance represents the second of the three (3) additional one-year renewal options, beginning on September 20, 2023 and ending on September 19, 2024. This contract is not subject to automatic renewal, however upon mutual agreement and authorized appropriation, it may be renewed for one (1) additional one-year term. This ordinance also authorizes the expenditure of $298,036.80 for the above-described purpose. The original ordinance authorizing these renewals was 2509-2021. \nEMERGENCY DESIGNATION\nEmergency action is requested to avoid disruptions to the above-described systems.\nFISCAL IMPACT:\nFunding for this renewal is budgeted and is available within the Department of Technology, Information Services Division, Information Services Operating Fund and other fund agencies' direct charge budgets within DoT.\nCONTRACT COMPLIANCE NUMBER:\nVendor: Softchoice, LLC\nVendor #: 022312, Expiration Date: 2/4/2024\n \n \nTitle\nTo authorize the Director of the Department of Technology to enter into a renewal of the previous contract with Softchoice LLC for Cisco SmartNet maintenance services, to authorize the expenditure of $298,036.80 from the Department of Technology, Information Services Division, Information Services Operating Fund; and to declare an emergency. ($298,036.80)\n \nBody\nWHEREAS, there is a need for Cisco SmartNet maintenance services to support the citywide Metronet hardware; and\nWHEREAS, Softchoice submitted the lowest, responsive bid for the above stated services; and\nWHEREAS, the term of this contract renewal will be for one year, from September 20, 2023 and ending on September 19, 2024; and\nWHEREAS, this contract is not subject to automatic renewal, however upon mutual agreement and authorized appropriation, may be renewed for one (1) additional one-year terms; and\nWHEREAS, the total cost of this contract is $298,036.80; and\nWHEREAS, an emergency exists in the usual daily operation of the Department of Technology in that it is immediately necessary to authorize the Director of Technology to enter into contract renewal with Softchoice LLC for Cisco SmartNet hardware maintenance services to avoid disruption in services, these services support the citywide Metronet Hardware, a critical component of the computing infrastructure of the city, all for the immediate preservation of the public health, peace, property, safety, and welfare; and NOW THEREFORE, \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1: That the Director of the Department of Technology be and is hereby authorized to enter into a contract renewal with Softchoice LLC for the purchase of Cisco SmartNet hardware maintenance support services, in the amount of $298,036.80 for a one (1) year term, starting on September 20, 2023 and ending on September 19, 2024.\nSECTION 2: That the expenditure of $298,036.80, or so much thereof as may be necessary, is hereby authorized to be expended as shown in the attachment to this ordinance (please see attachment 2116-2023XP).\nSECTION 3: That the City Auditor is authorized to make any changes to revise the funding source for any contract renewal or contract modifications associated with this ordinance.\nSECTION 4: That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\nSECTION 5: That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 85,
    "meeting_date": "2023-07-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}