{
  "success": true,
  "vote": {
    "id": 7199,
    "item_number": "CA-21",
    "title": "To authorize the Director of the Department of Public Service to execute those documents necessary for the transfer of 0.005 acre portion of right-of-way adjacent to 1355 N High Street to VERVE Columbus. ($8,720.00)",
    "description": "Explanation\n \n1. Background:\nThe City of Columbus, Department of Public Service, received a request from VERVE Columbus asking that the City sell them a 218 square foot (0.005 acre) portion of right-of-way adjacent to 1355 N High Street. The right-of-way area is located on King Avenue on the northern side of the parcel.  It runs west to east directionally with a slight southern tilt from west to east for 76 feet and is 3 feet in width (north to south).  It is adjacent at the northwest corner of the parcel 010-011228.  \n \nSale of this right-of-way will facilitate the construction of pedestrian ramps to accommodate accessible entrances to the historically preserved townhouses located at the northwest corner of the parcel.  The Department of Public Service has agreed to sell the right-of-way as described and shown within attached legal description and exhibit, and extinguishes its need for this public right-of-way.  \n \nPer current practice, comments were solicited from interested parties, including City agencies, private utilities and the applicable area commission, before it was determined that, subject to the retention of a general utility easement for those utilities currently located within this right-of-way, the City will not be adversely affected by the transfer of this right-of-way.  \n \nThe Department of Public Service submitted a request to the City Attorney’s Office, asking that they establish a value for this right-of-way, and a value of $8,720.00 was established.  \n \nThis request went before the Land Review Commission on May 18, 2023.  After review of the request, the Land Review Commission voted to recommend the above referenced right-of-way be transferred to VERVE Columbus at the cost of $8,720.00 to them.\n \n2. FISCAL IMPACT:\nThe City will receive a total of $8,720.00 and the funds are to be deposited in Fund 7748, Project P537650, as consideration for the transfer of the requested right-of-way.\n \nTitle\n \nTo authorize the Director of the Department of Public Service to execute those documents necessary for the transfer of 0.005 acre portion of right-of-way adjacent to 1355 N High Street to VERVE Columbus. ($8,720.00)\n \nBody\n \nWHEREAS, the City of Columbus, Department of Public Service, received a request from VERVE Columbus asking that the City sell them a 218 square foot (0.005 acre) portion of right-of-way adjacent to 1355 N High Street. The right-of-way area is located on King Avenue on the northern side of the parcel.  It runs west to east directionally with a slight southern tilt from west to east for 76 feet and is 3 feet in width (north to south).  It is adjacent at the northwest corner of the parcel 010-011228; and \n \nWHEREAS, the purpose of the transfer is to facilitate the construction of pedestrian ramps to accommodate accessible entrances to the historically preserved townhouses located at the northwest corner of the parcel; and\n \nWHEREAS, the Department of Public Service has agreed to sell the right-of-way as described and shown within attached legal description and exhibit, and extinguishes its need for this public right-of-way; and\n \nWHEREAS, per current practice, comments were solicited from interested parties, including City agencies, private utilities and the applicable area commission, before it was determined that, subject to the retention of a general utility easement for those utilities currently located within this right-of-way, the City will not be adversely affected by the transfer of this right-of-way; and\n \nWHEREAS, the Department of Public Service submitted a request to the City Attorney’s Office, asking that they establish a value for this right-of-way; and\n \nWHEREAS, a value of $8,720.00 was established; and\n \nWHEREAS, this request went before the Land Review Commission on May 18, 2023; and\n \nWHEREAS, after review of the request, the Land Review Commission voted to recommend the above referenced right-of-way be transferred to VERVE Columbus at the cost of $8,720.00 to them; now, therefore\n \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.    That the Director of the Department of Public Service be and is hereby authorized to execute a quit claim deed and other incidental instruments prepared by the City Attorney’s Office, necessary to transfer the legal description as described below and attached exhibit of right-of-way to VERVE Columbus.\n \nSECTION 2.    That the attached referenced real property shall be considered excess road right-of-way and the public rights therein shall terminate upon the Director's execution and delivery of said quitclaim deed to the grantee thereof.\n \nSECTION 3.    That a general utility easement in, on, over, across and through the attached legal description and exhibit describing the right-of-way shall be and hereby is retained unto the City of Columbus for those utilities located within said right-of-way.\n \nSECTION 4.    That upon notification and verification of the relocation of all utilities located within the retained general utility easement area the Director of the Department of Public Service is hereby authorized to execute those documents necessary to release the retained general utility easement with no additional compensation due to the City and with no further legislative action required by the City.\n \nSECTION 5.    That the City will receive a total of $8,720.00, to be deposited in Fund 7748, Project P537650\n \nSECTION 6.    That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 85,
    "meeting_date": "2023-07-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Property & Real Estate",
      "Public Works"
    ]
  }
}