{
  "success": true,
  "vote": {
    "id": 7200,
    "item_number": "CA-22",
    "title": "To authorize the Director of the Department of Public Service to execute those documents necessary for the transfer of 0.062 acre  portion of the Americus Alley right-of-way to 1199 Cleveland, LLC. ($10,800.00)",
    "description": "Explanation\n \n1. Background:\nThe City of Columbus, Department of Public Service, received a request from 1199 Cleveland, LLC asking that the City transfer them a 2,700 square foot (0.062 acre) portion of the Americus Alley right-of-way.  The right-of-way area is adjacent to 1199 Cleveland Ave (PID 010-046409, 010-042193, 010-042192, and 010-062818).  The portion runs north/east directionally for 135+/- feet and is 20’ in width.  Essex Avenue is adjacent to the west of the portion and Lockwin Avenue is adjacent to the east of the portion. \n \nTransfer of this right-of-way will be to allow incorporation of the requested portion with the adjacent parcels.  Currently, the right-of-way splits the four parcels that the applicant owns.  The Department of Public Service has agreed to transfer the right-of-way as described and shown within attached legal description and exhibit, and extinguishes its need for this public right-of-way.  \n \nPer current practice, comments were solicited from interested parties, including City agencies, private utilities and the applicable area commission, before it was determined that, subject to the retention of a general utility easement for those utilities currently located within this right-of-way, the City will not be adversely affected by the transfer of this right-of-way.  \n \nThe Department of Public Service submitted a request to the City Attorney’s Office, asking that they establish a value for this right-of-way, and a value of $10,800.00 was established.  \n \nThis request went before the Land Review Commission on March 16, 2023.  After review of the request, the Land Review Commission voted to recommend the above referenced right-of-way be transferred to 1199 Cleveland, LLC at the cost of $10,800.00 to them.\n \n2. FISCAL IMPACT:\nThe City will receive a total of $10,800.00 and the funds are to be deposited in Fund 7748, Project P537650, as consideration for the transfer of the requested right-of-way.\n \nTitle\n \nTo authorize the Director of the Department of Public Service to execute those documents necessary for the transfer of 0.062 acre  portion of the Americus Alley right-of-way to 1199 Cleveland, LLC. ($10,800.00)\n \nBody\n \nWHEREAS, the City of Columbus, Department of Public Service, received a request from 1199 Cleveland, LLC asking that the City transfer them a 2,700 square foot (0.062 acre) portion of the Americus Alley right-of-way.  The right-of-way area is adjacent to 1199 Cleveland Ave (PID 010-046409, 010-042193, 010-042192, and 010-062818).  The portion runs north/east directionally for 135+/- feet and is 20’ in width.  Essex Avenue is adjacent to the west of the portion and Lockwin Avenue is adjacent to the east of the portion; and \n \nWHEREAS, transfer of this right-of-way will be to allow incorporation of the requested portion with the adjacent parcels.  Currently, the right-of-way splits the four parcels that the applicant owns; and\n \nWHEREAS, the Department of Public Service has agreed to transfer the right-of-way as described and shown within attached legal description and exhibit, and extinguishes its need for this public right-of-way; and\n \nWHEREAS, per current practice, comments were solicited from interested parties, including City agencies, private utilities and the applicable area commission, before it was determined that, subject to the retention of a general utility easement for those utilities currently located within this right-of-way, the City will not be adversely affected by the transfer of this right-of-way; and\n \nWHEREAS, the Department of Public Service submitted a request to the City Attorney’s Office, asking that they establish a value for this right-of-way; and\n \nWHEREAS, a value of $10,800.00 was established; and\n \nWHEREAS, this request went before the Land Review Commission on March 16, 2023; and\n \nWHEREAS, after review of the request, the Land Review Commission voted to recommend the above referenced right-of-way be transferred to 1199 Cleveland, LLC at the cost of $10,800.00; now, therefore\n \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.    That the Director of the Department of Public Service be and is hereby authorized to execute a quit claim deed and other incidental instruments prepared by the City Attorney’s Office, necessary to transfer the legal description as described below and attached exhibit of right-of-way to 1199 Cleveland, LLC.\n \nSECTION 2.    That the attached referenced real property shall be considered excess road right-of-way and the public rights therein shall terminate upon the Director's execution and delivery of said quitclaim deed to the grantee thereof.\n \nSECTION 3.    That a general utility easement in, on, over, across and through the attached legal description and exhibit describing the right-of-way shall be and hereby is retained unto the City of Columbus for those utilities located within said right-of-way.\n \nSECTION 4.    That upon notification and verification of the relocation of all utilities located within the retained general utility easement area the Director of the Department of Public Service is hereby authorized to execute those documents necessary to release the retained general utility easement with no additional compensation due to the City and with no further legislative action required by the City.\n \nSECTION 5.    That the City will receive a total of $10,800.00, to be deposited in Fund 7748, Project P537650.\n \nSECTION 6.    That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 85,
    "meeting_date": "2023-07-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Property & Real Estate",
      "Public Works"
    ]
  }
}