{
  "success": true,
  "vote": {
    "id": 723,
    "item_number": "CA-8",
    "title": "To authorize the Finance and Management Director to enter into two (2) contracts for the option to purchase Sporting Goods and Recreational Supplies with S&S Worldwide Inc. and Varsity Brands Holding Co Inc., Dba BSN Sports, LLC; to authorize the expenditure of $2.00 from General Budget Reservation BRPO001670; and to declare an emergency. ($2.00).",
    "description": "Explanation\n \nBACKGROUND:  This legislation authorizes the Finance and Management Director to establish two (2) Universal Term Contracts (UTC) for the option to purchase Sporting Goods and Recreational Supplies with S&S Worldwide Inc. and Varsity Brands Holding Co Inc. Dba BSN Sports LLC.  The Department of Recreation and Parks is the primary user for Sporting Goods and Recreational Supplies.  The contracts provide equipment in Recreation Centers and Sports Leagues throughout the City of Columbus.  The term of the proposed option contracts would be approximately three (3) years, expiring March 31, 2024 with the option to renew for one (1) additional year.  The Purchasing Office opened formal bids on March 11, 2021.   In addition, the expenditure of $2.00 is hereby authorized from General Budget Reservation BRPO001670.                     \n \nThe Purchasing Office advertised and solicited competitive bids in accordance with the relevant provisions of Section 329 relating to competitive bidding (Request for Quotation No. RFQ017863).    Two (2) bids were received.  \n \nThe Purchasing Office is recommending award to the overall lowest, responsive, responsible and best bidders as follows:\n \nS&S Worldwide Inc., CC# 000338 expires 02/15/2023, All Items and catalog, $1.00\nVarsity Brands Holding Co Inc. Dba BSN Sports LLC, CC#012290 expires 3/31/2023, All Items and catalog, $1.00\nTotal Estimated Annual Expenditure: $125,000, Department of Recreation and Parks, the primary user.\n \nEmergency Designation:  The Finance and Management Department respectfully requests this legislation to be considered an emergency ordinance because the current contract expires on March 31, 2021.\n \nThese companies are not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.   \n \nFISCAL IMPACT: The expenditure of $2.00 is hereby authorized from General Budget Reservation BRPO001670.  City Agencies will be required to obtain approval to expend from their own appropriations for their estimated annual expenditures. \n \n \nTitle\n \nTo authorize the Finance and Management Director to enter into two (2) contracts for the option to purchase Sporting Goods and Recreational Supplies with S&S Worldwide Inc. and Varsity Brands Holding Co Inc., Dba BSN Sports, LLC; to authorize the expenditure of $2.00 from General Budget Reservation BRPO001670; and to declare an emergency. ($2.00).\n \n \nBody\n \nWHEREAS, the Sporting Goods and Recreational Supplies UTC will provide for the purchase of sporting goods and recreational supplies used to for the recreation centers and sports leagues throughout the City of Columbus; and,  \n \nWHEREAS, the Purchasing Office advertised and solicited formal bids on March 11, 2021 and selected the overall lowest, responsive, responsible and best bidders; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Recreation and Parks Department in that it is immediately necessary to authorize the Finance and Management Director to enter into a Universal Term Contract for the option to purchase Sporting Goods and Recreation Supplies so supplies are not interrupted, thereby preserving the public health, peace, property, safety, and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Finance and Management Director is hereby authorized to enter into the following contracts for the option to purchase of Sporting Goods and Recreational Supplies in accordance with Request for Quotation RFQ017863 for a term of approximately three (3) years, expiring March 31, 2024, with the option to renew for one (1) additional year, as follows:\n \nS&S Worldwide Inc., All Items and catalog, $1.00\nVarsity Brands Holding Co Inc. Dba BSN Sports LLC, All Items and catalog, $1.00\n \nSECTION 2. That the expenditure of $2.00 is hereby authorized from General Budget Reservation BRPO001670 of this ordinance to pay the cost thereof.\n \nSECTION 3.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That for the reason stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 12,
    "meeting_date": "2021-04-26",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}