{
  "success": true,
  "vote": {
    "id": 7265,
    "item_number": "SR-15",
    "title": "To amend the 2023 Capital Improvement Budget; to authorize the transfer of funds and appropriation within the Streets and Highways Bond Fund; to authorize the Director of Public Service to pay utility relocation costs to various utilities for the North Market Streetscape - Utility Relocation Design project; and to authorize the expenditure of up to $4,700,000.00 for utility relocations for this project.  ($4,700,000.00)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes payment for utility relocation work as needed by American Electric Power, AT&T, Spectrum (aka Charter Communications), Verizon, and other utilities (or companies hired by utilities to perform utility relocation work) for the North Market Streetscape - Utility Relocation Design project in an amount up to $4,700,000.00.\n \nThe Public Service Department is engaged in the North Market Streetscape - Utility Relocation Design project.  This project consists of the relocation of public utilities in the Arena and Convention Center Districts. Existing aerial facilities will be relocated underground on Vine Street, Spruce Street, Park Street, and Swan Street. A joint user duct bank system will be installed to relocate private utilities underground. Improvements also include the replacement of water main in Armstrong Street and Park Street, resurfacing, replacing sidewalks, and street lights.\n \nIn the course of effecting roadway improvements, it is sometimes necessary to force the relocation of utilities from privately held easements or place overhead utilities underground to promote public health, safety and welfare including the economic development of the City.  It is necessary to move utilities to complete this project. \n \nThe funding request for utilities relocation reimbursement is based upon estimates from the utilities.  The utilities will invoice the City for actual costs incurred in relocating the utilities.  The amount needed may exceed the amount requested in this ordinance.  Additional legislation will be submitted by the Department of Public Service if additional funds are needed to complete the relocations.     \n2.  FISCAL IMPACT\nFunding in the amount of $4,700,000.00 is available within the Streets and Highways Bond Fund within the Department of Public Service.  An amendment to the 2023 Capital Improvements Budget and a transfer of funds and appropriation are necessary to align funding for these project expenditures. Funds are appropriated.\n \nTitle\nTo amend the 2023 Capital Improvement Budget; to authorize the transfer of funds and appropriation within the Streets and Highways Bond Fund; to authorize the Director of Public Service to pay utility relocation costs to various utilities for the North Market Streetscape - Utility Relocation Design project; and to authorize the expenditure of up to $4,700,000.00 for utility relocations for this project.  ($4,700,000.00)\n \nBody\nWHEREAS, the City of Columbus is concerned with the use of the various rights-of-way areas in the City as such rights-of-way areas represent a valuable and limited resource that must be utilized to promote the public health, safety and welfare including the economic development of the City; and\n \nWHEREAS, utility relocations must be completed before construction can begin; and\n \nWHEREAS, the Department of Public Service requires funding to be available for utility relocation expenses for the North Market Streetscape - Utility Relocation Design project; and \n \nWHEREAS, this ordinance authorizes funding in the amount of $4,700,000.00 for that purpose; and\n \nWHEREAS, it is necessary to authorize an amendment to the 2023 Capital Improvement Budget for the purpose of providing sufficient spending authority for the aforementioned project expenditure; and\n \nWHEREAS, it is necessary for Council to authorize a transfer of funds and appropriation within Fund 7704, the Streets and Highways Bond Fund, to establish sufficient cash to pay for the project; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2023 Capital Improvements Budget authorized by ordinance 1711-2023 be amended as follows to establish  sufficient authority for this project:\n \nFund / Project / Project Name / C.I.B. / Change / C.I.B. as Amended\n7704 / P530282-100051 / 59-03 Resurfacing (Voted Carryover) / $3,492,421 / $2,557,172.00 / $6,049,593\n(to match cash)\n \n7704 / P530282-100051 / Resurfacing - Resurfacing Projects (Voted Carryover) / $6,049,593 / ($2,394,005.00) / $3,655,588\n7704 / P440005-100000 / UIRF - Urban Infrastructure Recovery Fund (59-12)  (Voted Carryover) / $5,234,279.00 / ($1,200,000.00) / $4,034,279.00\n \n7704 / P441768-100001 / North Market Streetscape - Utility Relocation Design (Voted Carryover) /$0.00 / $4,700,000.00 / $4,700,000.00\n \nSECTION 2.  That the transfer of $1,105,995.00, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5911 (Infrastructure Management), Project P530282-100000 (59-03 Resurfacing), Object Class 06 (Capital Outlay) to Dept-Div 5912 (Design and Construction), Project P441768-100001 (North Market Streetscape - Utility Relocation Design), Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That the transfer of $2,394,005.00, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5911 (Infrastructure Management), Project P530282-100051 (Resurfacing - Resurfacing Projects), Object Class 06 (Capital Outlay) to Dept-Div 5912 (Design and Construction), Project P441768-100001 (North Market Streetscape - Utility Relocation Design), Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\n \nSECTION 4.  That the transfer of $1,200,000.00, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5912 (Design and Construction), Project P440005-100000 (UIRF - Urban Infrastructure Recovery Fund), Object Class 06 (Capital Outlay) to Dept-Div 5912 (Design and Construction), Project P441768-100001 (North Market Streetscape - Utility Relocation Design), Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\n \nSECTION 5.  That the Director of Public Service be and hereby is authorized to reimburse utilities for utility relocation work, or to reimburse companies hired by utilities to perform utility relocation work for the North Market Streetscape - Utility Relocation Design project.\n \nSECTION 6.  That the expenditure of $4,700,000.00, or so much thereof as may be needed, is hereby authorized in Fund 7704 (Streets and Highways Bond Fund), in Dept-Div 5912 (Design and Construction), Project P441768-100001 (North Market Streetscape - Utility Relocation Design), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 7.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 8.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 9.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 10.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 4,
    "noes": 1,
    "abstain": 2,
    "absent": 0,
    "meeting_id": 85,
    "meeting_date": "2023-07-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "ABSTAIN"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "NAY"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSTAIN"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Infrastructure",
      "Public Works"
    ]
  }
}