{
  "success": true,
  "vote": {
    "id": 7267,
    "item_number": "SR-17",
    "title": "To authorize the Director of the Department of Recreation and Parks to enter into contract with Ameresco for the Department of Energy Grant - HVAC Controls Upgrades Project; to waive the competitive bidding provisions of Columbus City Code Chapter 329; to authorize the transfer of $13,000.00 within the Recreation and Parks Voted Bond Fund, to authorize the amendment of the 2023 Capital Improvements Budget; to authorize the expenditure of $13,000.00 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($13,000.00)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Director of the Recreation and Parks Department to enter into contract with Ameresco for the Department of Energy Grant - HVAC Controls Upgrades Project. The contract amount is a total of $13,000.00 being authorized by this ordinance.\n \nAmeresco brought to the Recreation and Parks Department's attention the opportunity to help fund one of its upcoming capital improvement projects. There are two grants available, at $250,000.00 per building, for buildings that are scheduled for renovation that will address specific energy needs and usage. The top tier activity to address energy that qualifies the Recreation and Parks Department for this grant is to install working building automated controls. This ordinance is to authorize the Director of the Recreation and Parks Department to enter into contract with Ameresco to prepare a Department of Energy Grant Application on the behalf of the Columbus Recreation and Parks Department. The grant application for this project involves engineering services, including gathering facility data, energy usage data, utility bill data and an energy audit. This information is required to complete the grant application and the application is due on September 29, 2023. Since we were just informed of the opportunity, there is not enough time to procure formal responses. Ameresco has successfully completed other HVAC projects for the Columbus Recreation and Parks Department, making the information required for this application readily available to them, saving the Department time and money. As a result, the Department is requesting to waive the competitive bidding provisions of Columbus City Code Chapter 329.\n \nCleo Dumaree Athletic Complex and the Franklin Parks Adventure Center are two of 11 buildings that are scheduled to have their building level controls replaced next year as part of the Department's HVAC Controls Upgrade Project. Automated control functions in each facility are anticipated to cost approximately $210,000.00 each. Successful funding of this application will reduce the Department's capital cash needs to execute this larger project by approximately $420,000.00. Funding from the Department of Energy is prioritized for Community Development Block Grant eligible neighborhoods and facilities that provide service to those who have special needs. Both of these facilities meet this criteria. \n \nPrincipal Parties: \nAmeresco, Inc.\n640 Lakeview Plaza, Suite J\nWorthington, Ohio 43085\nDave Zahala, (614) 935-0041\nContract Compliance Number: 000251\nContract Compliance Expiration Date: August 25, 2024\n \nEmergency Justification: Emergency action is requested as the grant application is due on September 29, 2023 and this will ensure that the application is submitted by the designated deadline.  \n \nBenefits to the Public: The reduction in building energy use enabled by this project will have an environmental impact, helping the City meet its climate goals which will positively impact the quality of life of current and future generations of residents.\n \nCommunity Input/Issues: The City's effort to reduce its energy needs by 45 percent by 2030 has undergone extensive community engagement.\n \nArea(s) Affected: Citywide (99)\n \nMaster Plan Relation: This project will support the Recreation and Parks Master Plan by helping to improve operations and services to the citizens of Columbus.\n \nFiscal Impact: $13,000.00 is budgeted and available from within the Recreation and Parks Voted Bond Fund 7702 to meet the financial obligations of this contract. \n \nTitle\n \nTo authorize the Director of the Department of Recreation and Parks to enter into contract with Ameresco for the Department of Energy Grant - HVAC Controls Upgrades Project; to waive the competitive bidding provisions of Columbus City Code Chapter 329; to authorize the transfer of $13,000.00 within the Recreation and Parks Voted Bond Fund, to authorize the amendment of the 2023 Capital Improvements Budget; to authorize the expenditure of $13,000.00 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($13,000.00)\n \nBody\n \nWHEREAS, it is necessary to authorize the Director of the Recreation and Parks to enter into contract with Ameresco for the Department of Energy Grant - HVAC Controls Upgrades Project; and\n \nWHEREAS, that this Council finds it in the best interest of the City of Columbus to waive the competitive bidding provisions of Columbus City Code Chapter 329; and\n \nWHEREAS, it is necessary to authorize the transfer of $13,000.00 within the Recreation and Parks Voted Bond Fund 7702; and\n \nWHEREAS, it is necessary to authorize the amendment of the 2023 Capital Improvements Budget Ordinance 1711-2023 in order to provide sufficient budget authority for this and future projects; and\n \nWHEREAS, it is necessary to authorize the expenditure of $13,000.00 from the Recreation and Parks Voted Bond Fund 7702; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Recreation and Parks Department in that it is immediately necessary to authorize the Director to enter into contract with Ameresco as the grant application is due on September 29, 2023 and this will ensure that the application is submitted by the designated deadline, all for the preservation of the public health, peace, property, safety, and welfare and, NOW, THEREFORE \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Recreation and Parks be and is hereby authorized to enter into contract with Ameresco for the Department of Energy Grant - HVAC Controls Upgrades Project.\n \nSECTION 2. That this Council finds it in the best interest of the City of Columbus to waive the competitive bidding provisions of Columbus City Code Chapter 329. \n \nSECTION 3. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 4. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 5. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 6. That the transfer of $13,000.00 or so much thereof as may be needed, is hereby authorized between projects within the Recreation and Parks Bond Fund 7702 per the account codes in the attachment to this ordinance.\n \nSECTION 7. That the 2023 Capital Improvements Budget Ordinance 1711-2023 is hereby amended as follows in order to provide sufficient budget authority for this ordinance and future projects.\n \nFund / Project / Project Name / Current / Change / Amended\n \nFund / Project / Project Name / Current Revised Authority / Current Remaining Authority / Change / Amended Revised Authority / Amended Remaining Authority\n \nFund 7702 / P511035-100000 / Climate Action Plan (Voted Carryover) / $5,366,800 / $5,366,800 / ($13,000) / $5,353,800 / $5,353,800  \n \nFund 7702 / P511040-100000 / Climate Action Plan - Comprehensive Energy Management Plan Implementation (Voted 2019 Carryover) / $0 / $0 / $13,000 / $13,000 / $13,000\n \nSECTION 8. For the purpose stated in Section 1, the expenditure of $13,000.00 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Recreation and Parks and Voted Bond Fund 7702 in object class 06 Capital Outlay per the accounting codes in the attachments to this ordinance.  \n \nSECTION 9. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 85,
    "meeting_date": "2023-07-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}