{
  "success": true,
  "vote": {
    "id": 7271,
    "item_number": "SR-21",
    "title": "To authorize an amendment to the 2023 Capital Improvement Budget; to authorize the appropriation and transfer of funds from the Sanitary Sewer Reserve Fund to the Sanitary Revolving Loan Fund; to authorize the appropriation of funds within the Sanitary Revolving Loan Fund; to authorize the Director of Public Utilities to enter into a construction contract with Elite Excavating Co. of Ohio, Inc., for the Brooklyn/Cleveland HSTS Elimination project; to authorize the expenditure of up to $2,058,856.20 from the Sanitary Revolving Loan Fund and the Sanitary Bond Fund to pay for the project and to authorize the Director of Public Utilities to increase the amount of the loan from the Ohio Water Pollution Control Loan Fund to fund the construction of this project.  ($2,058,856.20).",
    "description": "Explanation    \n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Utilities to enter into a construction contract with Elite Excavating Co. of Ohio, Inc., for public sanitary sewers for the Brooklyn/Cleveland HSTS Elimination project, CIP #650895-100003, in an amount up to $2,056,854.20; to encumber funds with the Department of Public Service for construction administration and inspection services in an amount up to $2,000.00 (for a total expenditure of $2,058,854.20); and seeks City Council approval to increase the maximum amount of a Water Pollution Control Loan Fund loan that will be used to fund construction of this project. \n \nThis project will extend over 3,300 feet of sanitary sewer on Brooklyn Road to serve a developed area that is currently serviced by home treatment systems. This project will eliminate the home treatment systems due to failing systems and the potential ground water pollution hazard.\n \nWork performed will be in the Northland planning area. Work will include construction of a new sanitary sewer that mostly extends along Brooklyn Road. This project is part of the Septic Tank Elimination Program (STEP).\n \nOrdinance 3120-2022, passed 12/12/2022, authorized this project to be funded by a loan to be obtained through the Water Pollution Control Loan Fund (WPCLF) loan account in an amount not to exceed $1,500,000.00.  That ordinance estimated the loan amount to cover the construction cost of the Public Sanitary Sewers for the Brooklyn/Cleveland HSTS Elimination project would be $1,500,000.00.  The actual construction cost for this project per the bids received is $2,056,854.20.  This ordinance seeks City Council approval to increase the maximum loan amount that can be sought for this project to $2,500,000.00 to cover the entire cost of construction and any additional administration costs that may be associated with seeking and administering the loan.   \n \nThe Community Area for this ordinance will be 35, Northland.  \n \nTIMELINE:  All contract work is required to be completed in a manner acceptable to the City within 365 days from the date that a Notice To Proceed (NTP) is given by the City.  The Notice To Proceed is anticipated to be issued in August 2023.\n \nESTIMATED COST OF PROJECT:  The bid amount and proposed award amount is $2,056,854.20, including a 20% construction contingency amount that will be utilized to fund needed and approved changes in the work.  No contract modifications are anticipated at this time; however, construction exigency might later compel modification of this contract, if unforeseen difficulties are encountered.\n \nCost summary: \n \nOriginal Contract                                                  $2,056,854.20\nFuture Anticipated Needs                                                  $0.00 \nPrevailing Wage Services                          $        2,000.00\nCONTRACT TOTAL                                           $2,058,854.20\n \n2.  ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT\nThe goal of this project is to extend over 3,300 feet of sanitary sewer on Brooklyn Road to serve a developed area that is currently serviced by home treatment systems. This project will eliminate the home treatment systems due to failing systems and the potential ground water pollution hazard.\n \n3.  CONSTRUCTION CONTRACT AWARD\nAn Invitation for Bids for the Public Sanitary Sewers for Brooklyn/Cleveland HSTS Elimination project was advertised on the Vendor Services and Bid Express websites from 03/3/23 through 04/05/23.  Two bids were received for the project and were opened on 04/05/23.  The following company submitted a bid:\n  \nCompany                                                                                                            Bid Amount                        Compliance Number       ODI Status\n1.                     Elite Excavating Co. of Ohio, Inc.        $2,056,854.20                  CC001064                              MAJ\n2.                     John Eramo & Sons, Inc.                     $2,241,234.00                  CC004251                      MAJ\n \nThe Elite Excavating Co. of Ohio, Inc. bid was deemed the lowest, best, most responsive and responsible bid in the amount of $2,056,854.20.\n \nThe certification of Elite Excavating Company of Ohio and of the above companies was in good standing at the time the bid was awarded.\n \n4.  CONTRACT COMPLIANCE INFORMATION\nElite Excavating Co. of Ohio, Inc.’s contract compliance number is CC001064 and expires 1/5/24.   \n \nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against Elford, Inc. \n \n5.  MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract was bid with an anticipated City of Columbus MBE/WBE Program goal of 10% as assigned by the City’s Office of Diversity and Inclusion (ODI).  After ODI’s review of the Utilization Plan and other related information the contractor submitted with their bid response, ODI has approved an MBE/WBE Program goal of 10% for this contract.  Failure by the contractor to meet this goal subjects the contractor to the Penalties for Non-Compliance as described in the “City’s Minority and Women-Owned Business Enterprise & Small Local Business Enterprise Program Manual” and in the bid documents for this contract.\nElite Excavating Co. of Ohio, Inc. listed the following companies as subcontractors for this project:\n \nCompany Name                                            City/State                                     ODI Certification Status\nRiley Contracting, Inc                                     Norwalk, Ohio                                          MAJ\nCAP Stone & Associates                              Columbus, Ohio                                         WBE\n \nThe certification of Elite Excavating Company of Ohio, Inc. and the above companies including the selected WBE subcontractor was in good standing at the time the bid was awarded.\n \n6.  PRE-QUALIFICATION STATUS\nElite Excavating Co. of Ohio, Inc. and all subcontractors have met code requirements with respect to pre-qualification, pursuant to relevant sections of Columbus City Code Chapter 329.  \n \n7.  FISCAL IMPACT\nThe construction portion of this project is anticipated to be financed with a loan from the Water Pollution Control Loan Fund (WPCLF), a program jointly administered by the Ohio EPA's Division of Environmental and Financial Assistance and the Ohio Water Development Authority (OWDA).  City Council authorized this loan application and acceptance of funding via Ordinance 3120-2022, passed by Council on 12/12/22.  The loan is expected to be approved in July, 2023.  Funds will need to be certified against the Sanitary Sewer Reserve Fund, Fund 6102, to proceed with this project until the loan has been approved.\nFunds will need to be appropriated within the Sanitary Sewer Reserve Fund, Fund 6102, transferred to the Sanitary Revolving Loan Fund, Fund 6111, and then appropriated in the Sanitary Revolving Loan Fund, Fund 6111, in order to fund this expenditure.  This transaction is a temporary measure that is required until such time as the division is able to execute a loan with the WPCLF and reimburse the Sanitary Sewer Reserve Fund.  An amendment to the 2023 Capital Improvement Budget is needed to reflect the loan funding for this project. \nFunding in the amount of $2,000.00 is appropriated and available within the Sanitary Bond Fund, Fund 6109, to pay the Department of Public Service to provide prevailing wage services for this project.  An amendment to the 2023 Capital Improvement Budget is necessary to align budget authority with the proper project. Amendments to the 2023 Capital Improvement Budget are contingent upon approval of the 2023 Capital Improvement Budget.\nTitle\nTo authorize an amendment to the 2023 Capital Improvement Budget; to authorize the appropriation and transfer of funds from the Sanitary Sewer Reserve Fund to the Sanitary Revolving Loan Fund; to authorize the appropriation of funds within the Sanitary Revolving Loan Fund; to authorize the Director of Public Utilities to enter into a construction contract with Elite Excavating Co. of Ohio, Inc., for the Brooklyn/Cleveland HSTS Elimination project; to authorize the expenditure of up to $2,058,856.20 from the Sanitary Revolving Loan Fund and the Sanitary Bond Fund to pay for the project and to authorize the Director of Public Utilities to increase the amount of the loan from the Ohio Water Pollution Control Loan Fund to fund the construction of this project.  ($2,058,856.20). \n \nBody\nWHEREAS, the Department of Public Utilities is engaged in the Public Sanitary Sewers for Brooklyn/Cleveland HSTS Elimination project; and\n \nWHEREAS, two bids for the Public Sanitary Sewers for Brooklyn/Cleveland HSTS Elimination project were received and opened on 04/05/23; and\n \nWHEREAS, the lowest, best, most responsive and responsible bid was from Elite Excavating Co. of Ohio, Inc.; and\n \nWHEREAS, Ordinance 3120-2022 authorized this project to be funded by a loan to be obtained through the Water Pollution Control Loan Fund (WPCLF) Loan Account in an amount not to exceed $1,500,000.00; and\n \nWHEREAS, it is necessary to increase the amount of the WPCLF loan due to higher than expected construction costs; and\n \nWHEREAS, the 2023 Capital Improvement Budget must be modified to align budget authority with the proper project; and\n \nWHEREAS, it is necessary to both appropriate funds from the Sanitary Sewer Reserve Fund and to authorize the transfer of said funds into the Sanitary Revolving Loan Fund in order to temporarily fund this expenditure, until such time as the City is able to execute a loan for the above stated purpose and reimburse the Sanitary Sewer Reserve Fund; and\n \nWHEREAS, the funds transferred into the Sanitary Revolving Loan Fund must be appropriated; and\n \nWHEREAS, the City anticipates incurring certain Original Expenditures (as defined in Section 1.150-2(c) of the Treasury Regulations (the “Treasury Regulations” promulgated pursuant to the Internal Revenue Code of 1986, as amended)) with respect to the construction of the Project described in this Ordinance (collectively, the “Project”); and\n \nWHEREAS, it is necessary to authorize the Director of the Department of Public Utilities to enter into a construction contract with Elite Excavating Co. of Ohio, Inc. for the Public Sanitary Sewers for Brooklyn/Cleveland HSTS Elimination project; and \n \nWHEREAS, it is necessary to authorize an expenditure of funds from the Sanitary Revolving Loan Fund to pay for the project; and\n \nWHEREAS, it is necessary to expend funds from the Sanitary Bond Fund to provide for payment of prevailing wage services associated with said project; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2023 Capital Improvement Budget authorized by Ordinance 1711-2023 be amended as follows to establish sufficient budget authority for this project:\n \nFund / Project Number / Project Name (Funding Source) / Current Authority/ Revised Authority / Change \n6111 / 650895-100003 / Brooklyn Cleveland HSTS Elimination (WPCLF/OWDA Loan) / $1,120,000.00 / $2,056,855.00 / $936,855.00 (To match the loan amount)\n \n6109 / 650895-100007 / Sunbury Rd Mock Rd HSTS Elimination Project (Voted Sanitary Carryover) / $931,852.00 / $929,852.00 / ($2,000.00) \n \n6109 / 650895-100003 / Brooklyn Cleveland HSTS Elimination (Voted Sanitary Carryover) / $0.00 / $2,000.00 / $2,000.00\n \nSECTION 2.  That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ending December 31, 2023, the sum of $2,056,854.20  is appropriated in the Sanitary Reserve Fund, Fund 6102, per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That the transfer of $2,056,854.20, or so much thereof as may be needed, is hereby authorized between the Sanitary Reserve Fund, Fund 6102, and the Sanitary Revolving Loan Fund, Fund 6111, per the account codes in the attachment to this ordinance.\n \nSECTION 4.  That the appropriation of $2,056,854.20, or so much thereof as may be needed, is hereby authorized in the Sanitary Revolving Loan Fund, Fund 6111, per the accounting codes in the attachment to this ordinance.\n \nSECTION 5.  That the Director of Public Utilities is hereby authorized to enter into a construction contract for the Public Sanitary Sewers for Brooklyn/Cleveland HSTS Elimination project with Elite Excavating Co. of Ohio, Inc., 4500 Snodgrass Road, Mansfield, Ohio 44903, in an amount up to $2,056,854.20; in accordance with the terms and conditions of the contract on file in the Department of Public Utilities; and to obtain the necessary construction administration and inspection services for this project from the Department of Public Services in an amount up to $2,000.00.\n \nSECTION 6.  That the expenditure of $2,058,854.20, or so much thereof as may be needed, is hereby authorized to pay for this contract per the accounting codes in the attachment to this ordinance. \n \nSECTION 7.  That upon obtaining other funds for the purpose of funding sewer system capital improvement work, the City Auditor is hereby authorized to repay the Sanitary System Reserve Fund, Fund 6102, the amount transferred above (Section 3), and said funds are hereby deemed appropriated for such purposes.\n \nSECTION 8.  That the City intends that this Ordinance constitute an \"official intent\" for purposes of Section 1.150-2(e) of the Treasury Regulations, and that the City reasonably expects to reimburse itself for certain Original Expenditures incurred with respect to the Project from the proceeds of obligations to be issued by the City in a principal amount currently estimated to be $2,056,854.20 (the \"Obligations\").\n \nThe City intends to make a reimbursement allocation on its books for the Original Expenditures not later than eighteen months following the later to occur of the date of the Original Expenditure to be reimbursed or the date the Project for which such Original Expenditures were made is \"placed in service\" within the meaning of Treasury Regulations Section 1.150-2(c).  Upon the issuance of the Obligations, the proceeds of such Obligations shall be used to reimburse the Sanitary Reserve Fund, Fund 6102, which is the fund from which the advance for costs of the Project will be made.\n \nSECTION 9.  That City Council approves increasing the amount of a loan from the Ohio Water Pollution Control Loan Fund to fund construction for this project from a maximum of $1,500,000.00 to a maximum of $2,500,000.00.\n \nSECTION 10.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 11.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 12.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 13.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 85,
    "meeting_date": "2023-07-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}