{
  "success": true,
  "vote": {
    "id": 733,
    "item_number": "CA-18",
    "title": "To authorize the Director of the Department of Technology to enter into a contract renewal with Accela, Inc., on behalf of the Columbus Public Health Department, for software license maintenance and support services for the Envision Connect system in accordance with sole source procurement provisions of the Columbus City Codes; and to authorize the expenditure of $131,684.64 from the Health Department’s direct charge allocation of the Department of Technology, Information Services Operating Fund. ($131,684.64)",
    "description": "Explanation\nThis legislation authorizes the Director of the Department of Technology, on behalf of the Columbus Public Health Department, to enter into a contract with Accela Inc. for annual software license maintenance and support services for the Envision Connect system utilized by the Environmental Health unit.  The original contract (EL000490) was established by the Columbus Health Department in 2000 with Decade Software Company.  Decade Software Company was acquired by Accela in November 2014. The Envision Connect agreement was most recently renewed by authority of ordinance 1366-2020, passed July 2, 2020, through purchase order PO204353.  This renewal will provide service from July 1, 2021 to June 30, 2022 at a cost of $131,684.64.    \n \nThe Envision Connect system provides the Columbus Public Health Department the ability to operate the Environmental Health unit by providing an extensive array of services such as tracking and maintaining information associated with inspections, historical data of restaurants and other businesses, tracking sanitation standards data, vector control for mosquitoes, environmental reviews, accounts receivable/payable and billings as well as statistics and analysis regarding the Environmental Health unit. Services provided by Accela under this contract renewal include telephone support services, software maintenance, update training, upgrades and enhancements, and application hosting services. Without this service, the Columbus Public Health Department would lose the ability to operate the Environmental Health unit, which could result in the failure to meet requirements mandated by the State of Ohio.\n \nAccela Inc. is the sole provider of maintenance and support for Envision Connect software.  As such, this ordinance is being established in accordance with the sole source provisions of the Columbus City Code, Section 329. \n \nFiscal Impact\nIn 2019 and 2020, funds totaling $113,382.71 and $125,413.94, respectively, were legislated for software license, hosting and support services for the Envision Connect system. The cost for 2021 software license, hosting and support services for Envision Connect is $131,684.64. Funds were budgeted and available within the Columbus Public Health Department’s direct charge allocation of the Department of Technology, Information Services Operating Fund.\n \nContract Compliance\nVendor Name: Accela, Inc.;     FID/CC#: 94-2767678        Expiration Date: 3/22/2021\nDAX Vendor Account # 010838\n \nTitle\nTo authorize the Director of the Department of Technology to enter into a contract renewal with Accela, Inc., on behalf of the Columbus Public Health Department, for software license maintenance and support services for the Envision Connect system in accordance with sole source procurement provisions of the Columbus City Codes; and to authorize the expenditure of $131,684.64 from the Health Department’s direct charge allocation of the Department of Technology, Information Services Operating Fund. ($131,684.64)\n \nBody\nWHEREAS, it is necessary to authorize the Director of the Department of Technology to enter into a contract renewal with Accela, Inc., on behalf of the Columbus Public Health Department to provide software licensing, maintenance and support and hosting services for the Envision Connect system for the term period July 1, 2021 through June 30, 2022 at a cost of $131,684.84; and\n \nWHEREAS, this contract is in accordance with the sole source provisions of the Columbus City Code; and\n \nWHEREAS, the Envision Connect system is used by the Environmental Health Section of the Columbus Public Health Department in their daily operations; and\n \nWHEREAS, it is necessary to authorize the Director of the Department of Technology, on behalf of the Columbus Public Health Department, to enter into a contract with Accela, Inc., for software licensing, maintenance and support, and hosting services for the Envision Connect system to avoid interruption in services; now, therefore:\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Department of Technology be and is hereby authorized to enter into a contract renewal with Accela, Inc., on behalf of the Columbus Public Health Department, for software licensing, maintenance and support, and hosting services for the Envision Connect system for the period July 1, 2021 through June 30, 2022 at cost of $131,684.64.\n \nSECTION 2. That the expenditure of $131,684.64, or so much thereof as may be necessary in regard to the action authorized by Section 1 is hereby authorized to be expended as follows in the attachment to this ordinance.  (Please see attachment 0884-2021 EXP):\n \nSECTION 3. That the monies in the foregoing Sections shall be paid upon order of the Director of Technology, and that no order shall be drawn or money paid except by voucher, the form of which shall be approved by the City Auditor.\n \nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION65. That this contract is in accordance with the sole source provisions of the Columbus City Code, Chapter 329.\n \nSECTION 6. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 12,
    "meeting_date": "2021-04-26",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}