{
  "success": true,
  "vote": {
    "id": 7359,
    "item_number": "CA-31",
    "title": "To authorize the Finance and Management Director to associate all General Budget Reservations resulting from this ordinance with the appropriate Universal Term Contract Purchase Agreements for the purchase of  lamps for the Division of Power; and to authorize the expenditure of $60,000.00 from the Electricity Operating Fund. ($60,000.00)",
    "description": "Explanation\n \nBACKGROUND: This legislation authorizes the Finance and Management Director to associate all General Budget Reservations resulting from this ordinance with the following Universal Term Contract Purchase Agreements listed below for the Division of Power. \n \nThe lamps from these contracts will be used to replenish stock, maintain existing street lights and for new construction for future development within the City.\n \nThe following Purchase Agreement association requires approval by City Council in order for the Division to expend more than $100,000.00, per CCC Sec. 329.19(g):\n \nUNIVERSAL TERM CONTRACT PURCHASE AGREEMENTS:\nPurchase of Lamps PA005347 & PA005348\n \nThe companies are not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.  \n \nSUPPLIERS:\nGrainger, vendor #007170, CC expires 2/2/24, majority vendor\nConsolidated Electrical Distributors, Inc., vendor #010270, CC expires 5/4/25, majority vendor\n \nFISCAL IMPACT:  $60,000.00 is budgeted and needed for this purchase.  \n \n$258,292.06 was spent in 2022\n$101,368.84 was spent in 2021\n \n \nTitle\n \nTo authorize the Finance and Management Director to associate all General Budget Reservations resulting from this ordinance with the appropriate Universal Term Contract Purchase Agreements for the purchase of  lamps for the Division of Power; and to authorize the expenditure of $60,000.00 from the Electricity Operating Fund. ($60,000.00)\n \n \nBody\n \nWHEREAS, the Purchasing Office has established Universal Term Contract Purchase Agreements for the purchase of lamps; and\n \nWHEREAS, the expenditure of $60,000.00, or so much thereof as is needed for the purchase of lamps from and within the Electricity Operating Fund; and\n \nWHEREAS, the lamps will be used to replenish stock, maintain existing street lights and for new construction for future development within the City; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities to authorize the Finance and Management Director to associate all General Budget Reservations resulting from this ordinance with the appropriate Universal Term Contract Purchase Agreements for the purchase of lamps; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Finance and Management Director be and hereby is authorized to associate all General Budget Reservations resulting from this ordinance with the appropriate Universal Term Contract Purchase Agreements for the purchase of lamps.\n \nSECTION 2.  That the expenditure of $60,000.00, or so much thereof as may be needed, be and is hereby authorized in Fund 6300 (Electricity Operating) in object class 02 Materials and Supplies per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.   That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 86,
    "meeting_date": "2023-07-31",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements"
    ]
  }
}