{
  "success": true,
  "vote": {
    "id": 7422,
    "item_number": "SR-17",
    "title": "To authorize the Director of Finance and Management, on behalf of the Office of Construction Management, to enter into a construction contract with 2K General Company for the Health Department Expansion Renovation Project; to waive the provisions of Columbus City Codes, Chapter 378, in regards to approval by the Community Benefits Agreement Advisory Committee; to authorize transfers and expenditures up to $21,493,900.00 within the Safety General Obligation Bond Fund, the Health General Obligations Bond Fund, and the Construction Management Capital Improvement Fund; and to authorize an amendment to the 2023 Capital Improvements Budget.  ($21,493,900.00)",
    "description": "Explanation\n \n1. BACKGROUND:  This legislation authorizes the Director of Finance and Management to enter into a construction contract, on behalf of the Office of Construction Management, with 2K General Company, for the Health Department Expansion Renovation Project, in the amount of $21,493,900.00.  \n \nThis project consists of a full interior renovation of over 60,000 sq. ft. of the historic Health Department building located at 240 Parsons Avenue.  The majority of the work will take place on the 3rd and 4th floors, with associated work throughout the building.  Associated work includes:  HVAC, mechanical, electrical, plumbing, demolition, structural/architectural remediation, fire suppression and alarms.  Improvements/upgrades will also be made to the technology/security system, elevators, pumps, water heater, chiller, furniture, fixtures, and equipment.  This is a 16-month construction project in an occupied building.\n \n2. CONSTRUCTION CONTRACT AWARD:    The project was let by the Office of Construction Management via Bid Express.  Three bids were opened on June 5, 2023 from Majority-owned firms:\n \n1.                     2K General Company                                $21,493,900.00\n2.   Elford, Inc.                                                                                                         $21,806,437.00\n3.   Setterlin Building Company                                                               $23,156,676.00\n \n*Pricing includes alternates\n \n2K General Company’s bid was deemed the lowest, best, most responsive and responsible bid in the amount of $21,493,900.00.  Their Contract Compliance Number is 5739 (expires 6/14/24, Majority-designated).\n \n3. SUBCONTRACTOR PARTICIPATION:  The Office of Diversity & Inclusion (ODI) assigned a 20% goal for this project.  2K General Company proposed the following subcontractors to partially meet this goal:\n \nCompany Name                     City/State                     ODI Status  \nArdit Co.                     Columbus, OH                     WBE\nBarnett Mechanical                     Columbus, OH                     MBE\nGoldtech of Ohio                     Hilliard, OH                     MBE\nMVC ltd. dba Multivista                     Westerville, OH                     MBE\nMajestic Rehab & Remodeling                     Columbus, OH                     MBE & WBE\n \nODI approved 2K General’s Request for MBE/WBE Goal Waiver and Documentation of Good Faith Effort.\n \nMinority vendor certification was in good standing at the time the bid was awarded.\n \n4. BID WAIVER INFO.:  The Department requests a waiver of Chapter 378 of Columbus City Codes relating to approval by the Community Benefits Agreement Advisory Committee.  This project was initially bid prior to this Chapter being enacted and the need for subsequent re-bids were thought to comply with previous code requirements. This waiver is also requested so that necessary renovations at Columbus Public Health can commence as quickly as possible. \n \n5. FISCAL IMPACT:  Transfers within the Safety G.O. Bond Fund - Fund No. 7701, Health G.O. Bond Fund - Fund No. 7706, and Construction Management Capital Improvement Fund - Fund No. 7733 will be necessary as well as an amendment to the 2023 Capital Improvements Budget.  Amendments to the 2023 Capital Improvements Budget are contingent upon passage of the 2023 Capital Improvements Budget.\n \n \nTitle\n \nTo authorize the Director of Finance and Management, on behalf of the Office of Construction Management, to enter into a construction contract with 2K General Company for the Health Department Expansion Renovation Project; to waive the provisions of Columbus City Codes, Chapter 378, in regards to approval by the Community Benefits Agreement Advisory Committee; to authorize transfers and expenditures up to $21,493,900.00 within the Safety General Obligation Bond Fund, the Health General Obligations Bond Fund, and the Construction Management Capital Improvement Fund; and to authorize an amendment to the 2023 Capital Improvements Budget.  ($21,493,900.00)\n \n \nBody\n \n \nWHEREAS, three bids for Health Department Expansion Renovation Project were received and publicly opened in the office of the Director of Finance and Management on June 5, 2023; and\n \nWHEREAS, the bid from 2K General Company was deemed the lowest, best, most responsive and responsible bid in the amount of $21,493,900.00; and\n \nWHEREAS, a waiver of provisions of Columbus City Code, Chapter 378 in regards to approval by the Community Benefits Agreement Advisory Committee is being requested to allow the Director of Finance and Management to award a construction contract to 2K General Company for the Health Department Expansion Renovation Project; and\n \nWHEREAS, it is necessary to authorize transfers and expenditures within the Safety Voted Capital Fund - Fund No. 7701, the Health General Obligations Bond Fund - Fund No. 7706,  and the Construction Management Capital Improvement Fund - Fund No. 7733; and\n \nWHEREAS, it is necessary to authorize an amendment to the 2023 Capital Improvements Budget for the purpose of providing sufficient spending authority for the aforementioned project expenditures; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Finance and Management, Office of Construction Management, to authorize the Director of Finance and Management to enter into a construction contract with 2K General Company for the Health Department Expansion Renovation Project; for the preservation of the public Safety, peace, property and safety; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Finance and Management is hereby authorized to enter into a construction contract, on behalf of the Office of Construction Management, with 2K General Company, for the Health Department Expansion Renovation Project, in an amount up to $21,493,900.00.\n \nSECTION 2. That this Council finds it in the best interest of the City to waive the provisions of Columbus City Codes, Chapter 378 in regards to approval by the Community Benefits Agreement Advisory Committee.\n \nSECTION 3. That the transfer of $20,334.74, or so much thereof as may be needed, is hereby authorized within Fund 7701 (Safety General Obligation Bond Fund), Dept/Div 4550 (Construction Mgmt.), per the account codes in the attachment to this ordinance.\n \nSECTION 4. That the transfer of $18,148.83, or so much thereof as may be needed, is hereby authorized within Fund 7706 (Health G.O. Bond Fund), Dept/Div 4550 (Construction Mgmt.) and Dept/Div 5001 (Health), per the account codes in the attachment to this ordinance.\n \nSECTION 5.  That the transfer of $1,181,274.00, or so much thereof as may be needed, is hereby authorized within Fund 7733 (Construction Mgmt. Capital Improvement Fund), Dept/Div 4550 (Construction Mgmt.), per the account codes in the attachment to this ordinance.  \n \nSECTION 6. That the expenditure of $20,334.74, or so much thereof as may be needed, is hereby authorized within the Safety General Obligation Bond Fund - Fund No. 7701, per the account codes in the attachment to this ordinance.\n \nSECTION 7. That the expenditure of $20,289,751.83, or so much thereof as may be needed, is hereby authorized within the Health G.O. Bonds Fund - Fund No. 7706, per the account codes in the attachment to this ordinance.\n \nSECTION 8.  That the expenditure of $ $1,183,813.43, or so much thereof as may be needed, is hereby authorized within the Construction Mgmt. Capital Improvement Fund - Fund No. 7733, per the account codes in the attachment to this ordinance.\n \nSECTION 9.  That the 2023 Capital Improvements Budget is hereby amended per the accounting codes in the attachment to this ordinance.\n \nSECTION 10.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 11.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 12.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 13.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 86,
    "meeting_date": "2023-07-31",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}