{
  "success": true,
  "vote": {
    "id": 7443,
    "item_number": "CA-6",
    "title": "To Celebrate the Grand Opening of the Essential Care Center",
    "description": "Title\nTo Celebrate the Grand Opening of the Essential Care Center\nBody\nWHEREAS, the Essential Care Center held its grand opening ceremony on August 24, 2023, launching a $6 million community hub for pets and their owners; and \nWHEREAS, an estimated 106,000 pet owners in Columbus are experiencing poverty and 70,000 of those pets have never been to a veterinarian as a result; and \n \nWHEREAS, pet ownership can help reduce feelings of loneliness and anxiety, increase cardiovascular activity, and encourage healthy decision making; and\n \nWHEREAS, the Essential Care Center provides invaluable services to the Columbus community and their pets, including veterinary care, a pet food bank, and social and medical services for pet owners; and\n \nWHEREAS, the Essential Care Center is the first of its kind in Columbus, providing support and vital resources to a previously unserved demographic of pet owners and their pets; and \n \nWHEREAS, the Essential Care Center embodies the spirit of collaboration with several community partnerships and a comprehensive collection of services and resources located in one convenient location; now, therefore\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: That this Council celebrates the grand opening of the Essential Care Center, congratulates the Columbus Humane Society on this incredible milestone, and looks forward to supporting the amazing community work happening at the Center.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 87,
    "meeting_date": "2023-09-11",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}