{
  "success": true,
  "vote": {
    "id": 7464,
    "item_number": "CA-27",
    "title": "To authorize the Director of the Recreation and Parks Department to issue a nonexclusive sewer easement to the YWCA for installation of storm water services at Franklin County Tax Parcel 010-261917-00, which is managed as the Majestic Paint Parkland by the Recreation and Parks Department. ($0.00)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Director of Recreation and Parks to issue a nonexclusive sewer easement to the YWCA for installation of storm water services at Franklin County Tax Parcel 010-261917-00, which is managed as the Majestic Paint Parkland by the Columbus Recreation and Parks Department. \n \nThe City owns real property at Franklin County Tax Parcel 010-261917-00, which is managed as the Majestic Paint Parkland by the Recreation and Parks Department. The YWCA Housing Corporation is requesting a nonexclusive 0.017 acre storm sewer easement within the property, specifically under the Alum Creek multi-use trail, for the installation of one eight (8) inch storm sewer line. The easement will provide the storm water service for the YWCA’s facility improvement project, which includes playground improvements. Without the easement, additional impacts to the surrounding properties would need to occur, creating concerns for community impacts and indirect impacts to the recreational opportunities for the community.\n \nPrincipal Parties: \nYWCA\n900 Harvey Court\nColumbus, Ohio 43219\nElizabeth Brown, Director \n \nBenefits to the Public: The easement will allow the YWCA Housing Corporation to improve community services and provide an upgraded playground for the community.\n \nCommunity Input/Issues: The YWCA has hosted community meetings regarding this project. . Additionally, the City of Columbus has received numerous 311 requests and inquiries about the need for an upgraded playground for the community in this area.   \n \nArea(s) Affected: Near East (56)\n \nMaster Plan Relation: This project will support the Recreation and Parks Master Plan by expanding partnerships and providing amenities to the community. \n \nFiscal Impact: No fiscal action is required at this time. The value of the easement is being prepared and the YWCA Housing Corporation will pay the City of Columbus for the storm easement.\nTitle\n \nTo authorize the Director of the Recreation and Parks Department to issue a nonexclusive sewer easement to the YWCA for installation of storm water services at Franklin County Tax Parcel 010-261917-00, which is managed as the Majestic Paint Parkland by the Recreation and Parks Department. ($0.00) \n \nBody\n \nWHEREAS, it is necessary to authorize the Director of Recreation and Parks to issue a nonexclusive sewer easement to the YWCA for installation of storm water services at Franklin County Tax Parcel 010-261917-00, which is managed as the Majestic Paint Parkland by the Recreation and Parks Department; and\n \nWHEREAS, it has become necessary in the usual daily operations of the Recreation and Parks Department in that it is necessary to authorize the Director to issue this sewer easement; NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Recreation and Parks is hereby authorized to issue a nonexclusive sewer easement to the YWCA for installation of storm water services at Franklin County Tax Parcel 010-261917-00, which is managed as the Majestic Paint Parkland by the Recreation and Parks Department, as described within this ordinance. \nSECTION 2. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 87,
    "meeting_date": "2023-09-11",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Infrastructure",
      "Parks & Recreation"
    ]
  }
}