{
  "success": true,
  "vote": {
    "id": 7472,
    "item_number": "CA-35",
    "title": "To authorize the Director of Development to enter into a First Amendment to the Bond Funded Grant Agreement with Erie Ohio Capital CDFI Fund, LLC, to permit the reimbursement of project costs incurred prior to the creation of the purchase order. ($0.00)",
    "description": "Explanation\n \nBACKGROUND\nThis ordinance authorizes the Director of Development to amend a grant agreement with Erie Ohio Capital CDFI Fund, LLC for the Starling Yard housing project to allow for the reimbursement of project costs incurred prior to the creation of the purchase order. \nOriginal HD Agreement                                                                       $0.00           Ord. 2041-2022             \nOriginal Grant Agreement                            $3,500,000.00          Ord. 3283-2022               PO387354\nMod. No. 1 to Grant Agreement                              $ 0.00\nTotal Agreement Amount                             $3,500,000.00 \n \nUntil bond funds could be issued, pursuant to Ordinance No. 2041-2022, the City entered into a Housing Development Agreement with Erie Ohio Capital CDFI Fund, LLC, (\"Grantee\") which was initially funded temporarily with the Special Income Tax Fund. Ordinance No. 3283-2022 passed on November 17, 2022, authorized the City's Director of Development to enter into a bond-funded grant agreement with the Grantee in the amount of $3.5 million (the \"Grant Agreement\"). This legislation will authorize an amendment to the Grant Agreement to authorize the reimbursement of project costs to the Grantee prior to the issuance of a purchase order (\"Project Costs\"). \nThe Grant Agreement, and the previous legislation, pertains to the Starling Yard project that will be constructed on the former school site located at 120 South Central Avenue. The property contains the historic 1908 Starling School (originally built as West High School), and is bounded on its perimeter by existing housing (north, east, and south), as well as the new Starling Middle School, West Central School and existing senior apartments to the west. The site is walkable to the West Broad Street corridor, which contains a number of restaurants and retail stores. The Franklinton Branch of the Columbus Metropolitan Library and City of Columbus Fire Station and EMS Station 10 are just a short distance away. When completed, the project will deliver new high-quality infill development with important safe and accessible affordable units needed by families; it will redevelop a vacant historic structure as additional affordable housing units while at the same time returning the building to its more appropriate 1908 configuration; and provide housing in an undeserved area of the City of Columbus.\nStarling Yard will contain 18 one-bedroom units, 26 two-bedroom units, and 8 three-bedroom units. The property will be mixed-income, featuring affordable housing ranging from 30% AMI, up to 80% AMI, accommodating various household sizes. 20 units will be set-aside for residents earning at or below 30% AMI, 24 units will be set-aside for residents earning at or below 50% AMI, 11 units will be set-aside for residents earning at or below 60% AMI, and 42 units will be set-aside for residents earning at or below 80% AMI (the \"Project\"). The Project will be appropriate for a variety of populations: singles, young professionals, seniors, single-parent households, small families needing three-bedroom units, and those needing workforce housing in close proximity to downtown and surrounding job centers. The project intends to have no fewer than 10% of the units be fully accessible, ideal for people with housing entry barriers including elderly, persons with mobility disabilities, and those less mobile. Additional units will be set-aside for hearing/vision impaired residents. \nOn-site amenities will include management offices, community room, and more. The Project is less than 100 feet from COTA bus stops, and quality retail including United Dairy Farms store, Bottoms Up Coffee, several restaurants, houses of worship, Jubilee Market Grocery, and Lower Lights Pharmacy. Programming opportunities will be offered through Franklinton Development Association. The total Project costs is $33,451,622.00.\nFISCAL IMPACT: This legislation does not have a fiscal impact.  \nCONTRACT COMPLIANCE: the vendor number is 033062 and expires June 24, 2024. \n \nTitle\n \nTo authorize the Director of Development to enter into a First Amendment to the Bond Funded Grant Agreement with Erie Ohio Capital CDFI Fund, LLC, to permit the reimbursement of project costs incurred prior to the creation of the purchase order. ($0.00)\nBody\n \nWHEREAS, the Director of Development desires to modify a grant agreement with Erie Ohio Capital CDFI Fund, LLC (the \"Developer\" and the \"Grantee\") to allow for the reimbursement of project costs incurred prior to the creation of the purchase order; and \nWHEREAS, the Developer's project, Starling Yard, will contain 18 one-bedroom units, 26 two-bedroom units, and 8 three-bedroom units. The property will be mixed-income, featuring affordable housing ranging from 30% AMI, up to 80% AMI, accommodating various household sizes. 20 units will be set-aside for residents earning at or below 30% AMI, 24 units will be set-aside for residents earning at or below 50% AMI, 11 units will be set-aside for residents earning at or below 60% AMI, and 42 units will be set-aside for residents earning at or below 80% AMI (the \"Project\"); and \n \nWHEREAS, the original Ordinance No. 2041-2022 passed on July 25, 2022 (\"Original Ordinance\"), permitted the Director of Development (\"Director\") to enter into a Housing Development Agreement (\"HDA\") to utilize Affordable Housing bond funds coming from the City’s 2022 Capital Budget in the amount of $3,000,000.00; and\n \nWHEREAS, Ordinance No. 3283-2022 passed on November 17, 2022,  authorized the Director to enter into a Bond Funded Grant Agreement with the Developer for $3,500,000.00 (\"Bond Funded Grant Agreement\") that was funded temporarily in the City’s 2022 Capital Budget from the Special Income Tax Fund until bonds could be issued, which nullified the need to enter into an HDA authorized by the Original Ordinance; and \n \nWHEREAS, to hold construction pricing down, the Grantee and its contractor commenced work on the Project prior to theCity's issuance of a purchase order; and \nWHEREAS, the grant amendment requested herein (the \"First Amendment\") will permit the Grantee to be reimbursed for project costs incurred prior to the issuance of a purchase order (\"Project Costs\"); and\nWHEREAS, in the usual daily operation of the Department of Development it is necessary to authorize the Director to enter into a First Amendment to the Bond Funded Grant Agreement, to allow payment to the Grantee for Project Costs incurred prior to the issuance of a purchase order, which advances the public purpose of providing affordable housing in a cost efficient manner, to the City's residents.\nNOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1. For the reasons set forth above, the Director of the Department of Development is authorized to enter into a First Amendment to the $3.5 million Bond Funded Grant Agreement with the Grantee, Erie Ohio Capital CDFI LLC, to allow for the reimbursement of Project Costs incurred prior to the creation of the purchase order. \nSECTION 2. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 87,
    "meeting_date": "2023-09-11",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Grants"
    ]
  }
}