{
  "success": true,
  "vote": {
    "id": 7480,
    "item_number": "CA-43",
    "title": "To authorize the Board of Health to enter into a contract with Health Management Associates, Inc for assessment services for the period of September 11, 2023 through June 30, 2024; to authorize the expenditure of $90,944.00 from the Health grants fund to pay the costs thereof; and to declare an emergency. ($90,944.00).",
    "description": "Explanation\n \nBACKGROUND:   This ordinance authorizes the Board of Health to enter into a contract with Health Management Associates, Inc. in the amount of $90,944.00. Their contract compliance number is CC-045659 These services were advertised through Bonfire (RFQ024223) according to bidding requirements of the City Code.\n \nPublic Health’s (CPH) Office of Planning and Quality Improvement, has an immediate need for planning, assessment, and facilitation services resulting in an updated Access to Care and Services Assessment and accompanying implementation plan.\n \nEmergency action is requested in order to not delay the start date of September 11, 2023 and the start of the access to care assessment which is a required deliverable of the Strengthening U.S. Public Health Infrastructure grant program.\n \nFISCAL IMPACT:  $90,944.00 is fully budgeted in the Health Grants fund and does not require a city match\n \nTitle\n \nTo authorize the Board of Health to enter into a contract with Health Management Associates, Inc for assessment services for the period of September 11, 2023 through June 30, 2024; to authorize the expenditure of $90,944.00 from the Health grants fund to pay the costs thereof; and to declare an emergency. ($90,944.00).\n \nBody\n \nWHEREAS, Columbus Public Health has a need for Access to care assessment services and\n \nWHEREAS, Health Management Associates, Inc has the expertise required; and\n \nWHEREAS, an emergency exists and that it is immediately necessary to contract with Health Management Associates, Inc. for access to care assessment services as it required for the grant program and all for the immediate preservation of the public health, peace, property, safety and welfare; NOW THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Board of Health is hereby authorized to enter into a contract with Public Consulting Group, LLC. in the amount of $90,944.00 for the period of September 11, 2023 through June 30, 2024;\n \nSECTION 2.  That to pay the costs of said contract, the expenditure of $90,944.00 is hereby authorized from the Health grants fund, 2251.  \n \nSECTION 3.  That this contract is in compliance with Chapter 329 of the Columbus City Code.\n \nSECTION 4.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 87,
    "meeting_date": "2023-09-11",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}