{
  "success": true,
  "vote": {
    "id": 7534,
    "item_number": "CA-18",
    "title": "To authorize the Director of Public Utilities to renew the contract with Cornerstone Maintenance Services, Ltd. for HVAC and air purification maintenance services at various Department of Public Utilities facilities, and to authorize the expenditure of $425,000.00 from the Sewer Operating Sanitary Fund and $30,000.00 from the Power Operating Fund. ($455,000.00)",
    "description": "Explanation\n \nThis legislation authorizes the Director of Public Utilities to renew the existing contract (FEM Project No. 1505.4.) with Cornerstone Maintenance Services, Ltd. for heating ventilation, air-conditioning (HVAC), and air purification maintenance services at various facilities within the Department of Public Utilities (DPU). Facilities served by the contract include the Southerly Wastewater Treatment Plant, Jackson Pike Wastewater Treatment Plant, and Compost Facility within the Division of Sewerage and Drainage (DOSD), as well as Division of Power (DOP) substations and buildings. Other Department facilities may be added in the future via contract modification.\n \nThe work to be performed under this contract modification concerns HVAC & air purification units and their associated equipment and systems that require inspection, sampling, testing, troubleshooting, balancing, maintenance, and repair or replacement. This includes maintenance and repair of piping and ductwork. The work may also include software updates for the various HVAC units or any HVAC associated equipment.\n \nThis equipment helps ensure required environmental conditions are met in areas housing sensitive electronics crucial to monitoring, operating, and controlling many plant processes and equipment. Regular inspection and maintenance of HVAC and air purification equipment help ensure the equipment operates safely throughout its expected life.\n \nThe Department of Public Utilities solicited competitive bids in accordance with Chapter 329 of City Code via RFSQ022406. Two (2) bids were received and opened on August 17, 2022. The Division of Sewerage and Drainage recommended an award be made to Cornerstone Maintenance Services, Ltd., which was deemed the lowest, responsive, responsible, and best bidder. The contract was initially bid as a one (1) year contract with an option for four (4) additional years contingent on consensus of the City and the Contractor and approval of City Council. The original contract was authorized pursuant to Ordinance No. 2415-2022.This renewal is the first renewal to provide funding for the services to be provided through October 2024.\n \nSUPPLIER:  \n \nCornerstone Maintenance Services Ltd. | EIN 01 0852059 | D365 Vendor #000055 | Expires 2/10/2024\nCornerstone Maintenance Services, Ltd. does not hold MBE/WBE status.\n \nThe company is not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.\n \nFISCAL IMPACT: \n \nTotal:                     $455,000.00\n \nLabor:                                           $300,000.00 (DOSD), $15,000.00 (DOP)\nMaterials:                     $125,000.00 (DOSD), $15,000.00 (DOP)\nTotal:                                          $455,000.00                     \n \nDivision of Sewerage & Drainage\n$206,416.21 has been spent in 2023\n$370,510.51 was spent in 2022\n$426,653.46 was spent in 2021 \n \nDivision of Power\n$13,870.11 has been spent in 2023\n$9,348.89 was spent in 2022\n$12,204.76 was spent in 2021 \n \nTitle\n \nTo authorize the Director of Public Utilities to renew the contract with Cornerstone Maintenance Services, Ltd. for HVAC and air purification maintenance services at various Department of Public Utilities facilities, and to authorize the expenditure of $425,000.00 from the Sewer Operating Sanitary Fund and $30,000.00 from the Power Operating Fund. ($455,000.00)\n \nBody\n \nWHEREAS, there is a continued need for HVAC and air purification maintenance services at various Department of Public Utilities facilities; and\n \nWHEREAS, the Department facilities requiring the services include the Southerly Wastewater Treatment Plant, Jackson Pike Wastewater Treatment Plant, and Compost Facility within the Division of Sewerage and Drainage (DOSD), as well as Division of Power substations and buildings; and\n \nWHEREAS, two (2) bids were received and opened by the Department of Public Utilities on August 17, 2022, and the Division of Sewerage and Drainage recommended an award be made to Cornerstone Maintenance Services, Ltd., the lowest, responsive, responsible, and best bidder; and\n \nWHEREAS, the contract was initially bid as a one (1) year contract with an option for four (4) additional years contingent on consensus of the City and the Contractor and approval of City Council; and\n \nWHEREAS, this is the first renewal to provide funding for the services to be provided through October 2024;\n \nWHEREAS, that the expenditure of $455,000.00 or so much thereof as may be needed, is hereby authorized in Fund 6100, Sewer Operating Sanitary Fund, as $300,000.00 from object class 03, Services, and $125,000.00 from object class 02, Materials & Supplies, and in Fund 6300, Power Operating Fund, as $15,000.00 from object class 03, Services, and $15,000.00 from object class 02, Materials & Supplies, per the accounting codes in the attachment to this ordinance; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities to authorize the Director of Public Utilities to modify the contract with Cornerstone Maintenance Services, Ltd. for HVAC and air purification maintenance services at various Department of Public Utilities facilities; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Public Utilities is hereby authorized to modify the contract with Cornerstone Maintenance Services, Ltd., 2620 Adda Avenue, Columbus, OH 43231, for HVAC and air purification maintenance services at various facilities within the Department of Public Utilities.\n \nSECTION 2. That this contract modification is in accordance with the relevant provisions of Chapter 329 of City Code.\n \nSECTION 3. That the expenditure of $455,000.00 or so much thereof as may be needed, is hereby authorized in Fund 6100, Sewer Operating Sanitary Fund, as $300,000.00 from object class 03, Services, and $125,000.00 from object class 02, Materials & Supplies, and in Fund 6300, Power Operating Fund, as $15,000.00 from object class 03, Services, and $15,000.00 from object class 02, Materials & Supplies per the accounting codes in the attachment to this ordinance.\n \nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6. That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 88,
    "meeting_date": "2023-09-18",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}