{
  "success": true,
  "vote": {
    "id": 754,
    "item_number": "SR-8",
    "title": "To authorize the Director of the Department of Technology, on behalf of various city departments, to enter into a contract with ConvergeOne, Inc. for professional services and maintenance and support services to enable the city’s Interactive Voice Response (IVR) System to continue utilizing remote worker/telework solutions; to waive the competitive bidding provisions of City Code; to authorize the expenditure of $387,237.08 from the Department of Technology, Information Services Division, Information Services Operating Fund and the Department of Technology, Information Services Operating Fund (Direct Charge); and to declare an emergency. ($387,237.08)",
    "description": "Explanation\nThis ordinance authorizes the Director of the Department of Technology (DoT), on behalf of various city departments, to enter into a contract with ConvergeOne, Inc. for professional services and maintenance and support services associated with the Genesys Interactive Voice Response (IVR) system, in the amount of $387,237.08, for the coverage term period through April 29, 2022.  The current IVR system is used by the city’s 311, Public Utilities, BZS, and Technology Help Desk call centers.  The Department of Technology via SA005214 established a contract agreement (EL015526) under the authority of ordinance 0177-2014 passed by council March 31, 2014 to acquire IVR equipment, software, maintenance and support, and services.  Ordinance 0177-2014 authorized a one-year contract with four annual renewal options. As consistent in the past, since the last renewal option has been exhausted, the department requests to waive the provisions of competitive bidding.\n \nThis contract will provide maintenance and support for the duration of a five (5) year period with the option to renew an additional two (2) years thereafter.  The additional time is to allow us time to bid out the entire system maintenance and support, while continuing to have coverage.  This decision is a result of the OEM, Genesys, having a policy of not permitting multiple parties supporting our IVR systems.  The Department of Technology is currently in a three (3) year contract for our Genesys hosted IVR solution and a five (5) year contract for our maintenance and support for our On-Premises IVR solution as a result of CARES Act funding projects and procurement.  The OEM's policy puts us in the position of relying on our current vendor ConvergeOne.  Due to this OEM policy, we cannot bid out our pre-established IVR system's maintenance and support with ConvergeOne to be shared with any other vendor.  Given these circumstances, the Department of Technology requests to waive the provisions of the competitive bidding requirements.\n \nThe attached project quote will allow for maintenance and support services for the City's existing IVR environments.  The project quote includes the following: quote reflects a full five (5) year cost, but is broken down annually.  The quote reflects that costs remain locked over the next five (5) years, however ConvergeOne, Inc. Genesys will not increase their cost annually.  Also, all Cares Act projects are covered by pre-paid five (5) years of maintenance and support services.  The Department of Building and Zoning did also introduce a new IVR system tied with Accela and was not part of the Cares Act but as such they have a yearly maintenance and support renewal that is a part of this quote as well (the quote includes hourly costs for professional services if needed/requested and utilized.  \n \nAdditionally, the Department of Public Utilities has requested $200,000.00 in contingency funds for work they may need performed that is not currently accounted for at this time.  These funds are intended to be utilized for professional services and licenses if necessary (this is the purpose of the hourly costs identified in the quote document.  There is $16,000.00 of DoT contingency funds for any circumstances that may come up that would require professional services and/or licenses based off requests from our customers that cannot be accomplished in-hours.  Given these factors, this ordinance requests a five (5) year bid waiver with the option of two (2) additional one-year renewals.  The coverage term period associated with this legislation in the total amount of $387,237.08 is through April 29, 2022, for the first year of services.\n \nEMERGENCY: \nEmergency action is requested to ensure that the necessary contract and purchase order(s) for the above described services and statements of work occur in a timely manner to ensure service provision without interruption to continue to mitigate the spread of the COVID-19 pandemic.\n \n \nCONTRACT COMPLIANCE NUMBER:\nVendor Name:    ConvergeOne, Inc.                CC#: 41-1763228;              Expiration Date: 10/31/2021\n    (DAX Vendor Acct. #:007864) \n \n \nFISCAL IMPACT:  \nAll services and projects noted in this ordinance were budgeted and accounted for in the recently adopted 2021 Operating Budget.\n \n \nTitle\nTo authorize the Director of the Department of Technology, on behalf of various city departments, to enter into a contract with ConvergeOne, Inc. for professional services and maintenance and support services to enable the city’s Interactive Voice Response (IVR) System to continue utilizing remote worker/telework solutions; to waive the competitive bidding provisions of City Code; to authorize the expenditure of $387,237.08 from the Department of Technology, Information Services Division, Information Services Operating Fund and the Department of Technology, Information Services Operating Fund (Direct Charge); and to declare an emergency. ($387,237.08)\n \n \nBody\n \nWHEREAS, this ordinance authorizes the Director of the Department of Technology (DoT), on behalf of various city departments, to enter into a contract agreement with ConvergeOne, Inc. for professional services and maintenance and support services associated with the Genesys Interactive Voice Response (IVR) system, in the amount of $387,237.08, for the coverage term period through April 29, 2022; and\n \nWHEREAS, the COVID-19 pandemic has resulted in the need to enter into a contract for the City's IVR system to provide for the purchase of support  and services remote worker/telework solution, more remote access and to support telework due to the public health emergency with respect to the Coronavirus Disease 2019; and \n \nWHEREAS, the current IVR system is used by the city’s 311, Public Utilities, BZS, and Technology Help Desk call centers.  The Department of Technology via SA005214 established a contract agreement (EL015526) under the authority of ordinance 0177-2014 passed by council March 31, 2014 to acquire IVR equipment, software, maintenance and support, and services.  Ordinance 0177-2014 authorized a one-year contract with four annual renewal options. Since the last renewal option has been exhausted, the department requests to waive the provisions of competitive bidding; and\n \nWHEREAS, the contract will provision maintenance and support for the duration of a five (5) year period with the option to renew an additional two (2) years thereafter.  The additional time is to allow us time to bid out the entire system maintenance and support, while continuing to have coverage.  This decision is a result of the OEM, Genesys, having a policy of not permitting multiple parties supporting our IVR systems.  The Department of Technology is currently in a three (3) year contract for our Genesys hosted IVR solution and a five (5) year contract for our maintenance and support for our On-Premises IVR solution as a result of CARES Act funding projects and procurement.  The OEM's policy puts us in the position of relying on our current vendor Converge One.  Due to this OEM policy, we cannot bid out our pre-established IVR system's maintenance and support with Converge One to be shared with any other vendor.  Given these circumstances, the Department of Technology requests to waive the provisions of the competitive bidding requirements; and\n \nWHEREAS, the attached project quote will allow for maintenance and support services for the City's existing IVR environments.  The project quote includes the following: quote reflects a full five (5) year cost, but is broken down annually.  The quote reflects that costs remain locked over the next five (5) years, however ConvergeOne, Inc. Genesys will not increase their cost annually.  Also, all Cares Act projects are covered by pre-paid five (5) years of maintenance and support services.  The Department of Building and Zoning did also introduce a new IVR system tied with Accela and was not part of the Cares Act but as such they have a yearly maintenance and support renewal that is a part of this quote as well (the quote includes hourly costs for professional services if needed/requested and utilized.  Additionally, the Department of Public Utilities as requested $200,000.00 in contingency funds for work they may need performed that is not currently accounted for at this time.  These funds are intended to be utilized for professional services and licenses if necessary (this is the purpose of the hourly costs identified in the quote document.  There is $16,000.00 of DoT contingency funds for any circumstances that may come up that would require professional services and/or licenses based off requests from our customers that cannot be accomplished in-hours.  The total amount of funding being requested via this legislation/ordinance is $387,237.08; and \n \nWHEREAS, to allow for the above-mentioned contract, it is necessary to waive the provisions of competitive bidding; and \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Technology in that it is immediately necessary to authorize the Director, on behalf of the various city departments, to enter into a contract with ConvergeOne, Inc. for the maintenance and support services for the City's IVR system including remote worker/telework solution services due to the COVID-19 pandemic to ensure service without interruption, for the immediate preservation of the public health, peace, property, safety, and welfare:\n \nNOW, THEREFORE, BE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1:  That the Director of the Department of Technology, on behalf of various city departments, is hereby authorized to enter into contract with ConvergeOne, Inc., in the amount of $387,237.08 for the coverage term period through April 29, 2022.\n \nSECTION 2:  That the expenditure of $387,237.08 or so much thereof as may be necessary is hereby authorized to be expended as follows ( please see 0724-2021 EXP ). \n \nSECTION 3:  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 4:  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5:  That this Council finds it is in the City's best interest to waive the competitive bidding provisions of City Code for the above-mentioned purposes.\n \nSECTION 6: That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure, and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 12,
    "meeting_date": "2021-04-26",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}