{
  "success": true,
  "vote": {
    "id": 7632,
    "item_number": "CA-21",
    "title": "To authorize the Director of the Department of Public Service to execute those documents necessary for the transfer of 0.017 acre portion of right-of-way near E. Long Street to H&H Holdings Reserve. ($2,962.00)",
    "description": "Explanation\n \nBackground:  The City of Columbus, Department of Public Service, received a request from Jennifer Heckert, H&H Reserve Holdings, LLC asking that the City transfer them a 740 square foot (0.017 acre) portion of the right-of-way near E. Long Street.  The right-of-way area is South of Long Street and east of Talmadge Street, abutted by parcel 010-039421 to the east, and 010-023992 to the west. \n \nTransfer of this right-of-way will allow the owner to create an ADA compliant entrance to their building and provide a space to store dumpsters.  The Department of Public Service has agreed to transfer the right-of-way via a quitclaim deed as described and shown within attached legal description and exhibit, and extinguishes its need for this public right-of-way.  \n \nPer current practice, comments were solicited from interested parties, including City agencies, private utilities and the applicable area commission, before it was determined that, subject to the retention of a general utility easement for those utilities currently located within this right-of-way, the City will not be adversely affected by the transfer of this right-of-way.  \n \nThe Department of Public Service submitted a request to the City Attorney’s Office, asking that they establish a value for this right-of-way, and a value of $2,962.00 was established.  \n \nThe request went before the Land Review Commission on April 20, 2023.  After review of the request, the Land Review Commission voted to recommend the above referenced right-of-way be transferred to H&H Reserve Holdings, LLC at the cost of $2,962.00.\n                     \nFISCAL IMPACT:  The City will receive a total of $2,962.00 and the funds are to be deposited in Fund 7748, Project P537650, as consideration for the transfer of the requested right-of-way.\n \nTitle\n \nTo authorize the Director of the Department of Public Service to execute those documents necessary for the transfer of 0.017 acre portion of right-of-way near E. Long Street to H&H Holdings Reserve. ($2,962.00)\n \nBody\n \nWHEREAS, the City of Columbus, Department of Public Service, received a request from Jennifer Heckert, H&H Reserve Holdings, LLC asking that the City transfer them a 740 square foot (0.017 acre) portion of the right-of-way near E. Long Street.  The right-of-way area is South of Long Street and east of Talmadge Street, abutted by parcel 010-039421 to the east, and 010-023992 to the west; and \n \nWHEREAS, transfer of this right-of-way will allow the owner to create an ADA compliant entrance to their building and provide a space to store dumpsters; and\n \nWHEREAS, the Department of Public Service has agreed to transfer via quitclaim deed the right-of-way as described and shown within attached legal description and exhibit, and extinguishes its need for this public right-of-way; and\n \nWHEREAS, per current practice, comments were solicited from interested parties, including City agencies, private utilities and the applicable area commission, before it was determined that, subject to the retention of a general utility easement for those utilities currently located within this right-of-way, the City will not be adversely affected by the transfer of this right-of-way; and\n \nWHEREAS, the Department of Public Service submitted a request to the City Attorney’s Office, asking that they establish a value for this right-of-way; and\n \nWHEREAS, a value of $2,962.00 was established; and\n \nWHEREAS, this request went before the Land Review Commission on April 20, 2023; and\n \nWHEREAS, after review of the request, the Land Review Commission voted to recommend the above referenced right-of-way be transferred to H&H Reserve Holdings LLC at the cost of $2,962.00; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Public Service be, and hereby is, authorized to execute a quitclaim deed and other incidental instruments prepared by the City Attorney’s Office, necessary to transfer the right-of-way described below and depicted in the attached exhibit which is incorporated into this ordinance for reference, to H&H Reserve Holdings LLC; to-wit:\n \nDESCRIPTION OF 0.017 ACRES\nLYING WEST OF MONROE AVENUE\nAND SOUTH OF LONG STREET\n \n                     Situated in the State of Ohio, County of Franklin, City of Columbus, being all of an 11 feet wide alley located in Gates’ Subdivision, as shown and delineated in Plat Book 5, Page 55, Recorder's Office, Franklin County, Ohio, and being bounded and more particularly described as follows:\n \n                     Beginning, at a MAG nail set, at the northeasterly corner of lot 4 of said Gates’ Subdivision, and the southwesterly intersection of said 11 feet wide alley, and Long Street (70 feet wide, P.B. 2, Pg. 172);\n \n                     Thence North 81°55'54\" East, a distance of 11.23 feet, along the southerly line of said Long Street, and the northerly line of said alley, to a rebar set, at the southeasterly intersection of said alley and said Long Street, and the northwesterly corner of lot 1 of said Gates’ Subdivision;\n \n                     Thence South 03°35'28\" West, a distance of 67.54 feet, along the easterly line of said alley, the westerly line of said lot 1, and the westerly line of lots 2 and 3 of said Gates’ Subdivision, to a rebar set, at the southeasterly corner of said alley, at a northeasterly interior corner of said lot 3;\n \n                     Thence North 85°47'18\" West, a distance of 11.00 feet, along the southerly terminus of said alley, and the northerly line of said lot 3, to a point, in the east brick face of a building, at the southwesterly corner of said alley, and the northwesterly corner of said lot 3, and on the easterly line of said lot 4;\n \n                     Thence North 03°35'28\" East, a distance of 65.15 feet, along the line common to said alley and said lot 4, to the Point of Beginning, containing 0.017 acres more or less, and being subject to all easements, restrictions and rights-of-way of record. \n \n                     The bearings are based on the Ohio State Plane Coordinate System, South Zone, NAD83 (CORS). Said bearings originated from a field traverse which was referenced to said Coordinate System by GPS observations and observations of selected stations in the Ohio Department of Transportation Real-Time-Network. The portion of the southerly line of Long Street, having a bearing of North 81°55’54” East and monumented as shown hereon, is designated the “basis of bearing” for this description.\n \nAll rebar set are 5/8 inch DIA. 30 inches in length, with a red plastic cap stamped with the name “Landmark Survey”.\n \n                     The above description is based on an actual field survey performed in May of 2023.\n \nSECTION 2.  That the attached referenced real property shall be, and hereby is, considered excess road right-of-way and the public rights therein shall terminate upon the Director's execution and delivery of said quitclaim deed to the grantee thereof.\n \nSECTION 3.  That a general utility easement in, on, over, across and through the legal description and attached exhibit describing the right-of-way shall be retained unto the City of Columbus for those utilities located within said right-of-way.\n \nSECTION 4.  That upon notification and verification of the relocation of all utilities located within the retained general utility easement area the Director of the Department of Public Service is hereby authorized to execute those documents necessary to release the retained general utility easement with no additional compensation due to the City and with no further legislative action required by the City.\n \nSECTION 5.  That the City will receive a total of $2,962.00 to be deposited in Fund 7748, Project P537650, for granting the requested transfer.\n \nSECTION 6.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 90,
    "meeting_date": "2023-10-09",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Property & Real Estate",
      "Public Works"
    ]
  }
}