{
  "success": true,
  "vote": {
    "id": 7638,
    "item_number": "CA-27",
    "title": "To authorize the City Attorney to spend City funds to acquire and accept in good faith the real property located at 1553 Brown Road {Franklin County Tax Parcel No140-000154}, from Brown Road Community Church Inc., an Ohio nonprofit corporation; to contract for associated professional services in order for the Recreation and Parks Department to timely complete the acquisition of the property; to authorize the appropriation of $101,531.60 within the Recreation and Parks Permanent Improvement Fund; to authorize the transfer of $177,728.90 within the Recreation and Parks Voted Bond Fund; to authorize the transfer of $132,271.10 within the Recreation and Parks Permanent Improvement Fund; to authorize the amendment of the 2023 Capital Improvements Budget; to authorize the expenditure of $310,000.00 from the Recreation and Parks Voted Bond Fund and Permanent Improvement Fund; and to declare an emergency. ($310,000.00)",
    "description": "BACKGROUND: The City’s Recreation and Parks Department (“CRPD”) is engaged in acquiring approximately 8.989, more or less, acres of real estate located at 1553 Brown Road {Franklin County Tax Parcel No140-000154}, from Brown Road Community Church Inc., an Ohio nonprofit corporation (“Real Estate”). CRPD has successfully negotiated a purchase contract for the purchase of the Real Estate. CRPD now requests the City Attorney’s Real Estate Division acquire the Real Estate in good faith and contract for associated professional services (e.g. surveys, title work, appraisals, etc.) as part of the closing so that CRPD can timely complete the acquisition of the Real Estate. \n \nCONTRACT COMPLIANCE:  Not applicable. \n \nFISCAL IMPACT: This ordinance will authorize the expenditure of up to $310,000.00 from the Recreation and Parks Voted Bond Fund 7702 and Permanent Improvement Fund 7747.\n \nEMERGENCY JUSTIFICATION: Emergency action is requested in order to acquire the Real Estate and allow the Recreation and Parks Department to timely complete the Public Project without unnecessary delay and meet the October 9, 2023 contract requirement for closing, which will preserve the public peace, health, property, safety, and welfare. \n \nTitle\n \nTo authorize the City Attorney to spend City funds to acquire and accept in good faith the real property located at 1553 Brown Road {Franklin County Tax Parcel No140-000154}, from Brown Road Community Church Inc., an Ohio nonprofit corporation; to contract for associated professional services in order for the Recreation and Parks Department to timely complete the acquisition of the property; to authorize the appropriation of $101,531.60 within the Recreation and Parks Permanent Improvement Fund; to authorize the transfer of $177,728.90 within the Recreation and Parks Voted Bond Fund; to authorize the transfer of $132,271.10 within the Recreation and Parks Permanent Improvement Fund; to authorize the amendment of the 2023 Capital Improvements Budget; to authorize the expenditure of $310,000.00 from the Recreation and Parks Voted Bond Fund and Permanent Improvement Fund; and to declare an emergency. ($310,000.00)\nBody\n \nWHEREAS, the Recreation and Parks Department (“CRPD”) desires to purchase approximately 8.989, more or less, acres of real estate located at 1553 Brown Road {Franklin County Tax Parcel No140-000154}, from Brown Road Community Church Inc., an Ohio nonprofit corporation (“Real Estate”); and \n \nWHEREAS, authority is needed to authorize the City attorney to acquire and accept the Real Estate in order for CRPD to complete the acquisition of the Real Estate (“Public Project”); and \n \nWHEREAS, the purchase of this Real Estate will allow for the Recreation and Parks Department to establish park and green space; and \n \nWHEREAS, it is necessary to authorize the appropriation of $101,531.60 within the Recreation and Parks Permanent Improvement Fund 7747; and\nWHEREAS, it is necessary to authorize the transfer of $177,728.90 within the Recreation and Parks Voted Bond Fund 7702; and\nWHEREAS, it is necessary to authorize the transfer of $132,271.10 within the Recreation and Parks Permanent Improvement Fund 7747; and\nWHEREAS, it is necessary to authorize the amendment of the 2023 Capital Improvements Budget Ordinance 1711-2023 in order to provide sufficient budget authority for this and future projects; and\nWHEREAS, it is necessary to authorize the expenditure of $310,000.00 from the Recreation and Parks Voted Bond Fund 7702 and Permanent Improvement Fund 7747; and\nWHEREAS, the City Attorney is authorized to spend up to Three Hundred Ten Thousand and 00/100 U.S. Dollars ($310,000.00), or as much as is necessary, from the Recreation and Parks Voted Bond Fund 7702 and Permanent Improvement Fund 7747 to acquire the Real Estate; and \n \nWHEREAS, an emergency exists in the usual daily operations of CRPD in that it is immediately necessary to acquire the Real Estate to allow the Recreation and Parks Department to timely complete the Public Project by the October 9, 2023 contract requirement for closing in order to prevent unnecessary delay NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the City Attorney is authorized to acquire and accept certain fee simple title and lesser real estate to approximately 8.989, more or less, acres of real estate located at 1553 Brown Road {Franklin County Tax Parcel No140-000154}, from Brown Road Community Church Inc., an Ohio nonprofit corporation (“Real Estate”). \n \nSECTION 2. That the City Attorney is authorized to contract for professional services (e.g. surveys, title work, appraisals, etc.) associated with the Real Estate’s acquisition.\n \nSECTION 3. That the appropriation of $101,531.60 is authorized within the Recreation and Parks Permanent Improvement Fund 7747 per the accounting codes in the attachment to this ordinance.  \n \nSECTION 4. That the transfer of $177,728.90 or so much thereof as may be needed, is hereby authorized between projects within the Recreation and Parks Voted Bond Fund 7702 per the accounting codes in the attachment to this ordinance.\nSECTION 5. That the transfer of $132,271.10 or so much thereof as may be needed, is hereby authorized between projects within the Recreation and Parks Permanent Improvement Fund 7747 per the accounting codes in the attachment to this ordinance.\nSECTION 6. That the 2023 Capital Improvements Budget Ordinance 1711-2023 is hereby amended as follows in order to provide sufficient budget authority for this ordinance and future projects.            \nFund / Project / Project Name / Current Revised Authority / Current Remaining Authority / Change / Amended Revised Authority / Amended Remaining Authority\nFund 7702 / P512000-100000 / New Development - Misc. (Voted Carryover) / $3,400,312 / $3,400,312 / ($3,075,376) / $324,936 / $324,936 (to match cash)\nFund 7747 / P510316-100000 / Greenways Projects (Carryover) / $0 / $0 / $30,740 / $30,740 / $30,740 (to match cash)\nFund 7747 / P510052-100000 / Parkland Dedication - Greenlawn, Frank Road (Carryover) / $4,480 / $4,480 / ($4,480) / $0 / $0\nFund 7747 / P510316-100000 / Greenways Projects (Carryover) / $30,740 / $30,740 / ($30,740) / $0 / $0\nFund 7747 / P510759-100000 / CC Southwest - Parkland Dedication (Carryover) / $97,052 / $97,052 / ($97,052) / $0 / $0\nFund 7702 / P512000-100000 / New Development - Misc. (Voted Carryover) / $324,936 / $324,936 / ($177,729) / $147,207 / $147,207  \nFund 7702 / P513010-100000; Brown Road Parkland Acquisition (Voted Carryover) / $0 / $0 / $177,729 / $177,729 / $177,729  \nFund 7747 / P513010-100000; Brown Road Parkland Acquisition (Carryover) / $0 / $0 / $132,272 / $132,272  / $132,272  \nSECTION 7. For the purpose stated in Section 1, the expenditure of $310,000.00 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Recreation and Parks Voted Bond Fund 7702 and Permanent Improvement Fund 7747 in object class 06 Capital Outlay per the accounting codes in the attachments to this ordinance.\n \nSECTION 8. That the City Attorney, in order to exercise the authority described in Sections One (1) and Two (2) of this ordinance, is authorized to spend up to Three Hundred Ten Thousand and 00/100 U.S. Dollars ($310,000.00) or as much as may be necessary, from the Recreation and Parks Voted Bond Fund 7702 and Permanent Improvement Fund 7747 according to the account codes in the attachment to this ordinance, which is made a part of this ordinance and fully incorporated for reference as if rewritten.  \n \nSECTION 9. That the City Auditor is authorized and directed to establish any appropriate accounting codes once the funds necessary to carry out the purpose of this ordinance are deemed appropriated.\n \nSECTION 10. That the City Auditor is authorized and directed to transfer any unencumbered balance in the Public Project’s account to the unallocated balance within the same fund upon receipt of certification by the director of the department administering the Public Project that the Public Project is complete and the monies are no longer required for the Public Project, except that no transfer can be made from a project account by monies from more than one source.\n \nSECTION 11. That the City Auditor is authorized and directed to establish any proper and appropriate project accounting numbers.\n \nSECTION 12. That the City Auditor is authorized and directed to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 13. That this ordinance, for the reasons stated in the preamble, which are made a part of this ordinance and fully incorporated for reference as if rewritten, is declared to be an emergency measure and shall take effect and be in force from and after this ordinance’s passage and approval by the Mayor or ten (10) days after its adoption if the Mayor neither approves nor vetoes this ordinance.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 90,
    "meeting_date": "2023-10-09",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Community Services",
      "Contracts & Agreements"
    ]
  }
}