{
  "success": true,
  "vote": {
    "id": 7643,
    "item_number": "CA-32",
    "title": "To authorize the Director of Recreation and Parks to enter into contract with CAP-STONE & Associates, Inc. for the Hard Surface Program 2024 Project; to authorize the transfer of $175,587.36 within the Recreation and Parks Voted Bond Fund, to authorize the amendment of the 2023 Capital Improvements Budget; and to authorize the expenditure of $175,587.36 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($175,587.36) (Amended by ord. 0072-2026 passed on 2/9/2026 -LG)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Director of the Recreation and Parks Department to enter into contract with CAP-STONE & Associates, Inc. to provide design services for the Hard Surface Program 2024 Project. The contract amount is $115,587.36, with a contingency of $60,000.00, for a total of $175,587.36 being authorized by this ordinance.\n \nRecreation and Parks allocates a portion of the Capital Improvements Budget to improve existing hard surfaces and accessibility each year. The hard surfaces program focuses on the removal and replacement of existing asphalt and concrete surfaces that are highly used by the public, including entry drives, parking lots, park drives, sport courts, walkways, and trails. These improvements ensure safe and easy access to the parks and facilities. Areas for improvement are requested from internal staff and the public, primarily through 311 requests. All requests are then assessed and given a Pavement Condition Rating (PCR), indicating a rank from 0, meaning the worst condition, to 100, meaning the best condition. All requests are then prioritized for action based on their respective PCR scores and feedback from relevant stakeholders.\n \nThis contract will provide engineering services to assess existing hard surface conditions, design improvements for the hard surfaces, and create complete construction documents for bidding in early 2024.\n \nVendor Bid/Proposal Submissions (Office of Diversity and Inclusion designation status): \nBids were advertised through Vendor Services and Bonfire, in accordance with City Code Section 329, on June 30, 2023 and received by the Recreation and Parks Department on August 1, 2023. Bids were received from the following companies:\n \nCAP-STONE & Associates (WBE)\nResource International (WBE)\nCompass Infrastructure Group (WBE)\n \nOf note, professional services contracts are quality based selections and not based on price. Costs were not requested nor were they part of this evaluation.\n \nIn accordance with City Code, a selection team evaluated the proposals and recommended CAP-STONE & Associates, Inc. be selected to perform the work. The firm was chosen based on their referenced projects, experience, qualifications, availability, timeline, and project approach.\n \nAs part of their bid, CAP-STONE & Associates, Inc. has proposed the following vendors to fulfill the Office of Diversity and Inclusion project goal:\n \nDLZ Ohio (MBE)\n \nCertification of the MBE being proposed was in good standing at the time the bid was awarded.\n \nPrincipal Parties: \nCAP-STONE & Associates, Inc.\n748 Green Crest Drive\nWesterville, Ohio 43081                                                      \nMary Sharrett, (614) 865-1874\nContract Compliance Number: 004933\nContract Compliance Expiration Date: July 19, 2024\n \nEmergency Justification: Emergency action is requested in order to ensure hard surface improvements at Lou Berliner Sports Park are completed prior to the 2024 tournament season, minimizing impacts to operations and associated revenue.\n \nBenefits to the Public: This project will provide high quality asphalt, concrete, and sport court surfaces throughout Recreation and Parks’ properties, ensuring a more consistent level of service across the City. These improvements increase accessibility, enjoyment of the parks, and health for residents.\n \nCommunity Input/Issues: Hard surface improvements are based off community requests for improvements. These are received via 311 requests, area commission meetings, word of mouth, and field staff observations.\n \nArea(s) Affected: Citywide (99)\n \nMaster Plan Relation: This project will support the Recreation and Parks Master Plan by removing access barriers to city parks and by updating at least five neighborhood parks per year.\n \nFiscal Impact: $175,587.36 is budgeted and available from within the Recreation and Parks Voted Bond Fund 7702 to meet the financial obligations of these expenditures.\nTitle\n \nTo authorize the Director of Recreation and Parks to enter into contract with CAP-STONE & Associates, Inc. for the Hard Surface Program 2024 Project; to authorize the transfer of $175,587.36 within the Recreation and Parks Voted Bond Fund, to authorize the amendment of the 2023 Capital Improvements Budget; and to authorize the expenditure of $175,587.36 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($175,587.36) (Amended by ord. 0072-2026 passed on 2/9/2026 -LG)\n \nBody\n \nWHEREAS, it is necessary to authorize the Director of the Recreation and Parks to enter into contract with CAP-STONE & Associates, Inc. for the Hard Surface Program 2024 Design Project; and\n \nWHEREAS, it is necessary to authorize the expenditure of $175,587.36 from the Recreation and Parks Voted Bond Fund; and, \n \nWHEREAS, it is necessary to authorize the amendment of the 2023 Capital Improvements Budget Ordinance 1711-2023 in order to provide sufficient budget authority for this and future projects; and\n \nWHEREAS, it is necessary to authorize the expenditure of $175,587.36 from the Recreation and Parks Voted Bond Fund 7702; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Recreation and Parks Department in that it is immediately necessary to authorize the Director to enter into contract with CAP-STONE & Associates, Inc. in order to ensure hard surface improvements at Lou Berliner Sports Park are completed prior to the 2024 tournament season, minimizing impacts to operations and associated revenue, all for the immediate preservation of the public health, peace, property, safety, and welfare; and NOW, THEREFORE  \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Recreation and Parks be and is hereby authorized to enter into contract with CAP-STONE & Associates, Inc. for the Hard Surface Program 2024 Project.\n \nSECTION 2. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 4. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 5. That the transfer of $175,587.36 or so much thereof as may be needed, is hereby authorized between projects within the Recreation and Parks Bond Fund 7702 per the account codes in the attachment to this ordinance.\n \nSECTION 6. That the 2023 Capital Improvements Budget Ordinance 1711-2023 is hereby amended as follows in order to provide sufficient budget authority for this ordinance and future projects.\nFund / Project / Project Name / Current Revised Authority / Current Remaining Authority / Change / Amended Revised Authority / Amended Remaining Authority\nFund 7702 / P511003-100000 / Reservoir Boat Ramp Renovations (Voted Carryover) / $0 / $0 / $41,627 / $41,627 / $41,627 (to match cash)\nFund 7702 / P511007-202102 / Hard Surface Improvements 2020-2021(Voted Carryover) / $0 / $0 / $17,546 / $17,546 / $17,546 (to match cash)\n \nFund 7702 / P510038-100000 / Linden Community Recreation Center (Voted Carryover) / $117,157 / $117,157 / ($117,157) / $0 / $0\nFund 7702 / P511003-100000 / Reservoir Boat Ramp Renovations (Voted Carryover) / $41,627 / $41,627 / ($40,884) / $743 / $743\nFund 7702 / P511007-202102 / Hard Surface Improvements 2020-2021(Voted Carryover) / $17,546 / $17,546 / ($17,546) / $0 / $0\n \nFund 7702 / P511007-202301 / Hard Surface Improvements 2023-2024 (Voted Carryover) / $0 / $0 / $175,587 / $175,587 / $175,587\n \nSECTION 7. For the purpose stated in Section 1, the expenditure of $175,587.36 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Recreation and Parks Voted Bond Fund 7702 in object class 06 Capital Outlay per the accounting codes in the attachments to this ordinance.  \n \nSECTION 8. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 90,
    "meeting_date": "2023-10-09",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}