{
  "success": true,
  "vote": {
    "id": 7644,
    "item_number": "CA-33",
    "title": "To authorize the City Auditor to correct revenue deposited by the Recreation and Parks Department into the Debt Service Recreation Fund since the effective date of debt service termination, January 1, 2023, by moving it to the Recreation and Parks operating fund, 2285.",
    "description": "Explanation\n \nBackground: This ordinance authorizes the City Auditor to correct the revenue deposited by the Recreation and Parks Department into  the Debt Service Recreation Fund (4411) since 1/1/2023 by moving it to the Recreation and Parks operating fund, 2285.  \n \nThe Recreation and Parks Department has historically provided a percentage of specific revenue sources from the Debt Service Recreation Fund to the Special Income Tax Fund annually for partial repayment of Recreation debt service.  It has been determined by the Director of Finance and the City Auditor that these payments were terminated effective January 1, 2023.\n \n \nFiscal Impact: this correction will cause an increase to the Recreation and Parks operating fund revenue.   \n \nTitle\n \nTo authorize the City Auditor to correct revenue deposited by the Recreation and Parks Department into the Debt Service Recreation Fund since the effective date of debt service termination, January 1, 2023, by moving it to the Recreation and Parks operating fund, 2285.\n \nBody\n \nWHEREAS, the Recreation and Parks Department has historically provided a percentage of specific revenue sources from the Debt Service Recreation Fund to the Special Income Tax Fund annually for partial repayment of Recreation debt service; and\n \nWHEREAS, the Director of Finance and the City Auditor have terminated these annual transfers of Recreation and Parks revenue to the SIT fund effective January 1, 2023; and\n \nWHEREAS, it is necessary for the City Auditor to Correct any revenue deposited by the Recreation and Parks Department into Fund 4411, Recreation Debt Service, during 2023 by moving it to Recreation Operating Fund 2285; NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. The Recreation and Parks Department has historically provided a percentage of specific revenue sources to the Debt Service Recreation Fund annually for partial repayment of Recreation debt service that is no longer applicable.  \n \nSECTION 2.  That per the Director of Finance and the City Auditor, these annual transfers of Recreation and Parks revenue to the SIT were terminated effective January 1, 2023.\n \nSECTION 3. That the City Auditor is authorized to correct any revenue deposited by the Recreation and Parks Department into Fund 4411, Recreation Debt Service, during 2023 by moving it to Recreation Operating Fund 2285.\n \nSECTION 4.  That funds are hereby deemed appropriated and corrections, expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 90,
    "meeting_date": "2023-10-09",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Parks & Recreation"
    ]
  }
}