{
  "success": true,
  "vote": {
    "id": 7685,
    "item_number": "CA-74",
    "title": "To authorize the Director of Finance and Management, on behalf of the Office of Construction Management, to enter into a construction contract with Black Bronco Construction for the CDBG Neighborhood Facilities Renovation projects, Star House and Reeb Avenue Center; to authorize the appropriation and expenditure of funds in an amount up to $475,000.00 within the Community Development Block Grant Fund (CDBG); and to declare an emergency.  ($475,000.00)",
    "description": "Explanation\n \n1. BACKGROUND:  This legislation authorizes the Director of Finance and Management to enter into a construction contract, on behalf of the Office of Construction Management, with Black Bronco Construction, for the CDBG Neighborhood Facilities Renovation projects, Star House and Reeb Avenue Center, in the amount of $475,000.00.\n \nStar House, located at 1220 Corrugated Way, Columbus, Ohio 43201, serves as a drop-in center for young people experiencing homelessness and provides immediate access to safety, basic needs, and resources. The scope of work for this project includes reconfiguration of the receiving/reception office/building entrances, and work comprises of demolition, a new wall layout, architecture assemblies, electrical, technology, HVAC, and glazing.\nThe Reeb Avenue Center, located at 280 Reeb Avenue, Columbus, Ohio 43207, is a community center that provides services including workforce development and job training, early learning preschool and child care, after-school and summer programming for school-aged children, and other social services.  The scope of work for this project includes a full kitchen upgrade, renovation of a new security/welcome entrance desk and comprises of painting, electrical, technology, HVAC, and new furniture.\n2. CONSTRUCTION CONTRACT AWARD:  The project was led by the Office of Construction Management via Bid Express on July 27, 2023.  Black Bronco Construction submitted the only bid in the amount of $475,000.00.\n \nBlack Bronco Construction’s bid was deemed the lowest, best, most responsive and responsible bid in the amount of $475,000.00.  Their Contract Compliance Number is 11955 (expires 2/16/25, MBE-owned firm).   Searches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against Black Bronco Construction.\n \n3. MINORITY CONTRACT PARTICIPATION: The ODI-assigned goal for this project is 10%.  Black Bronco Construction is an MBE-designated firm with the City and will meet the goal through self-performance. \n \n4. EMERGENCY DESIGNATION: Construction needs to be finished by November 2, 2023 in order to meet the requirements of the CDBG grant.  Emergency designation will eliminate 6 weeks of downtime.  Materials should be ordered as soon as possible due to current supply-chain issues.  Having the necessary materials on order will enable the contractor to mobilize and finish construction by the November 2, 2023 deadline.\n \n5. FISCAL IMPACT:  Funding for this project will come from the Community Development Block Grant (CDBG) under the U.S. Department of Housing and Urban Development (HUD).  The Community Development Block Grant (CDBG) Entitlement Program provides annual grants on a formula basis to cities and counties to develop viable urban communities.  An appropriation of funds will be needed to align this Ordinance with the Draft FY 2023 Annual Action Plan as approved by City Council through the adoption of Ordinance No. 3353-2022.\n \nThe appropriation and expenditure of $475,000.00 will be needed within the Community Development Block Grant (CDBG) Fund.\n \n \nTitle\n \nTo authorize the Director of Finance and Management, on behalf of the Office of Construction Management, to enter into a construction contract with Black Bronco Construction for the CDBG Neighborhood Facilities Renovation projects, Star House and Reeb Avenue Center; to authorize the appropriation and expenditure of funds in an amount up to $475,000.00 within the Community Development Block Grant Fund (CDBG); and to declare an emergency.  ($475,000.00)\n \n \nBody\n \nWHEREAS, one bid for the CDBG Neighborhood Facilities Renovation projects, Star House and Reeb Avenue Center was received and publicly opened in the office of the Director of Finance and Management on July 27, 2023; and\n \nWHEREAS, the lowest, best, most responsive and responsible bid was from Black Bronco Construction in the amount of $475,000.00; and\n \nWHEREAS, it is necessary to authorize the Director of Finance and Management to award and execute a construction contract for the CDBG Neighborhood Facilities Renovation projects, Star House and Reeb Avenue Center; and \n \nWHEREAS, it is necessary to authorize the appropriation and expenditure of $475,000.00 from the Community Development Block Grant Fund included in the Draft 2023 Annual Action Plan adopted under Ordinance No. 3353-2022; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Finance and Management, Office of Construction Management, in that it is immediately necessary to authorize the Director of Finance and Management to enter into a construction contract for the CDBG Neighborhood Facilities Renovation projects, Star House and Reeb Avenue Center, with Black Bronco Construction; in an emergency manner in order to reduce project down time and expedite material orders thereby enabling construction to be completed by the November 2, 2023 deadline of the CDBG grant; all for the immediate preservation of the public health, safety, peace, property and welfare; and NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Finance and Management is hereby authorized to enter into a construction contract, on behalf of the Office of Construction Management, with Black Bronco Construction, for the CDBG Neighborhood Facilities Renovation projects, Star House and Reeb Avenue Center, in an amount up to $475,000.00.\n \nSECTION 2. That the appropriation and expenditure up to $475,000.00, or so much thereof as may be needed, is hereby authorized within the Community Development Block Grant Fund - Fund No. 2248, per the account codes in the attachment to this ordinance.\n \nSECTION 3. That the monies in the foregoing sections shall be paid upon order of the Director of Finance and Management, and that no order shall be drawn or money paid except by voucher, the form of which shall be approved by the City Auditor.\n \nSECTION 4.  That the funds necessary to carry out the purpose of this Ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That the City Auditor is hereby authorized and directed to transfer any unencumbered balance in the project account to the unallocated balance within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies no longer required for said project; except that no transfer shall be made from a project account by monies from more than one source.\n \nSECTION 6.  That the City Auditor is authorized to establish proper project accounting numbers as appropriate.\n \nSECTION 7.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this Ordinance.\n \nSECTION 8.  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 90,
    "meeting_date": "2023-10-09",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}