{
  "success": true,
  "vote": {
    "id": 7690,
    "item_number": "CA-79",
    "title": "To authorize the Finance and Management Director on behalf of the Fleet Management Division to purchase two (2) riding floor scrubbers from Jordan Power & Equipment Co.  LLC; to authorize expenditure of $54,335.00 from the Fleet G. O. Debt Fund; to authorize the transfer of $54,335.00 within the Fleet Management G. O. Debt Fund; to authorize the amendment of the 2023 Capital Improvement Budget; and to declare an emergency. ($54,335.00)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Finance and Management Director on behalf of the Fleet Management Division to purchase two (2) riding floor scrubbers from Jordan Power & Equipment Co. This machine will be utilized by the Department of Finance Fleet Division for upkeep of the Fleet Management Facility that provides fleet services and repairs throughout the city. RFQ025421 closed on 7/31/2023. There were two (2) bidders and the award was given to Jordan Power & Equipment Co. Grainger was only able to supply one of the two models requested, not fulfilling the order. This meant that Jordan Power & Equipment Co. initial bid came out to being the lowest and best bid response to bid specifications, length of warranty and available delivery date: \n \nJordan Power & Equipment Co.  - $54,335.00\nGrainger - $26,643.22\n \nJordan Power & Equipment Co, ID#341180457\n \nFiscal Impact: A total of $54,335.00 will be spent from the Fleet Management G. O. Debt  Fund 5205. Amendments to the 2023 Capital Improvement Budget and transfers of cash within Fund 5205 will be necessary to align budget authority and cash with the proper projects. \n \nEmergency action is requested due to the instability of the automobile supply chain. The market volatility of all the OEMs continues with the ongoing shortage of chips and other critical supply line parts to produce vehicles. This limited availability is causing machinery to increase in cost as well as limit their availability and produce unacceptably long lead times. Therefore, emergency legislation is being requested so that Fleet may ensure the pending purchase and delivery of this machinery.\n  \nTitle\nTo authorize the Finance and Management Director on behalf of the Fleet Management Division to purchase two (2) riding floor scrubbers from Jordan Power & Equipment Co.  LLC; to authorize expenditure of $54,335.00 from the Fleet G. O. Debt Fund; to authorize the transfer of $54,335.00 within the Fleet Management G. O. Debt Fund; to authorize the amendment of the 2023 Capital Improvement Budget; and to declare an emergency. ($54,335.00)\n \nBody\nWHEREAS, the Fleet Management Division intends to purchase two (2) riding floor scrubbers; and \n \nWHEREAS Jordan Power & Equipment Co.  LLC bid and was awarded RFQ025421; and\n \nWHEREAS, it is necessary to authorize the transfer of $54,335.00 within the Fleet Management Capital Fund 5205; and\nWHEREAS, it is necessary to authorize the amendment of the 2023 Capital Improvement Budget Ordinance 1711-2023 in order to provide sufficient budget authority for this and future projects; and\nWHEREAS, an emergency exists in the usual daily operation of the Finance and Management Department, Fleet Management Division, in that it is immediately necessary to purchase two (2) riding floor scrubbers from Jordan Power & Equipment Co. for the upkeep of Fleet Management services facility which provides repairs and services for the entirety of the City of Columbus Fleet will be ready as soon as possible and it is immediately necessary to purchase because of the instability of the automobile supply chain, the market volatility of all the OEMs continues with the ongoing shortage of chips and other critical supply line parts to produce vehicles, and this limited availability is causing machinery to increase in cost as well as limit their availability and produce unacceptably long lead time, all for the immediate preservation of the public health, peace, property, safety and welfare; NOW, THEREFORE:\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS: \n \nSECTION 1. That the Finance and Management Director, on behalf of the Fleet Management Division, is hereby authorized to establish a purchase order for the acquisition of two (2) riding floor scrubbers from Jordan Power & Equipment Co. for use by the Department of Finance, Fleet Management Division.\n \nSECTION 2. That the expenditure of $54,335.00, or so much thereof as may be necessary, is hereby authorized and approved from the Fleet Management G. O. Debt Fund 5205 within project P550003-100000 in Object Class 06 per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That the transfer of $54,335.00 or so much thereof as may be needed, is hereby authorized between projects within the Fleet Management G. O. Debt Fund 5205 per the accounting codes in the attachment to this ordinance.\nSECTION 4. That the 2023 Capital Improvement Budget Ordinance 1711-2023 is hereby amended as follows in order to provide sufficient budget authority for this ordinance and future projects:\n \nFund/Project ID/Project Name (Funding Source)/Current Authority/Revised Authority/Change\n5205/P550013-100000/Fleet Facility Renovations (Fleet Management Carryover)/$326,032.00/$271,697.00/($54,335.00)\n5205/P550003-100000/Fleet Equipment Replacement (Fleet Management Carryover)/$475,301.00/$420,966.00/$54,335.00\n \nSECTION 5. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 6. That the monies in the foregoing Sections shall be paid upon order of the Director of Finance and Management, and that no order shall be drawn or money paid except by voucher, the form of which shall be approved by the City Auditor.\n \nSECTION 7. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 8. That for reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 90,
    "meeting_date": "2023-10-09",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services",
      "Public Works"
    ]
  }
}