{
  "success": true,
  "vote": {
    "id": 7727,
    "item_number": "CA-15",
    "title": "To authorize the Franklin County Municipal Court Judges and the Department of Public Utilities to modify past, present, and future contracts and purchase orders from Willo Security, Inc. to US Protection Services LLC DBA Royce US Protection Services and to declare an emergency.",
    "description": "Explanation\nBACKGROUND:  This legislation authorizes the Administrative Judge of the Franklin County Municipal Court Judges and the Department of Public Utilities to modify past, present, and future contracts and purchase orders with Willo Security, Inc.  Willo Security, Inc. has merged with US Protection Services LLC DBA Royce US Protection Services, anticipated to be effective October 1, 2023.  This ordinance authorizes the assignment of all past, present, and future business done by the City of Columbus from Willo Security, FID 34-1808997, to US Protection Services LLC DBA Royce US Protection Services, FID 47-4364396.\n \nNo additional funds are necessary to modify the option contracts as requested for the court.  There is no change in the type of services being procured, and the original contract was formally bid  The original terms and conditions remain in effect. The Department of Public Utilities has contracts that are under $50,000 that will need to be included in the change.\n \nEMERGENCY DESIGNATION:  The Franklin County Municipal Court Judges respectfully request this legislation be considered an emergency in order to maintain uninterrupted security services.\n \nFISCAL IMPACT: No additional funding is required to modify the contracts.  \n \nTitle\n \nTo authorize the Franklin County Municipal Court Judges and the Department of Public Utilities to modify past, present, and future contracts and purchase orders from Willo Security, Inc. to US Protection Services LLC DBA Royce US Protection Services and to declare an emergency.\n \n..Body\n \nWHEREAS, the Franklin County Municipal Court Judges and the Department of Public Utilities have contracts and open purchase orders for security services; and,  \n \nWHEREAS, Willo Security, Inc. has merged with US Protection Services LLC DBA Royce US Protection Services, and in addition to notifying the Court, US Protection Services LLC DBA Royce US Protection Services has agreed to honor the past, present, and future contracts and agreements; and,\n \nWHEREAS, an emergency exists in the usual daily operation of the Franklin County Municipal Court Judges and the Department of Public Utilities in that it is immediately necessary to modify all contracts and purchase orders established and in process with Willo Security, Inc., in order to maintain uninterrupted security services, thereby preserving the public health, peace, property, safety, and welfare; now, therefore: \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Franklin County Municipal Court Judges and the Department of Public Utilities  is hereby authorized to modify all past, present, and future contracts and purchase orders pursuant to those contracts to reflect the change from Willo Security, FID 34-1808997, to US Protection Services LLC DBA Royce US Protection Services, FID 47-4364396.\n \nSECTION 2. That these modifications are in accordance with relevant provisions of Chapter 329 of the Columbus City Code.  \n \nSECTION 3.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 91,
    "meeting_date": "2023-10-16",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Emergency Services",
      "Infrastructure"
    ]
  }
}