{
  "success": true,
  "vote": {
    "id": 7732,
    "item_number": "CA-20",
    "title": "To authorize the Board of Health to modify existing contracts with James G. Ryan and Phillip L. Wright Jr., for hearing officer services; to authorize the expenditure to cover these modifications from the 2023 Health Special Revenue Fund; and to declare an emergency. ($12,700.00).",
    "description": "BACKGROUND:   This ordinance authorizes the Board of Health to modify an existing contract with James G. Ryan in an amount not to exceed $9,050.00 for a new contract amount of $13,050.00; and to modify an existing contract with Phillip L. Wright Jr. in an amount not to exceed $3,650.00 for a new contract amount of $7,650.00. Both contracts were entered into on March 1, 2023 for the period ending February 29, 2024. The total increase in funding for both contracts shall not exceed $12,700.00. All other provisions of the contracts remain in effect.\n \nThe need for additional goods or services could not be foreseen at the time both contracts were initially awarded because there was a new fine structure implemented this year, resulting in an increased amount of hearings. Without the new fine structure in place, there was no way to estimate the amount of hearings it would result in. \n \nIt would not be in the city's best interests to have the additional contract requirements for both contracts awarded through other procurement processes as specified in Columbus City Code 329 because all hearings are scheduled for the remainder of the contract cycle and there are select hearing officers who have the expertise to facilitate. \n \nThe price for the additional goods or services for both contracts was determined based on the number of scheduled hearings. \n \nColumbus Public Health has a need for hearing officers to preside over hearings on matters relating to business conducted by the Board of Health as prescribed by Ohio Revised Code 3709.20, Ohio Administrative Code 3701-21-26 and Ohio Administrative Code 901:3-4-08 and Columbus City Health Code 209.05.\n \nJames G. Ryan and Phillip L. Wright Jr. are operating as sole proprietors in relation to these services and are therefore not required to be registered with the Secretary of State Office. Both underlying contracts did not require authorizing legislation based on their original contract amounts.\n \nFISCAL IMPACT Expenditures to provide these services are budgeted in the 2023 Health Special Revenue Fund, Fund No. 2250. ($12,700.00) \n \nTitle\n \nTo authorize the Board of Health to modify existing contracts with James G. Ryan and Phillip L. Wright Jr., for hearing officer services; to authorize the expenditure to cover these modifications from the 2023 Health Special Revenue Fund; and to declare an emergency. ($12,700.00).\n \nBody\n \nWHEREAS, The Board of Health has a need to modify an existing contract with James G. Ryan in an amount not to exceed $9,050.00 for a new contract amount of $13,050.00; and to modify an existing contract with Phillip L. Wright Jr. in an amount not to exceed $3,650.00 for a new contract amount of $7,650.00; and\n \nWHEREAS, James G. Ryan and Phillip L. Wright Jr. have the expertise required to carry out those services; and\n \nWHEREAS, an emergency exists in the usual, daily operations of the Department of Public Health in that it is immediately necessary to authorize the Board of Health to modify an existing contract for hearing officer services with James G. Ryan and Phillip L. Wright Jr., to allow for scheduled appeals to be heard and addressed in a timely manner in accordance with the courts, all for the immediate preservation of the public peace, property, health, safety and welfare; and now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Board of Health is hereby authorized to modify an existing contract with James G. Ryan in an amount not to exceed $9,050.00 for a new contract amount of $13,050.00; and to modify an existing contract with Phillip L. Wright Jr. in an amount not to exceed $3,650.00 for a new contract amount of $7,650.00.\n \nSECTION 2. That to pay the cost of said contract modifications, the expenditure of $12,700.00 is hereby authorized from the Health Special Revenue Fund, Fund 2250, Department 50, Division 5001, per the accounting codes attached to this ordinance.\n \nSECTION 3.  That this contract modification is in compliance with Chapter 329 of the Columbus City Code.\n \nSECTION 4.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes necessary to ensure that these contract modifications are properly accounted for and recorded accurately on the city's financial records.\n \nSECTION 6.  That for reasons stated in the preamble hereto, which is hereby made a part thereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 91,
    "meeting_date": "2023-10-16",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}