{
  "success": true,
  "vote": {
    "id": 7770,
    "item_number": "CA-5",
    "title": "To Celebrate the Achievements of Roy Lichtenstein in Honor of the Centennial Anniversary of his Birth.",
    "description": "Title\nTo Celebrate the Achievements of Roy Lichtenstein in Honor of the Centennial Anniversary of his Birth.\nBody\nWHEREAS, Roy Lichtenstein was born on October 27, 1923; and\n \nWHEREAS, Roy Lichtenstein is a proud alumnus of The Ohio State University and his time in Columbus played a pivotal role in shaping his artistic journey, fostering his creative spirit, and nurturing the talents that would later define his illustrious career; and \n \nWHEREAS, Roy’s iconic art style, characterized by bold lines, vivid colors, and the use of Ben-Day dots, is synonymous with modern American art and inspired a new generations of artists and deepened our appreciation of the arts; and\n \nWHEREAS, Roy’s art has been repeatedly exhibited across Columbus, including at the Columbus Museum of Art, the Ohio State Fair, and the Wexner Center for the Arts, and his sculpture work is prominently installed at John Glenn Columbus Airport and on the campus of The Ohio State University; and\n \nWHEREAS, Roy Lichtenstein's legacy remains an enduring source of pride and inspiration for The Ohio State University and the Columbus community at large; and\n \nWHEREAS, 2023 marks 100 years since the birth of Roy Lichtenstein, providing an opportunity for the celebration of one of the greatest artists of all time and reflection on his continuing impact on our culture and community; now, therefore\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: That this Council celebrates the achievements of Roy Lichtenstein in honor of the centennial anniversary of his birth.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 92,
    "meeting_date": "2023-10-30",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}