{
  "success": true,
  "vote": {
    "id": 7780,
    "item_number": "CA-15",
    "title": "To authorize the Director of the Department of Public Service to execute those documents necessary for the transfer of a 0.260 acre portion of S. 6th Street right-of-way to Ohio Health Corporation.",
    "description": "Explanation\n \n1.  Background:  The City of Columbus, Department of Public Service, received a request from Ohio Health Corporation, asking that the City transfer them a 0.260 acre portion of the S. 6th Street right-of-way.  Right-of-way area is located between 290 E. Town Street; PID= 010-006164 and 300 E. Town Street; PID= 010-008401.  The portion runs north/south directionally, is 60’ wide, east to west, and is 190’ long, north to south.\n \nTransfer of this right-of-way will allow OhioHealth to combine with the adjacent parcels they currently own for the development of expansion of downtown emergency and critical care services. Currently, they are planning to develop a building on the 290 E Town Street parcel that would expand the site through and across 6th Street, connecting into the main hospital on the basement, 1st floor, 2nd floor and possibly other floors above.  The Department of Public Service has agreed to transfer the right-of-way via a quitclaim deed as described and shown within the attached legal description and exhibit, and extinguishes its need for this public right-of-way.  \n \nPer current practice, comments were solicited from interested parties, including City agencies, private utilities and the applicable area commission, before it was determined that, subject to the retention of a general utility easement for those utilities currently located within this right-of-way, the City will not be adversely affected by the transfer of this right-of-way.  \n \nThe Department of Public Service submitted a request to the City Attorney’s Office, asking that they establish a value for this right-of-way, and a value of $29.00 per square foot was established.  This value is at a reduced easement retention value.  \n \nThis request went before the Land Review Commission on September 21, 2023.  After review of the request, the Land Review Commission voted to recommend the above referenced right-of-way be transferred to Ohio Health Corporation at complete mitigation and will be transferred at no cost to them.  \n                     \n2.  FISCAL IMPACT:  The City will receive no funds for the transfer of the requested right-of-way.\n \nTitle\n \nTo authorize the Director of the Department of Public Service to execute those documents necessary for the transfer of a 0.260 acre portion of S. 6th Street right-of-way to Ohio Health Corporation. \n \nBody\n \nWHEREAS, the City of Columbus, Department of Public Service, received a request from Ohio Health Corporation, asking that the City transfer them a 0.260 acre portion of the S. 6th St. right-of-way.  Right-of-way area is located between 290 E. Town Street; PID= 010-006164 and 300 E. Town Street; PID= 010-008401.  The portion runs north/south directionally, is 60’ wide, east to west, and is 190’ long, north to south; and \n \nWHEREAS, transfer of this right-of-way will allow OhioHealth to combine with the adjacent parcels they currently own for the development of expansion of downtown emergency and critical care services. Currently they are planning to develop a building on the 290 E Town parcel that would expand the site through and across 6th street, connecting into the main hospital on the basement, 1st floor, 2nd floor and possibly other floors above; and\n \nWHEREAS, the Department of Public Service has agreed to transfer via quitclaim deed the right-of-way as described and shown within attached legal description and exhibit, and extinguishes its need for this public right-of-way; and\n \nWHEREAS, per current practice, comments were solicited from interested parties, including City agencies, private utilities and the applicable area commission, before it was determined that, subject to the retention of a general utility easement for those utilities currently located within this right-of-way, the City will not be adversely affected by the transfer of this right-of-way; and\n \nWHEREAS, the Department of Public Service submitted a request to the City Attorney’s Office, asking that they establish a value for this right-of-way; and\n \nWHEREAS, a value of $29.00 per square foot was established; and\n \nWHEREAS, this request went before the Land Review Commission on September 21, 2023; and\n \nWHEREAS, after review of the request, the Land Review Commission voted to recommend the above referenced right-of-way be transferred to Ohio Health Corporation at the cost of $0.00; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     That the 0.260 acre portion of right-of-way described and depicted in the exhibit, which is attached hereto and made a part hereof, is no longer needed by the City of Columbus and can be extinguished.\n \nSECTION 2.    That the Director of the Department of Public Service be, and hereby is, authorized to execute a quitclaim deed and other incidental instruments prepared by the City Attorney’s Office, necessary to transfer the right-of-way described below and depicted in the attached exhibit which is incorporated into this ordinance for reference, to Ohio Health Corporation.\n \nSECTION 3.   That a general utility easement in, on, over, across and through this excess right-of-way shall be, and hereby is, retained for those utilities currently located within said excess right-of-way.\n \nSECTION 4.   That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 92,
    "meeting_date": "2023-10-30",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Health & Safety",
      "Property & Real Estate",
      "Public Works"
    ]
  }
}