{
  "success": true,
  "vote": {
    "id": 7810,
    "item_number": "CA-45",
    "title": "To authorize the Director of the Department of Development to enter into a Housing Development Agreement (HDA) with Community Development for All People (CD4AP) for the Dering Family Apartments project; and to declare an emergency. ($0.00)",
    "description": "Explanation\n \nThis legislation will allow the Director of the Department of Development to enter into a Housing Development Agreement with Community Development for All People (CD4AP) for the Dering Family Apartments development, which will ultimately be funded with $2,000,000.00 from a future Capital Budget, Affordable Housing Bond. Once funds become available, an ordinance will be brought to Council to authorize a grant agreement.\n \nDering Family Apartments will sit on two parcels - one is a vacant field at 98 Dering, and one is currently the site of The Rice Bowl Restaurant, which will be demolished for the purpose of this development. The development will consist of 245 one-, two-, three-, and four-bedroom apartment units in three 4-story buildings. These apartments will be affordable to individuals and families making between 30% and 80% of the Area Median Income. The development will also have amenities including a fitness center, business center, playground, leasing office, and mailroom for all residents, as well as 380 parking spots. \n \nAdditionally, because this development is right on the South High Corridor, residents will have easy access to public transit that can take them to a number of important nearby amenities including groceries, healthcare facilities, shopping centers, schools, and parks. New commercial, single-family, and multi-family market rate developments have been moving down South High Street for several years. As new development moves south, it is vital that new affordable housing units be produced to ensure long-term affordability in the neighborhood.\n \nDering Family Apartments will be more than just an affordable housing community and will create tremendous value to the larger Far South community. It will also feature approximately 6,000 square feet of commercial space that will serve as a childcare facility open to the broader community that will be operated by Sprout Five, or Southside Early Children’s Learning Center. Sprout Five has a long and respected history of serving families on the Southside of Columbus. Locating both a childcare facility and an affordable apartment community designed for families will have a tremendous positive impact for both residents of Dering Family Apartments, and of the Far South neighborhood.\n \nEmergency action is requested in order to provide evidence of city funding by the closing date anticipated for the beginning of November to allow the project enough time to complete construction and be placed in service by the tax credit deadline.  Any delay could result in the project forfeiting their tax credits and losing the tax credit equity included in the project.\n \nFISCAL IMPACT: No funding is needed.\n \nCONTRACT COMPLIANCE: the vendor number is 008972 and expires August 16, 2024.\nTitle\n \nTo authorize the Director of the Department of Development to enter into a Housing Development Agreement (HDA) with Community Development for All People (CD4AP) for the Dering Family Apartments project; and to declare an emergency. ($0.00)\n \nBody\n \nWHEREAS, the Director of Development seeks to enter into a Housing Development Agreement (HDA) with Community Development for All People; and\n \nWHEREAS, the HDA would memorialize the City’s desired commitment to the project, pending City Council approval and future availability of funds; and\n \nWHEREAS, The Department of Development wishes to support this project by contributing\n$2,000,000.00 of bond funds upon availability, Affordable Housing Bond; and\n \nWHEREAS, this legislation would authorize the Director of Development to first execute the HDA and pending the availability of funding from the Capital Budget, Affordable Housing Bond the department will seek City Council’s approval to enter into a grant agreement; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development to pass this ordinance as emergency in order to provide evidence of city funding by the closing date anticipated for the beginning of November to allow the project enough time to complete construction and be placed in service by the tax credit deadline, thereby preserving the public health, peace, property, safety and welfare; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Department of Development is authorized to enter into a Housing Development Agreement (HDA) with Community Development for All People.\n \nSECTION 2. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 92,
    "meeting_date": "2023-10-30",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Emergency Services",
      "Housing"
    ]
  }
}