{
  "success": true,
  "vote": {
    "id": 7811,
    "item_number": "CA-46",
    "title": "To authorize the Director of the Department of Development to enter into a Housing Development Agreement (HDA) with Erie Ohio Capital CDFI Fund LLC for the Broadleigh Lofts development; and to declare an emergency. ($0.00)",
    "description": "Explanation\n \n \nBACKGROUND\n \nThis legislation will allow the Director to enter into a Housing Development Agreement (HDA) with Erie Ohio Capital CDFI Fund LLC for the Broadleigh Lofts development, which will ultimately be funded with $2,000,000.00 from a future Capital Budget, Affordable Housing Bond. Once funds become available, an ordinance will be brought to Council to authorize a grant agreement.\n \nBroadleigh Lofts will be three separate buildings consisting of three-story midrise buildings, situated on a vacant site in the Broadleigh neighborhood of Columbus. The development will provide integrated housing for households of 30-80% AMI, contain onsite manager’s office, a children’s playground, and community space. The proposed development located at 3150 Allegheny Avenue in Columbus, Ohio will total 84-units of affordable multi-family housing. The site is one parcel approximately 3.8 acres and is currently blighted and unimproved and has been vacant for over 10 years. The location is within walking distance of the City of Columbus School District K-12 Africentric School as well as a convenience store, multiple restaurant options, and located along a\nCOTA bus route. \n \nThe property will be mixed income, featuring affordable housing ranging from 30% AMI, up to 80% AMI, accommodating various household sizes including one, two, and three bedrooms. The project will be appropriate for a variety of populations: singles, young professionals, seniors, single-parent households, small families needing three-bedroom units, and those needing workforce housing in close proximity to downtown and surrounding job centers. The proposed development will total 84-units with at least 20% of units set-aside as integrated supportive housing for homeless veterans due to close proximity to the VA and the remaining units targeting general occupancy. Woda Cooper Development, Inc., affiliated with Erie Ohio Capital CDFI Fund, LLC, and the developer for the project, will be partnering with Columbus Metropolitan Housing Authority on this endeavor to provide twenty-nine (29) project based vouchers and coordinate the necessary supportive services for the target population. The project intends to have no fewer than 10% of the units be fully accessible, ideal for people with housing entry barriers including elderly, persons with mobility disabilities, and those less-mobile. Additional units will be set-aside for hearing/vision impaired residents. On-site amenities will include management offices, community room, and more.\n \nAll of the ground floor units will be “Visit-Able” with a zero-step entrance and widths/ clearances acceptable to accommodating residents and visitors with wheelchairs, walkers and other mobility assisting devices, as well as feature certain elements of Universal Design promoting “aging in place.” The unit amenities include large windows and good views, in-unit washer\n \nEmergency action is requested in order to provide evidence of city funding by the closing date anticipated for the beginning of November 2023.  The City’s funding commitment is critical for the closing to happen and cannot wait 30 days after legislation passes.  Any delay could result in the project forfeiting their tax credits and losing the tax credit equity included in the project.\n \nFISCAL IMPACT: No funding is needed.\nCONTRACT COMPLIANCE: the vendor number is 033062 and expires June 24, 2024.\nTitle\n \nTo authorize the Director of the Department of Development to enter into a Housing Development Agreement (HDA) with Erie Ohio Capital CDFI Fund LLC for the Broadleigh Lofts development; and to declare an emergency. ($0.00)\n \nBody\n \nWHEREAS, the Director of Development seeks to enter into a Housing Development Agreement (HDA) with Erie Ohio Capital CDFI Fund LLC; and\n \nWHEREAS, the HDA would memorialize the City’s desired commitment to the project, pending City Council approval and future availability of funds; and\n \nWHEREAS, The Department of Development wishes to support this project by contributing $2,000,000.00 of bond funds upon availability, Affordable Housing Bond; and\n \nWHEREAS, this legislation would authorize the Director of Development to first execute the HDA and pending the availability of funding from the Capital Budget, Affordable Housing Bond the department will seek City Council’s approval to enter into a grant agreement; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development to pass this ordinance as emergency in order to provide evidence of city funding by the closing date anticipated for the beginning of November.  The City’s funding commitment is critical for the closing to happen and cannot wait 30 days after legislation passes; any delay could result in the project Developers forfeiting their tax credits and losing the tax credit equity included in the project, all for the immediate preservation of the public health, peace, property, safety and welfare; and NOW THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That Director of the Department of Development is authorized to enter into a Housing Development Agreement (HDA) with Erie Ohio Capital CDFI Fund LLC.\n \nSECTION 2. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 92,
    "meeting_date": "2023-10-30",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}