{
  "success": true,
  "vote": {
    "id": 7824,
    "item_number": "CA-59",
    "title": "To authorize the Finance and Management Director to enter into two (2) Universal Term Contracts for the option to purchase Heavy Duty Specialty Services with C.W. DeMary Services, Inc. and Frame & Spring Inc.; to authorize the expenditure of $2.00; and to declare an emergency. ($2.00).",
    "description": "Explanation\n \nBACKGROUND:  This legislation authorizes the Finance and Management Director to establish two (2) Universal Term Contracts (UTCs) for the option to purchase Heavy Duty Specialty Services with C.W. DeMary Services, Inc. and Frame & Spring Inc. The Division of Fleet is the primary user for heavy duty equipment repairs and parts. Heavy Duty Specialty Services are used to repair and maintain equipment throughout the City of Columbus.  The term of the two (2) proposed option contracts would be approximately two (2) years, expiring September 30, 2025, with the option to renew for one (1) additional year.  The Purchasing Office opened formal bids on October 5, 2023. In addition, the expenditure of $2.00 is hereby authorized from General Budget Reservation BRPO002253.                     \n \nThe Purchasing Office advertised and solicited competitive bids in accordance with the relevant provisions of Section 329.06 relating to competitive bidding (Request for Quotation No. RFQ025872). Two (2) bids were received.  \n \nThe Purchasing Office is recommending award to the overall lowest, responsive, responsible and best bidders as follows:\n \nC.W. DeMary Services, Inc. CC# 004277 exp. 6/17/24, Item# 1, $1.00\nFrame & Spring Inc., CC# 005201 exp. 2/8/25, Item# 8, $1.00\nNo bids were awarded on items#  2, 3, 4, 5, 6, 7, 9 & 10. These items will be rebid.\n \nTotal Estimated Annual Expenditure: $115,000.00. The Division of Fleet is the primary user.\n \nEmergency Designation:  The Finance and Management Department respectfully requests this legislation to be considered an emergency ordinance to ensure an uninterrupted supply of maintenance contracts for equipment.\n \nThe companies are not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.   \n \nFISCAL IMPACT: The expenditure of $2.00 is hereby authorized from General Budget Reservation BRPO002253.   City Agencies will be required to obtain approval to expend from their own appropriations for their estimated annual expenditures.  \n \nTitle\n \nTo authorize the Finance and Management Director to enter into two (2) Universal Term Contracts for the option to purchase Heavy Duty Specialty Services with C.W. DeMary Services, Inc. and Frame & Spring Inc.; to authorize the expenditure of $2.00; and to declare an emergency. ($2.00).\n \nBody\n \nWHEREAS, the HD Specialty Services UTCs will provide for the purchase of  Brake Testing and Spring Factory Authorized parts and services used to repair and maintain heavy duty equipment; and,  \n \nWHEREAS, the Purchasing Office advertised and solicited formal bids on October 5, 2023 and selected the overall lowest, responsive, responsible, and best bidders; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Finance and Management in that it is immediately necessary to authorize the Director to enter into two (2) Universal Term Contracts for the option to purchase HD Specialty Services with C.W. DeMary Services, Inc. and Frame & Spring, Inc., to ensure equipment is being maintained and repaired promptly, all for the immediate preservation of the public health, peace, property, safety, and welfare; and now therefore:\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Finance and Management Director is hereby authorized to enter into the following two (2) Universal Term Contracts for the option to purchase HD Specialty Services in accordance with Request for Quotation RFQ025872 for a term of approximately two (2) years, expiring September 30, 2025 with the option to renew for one (1) additional year, as follows:\n \nC.W DeMary Services, Inc., Item #1, $1.00\nFrame & Spring Inc., Item #8, $1.00\n \nSECTION 2. That the expenditure of $2.00 is hereby authorized from General Budget Reservation BRPO002253 of this ordinance to pay the cost thereof.\n \nSECTION 3.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That for the reason stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 92,
    "meeting_date": "2023-10-30",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}