{
  "success": true,
  "vote": {
    "id": 7825,
    "item_number": "SR-1",
    "title": "To authorize the City Attorney to file complaints in order to immediately appropriate and accept the remaining fee simple and lesser real estate necessary to timely complete the Arterial Street Rehabilitation - E. Broad Street Widening Phase I Project; to authorize an expenditure of $1,429,126.00; and to declare an emergency. ($1,429,126.00)",
    "description": "EXPLANATION\n \nBACKGROUND: The City’s Department of Public Service (“DPS”) is performing the Arterial Street Rehabilitation - E. Broad Street Widening Phase I Project (PID 105734) (Project No. P530103-100061) (“Public Project”). The City must acquire certain fee simple title and lesser real estate located in the vicinity of East Broad Street from east of I-270 to Outerbelt Street (collectively, “Real Estate”) in order for DPS to timely complete the Public Project. The City passed Ordinance Number 1428-2021 authorizing the City Attorney to acquire the Real Estate. Furthermore, the City also adopted Resolution 0234X-2022 establishing the City’s intent to appropriate the Real Estate. The City’s acquisition of the Real Estate will help make, improve, or repair certain portions of the public right-of-way of East Broad Street from east of I-270 to Outerbelt Street which will be open to the public without charge. \n                     \nThe City Attorney, pursuant to Columbus City Code, Section 909.03, served notice to all of the owners of the Real Estate of the (i) Public Project’s public purpose and necessity, and (ii) adoption of Resolution 0234X-2022. However, the City Attorney was unable to either locate some of the Real Estate’s owner(s) or agree with some of the Real Estate’s owner(s) in good faith regarding the amount of just compensation.\n \nCONTRACT COMPLIANCE:  Not applicable.\n \nFISCAL IMPACT: Funding to acquire the Real Estate is available through the Federal Transportation Grant Fund, Fund Number 7765, pursuant to existing Auditor’s Certificates ACDI001517-10 and ACDI001517-20 with sixty percent of the funding coming from ACDI001517-10 and forty percent of the funding coming from ACDI001517-20.\n \nEMERGENCY JUSTIFICATION: Emergency action is requested in order to acquire the Real Estate and allow DPS to timely complete the Public Project without unnecessary delay in order to meet the right-of-way clear date of January 6, 2024, which will preserve the public peace, health, property, safety, and welfare.\n \nTITLE\n \nTo authorize the City Attorney to file complaints in order to immediately appropriate and accept the remaining fee simple and lesser real estate necessary to timely complete the Arterial Street Rehabilitation - E. Broad Street Widening Phase I Project; to authorize an expenditure of $1,429,126.00; and to declare an emergency. ($1,429,126.00)\n \nBODY\n \nWHEREAS, the City intends to make, improve, or repair certain public right-of-ways by completing the Arterial Street Rehabilitation - E. Broad Street Widening Phase I Project (PID 105734) (Project No. P530103-100061) (“Public Project”); and\n \nWHEREAS, the City intends for the City Attorney to acquire the necessary fee simple title and lesser real estate located in the vicinity of the public right-of-way of East Broad Street from east of I-270 to Outerbelt Street; and\n \nWHEREAS, the City, pursuant to the passage of Ordinance Number 1428-2021 and the adoption of Resolution Number 0234X-2022, intends to authorize the City Attorney to spend City funds and file the necessary complaints to immediately appropriate and accept title to the remainder of the Real Estate; and\n \nWHEREAS, the City intends for the Real Estate’s acquisition to help make, improve, or repair certain portions of the public right-of-way of East Broad Street from east of I-270 to Outerbelt Street which will be open to the public without charge; and \n \nWHEREAS, an emergency exists in the usual daily operations of DPS in that it is immediately necessary to declare the City’s intent to appropriate and accept the Real Estate in order to meet the right-of-way clear date of January 6, 2024 and to prevent unnecessary delay in completing the Public Project, all for the immediate preservation of the public health, peace, property, safety and welfare; and now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     That the fee simple and lesser real estate associated with the project parcel numbers listed in Section Four (4) of this ordinance (“Real Estate”) are (i) fully described in Resolution 0234X-2022 and incorporated into this ordinance for reference as if rewritten, and (ii) to be immediately appropriated and accepted for the public purpose of the Department of Public Service (“DPS”) timely completing the Arterial Street Rehabilitation - E. Broad Street Widening Phase I Project (PID 105734) (Project No. P530103-100061) (“Public Project”).\n \nSECTION 2.                     That the City declares, pursuant to the City's power and authority under the Ohio Constitution, Ohio Revised Code Sections 715.01, 717.01, 719.01, and 719.02, the City's Charter, and Columbus City Code Chapter 909, the appropriation of the Real Estate is necessary for the Public Project, because the City was unable to locate the Real Estate’s owner(s) or agree in good faith with the Real Estate’s owner(s) regarding the amount of just compensation to be paid by the City for the Real Estate.\n \nSECTION 3.                     That the City intends to obtain immediate possession of the Real Estate for the Public Project.\n \nSECTION 4.                     That the City declares that the fair market value of the Real Estate as follows:\n \nPUBLIC PROJECT PARCEL NUMBER(S) (FMVE)\nREAL ESTATE OWNER\nOWNER ADDRESS\n \nParcel 12WD1, WD2, T1, T2, T3 (FMVE $38,110.00)\nMount Carmel Health Systems\nc/o Thomas Luba\nRegional Director of Real estate \nMount Carmel Health System\n3100 Easton Square Place, Suite 300\nColumbus, Ohio 43219\n \nParcel 13WD, T (FMVE $2,690.00)\nMount Carmel Health Systems\nc/o Thomas Luba\nRegional Director of Real estate \nMount Carmel Health System\n3100 Easton Square Place, Suite 300\nColumbus, Ohio 43219\n \nParcel 14WD, SW, T (FMVE $770,491.00)\nMount Carmel Health Systems\nc/o Thomas Luba\nRegional Director of Real estate \nMount Carmel Health System\n3100 Easton Square Place, Suite 300\nColumbus, Ohio 43219\n \nParcel 16WD, SW, T (FMVE $35,571.00)\nWomet Broad Street LLC\nP.O. Box 171\nBlacklick, Ohio 43004\n \nParcel 18WD1, WD2, T1, T2 (FMVE $36,702.00)\nColumbus East Senior Living, LLC\n150 East Broad Street\nColumbus, Ohio 43215\n \nParcel 19WD, SW, T (FMVE $102,764.00)\nHammerhead East Broad, LLC\nc/o Bricker Graydon\n100 South Third Street\nColumbus, Ohio 43215\nAttn: Matthew Strayer\n \nand\n \nParcel 19BS (FMVE $26,171.00)\nSRI Operating Company\nc/o Becky Travis Real Estate Legal Manager\nThree Glenlake Parkway\nAtlanta, Georgia 30328\n \nParcel 20T1, T2 (FMVE $11,270.00)\nWellesley Broad, LLC\n2160 Ketterington Tower\nDayton, Ohio 45423\n \nParcel 21WD, S, T (FMVE $76,142.00)\nKemba Financial Credit Union\nc/o Bryan Balemian\n555 Officecenter Place\nGahanna, Ohio 43230\n \nParcel 23WD, S, T (FMVE $118,527.00)\nCFA Real Property, LLC\n5200 Buffington Road\nAtlanta, Georgia 30349\n \nParcel 24WD, T (FMVE $34,574.00)\nBuffalo-6350 EB Associates, LLC\nc/o Corporation Service Company, Reg. Agent\n3366 Riverside Drive, Suite 103\nUpper Arlington, Ohio 43221\n \nParcel 25WD, T (FMVE $107,519.00)\nGCR Retail, LLC\nc/o Jaynul Dewani, Reg. Agent\n6618 Weston Circle E\nDublin, Ohio 43016\n \nParcel 30WD, T (FMVE $14,509.00)\nSpeedway SuperAmerica, LLC\nc/o Matthew Rasmussen\n3200 Hackberry Road\nIrving, Texas 75063\n \nParcel 31WD, T (FMVE $36,663.00)\nAMAMATA LLC\n6400 East Broad Street\nColumbus, Ohio 43213\n \nParcel 33WD, T (FMVE $12,558.00)\nINDUS Broad Street Hotel LLC\n1555 Lennox Town Lane\nColumbus, Ohio 43212\n \nParcel 36WD (FMVE $300.00)\nLifetime Investments Inc./\nLeslie Development Co. Inc.\n10085 Wellington Boulevard\nPowell, Ohio 43065\n \nParcel 38WD, T (FMVE $2,969.00)\nAbdiraghe Abdulaziz, Yusuf Abdirisaq,\nAdam Abdirahman, and Elmi Mohamed\nP.O. Box 28730\nColumbus, Ohio 43228\n \nParcel 48T (FMVE $1,296.00)\nMount Carmel Health Systems\nc/o Thomas Luba\nRegional Director of Real estate \nMount Carmel Health System\n3100 Easton Square Place, Suite 300\nColumbus, Ohio 43219\n \nParcel 55WD (FMVE $300.00)\nNational Mortgage Co. of Ohio\nAddress unknown Notice by Publication dates: \nMarch 13, 2023, March 20, 2023, and March 27, 2023\n \nSECTION 5.                     That the City Attorney is authorized to file petitions necessary to appropriate the Real Estate in the appropriate court of common pleas and impanel a jury to inquire and assess the amount of just compensation for the Real Estate.\n \nSECTION 6.                     That the Real Estate’s acquisition for the Public Project is required to make, improve, or repair certain portions of the public right-of-way of East Broad Street from east of I-270 to Outerbelt Street and associated appurtenances, which will be open to the public without charge.\n \nSECTION 7.  That the City Attorney, in order to pay for the Real Estate’s acquisition and appropriation costs for the Public Project, is authorized to spend up to Eight Hundred Fifty-Seven Thousand, Four Hundred and Seventy-five and 60/100 U.S. Dollars ($857,475.60), which is sixty percent of the total cost, from existing ACDI001517-10 and Five Hundred Seventy-One Thousand, Six Hundred and Fifty and 40/100 U.S. Dollars ($571,650.40), which is forty percent of the total cost, from ACDI001517-20 for a total expenditure of One Million Four Hundred Twenty-nine Thousand One Hundred Twenty-six and 00/100 U.S. Dollars ($1,429,126.00), or so much as may be needed from existing Auditor’s Certificates ACDI001517-10 and ACDI001517-20.\n \nSECTION 8.                     That the City Auditor is authorized to make any accounting changes to revise the funding source associated with this ordinance.\n \nSECTION 9.                     That this ordinance, for the reasons stated in the preamble, which are made a part of this ordinance and fully incorporated for reference as if rewritten, is declared to be an emergency measure and shall take effect and be in force from and after this ordinance’s adoption and approval by the Mayor or ten (10) days after its adoption if the Mayor neither approves nor vetoes this ordinance.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 92,
    "meeting_date": "2023-10-30",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services",
      "Property & Real Estate"
    ]
  }
}