{
  "success": true,
  "vote": {
    "id": 783,
    "item_number": "CA-5",
    "title": "To authorize the Director of the Department of Finance and Management to execute any and all necessary documents, approved by the City Attorney, Real Estate Division, to grant quitclaim highway easements, an aerial easement and temporary construction easements to the State of Ohio, Department of Transportation as part of ODOT’s FRA-70-13.10 project. ($0.00)",
    "description": "Explanation\nBackground: The City desires to grant to the State of Ohio, Department of Transportation (“ODOT”), one (1) aerial easement, 23-A, five (5) highway easements, 23-LA1, 23-LA2, 23-LA3, 23-LA4, and 25-LA and two (2) thirty-six month temporary construction easements, 23-T and 25-T (“Real Estate”) on city owned property (“Real Estate”). All of the Real Estate is located in the vicinity of the Interstate 70/71 corridor through downtown. The City and ODOT are currently engaged in a joint project to transform the I-70/71 corridor through downtown Columbus. The construction will encompass several individual projects and phases. As a part of ODOT’s FRA-70-13.10 Project (“Project”), the City will be granting the following parcels to ODOT: 23-A, a 0.860 acre aerial easement, 23-LA1, a 0.015 acre highway easement that is present road occupied, 23-LA2, a 0.018 acre highway easement that is present road occupied, 23-LA3, a 0.010 acre highway easement that is present road occupied, 23-LA4, a 0.023 acre highway easement that is present road occupied, and 23-T, a 0.713 acre temporary construction easement all of which are part of Franklin County Tax Parcel 010-066781. The City will also be granting parcels 25-LA, a 0.074 acre highway easement, and 25-T, a 0.245 acre temporary construction easement both of which are part of Franklin County Tax Parcel 010-023620. For the parcels 23, ODOT will be executing subordination agreements, approved by the US Army Corps of Engineers, to subordinate these interests to the maintenance and operation of the Floodwall. \n \nThe City previously passed ordinance number 0340-2020 authorizing the Department of Finance and Management to execute Right of Entry agreements necessary for ODOT to immediately access the above-referenced City-owned property for the FRA-70-13.10 Project.  These Right of Entry Agreements, granted in March of 2020 and extended in November 2020, contemplated these future conveyances to ODOT.\n \nThe City’s Departments of Finance and Management, Recreation and Parks, Public Service and Public Utilities reviewed the request and determined that the Real Estate requested by ODOT to complete the Project should be granted and that the City should accept the appraised fair market value for the property, as determined by ODOT, in the total amount of Forty-one Thousand Five Hundred Twenty-nine and 00/100 U.S. Dollars ($41,529.00). Therefore, the following legislation authorizes the City’s Director of the Department of Finance and Management, with approval from the Directors of the Recreation and Parks Department, Department of Public Service and the Department of Public Utilities, to execute those documents as approved by the Columbus City Attorney, Real Estate Division, to grant the easements to ODOT to complete the Project, subject to the reservation of easements for existing utilities, including the Floodwall, and certain ODOT maintenance obligations.\n \nFiscal Impact: The City’s receipt of the Forty-one Thousand Five Hundred Twenty-nine and 00/100 U.S. Dollars ($41,529.00) from ODOT will be deposited within the General Permanent Improvement Fund.\n \nEmergency Justification: Not Applicable\n \nTitle\n \nTo authorize the Director of the Department of Finance and Management to execute any and all necessary documents, approved by the City Attorney, Real Estate Division, to grant quitclaim highway easements, an aerial easement and temporary construction easements to the State of Ohio, Department of Transportation as part of ODOT’s FRA-70-13.10 project. ($0.00)\n \nBody\n \nWHEREAS, the City desires to grant to the State of Ohio, Department of Transportation (“ODOT”), one (1) aerial easement, 23-A, five (5) highway easements, 23-LA1, 23-LA2, 23-LA3, 23-LA4, and 25-LA and two (2) thirty-six month temporary construction easements, 23-T and 25-T (“Real Estate”).  All of the Real Estate is located in the vicinity of the Interstate 70/71 corridor through downtown; and\n \nWHEREAS, the City passed Ordinance Number 0340-2020 that authorized the Department of Finance and management to execute the necessary Right of Entry documents to allow ODOT immediate access to City-owned property for the FRA-70-13.10 Project; and\n \nWHEREAS, the Real Estate to be granted to ODOT consists of the following:\n \n23-A, a 0.860 acre aerial easement, 23-LA1, a 0.015 acre highway easement that is present road occupied, 23-LA2, a 0.018 acre highway easement that is present road occupied, 23-LA3, a 0.010 acre highway easement that is present road occupied, 23-LA4, a 0.023 acre highway easement that is present road occupied, and 23-T, a 0.713 acre temporary construction easement that are all part of Franklin County Tax Parcel 010-066781; and \n \n25-LA, a 0.074 acre highway easement, and 25-T, a 0.245 acre temporary construction easement that are a part of Franklin County Tax Parcel 010-023620; and\n \nWHEREAS, the City will reserve easement rights for the existing bike trail(s), utilities, and certain ODOT maintenance obligations; and\n \nWHEREAS, ODOT will be executing subordination agreements to subordinate these interests to the operation of the Floodwall; and \n \nWHEREAS, ODOT will use the Real Estate for construction of ODOT’s FRA-70-13.10 projec(“Project”); and\n \nWHEREAS, the City’s Department of Finance and Management determined that the Real Estate requested by ODOT to complete the Project should be granted at a price of Forty-one Thousand Five Hundred Twenty-nine and 00/100 U.S. Dollars ($41,529.00); and now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Finance and Management, with approval from the Directors of the Recreation and Parks Department, Department of Public Service and the Department of Public Utilities, is authorized to execute those documents necessary to convey to the State of Ohio, Department of Transportation (“ODOT”) the following listed real estate (“Real Estate”), which are fully described in their associated exhibits and incorporated into this ordinance for reference.\n \n(Exhibit) … (Public Project Parcel Identification) … (Real Estate)\n \n1)                     23-A                                          (Perpetual Aerial Easement)                     \n2)                     23-LA1                     (Highway Easement With Limitation of Access)\n3)                     23-LA2                     (Highway Easement With Limitation of Access)\n4)                     23-LA3                     (Highway Easement With Limitation of Access)\n5)                     23-LA4                     (Highway Easement With Limitation of Access)\n6)                     23-T                                          (36-Month Temporary Easement)\n7)                     25-LA                                          (Highway Easement With Limitation of Access)\n8)                     25-T                                          (36-Month Temporary Easement)\n \nSECTION 2. That the City Attorney’s Office, Real Estate Division is required to approve all instrument(s), associated with this ordinance.\n \nSECTION 3. That the City will grant parcels 23-A, 23-LA1, 23-LA2, 23-LA3, 23-LA4, 23-T, 25-LA, and 25-T to ODOT for Forty-one Thousand Five Hundred Twenty-nine and 00/100 U.S. Dollars ($41,529.00).\n \nSECTION 4. That the funds from the property grants shall be deposited in the General Permanent Improvement Fund, Fund 7748.\n \nSECTION 5. That the grants will be subject to the reservation of easements for utilities, including maintenance and operation of the Floodwall and certain ODOT maintenance obligations.\n \nSECTION 6.  That ODOT will be executing subordination agreements to subordinate these interests to the maintenance and operation of the Floodwall.\n \nSECTION 7. That upon notification and verification of the relocation of all utilities located within the retained general utility easements, the Director of the Department of Public Utilities is hereby authorized to execute those documents necessary to release the retained general utility easement with no additional compensation due to the City and with no further legislative action required by the City.\n \nSECTION 8. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 13,
    "meeting_date": "2021-05-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Grants",
      "Property & Real Estate",
      "Transportation"
    ]
  }
}