{
  "success": true,
  "vote": {
    "id": 7853,
    "item_number": "CA-3",
    "title": "To authorize and direct the Director of the Department of Development to terminate the Enterprise Zone Agreement with Parkside on Pearl, LLC; and to direct the Director of the Department of Development to notify, as necessary the local and state tax authorities, of said termination.",
    "description": "Explanation\n \nBACKGROUND: Columbus City Council (“COUNCIL”), by Ordinance No. 1277-2022, passed July 18, 2022, authorized the City of Columbus (“CITY”) to enter into an Enterprise Zone Agreement (the “AGREEMENT”) with Parkside on Pearl, LLC (hereinafter referred to as “ENTERPRISE”) for a tax abatement of seventy-five percent (75%) for a period of ten (10) years in consideration of an investment of $2,275,797 and the creation of ten (10) net new full-time permanent positions with an annual payroll of approximately $416,000 related to the construction of approximately 12,534 +/- square-feet of a new Class A office space at 35 E. Hubbard Avenue, Columbus, Ohio, 43201, on parcel number 010-010941 (the “PROJECT SITE”), in Columbus Ohio, within the Columbus City School District and the Columbus Central Enterprise Zone.  The AGREEMENT was made and entered into effective October 5, 2022 (EZA# 023-22-26). The AGREEMENT stated that construction of the 7-story, 88,563-square-foot mixed-use development would consist of approximately 780 square-feet of retail space on the first floor, 12,534 square feet of commercial office space on the second floor, and roughly 75,249 square feet of residential units on the remaining floors (the “PROJECT”).  All real property improvements were expected to be completed by October 2024, and that no real property exemption was to commence after 2025 nor extend beyond 2034.\n \nThe CITY reported the status of the PROJECT to the 2022 Tax Incentive Review Council (“TIRC”) on August 19, 2022.  The TIRC noted the annual report was received late, but fully compliant, and recommended the AGREEMENT be continued and a letter be sent advising the ENTERPRISE of the need for accurate and timely reporting.    \n \nIn a letter received by the City on October 3, 2023, the ENTERPRISE requested to terminate the existing AGREEMENT due to the current challenging state of the national office market. The ENTERPRISE stated that the predetermined 12,534-square-feet of commercial office space would change from commercial office to residential use, making the PROJECT ineligible for an Enterprise Zone tax incentive. \n \nThis legislation terminates the Enterprise Zone Agreement with Parkside on Pearl, LLC and directs the Director of the Department of Development to notify as necessary the local and state tax authorities prior to the end of calendar year 2023. \n \nThis legislation is presented as 30-day legislation.  \n \nFISCAL IMPACT: \n \nNo funding is required for this legislation.\n \n \nTitle\n \nTo authorize and direct the Director of the Department of Development to terminate the Enterprise Zone Agreement with Parkside on Pearl, LLC; and to direct the Director of the Department of Development to notify, as necessary the local and state tax authorities, of said termination.\n \n \nBody\n \nWHEREAS, the City of Columbus (“CITY”) entered into an Enterprise Zone Agreement (the “AGREEMENT”) with Parkside on Pearl, LLC (referred to as “ENTERPRISE”), approved by Columbus City Council (“COUNCIL”) on July 18, 2022 by Ordinance No. 1277-2022 with this AGREEMENT made and entered into on or about October 5, 2022; and\n \nWHEREAS, the AGREEMENT granted a 75%/10-year abatement on real property improvements; and\n \nWHEREAS, the incentive was granted in consideration of an investment a total capital expenditure of approximately $22,000,000.00 of which included approximately $2,275,797.00 related to the construction of approximately 12,534 +/- square-feet of a new Class A office space (the “PROJECT”) at 35 E. Hubbard Avenue, Columbus, Ohio 43201, parcel number 010-010941 (the “PROJECT SITE”), in Columbus Ohio, within the Columbus City School District and within the Columbus Central Enterprise Zone; and  \n \nWHEREAS, the ENTERPRISE committed to create ten (10) net new full-time permanent positions with an estimated annual payroll of approximately $416,000.00 at the PROJECT SITE and anticipated that the construction of the commercial office portion would lead to the relocation of an unknown number of positions from within the City; and\n \nWHEREAS, the AGREEMENT stated that all real property improvements were expected to be completed by October 2024, and that no real property exemptions were to commence after 2025 nor extend beyond 2034; and \n \nWHEREAS, the CITY reported the status of the PROJECT to the 2022 Tax Incentive Review Council (“TIRC”) on August 19, 2022.  As a result of submitting the annual report after the stated deadline, the TIRC recommended the AGREEMENT be continued and a letter be sent advising the ENTERPRISE of the need for accurate and timely reporting; and\n \nWHEREAS, in a letter received by the CITY on October 3, 2023, the ENTERPRISE requested to terminate the existing AGREEMENT due to the current challenging state of the national office market. The ENTERPRISE stated that the predetermined 12,534 square-feet of commercial office space would change from commercial office to residential use, making the PROJECT ineligible for an Enterprise Zone incentive; NOW THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF COLUMBUS\n \nSECTION 1.                     That the Director of the Department of Development is hereby authorized and directed to terminate the Parkside on Pearl, LLC Enterprise Zone Agreement (EZA#023-22-26), effective December 31, 2022, which includes a 75%/10-year real property tax abatement to the value of real property improvements made to parcel number 010-010941 within the Columbus Central Enterprise Zone.\n \nSECTION 2.                     That the Director of the Department of Development is hereby authorized and directed to notify the necessary local and state agencies of any changes to the Parkside on Pearl, LLC Enterprise Zone Agreement, including the termination described in Section 1 of this ordinance.\n \nSECTION 3.                     That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 93,
    "meeting_date": "2023-11-06",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Economic Development"
    ]
  }
}