{
  "success": true,
  "vote": {
    "id": 7871,
    "item_number": "CA-21",
    "title": "To authorize the expenditure of up to $2,485.24 from the Electricity Grants Fund to fulfill approved customer applications to the payment relief program; to authorize the City Auditor to cancel appropriation within the Electricity Grant Fund; to authorize the transfer of funds in an amount up to $2,485.24 between grants within the Electricity Grant Fund and to appropriate these funds. ($2,485.24)",
    "description": "Explanation\n1.  BACKGROUND\nThis legislation authorizes the City Auditor to transfer funds from the American Municipal Power, Inc. (AMP) award for the 2022 EcoSmart Choice Sustainability Grant, G602100, in the amount of $2,485.24, to G601800, the 2017 EcoSmart Choice Sustainability Grant and authorizes the expenditure of said funds. This is a transfer within Fund 6316, Electricity Grants Fund.\n \nThe EcoSmart Choice Sustainability Grant program was instituted by AMP to return unused funds to participating members, recognizing EcoSmart Choice participating communities that demonstrate a commitment to sustainability through the promotion of environmentally focused, community-based grant projects. Funds are unused if market renewable energy certificate (REC) prices are lower than anticipated. Last year, the City had 97,333,022.5 kWh enrolled in the program, or 97,334 RECs. AMP approved the Division of Power’s (DOP) plan to use the 2022 grant award funds to offer smart thermostats at no or low cost to customers in connection with the ongoing Enhanced Meter Project (670500-100000). Expenditures of prior year EcoSmart Grant Funds contributed to DOP’s SMART Street Lighting Project and payment relief programs.\n \nORD 1219-2018 authorized the acceptance of the 2017 EcoSmart Choice Sustainability Grant. The Division of Power’s application included a power payment relief program for economically disadvantaged customers and appropriated $147,684.00 for this purpose. ORD 1309-2020 reallocated funding from other EcoSmart Choice grants into the payment relief program. The program invoices monthly and is nearing completion. However, between the most recent invoices, customer applications were approved in amounts greater than the available funding remaining on the grant. The Department intends to honor these applications prior to closing out the grant, and AMP approved transferring the necessary funds from the 2022 EcoSmart Choice Award for smart thermostats.   \n \n2.  FISCAL IMPACT  \nFunding in the amount of $2,485.24 needed for the balance of payment relief program applications is available and appropriated within Fund 6316, Electricity Grants Fund, Grant #G602100. It is necessary to cancel appropriation in the amount of $2,485.24 in G602100, transfer cash in the amount of $2,485.24 from G602100 to G601800, and then appropriate $2,485.24 in G601800 to align cash and appropriation with the proper grant.\n \nAs a result of the funding transfer, $2,485.24 of the $101,536.31 2022 EcoSmart Choice program year award will not be available for the smart thermostats and will instead cover the deficit for the final payment relief program customers. \n \nTitle\nTo authorize the expenditure of up to $2,485.24 from the Electricity Grants Fund to fulfill approved customer applications to the payment relief program; to authorize the City Auditor to cancel appropriation within the Electricity Grant Fund; to authorize the transfer of funds in an amount up to $2,485.24 between grants within the Electricity Grant Fund and to appropriate these funds. ($2,485.24)\n \nBody\nWHEREAS, the Department of Public Utilities established a payment relief program through funding received for the 2017 American Municipal Power, Inc. (AMP) award for the EcoSmart Choice Sustainability Grant (G601800); and\n \nWHEREAS, the program invoices monthly and between the most recent invoices customer applications were approved in amounts greater than the available funding remaining on the grant, and the Department intends to honor these applications prior to closing out the grant; and \n \nWHEREAS, AMP approved transferring the necessary funds from the 2022 EcoSmart Choice Award (G602100), which Ordinance 0963-2023 authorized the Director of Public Utilities to accept in the amount of $101,536.31 for smart thermostats, to cover the deficit in the payment relief program; and\n \nWHEREAS, a transfer of funds and appropriation within the Electricity Grants Fund, Fund 6316, is needed to align cash and appropriation with the proper project and to fund the remaining payment relief program applications; and\n \nWHEREAS, the appropriation of $2,485.24 and the expenditure of $2,485.24 or so much thereof as may be needed, is hereby authorized in Fund 6316, Electricity Grants Fund, in object class 05, Other Expenditures, per the accounting codes attached to the ordinance; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities, Division of Power, to authorize the City Auditor to transfer funds from the American Municipal Power, Inc. (AMP) award for the 2022 EcoSmart Choice Sustainability Grant, G602100, in the amount of $2,485.24, to G601800, the 2017 EcoSmart Choice Sustainability Grant and to authorized the expenditure of said funds; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the City Auditor is authorized to cancel appropriation in the amount of $2,485.24 in Fund 6316 (Electricity Grants Fund), Grant #G602100 (2022 EcoSmart Choice Award), per the accounting codes attached to this ordinance. \n \nSECTION 2.  That the City Auditor is hereby authorized to transfer $2,485.24 or so much thereof as may be needed, between grants within Fund 6316, Electricity Grants Fund, per the accounting codes attached to this ordinance.\n \nSECTION 3. That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2023, the sum of $2,485.24 is appropriated in Fund 6316 (Electricity Grants Fund) per the accounting codes attached to this ordinance.\n \nSECTION 4. That the expenditure of $2,485.24 or so much thereof as may be needed, is hereby authorized in Fund 6316, Electricity Grants Fund, in object class 05, Other Expenditures, per the accounting codes attached to the ordinance.\nSECTION 5. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 7. That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 93,
    "meeting_date": "2023-11-06",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Grants"
    ]
  }
}