{
  "success": true,
  "vote": {
    "id": 7900,
    "item_number": "SR-10",
    "title": "To authorize the Director of Development to enter into a Capital Improvement Grant Agreement in an amount up to $250,000.00 with Lower Lights Christian Health Center, Inc. for the purpose of reimbursing property acquisition cost incurred; to authorize expenditure of up to $250,000.00 from the Development Taxable Bond Fund; and to declare an emergency. ($250,000.00)",
    "description": "Explanation\n \nBACKGROUND\nThis legislation authorizes the Director of the Department of Development to enter into a Capital Improvement Grant Agreement with Lower Lights Christian Health Center, Inc. (LLCHC) for the purpose of acquiring real property to sustain and grow services to individuals and families living in its surrounding neighborhoods. \n \nIn 2014 Mount Carmel Health System decided to vacate their primary care practice and facility at 1560 South High Street. Lower Lights Christian Health Center and Mount Carmel negotiated an agreement that Lower Lights Christian Health Center would occupy the facility and provide health care services to the patients previously served by Mount Carmel Health System. A good faith lease agreement allowed LLCHC to pay for upkeep with no annual rental fee.\nRecently, Mount Carmel Health System alerted LLCHC that they wish to liquidate the property located at 1560 South High Street location from their portfolio and has offered LLCHC the first right of refusal to purchase the location at the appraised price of $500,000.00.  Acquisition of the property was required to ensure services provided continued without interruption.\n \nThe City desires to help LLCHC to purchase the 1560 South High Street location to sustain and grow their services to individuals and families living in its surrounding neighborhoods. The City is providing a capital improvement grant of $250,000.00 to reimburse LLCHC for half of the appraised purchase price. \n \nEmergency action is requested to immediately reimburse LLCHC for expenses incurred acquiring property located at 1560 South High Street to continue existing operations.  \n \nFISCAL IMPACT:  Funding is available within Department of Development Capital Improvement Budget.\n \nCONTRACT COMPLIANCE:  the vendor number is 024638 and expires 4/10/2025.\n \n \nTitle\n \nTo authorize the Director of Development to enter into a Capital Improvement Grant Agreement in an amount up to $250,000.00 with Lower Lights Christian Health Center, Inc. for the purpose of reimbursing property acquisition cost incurred; to authorize expenditure of up to $250,000.00 from the Development Taxable Bond Fund; and to declare an emergency. ($250,000.00)\n \n \nBody\n \nWHEREAS, the Director of the Department of Development seeks to enter into a Capital Improvement Grant Agreement with Lower Lights Christian Health Center, Inc. (LLCHC) in an amount up to $250,000.00 for the acquisition of property needed to maintain operations serving individuals and families; and \n \nWHEREAS, LLCHC has been operating from a facility owned by Mount Carmel Health System since 2014; and\n \nWHEREAS, the owner communicated their intent to sell and offered LLCHC first refusal to purchase the facility; and\n \nWHEREAS, this legislation would authorize the Director of the Department of Development to execute a Capital Improvement Grant Agreement to reimburse LLCHC $250,000.00 for expenditures incurred purchasing 1560 South High Street; and \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development to pass this ordinance as emergency in order to reimburse LLCHC for expenditures incurred acquiring property located at 1560 South High Street to continue existing operations, all for the immediate preservation of the public peace, health, property, and safety; NOW, THEREFORE,  \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Development be and is hereby authorized to enter into a Capital Improvement Grant Agreement, in an amount up to $250,000.00, with Lower Lights Christian Health Center, Inc. for the purpose of reimbursing a portion of the cost incurred by LLCHC in the acquisition of 1560 S. High Street.\n \nSECTION 2.  That for the purpose as stated in Section 1, the expenditure of $250,000.00, or so much thereof as may be necessary, is hereby authorized in fund 7739 (Development Taxable Bond Fund), Project 440104-100024, Dept. 4402 (Economic Development), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance. \n                     \nSECTION 3.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 4.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 93,
    "meeting_date": "2023-11-06",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}