{
  "success": true,
  "vote": {
    "id": 7944,
    "item_number": "CA-40",
    "title": "To authorize the Director of the Department of Finance and Management to execute those documents, as approved by the City Attorney, necessary for the City to grant an encroachment easement and legally allow a Shawnee Hills welcome sign and landscape bed to remain on City property.",
    "description": "Explanation\nBACKGROUND: The City of Columbus, Department of Public Utilities, Division of Water, received a request from the Village of Shawnee Hills, asking that the City allow a welcome sign and landscape bed located near the right-of-way of the 5900 block of Glick Road remain encroaching on city property. This structure was built on city property as shown on the attached Exhibit A. The following legislation authorizes the Director of the Department of Finance and Management to execute those documents necessary for the City to grant a revocable 0.006-acre encroachment easement and legally allow the sign and landscape bed to remain on city property. The Village of Shawnee Hills will be exclusively responsible for maintaining the sign and landscaping and, should the City need to use the area for any reason, the City will have the right to revoke the easement and the Village of Shawnee Hills will be required to immediately remove the sign and landscape bed at their sole cost and expense.  A value of $1,225.00 for the encroachment easement was established.\n \nCONTRACT COMPLIANCE: Not applicable. \nFISCAL IMPACT: The City will receive a total of $1,225.00, to be deposited in the Water Operating Fund, Fund 6000, for granting the requested encroachment easement.\n \nEMERGENCY JUSTIFICATION: Not applicable \n \nTitle\nTo authorize the Director of the Department of Finance and Management to execute those documents, as approved by the City Attorney, necessary for the City to grant an encroachment easement and legally allow a Shawnee Hills welcome sign and landscape bed to remain on City property. \n \nBody\nWHEREAS, the City of Columbus, Department of Public Utilities, Division of Water, received a request from the Village of Shawnee Hills asking that the City allow a welcome sign and landscape bed located near the right-of-way of the 5900 block of Glick Road remain encroaching on city property; and\n \nWHEREAS, the Department of Public Utilities, Division of Water, has reviewed the request and determined that granting a 0.006-acre encroachment easement will not adversely impact City operations; and\n \nWHEREAS, the following legislation authorizes the Director of the Department of Finance and Management to execute those documents, as approved by the City Attorney, necessary for the City to grant a revocable 0.006-acre encroachment easement to the Village of Shawnee Hills to legally allow a welcome sign and landscape bed to remain on city property; and\n \nWHEREAS, a value of $1,225.00 was established for the encroachment easement and the payment will be deposited in the Water Operating Fund, Fund 6000; and now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Department of Finance and Management be, and hereby is, authorized to execute those documents necessary for the City to grant a revocable  0.006-acre encroachment easement to the Village of Shawnee Hills to legally allow a Shawnee Hills welcome sign and landscape bed to remain on city property; to-wit:\n \nLEGAL DESCRIPTION OF 0.006 ACRE TRACT AS AN EASEMENT AREA FOR THE\nEXISTING MONUMENT FOR SHAWNEE HILLS\n \nSituated in the State of Ohio, County of Delaware, Township of Concord, located in Virginia Military\nSurvey No. 2545 and being in a 10.7 acre tract (Deed Book 160, Page 174) being part of the lands owned\nby the City of Columbus O’Shaughnessy Reservoir and being more particularly described as follows:\nBeginning at the southeast corner of Lot 786 in the Shawnee Hills No. 1 Subdivision as delineated and\nrecorded in Plat Book 4, Page 65, Recorders Office, Delaware County Ohio;\n \nThence North 15°33’38” West 4.44 feet in the east line of said Shawnee Hills Subdivision No. 1 and the\nwest line of said City of Columbus lands, to a point;\n \nThence the following four courses across said City of Columbus lands, O’Shaughnessy Reservoir;\n \nNorth 44°33’09” West 21.53 feet to a point;\n \nNorth 82°03’16” East 4.05 feet to a point;\n \nSouth 07°56’44” East 13.25 feet, to a point;\n \nSouth 44°33’09” West 7.00 feet, to a point in the north line of Glick Road;\n \nThence South 82°03’16” West 15.00, to the POINT OF BEGINNING, containing 0.006 acres (244.89\nsquare feet) more or less.\n \nAll reference plats and deeds are on file at the Delaware County Recorder’s Office, Delaware, Ohio.\nPatridge Surveying LLC\n \nSECTION 2. That the City Attorney is required to preapprove all document(s) executed by the City pursuant to this ordinance.  \n \nSECTION 3. That the City will receive a total of $1,225.00 to be deposited in the Water Operating Fund, Fund 6000,\n \nSECTION 4. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 94,
    "meeting_date": "2023-11-13",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Grants",
      "Property & Real Estate"
    ]
  }
}