{
  "success": true,
  "vote": {
    "id": 7964,
    "item_number": "3",
    "title": "To recognize the Northland Vikings Football team on their historic 2023 season in Columbus, Ohio.",
    "description": "Title\nTo recognize the Northland Vikings Football team on their historic 2023 season in Columbus, Ohio.\nBody\n \nWHEREAS, the city of Columbus recognizes the hard work and dedication of the Northland Vikings 2023 football team, coaches, staff, and the 2024 football senior class of Northland High School; and \nWHEREAS, this season's accomplishments include back-to-back City North Camps, the best record in school history, their first-ever home playoff game, and first-ever back-to-back playoff appearances; and \nWHEREAS, The team received numerous Honorable Mentions for the All-City Conference, as well as First and Second Team All-Conference; and \nWHEREAS, The Northland Vikings football Class of 2024 accomplished goals that nobody expected. With their first season beginning through COVID-19, this group has shown strength and courage in the face of adversity; and\nWHEREAS, Head Coach Ryan Sayers was awarded the Division 2 Central District Coach of the Year; and\nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: This Council does hereby recognize and congratulate the Northland High School Vikings on their historic football season.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 95,
    "meeting_date": "2023-11-20",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}