{
  "success": true,
  "vote": {
    "id": 7991,
    "item_number": "CA-25",
    "title": "To authorize the Director of Finance and Management to establish a contract with All Around Access LLC for the purchase of an Articulating Boom Lift for the Department of Public Utilities; to amend the 2023 Capital Improvement Budget; to authorize a transfer of cash and appropriation within the Sanitary Bond Fund; to authorize the expenditure of $192,955.00 from the Sanitary Bond Fund to pay for this purchase; and to declare an emergency.  ($192,955.00)",
    "description": "Explanation                     \n1.  BACKGROUND\nTo authorize the Director of Finance and Management to enter into a contract with All Around Access LLC for the purchase of an Articulating Boom Lift. The Articulating Boom Lift will be used to for preventative maintenance and on demand repair work at the Southerly Waste Water Treatment Plant. This purchase has been approved by the Division of Fleet Management.\n \nThe Purchasing Office advertised and solicited competitive bids for the Articulating Boom Lift in accordance with the relevant provisions of City Code Chapter 329 relating to competitive bidding (RFQ025743).  Seventy (70) bidders were solicited and two (MAJ) bids were received and opened on September 28, 2023.\n \n    Name                                          Bid Amount________City/State              Status                     \nAll Around Access LLC                    $192,955.00                 Naples, FL                                   MAJ\nQasim Juzer                                       $220,200.00                Bakersfield, CA       MAJ\n \nAll Around Access LLC’s bid was deemed the lowest, best, most responsive bid. \n  \n2.  CONTRACT COMPLIANCE\nAll Around Access LLC’s contract compliance number is 018943 and expires 10/12/25.\n \nThe certification of All Around Access LLC was in good standing at the time of the contract award.\n \nThe company is not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.\n \n3.  FISCAL IMPACT\nThe 2023 Capital Improvement Budget will need to be amended to align budget authority with the proper project.  A transfer of cash and appropriation between projects within the Sanitary Bond Fund, Fund 6109, is needed to align cash and appropriation with the proper project.\n \n4.  EMERGENCY DESIGNATION\nEmergency action is requested to finalize the contracts for this equipment as soon as possible because of the current volatile pricing and long lead times for this type of purchase, as a delay in finalizing the contracts will result in expired quotes and an increase in the price of the equipment.\n \nTitle\nTo authorize the Director of Finance and Management to establish a contract with All Around Access LLC for the purchase of an Articulating Boom Lift for the Department of Public Utilities; to amend the 2023 Capital Improvement Budget; to authorize a transfer of cash and appropriation within the Sanitary Bond Fund; to authorize the expenditure of $192,955.00 from the Sanitary Bond Fund to pay for this purchase; and to declare an emergency.  ($192,955.00) \n \nBody\nWHEREAS, the Department of Public Utilities has a need for an Articulating Boom Lift to be used for preventative maintenance and on demand repair work; and\n \nWHEREAS, the Purchasing Office opened formal bids on September 28, 2023 for the purchase of an Articulating Boom Lift; and\n \nWHEREAS, the Department of Public Utilities, Division of Sewerage and Drainage, recommends an award be made to the lowest, responsive, responsible and best bidder, All Around Access LLC; and \n \nWHEREAS, an amendment to the 2023 Capital Improvement Budget is necessary to align budget authority with the proper project; and\n \nWHEREAS, a transfer of cash and appropriation within the Sanitary Bond Fund, Fund 6109, is needed to align cash and appropriation with the proper project; and\n \nWHEREAS, it is necessary to authorize an expenditure of up to $192,955.00 within the Sanitary Bond Fund, Fund No. 6109, to purchase the equipment; and\n \nWHEREAS, the Director of Finance and Management will need to enter into a contract with All Around Access LLC in accordance with the terms, conditions and specifications of Solicitation Number RFQ025743 on file in the Purchasing Office to make this purchase on behalf of the Department of Public Utilities; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Utilities in that it is immediately necessary to authorize the Director of Finance and Management to finalize the contract for this equipment as soon as possible because of the current volatile pricing and long lead times for this type of purchase, as a delay in finalizing the contracts will result in expired quotes and an increase in the price of the equipment, all for the immediate preservation of the public health, peace, property, safety, and welfare;  and NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Finance and Management be and is hereby authorized to establish a contract with All Around Access LLC for the purchase of an Articulating Boom Lift in accordance with the terms, conditions and specifications of Solicitation Numbers RFQ025743 on file in the Purchasing Office.\n \nSECTION 2.  That the 2023 Capital Improvement Budget authorized by Ordinance 1711-2023 be amended as follows to establish sufficient budget authority for this project:\n \nFund / Project Number / Project Name (Funding Source) / Current Authority/ Revised Authority / Change \n6109 / 650871-153001 / Blueprint Hilltop 1 Palmetto Westgate Roof Redirection Project 1 (Voted Sanitary Carryover) / $250,000.00 / $57,045.00 / ($192,955.00) \n \n6109 / 650903-100000 / Fleet Purchases (Voted Sanitary Carryover) / $1,310,995.00 / $1,503,950.00 / $192,955.00\n \nSECTION 3.  That the transfer of $192,955.00, or so much thereof as may be needed, is authorized in the Sanitary Bond fund, Fund 6109, per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the expenditure of $192,955.00 or as much thereof as may be needed is hereby authorized in the Sanitary Bond Fund, Fund 6109, per the accounting codes in the attachment to this ordinance. \n \nSECTION 5.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 7.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 8.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 95,
    "meeting_date": "2023-11-20",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}