{
  "success": true,
  "vote": {
    "id": 8024,
    "item_number": "SR-1",
    "title": "To authorize the Director of the Department of Development to enter into a Capital Improvement Agreement with The Gravity Project 3 Holdings, LLC in an amount up to $2,000,000.00 to reimburse for certain eligible project costs associated with Inclusive Housing Units to be provided by the GreenHouse Gravity project in East Franklinton; to authorize the Director of the Department of Development to execute and approve such other agreements and instruments contemplated by the Agreement; to authorize the expenditure of up to $2,000,000.00 from the Development Taxable Bond Fund and to allow for expenditures prior to the Purchase Order; and to declare an emergency. ($2,000,000.00)",
    "description": "Explanation\n \nBACKGROUND\n \nThis Ordinance is to authorize the Director of the Department of Development to enter into a Capital Improvement Agreement (the “Agreement”) with The Gravity Project 3 Holdings, LLC (the “Developer”), in an amount of up to $2,000,000.00 from the 2023 Capital Improvement Budget for the purpose of reimbursing the Developer for certain eligible project costs associated with Inclusive Housing Units to be provided by the GreenHouse Gravity project in East Franklinton. \n \nPursuant to Ordinance No. 0140-2017, the City and The Gravity Project, LLC entered into an Economic Development Agreement on February 2, 2017 for Phase I of the Gravity Project and pursuant to Ordinance No. 1732-2019, the City and Gravity Project 2, LLC to enter into an Economic Development Agreement on September 27, 2019 for Phase II of the Gravity Project, which is a three-phase development occurring in East Franklinton.  GreenHouse Gravity is the third phase of the Gravity Project development.\n \nThe Developer proposes GreenHouse Gravity, a mixed-use residential and retail development that will include 313 apartment units, 5,300 square feet of retail space and a 324-space parking garage (the “Project”) located at the former AD Farrow Harley Davidson dealership and NWD Franklinton, LLC sites generally located at 501 West Broad Street and 36 S. May Avenue and identified as Franklin County Tax Parcels 010-021196.00, 010-050085-00, 010-057684-00 and 010-000899-00. This Project will provide 50 public parking spaces (the “Public Parking Spaces”), Public Infrastructure Improvements and Public Art and Place-making Improvements adjacent to the Project site, and thirty-two (32) affordable residential units as follows: six (6) studio units, seventeen (17) one-bedroom units and nine (9) two-bedroom units affordable to residents at or below 80% Area Median Income (“AMI”) (the “Inclusive Housing Units”).\n \nThe City entered into an Economic Development Agreement (the “EDA”) with the Developer on July 18, 2023, as authorized by Ordinance 1761-2023 approved by Columbus City Council on June 26, 2023. The EDA memorializes a city contribution of $4,000,000.00 to reimburse the Developer for approved capital expenditures associated with Public Parking Spaces, Public Infrastructure Improvements, Public Art and Place-making Improvements, and Inclusive Housing Units (the “City Contribution”).  The first $2,000,000.00 of the City Contribution will go toward the Inclusive Housing Units and is available in the 2023 Capital Improvement Budget.  The remaining $2,000,000.00 of the City Contribution shall be submitted for consideration in the 2024 Capital Improvement Budget. \n \nThe Director of Development shall also be authorized to execute and approve such other agreements and instruments and to take all actions necessary to implement this ordinance and the transactions contemplated by the Agreement.\n \nApproval is also requested for reimbursement of certain expenses including land acquisition cost, architectural and engineering fees associated with the Inclusive Housing Units beginning September 28, 2021(the date Developer acquired the land) and began incurring expenses related to the Inclusive Housing Units that were incurred prior to the execution of the purchase order.  Investing in the Inclusive Housing Units aligns with The Columbus Housing Strategy of the City.  \n \nEmergency action is requested in order to maintain the construction schedule and to fulfill post-closing financing requirements with the Developer’s other lenders.  Without emergency action, new affordable housing would be further delayed from a low-income community in urgent need of it.\n \nFISCAL IMPACT:  Funding in the amount of $2,000,000.00 is available in 2023 Capital Improvement Budget. \n \nCONTRACT COMPLIANCE:  vendor compliance is pending.\n.\n \n \nTitle\n \nTo authorize the Director of the Department of Development to enter into a Capital Improvement Agreement with The Gravity Project 3 Holdings, LLC in an amount up to $2,000,000.00 to reimburse for certain eligible project costs associated with Inclusive Housing Units to be provided by the GreenHouse Gravity project in East Franklinton; to authorize the Director of the Department of Development to execute and approve such other agreements and instruments contemplated by the Agreement; to authorize the expenditure of up to $2,000,000.00 from the Development Taxable Bond Fund and to allow for expenditures prior to the Purchase Order; and to declare an emergency. ($2,000,000.00)\n \n \nBody\n \nWHEREAS, pursuant to Ordinance No. 1761-2023, the City entered into an Economic Development Agreement (the “EDA”) with The Gravity Project 3 Holdings, LLC (the “Developer”) on July 18, 2023, outlining the mutual commitments of the parties related to the GreenHouse Gravity project in East Franklinton; and\n \nWHEREAS, the GreenHouse Gravity project will include 313 apartment units, 5,300 square feet of retail space and a 324-space parking garage (the “Project”); and\n \nWHEREAS, the EDA includes Developer commitments for the Project to include 50 Public Parking Spaces, Public Infrastructure Improvements, Public Art and Place-making Improvements, and thirty-two (32) Inclusive Housing Units as follows: six (6) studio units, seventeen (17) one-bedroom units and nine (9) two-bedroom units affordable to residents at or below 80% Area Median Income (“AMI”); and\n \nWHEREAS, the EDA memorializes a City Contribution of $4,000,000.00 to reimburse the Developer for costs associated with the Public Parking Spaces, Public Infrastructure Improvements, Public Art and Place-making Improvements, and Inclusive Housing Units; and\n \nWHEREAS, the first $2,000,000.00 of the City Contribution will go toward the Inclusive Housing Units and is available in the 2023 Capital Improvement Budget and the remaining $2,000,000.00 of the City Contribution shall be submitted for consideration in the 2024 Capital Improvement Budget; and\n \nWHEREAS, the Director of the Department of Development seeks to enter into a Capital Improvement Agreement with The Gravity Project 3 Holdings, LLC in an amount of up to $2,000,000.00 to reimburse for certain eligible project costs associated with the Inclusive Housing Units to be provided by the GreenHouse Gravity project; and\n \nWHEREAS, expenses incurred by The Gravity Project 3 Holdings, LLC prior to execution of the purchase order, starting September 28, 2021, will be reimbursed; and\n \nWHEREAS, the Director of the Department of Development will be authorized to execute and approve such other agreements and instruments and to take all actions necessary to implement this ordinance and the transactions contemplated by the Agreement; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development to pass this ordinance as emergency in order to maintain the project schedule and fulfill post-closing financing requirements with the Developer’s other lenders, thereby, allowing new affordable housing to not be further delayed from a low-income community in urgent need of it for the immediate preservation of the public health, peace, property and safety; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Development be and is hereby authorized to enter into a Capital Improvement Agreement with The Gravity Project 3 Holdings, LLC in an amount up to $2,000,000.00 to reimburse for certain eligible project costs associated with Inclusive Housing Units to be provided by the GreenHouse Gravity project. Expenses incurred prior to the execution of the purchase order, beginning September 28, 2021, for certain eligible project costs as described in the background of this ordinance is hereby determined to be a valid public purpose and therefore authorized to be reimbursed.\n \nSECTION 2.  That for the purpose as stated in Section 1, the expenditure of $2,000,000.00, or so much thereof as may be necessary, is hereby authorized in fund 7739 (Development Taxable Bond fund), Project P441784-100000, Dept. 44-02 (Economic Development), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance. \n \nSECTION 3.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 6.  That the Director of the Department of Development is authorized to execute and approve such other agreements and instruments contemplated by the Capital Improvement Agreement, as approved by the City Attorney’s Office, including, but not limited to, the following:\n \na)                     That the Director of the Department of Development is authorized to execute and approve a Housing Development Agreement with The Gravity Project 3 Holdings, LLC, presently on file with the Director along with any changes or amendments thereto not inconsistent with this Ordinance and not substantially adverse to the City and which shall be approved by the Director and the City Attorney, provided that the approval of such changes and amendments thereto by the Director, and the character of those changes and amendments as not being substantially adverse to the City, shall be evidenced conclusively by the Director’s execution and delivery thereof, wherein, as part of the GreenHouse Gravity project, ten percent of the residential units will be affordable to households earning 80% of the Area Median Income (AMI).\n \nSECTION 7. That for reasons stated in the preamble hereto, which is made a part hereof, this Ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 95,
    "meeting_date": "2023-11-20",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}