{
  "success": true,
  "vote": {
    "id": 8055,
    "item_number": "CA-1",
    "title": "To Recognize the New Birth Warriors Football, Cheer and Drill Teams 20 Years of Success",
    "description": "Title\nTo Recognize the New Birth Warriors Football, Cheer and Drill Teams 20 Years of Success\n \nBody\nWHEREAS, the New Birth Warriors Football Organization was created to offer a positive outlet for youth and families in central Ohio; and \n \nWHEREAS, the organization was founded in 2003 and have continued to champion sportsmanship and advocacy for youth and families; and\n \nWHEREAS, the New Birth Warriors have won over 40 1st place trophies between their cheer, drill, and football organizations; and\n \nWHEREAS, despite setbacks from the Covid-19 pandemic, the organization has been pivotal in creating an atmosphere where youth and families can experience fellowship and camaraderie through sports and competition; and\n \nWHEREAS, over 2,000 youth and families have been positively impacted by participating in the organization; now, therefore\n \nBE IT RESOLVED BY COUNCIL OF THE CITY OF COLUMBUS: That this Council does hereby recognize New Birth Warriors Football, Cheer and Drill Teams for 20 years of success and positive influence in Columbus, Ohio.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 96,
    "meeting_date": "2023-12-04",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}