{
  "success": true,
  "vote": {
    "id": 8059,
    "item_number": "CA-5",
    "title": "To authorize the Director of the Department of Development to amend the Enterprise Zone Agreement with Knightsbridge Olentangy, LLC for the first time for assignment and assumption, to remove Knightsbridge Olentangy, LLC as Enterprise and party to the Agreement to be replaced with COPC Medical, LLC, Mercy South - Ohio, LLC, and LSCO Medical, LLC, to redefine the Project Site, to revise the notice information; and to declare an emergency.",
    "description": "Explanation\n \nBACKGROUND: Columbus City Council (“Council”), by Ordinance No. 1885-2012, passed September 24, 2012, authorized the City of Columbus (“City”) to enter into an Enterprise Zone Agreement (the “Agreement”) with Knightsbridge Olentangy, LLC ( the “Original Enterprise”), for a real property tax abatement of seventy-five percent (75%) for a period of ten (10) consecutive years in consideration of a proposed total capital investment of approximately $3,000,000.00 in new construction, the creation of two (2) net new full-time permanent positions with an associated annual payroll of approximately $56,160.00, and the retention of 31 jobs with an estimated annual payroll of approximately $1,680,032.00, related to the construction of a new approximately 21,000 square-foot medical office facility (the “Project”) on Parcel No. 010-266768 (the “Original Parcel”) located on and/or near Olentangy River Road, Columbus, Ohio 43204, within the City of Columbus and within the City of Columbus Enterprise Zone (the “Project Site”). The Agreement was made and entered into effective December 3, 2012 (Agreement No. 393-12-05) with the Project expected to begin approximately November 2012, with all real property improvements expected to be completed by July 2013, and with the abatement to commence no later than 2014 nor extend beyond 2023.\n \nParagraph twelve within Section 6 (Program Compliance) of the Agreement states that the “Agreement is not transferable or assignable without the express, written, approval of the City”.\n \nIn a letter received by the City on behalf of the Original Enterprise dated September 27, 2023 and through ensuing correspondence, it was confirmed that COPC Medical, LLC, Mercy South - Ohio LLC, and LSCO Medical, LLC have collectively acquired ownership of the Project Site from Knightsbridge Olentangy, LLC with the transfer having been recorded at the County Auditor’s Office on August 10, 2023.  Additionally, the Project Site has been revised to be Parcel Number 010-073628 (split from the Original Parcel) containing approximately 2.14 +/- acres with a mailing address of 4895 Olentangy River Road, Columbus, Ohio 43214.  \n \nDue diligence has been undertaken by the City in that COPC Medical, LLC, Mercy South - Ohio LLC, and LSCO Medical, LLC have agreed to fully assume the terms and commitments of the Original Enterprise pursuant to the Agreement, have submitted an updated Economic Development Incentive Application, submitted the five-hundred dollars ($500.00) Amendment Fee, and that these applications and all other pertinent information have been reviewed and vetted.\n \nThis legislation is to authorize the Director of the Department of Development to amend the Agreement for the first time for Assignment & Assumption to (1) remove Knightsbridge Olentangy, LLC as Enterprise and party to the Agreement and to be replaced with  COPC Medical, LLC, Mercy South - Ohio LLC, and LSCO Medical, LLC, collectively known as the Enterprise, whereby COPC Medical, LLC, Mercy South - Ohio LLC, and LSCO Medical, LLC will assume the terms and commitments of the Agreement, (2) revise the description of the Project Site, and (3) revise the notice information related to Enterprise within Section 6 the Agreement.   \n \nBased on the above, the Director of the Department of Development of the City has investigated the Economic Development Applications of COPC Medical, LLC, Mercy South - Ohio LLC, and LSCO Medical, LLC and concurs with the Columbus City Council on the basis that COPC Medical, LLC, Mercy South - Ohio LLC, and LSCO Medical, LLC are qualified by financial responsibility and business experience to create and preserve employment opportunities in the Columbus Enterprise Zone and improve the economic climate of the City.\n \nThis legislation is being presented as an emergency measure in order to amend the Agreement in as expedient a manner as possible so that this amendment to the Agreement can be executed and ensure that the Enterprise receives any future tax savings from the approved tax abatement before the incentive term expires and remain compliant.  \n \nFISCAL IMPACT: No funding is required for this legislation.\n \n \nTitle\n \nTo authorize the Director of the Department of Development to amend the Enterprise Zone Agreement with Knightsbridge Olentangy, LLC for the first time for assignment and assumption, to remove Knightsbridge Olentangy, LLC as Enterprise and party to the Agreement to be replaced with COPC Medical, LLC, Mercy South - Ohio, LLC, and LSCO Medical, LLC, to redefine the Project Site, to revise the notice information; and to declare an emergency.  \n \n \nBody\n \nWHEREAS, the City of Columbus (“City”) entered into an Enterprise Zone Agreement (the “Agreement”) with Knightsbridge Olentangy, LLC (hereafter referred to as “Original Enterprise”), approved by Columbus City Council (“Council”) on September 24, 2012 by Ordinance No.1885-2012; and \n \nWHEREAS, the Agreement granted a 75%/10-Year abatement on real property improvements; and\n \nWHEREAS, the incentive was granted in consideration of company’s total proposed investment of approximately $3,000,000.00 in real property improvements to construct an approximate 21,000 square-foot medical office facility on Parcel No. 010-267768 (the “Original Parcel”) located on and/or near Olentangy River Road, Columbus, Ohio 43204, (the “Project Site”), within the Columbus City School District, and within the Columbus Enterprise Zone, (hereinafter referred to as the “Project”).  Additionally, the Original Enterprise committed to create two (2) net new full-time permanent positions with an associated annual payroll of approximately $56,160.00 and retain thirty-one (31) jobs with an estimated annual payroll of approximately $1,680,032.00 at the Project Site.  The Agreement was made and entered into effective December 3, 2012 with the Project expected to begin approximately November 2012, with all real property improvements expected to be completed by July 2013, and with the abatement to commence no later than 2014 nor extend beyond 2023 (Agreement No. 393-12-05); and\n \nWHEREAS, paragraph twelve within Section 6 (Program Compliance) of the Agreement states that the “Agreement is not transferable or assignable without the express, written, approval of the City”; and\n \nWHEREAS, in a letter received by the City on behalf of the Original Enterprise dated September 27, 2023 and through ensuing correspondence, it was confirmed that COPC Medical, LLC, Mercy South - Ohio LLC, and LSCO Medical, LLC have collectively acquired ownership of the Project Site from Knightsbridge Olentangy, LLC with the transfer having been recorded at the County Auditor’s Office on August 10, 2023.  Additionally, the Project Site has been revised to be Parcel Number 010-073628 (split from the Original Parcel) containing approximately 2.14 +/- acres with a mailing address of 4895 Olentangy River Road, Columbus, Ohio 43214; and\n \nWHEREAS, due diligence has been undertaken by the City in that COPC Medical, LLC, Mercy South - Ohio LLC, and LSCO Medical, LLC have agreed to fully assume the terms and commitments of the Original Enterprise pursuant to the Agreement, have submitted updated Economic Development Incentive Applications, submitted the five-hundred dollars ($500.00) Amendment Fee, and that these applications and all other pertinent information has been reviewed and vetted; and\n \nWHEREAS, the Director of the Department of Development of the City has investigated the Economic Development Applications of COPC Medical, LLC, Mercy South - Ohio, LLC, and LSCO Medical, LLC and concurs with the Columbus City Council on the basis that COPC Medical, LLC, Mercy South - Ohio, LLC, and LSCO Medical, LLC are qualified by financial responsibility and business experience to create and preserve employment opportunities in the Columbus Enterprise Zone and improve the economic climate of the City; and \n \nWHEREAS, an emergency exists in the usual daily operation of the Columbus Department of Development in that it is immediately necessary to seek a First Amendment to the Agreement is for Assignment & Assumption to remove Knightsbridge Olentangy, LLC as Enterprise and party to the Agreement and to be replaced with COPC Medical, LLC, Mercy South - Ohio, LLC, and LSCO Medical, LLC (collectively, and hereinafter referred to as the “Enterprise”), to redefine the Project Site, revise the notice information related to Enterprise within Section 6 of the Agreement prior to the expiration of the Agreement term to remain compliant, all for the immediate preservation of the public health, peace, property and safety; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF COLUMBUS:\n \nSECTION 1.                     That the Council of Columbus finds that the enterprise submitting this proposal is qualified by financial responsibility and business experience to create and preserve employment opportunities in the zone and improve the economic climate of the municipal corporation.\n \nSECTION 2.                      The Director of the Department of Development is hereby authorized to amend the Enterprise Zone Agreement with Knightsbridge Olentangy, LLC (the “Agreement”) to remove Knightsbridge Olentangy, LLC as Enterprise to be replaced by COPC Medical, LLC, Mercy South - Ohio, LLC, and LSCO Medical, LLC as Enterprise and party to the Agreement, whereby COPC Medical, LLC, Mercy South - Ohio, LLC, and LSCO Medical, LLC will collectively assume the terms and commitments of the Agreement as the Enterprise.\n \nSECTION 3.                     That the Director of the Department of Development is hereby authorized to amend Section 1 (Construction by Corporation) of the Agreement to state that the Project Site is revised to be Parcel Number 010-073628 (split from the Original Parcel), containing approximately 2.14 +/- acres with an mailing address of 4895 Olentangy River Road, Columbus, Ohio 43214.   \n \nSECTION 4.                     That the Director of the Department of Development is hereby authorized to amend within Section 6 (Program Compliance) of the Agreement, the “if to the Enterprise” section regarding written communication to Knightsbridge Olentangy, LLC to COPC Medical, LLC, Mercy South - Ohio, LLC, and LSCO Medical, LLC. The contact for COPC Medical, LLC and Mercy South - Ohio, LLC is Stephen M. Bessenbacher, and the contact for LSCO Medical, LLC is Lawrence J. Slater.\n \nSECTION 5.                     That this First Amendment for Assignment & Assumption to the City of Columbus Enterprise Zone Agreement be signed by COPC Medical, LLC, Mercy South - Ohio, LLC, and LSCO Medical, LLC within ninety (90) days of passage of this ordinance, or this ordinance and the incentive authorized herein shall be null and void.\n \nSECTION 6.                     That for reasons stated in the preamble hereto, which is hereby made a part hereof, the ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after the passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 96,
    "meeting_date": "2023-12-04",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Contracts & Agreements",
      "Economic Development",
      "Emergency Services"
    ]
  }
}