{
  "success": true,
  "vote": {
    "id": 8071,
    "item_number": "CA-17",
    "title": "To amend the 2023 Capital Improvement Budget; to authorize the transfer of funds within the Streets and Highways Bond Fund; to authorize the Director of Public Service to enter into a contract modification with Arcadis Engineering Services in connection with the Arterial - SR161 - I71 to Cleveland Avenue Phase 2 project; to authorize the expenditure of up to $800,000.00 from the Streets and Highways Bond Fund for the project; and to declare an emergency.  ($800,000.00)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of the Department of Public Service to modify a professional services contract with Arcadis Engineering Services (USA), Inc. formerly IBI Group Engineering Services (USA), Inc. to add additional funds for design of the Arterial - SR161 - I71 to Cleveland Avenue Phase 2.\nOrdinance 3324-2021 authorized the Director of the Department of Public Service to enter into a professional services contract with Arcadis Engineering Services (USA), Inc. for the Arterial - SR161 - I71 to Cleveland Avenue Phase 2 project.  The intent of this project is to provide the City of Columbus, Department of Public Service, additional resources for the preparation of preliminary engineering documents and detailed design plans for the second of multiple phases targeted to improve safety and increase multi-modal access throughout the East Dublin-Granville Road/SR161 corridor between I-71 and Cleveland Avenue. This phase will provide improvements to SR161 from Ambleside Drive/Satinwood Drive to Maple Canyon Avenue. The side streets of Sharon Woods Boulevard/Tamarack Boulevard and Beechcroft Road will be improved north and south of SR161.  \n \nOrdinance 2534-2022 authorized the Director of the Department of Public Service to submit MORPC Attributable Funds roadway improvement project applications for consideration for funding within the Transportation Improvement Program and to authorize the Director of Public Service to execute project agreements for approved projects for the Department of Public Service for the Arterial - SR161 - I71 to Cleveland Avenue Phase 2. \n \nOrdinance 2424-2023 authorized the Director of the Department of Public Service to modify contracts with IBI Group Engineering Services to allow the assignment of all past, present and future contracts from IBI Group Engineering Services to Arcadis Engineering Services (USA), Inc\n \nThis ordinance authorizes the Director of the Department of Public Service to modify the contract in the amount of $800,000.00.\n \n1.1  Amount of additional funds to be expended: $800,000.00\nThe original contract amount:                                                                             $850,000.00     (PO308007, Ord. 3324-2021)                          \nThe total of Modification No. 1:                                                                      $800,000.00     (This Ordinance)\n \nThe contract amount including all modifications:        $1,650,000.00  \n \n1.2  Reasons additional goods/services could not be foreseen:  \nThe amount initially legislated for this project did not include the full amount that would be needed to fund this project through final design and construction services. There will be future modifications as funds become available.\n \n1.3  Reason other procurement processes are not used:\nThe full amount of the contract was not initially available, therefore it was planned that contract would be modified as funds became available to complete the project.  It was decided that it is in the best interest of the City to modify the existing contract instead of bidding this part of the work.\n \n1.4  How cost of modification was determined:\nThe cost of this contract modification is consistent with the direct labor, overhead, and profit rates established within the original proposal/contract. \n \nSearches in the System for Award Management (Federal) and the Findings for Recovery list (State) produced no findings against Arcadis Engineering Services (USA), Inc\n \n2.  CONTRACT COMPLIANCE\nThe contract compliance number for Arcadis Engineering Services (USA), Inc. is CC009409 and expires 2/22/2025.\n \n3.  FISCAL IMPACT\nFunding in the amount of $800,000.00 is available and appropriated within the Streets and Highways Bond Fund within the Department of Public Service.  An amendment to the 2023 Capital Improvements Budget and a transfer of funds are necessary to align funding for these project expenditures. \n \n4. MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis expenditure is to modify a contract that was put in place prior to the implementation of the Minority and Woman Owned Business Enterprise & Small Local Business Enterprise program and as such is not a part of the program.\n \n5.  EMERGENCY DESIGNATION\nEmergency action is requested to meet the deadlines for the federal funding, meet the requirements of the grant, and to preserve the safety of the traveling public.                     \n                     \nTitle\nTo amend the 2023 Capital Improvement Budget; to authorize the transfer of funds within the Streets and Highways Bond Fund; to authorize the Director of Public Service to enter into a contract modification with Arcadis Engineering Services in connection with the Arterial - SR161 - I71 to Cleveland Avenue Phase 2 project; to authorize the expenditure of up to $800,000.00 from the Streets and Highways Bond Fund for the project; and to declare an emergency.  ($800,000.00) \n \nBody\nWHEREAS, contract no. PO308007 with Arcadis Engineering Services (USA), Inc., in the amount of $850,000.00, was authorized by Ordinance No. 3324-2021; and \n \nWHEREAS, it has become necessary to modify the contract in an amount up to $800,000.00 and provide additional funds for the Arterial - SR161 - I71 to Cleveland Avenue Phase 2 project; and\n \nWHEREAS, it is necessary to amend the 2023 Capital Improvement Budget and transfer cash to provide funding for project expenditures; and\n \nWHEREAS, it is necessary to expend funds relative to the project; and \n \nWHEREAS, this expenditure is to modify a contract that was put in place prior to the implementation of the Minority and Woman Owned Business Enterprise & Small Local Business Enterprise Program and as such is not a part of the program; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to enter into a contract modification with Arcadis Engineering Services (USA), Inc. to meet deadlines for federal grant funding, to preserve the safety of the traveling public, all for the immediate preservation of the public health, peace, property, and safety; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n                     \nSECTION 1.  That the 2023 Capital Improvements Budget authorized by Ordinance 1711-2023 be amended to establish sufficient authority for this project:\n \nFund / Project / Project Name / C.I.B. / Change / C.I.B. as Amended\n7704 / P533008-100000 / Arterial Street Rehabilitation - Williams Road Corridor - Scioto River to S. Hamilton Rd (Voted Carryover) / $2,200,000.00 / ($800,000.00) / $1,400,000.00\n7704 / P533003-100000 / Arterial - SR161 - I71 to Cleveland Ave Phase 2 (Voted Carryover) / $0.00 / $800,000.00 / $800,000.00\n \n7704 / P533008-100000 / Arterial Street Rehabilitation - Williams Road Corridor - Scioto River to S. Hamilton Rd (Voted 2019 SIT Supported) / 0.00 / $800,000.00 / $800,000.00\n7704 / P530103-100075 / Arterial - SR161 - I71 to Cleveland Ave Phase 1 - Part 2 (Parkville/Spring Run) (Voted 2019 SIT Supported) / $2,500,000.00 / ($800,000.00) / $1,700,000.00\n \nSECTION 2.  That the transfer of $800,000.00, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5912 (Design and Construction), Project P533008-100000 (Arterial Street Rehabilitation - Williams Road Corridor - Scioto River to S. Hamilton Rd), Object Class 06 (Capital Outlay) to Dept-Div 5912 (Design and Construction), Project P533003-100000 (Arterial - SR161 - I71 to Cleveland Ave Phase 2), Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That the Director of the Department of Public Service be, and hereby is, authorized to enter into a contract modification with Arcadis Engineering Services (USA), Inc., 8101 North High Street, Suite 100, Columbus, Ohio 43235, for the Arterial - SR161 - I71 to Cleveland Ave Phase 2 project in the amount of $800,000.00, or so much thereof as may be needed, in accordance with the plans and specifications on file in the Department of Public Service, which are hereby approved.\nSECTION 4.  That the expenditure of $800,000.00, or so much thereof as may be needed, is hereby authorized in Fund 7704 (Streets and Highways Bond Fund), Dept-Div 5912 (Design and Construction), Project P533003-100000 (Arterial - SR161 - I71 to Cleveland Ave Phase 2), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 5.  That funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 7.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 8.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 96,
    "meeting_date": "2023-12-04",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}