{
  "success": true,
  "vote": {
    "id": 8149,
    "item_number": "CA-95",
    "title": "To authorize the City Treasurer to modify its contract for banking services with Fifth Third Bank as provided in Chapter 321 of the Columbus City Codes; to authorize an expenditure of $41,000.00 from the Treasurer’s Office general fund appropriations; and to declare an emergency. ($41,000.00)",
    "description": "Explanation\n \nBACKGROUND:\nOn December 12, 2022, the Columbus City Treasurer's Office, in collaboration with the City Auditor’s Office, issued a request for proposal, RFQ023687, for various banking services.  An Evaluation Committee comprised of five representatives from the City Treasurer’s Office, Department of Public Utilities, Department of Finance and Management, Division of Income Tax, and the City Auditor’s Office received and reviewed proposals from six (6) banks.  On May 12, 2023, a joint meeting of the Columbus Depository Commission and Treasury Investment Board was held at which the Treasurer presented the Evaluation Committee’s rankings of offerors.  The Treasurer recommended, and the Depository Commission and Treasury Investment Board approved, subject to successful negotiation and the approval of City Council, the award of banking services to specific banks.\n \nAll such banks are currently eligible depositories of the City of Columbus, pursuant to Chapter 321.04 of the Columbus City Code.  The contracts are for a total period of ten (10) years beginning September 1, 2023, through August 31, 2033, subject to annual appropriations and approval of contracts by the Columbus City Council.\n \nThe initial contract term was made 17 months to better align the annual term with the City’s budget.\n \nThe original contract awarded both investment safekeeping and smart safe banking services.  This modification is needed to fund implementation of smart safe/bill recycler services for the Treasurer's Office and for the Division of Parking.  Pricing for these services is related to the volumes of cash and equipment sizes that are specific to each location.\n \nColumbus City Council authorized the initial term of the contract with passage of ordinance 1689-2023 on July 17, 2023.\n \nThe City Treasurer now wishes to modify its contract with Fifth Third Bank to add funding in the amount of $41,000.00 for implementation of smart safe and bill recycler solution.\n \nFISCAL IMPACT:\nFunds for these expenditures are consistent with the Treasurer’s Office third quarter financial review.\n \nContract Compliance:  Fifth Third Bank, 310676865, expiration 5/30/2025.\n \nThis ordinance is submitted as an emergency so that the Treasurer’s Office may proceed with implementation of the needed smart safe and bill recycler services prior to year-end.\n \nTitle\n \nTo authorize the City Treasurer to modify its contract for banking services with Fifth Third Bank as provided in Chapter 321 of the Columbus City Codes; to authorize an expenditure of $41,000.00 from the Treasurer’s Office general fund appropriations; and to declare an emergency. ($41,000.00)\n \n \nBody\n \nWHEREAS, the City Treasurer proposed the award of contracts for banking services as provided for in RFQ023687 issued on December 12, 2022, for which the Columbus Depository Commission, at a meeting held on May 12, 2023, recommended the award of banking services, subject to approval by Columbus City Council; and\n \nWHEREAS, Columbus City Council authorized the City Treasurer to enter into contracts for banking services with JP Morgan Chase Bank and with Fifth Third Bank with passage of ordinance 1689-2023 on July 17, 2023; and\nWHEREAS, the City Treasurer now wishes to add funds to its contract with Fifth Third Bank to implement services related to smart safe and bill recycling technology; and\n \nWHEREAS, an emergency exists in the usual daily operation of the City Treasurer in that it is immediately necessary to authorize the Treasurer to modify its contract with Fifth Third Bank and authorize the expenditures as cited below providing additional funding so that implementation of smart safe/bill recycler technology may proceed prior to year-end, for the immediate preservation of the public health, peace, property, and safety; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the City Treasurer is hereby authorized to modify its contract with Fifth Third Bank for the provision of banking services for the City of Columbus for the period September 1, 2023 through March 31, 2025 to increase the amount of said contract by $41,000.00. \n \nSECTION 2.  That the expenditure of $41,000.00, or so much thereof as may be necessary, is hereby authorized from the General Fund in object class 03, contractual services, per the accounting codes in the attachment to this ordinance. \n \nSECTION 3. That the funds necessary to carry out the purpose of this ordinance are deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 96,
    "meeting_date": "2023-12-04",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}