{
  "success": true,
  "vote": {
    "id": 8157,
    "item_number": "SR-7",
    "title": "To authorize the Director of the Recreation and Parks Department to enter into contract with Harrell's, LLC for the purchase of Golf Course pesticides; to authorize the expenditure of $237,124.50 for the purchase of golf turf pesticides from the Recreation and Parks Operating Fund; to waive the competitive bidding provisions of the Columbus City Codes; and to declare an emergency.  ($237,124.50)",
    "description": "Explanation\n   \nBackground: \nThis ordinance will authorize the Director of the Recreation and Parks Department to enter into contract with Harrell's, LLC for the purchase of Syngenta golf course pesticides.  An Informal cost proposal has been submitted by Harrell’s in the amount of $237,124.50.  This purchase shall be eligible for a rebate totaling $43,699.36 which shall be used in the spring to purchase additional chemicals from the distributor.  The cost proposal also includes the provision of free soil and water testing and educational training programs.\n \nChanges to the golf turf pesticide application program were implemented in 2017 and have resulted in a significant reduction in the number of pesticide applications and variety of products while producing noticeable results with improved playing conditions.  \n \nBid Waiver Justification:  Pesticide supplier Syngenta offers a seasonal purchasing program to its distributors which packages pesticides into bundles and offers deep discounts and rebates when the pesticides are purchased in the fall.  Syngenta also sets pricing resulting in equal pricing between all distributors. Harrell’s is the only local vendor to include additional free services such as soil and water testing and educational training programs with the pesticide purchase and these are of value to the Recreation and Parks Department.  Due to the set pricing across distributors and the provision of additional free services by Harrell’s, competitive bidding is requested to be waived.  \n \nEmergency Justification:  In order to take advantage of Syngenta’s fall purchasing program, the order must be placed with Harrell’s by December 2023 to be eligible.  An emergency is being requested in order to meet the fall order purchasing program deadline of December, 2023.\n \nBenefits to the Public: Golfers benefit from better utilization of safer pesticides to provide excellent course conditions, a great product for the customer.\n \nArea(s) Affected:  Airport, Mentel, Champions, Raymond, Turnberry, and Wilson Golf Courses.\n \nMaster Plan Relation:  The Golf Courses continue to support the mission of the Recreation and Parks Master Plan by ensuring a strong customer base with successful on-going revenue producing operations.\n \nPrincipal Parties: \nHarrell’s, LLC\n5105 New Tampa Highway\nLakeland Fl. 33815\nCCN:                     020552\nCC Expiration Date: 4/8/2024\n \nFiscal Impact: $237,124.50 is budgeted and available from and within the Recreation and Parks Operating Fund 2285 to meet the financial obligations of these expenditures.  \n \nTitle\n \nTo authorize the Director of the Recreation and Parks Department to enter into contract with Harrell's, LLC for the purchase of Golf Course pesticides; to authorize the expenditure of $237,124.50 for the purchase of golf turf pesticides from the Recreation and Parks Operating Fund; to waive the competitive bidding provisions of the Columbus City Codes; and to declare an emergency.  ($237,124.50)\n \nBody\n \nWHEREAS, it is necessary for the Director of the Recreation and Parks Department to enter into contract with Harrell's, LLC for the purchase of pesticides in an amount not to exceed $237,124.50; and\n \nWHEREAS, it is necessary to authorize the expenditure of $237,124.50 from the Recreation and Parks Department Operating Fund; and\n \nWHEREAS, due to set pricing required by supplier Syngenta which results in identical distributor pricing and additionally to the vendor’s inclusion of supplemental free services within the pesticide purchase price, it is in the best interest of the City to waive the competitive bidding provisions of City Codes Chapter 329; and \n \nWHEREAS, an emergency exists in the usual daily operation of the Recreation and Parks Department in that it is immediately necessary to authorize the Director of Recreation and Parks to enter into contract with Harrell's, LLC for golf course pesticides in order to meet the fall order purchasing program deadline of December, 2023; NOW, THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Recreation and Parks Department be and is hereby authorized to enter into contract with the Harrell’s, LLC in an amount not to exceed $237,124.50 for the purchase of Golf course pesticides.  \n \nSECTION 2. That, for the purpose stated in Section 1, the expenditure of $237,124.50, or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Recreation and Parks Operating Fund 2285 per the accounting codes in the attachment to this ordinance. \n \nSECTION 3.  That this Council finds it to be in the best interests of the City to waive and does waive the relevant provisions of Chapter 329 of the Columbus City Codes relating to competitive bidding for this purchase.\n \nSECTION 4. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5.  That for the reasons stated in the preamble hereto, which is hereby made a part thereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten (10) days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 96,
    "meeting_date": "2023-12-04",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}