{
  "success": true,
  "vote": {
    "id": 8200,
    "item_number": "0",
    "title": "To authorize the Director of the Department of Public Utilities to enter into a grant agreement with the Mid-Ohio Regional Planning Commission to provide funding and support for the 2023 Water Resources Program; to authorize the expenditure of $60,000.00 split among the Sanitary Sewer, Water, and Stormwater Operating Funds; and to authorize the City Auditor to transfer funds between object classes within each of those funds to support this expense. ($60,000.00)",
    "description": "Explanation\n \nThis legislation authorizes the Director of Public Utilities to enter into a grant agreement with the Mid-Ohio Regional Planning Commission (MORPC) to provide funding and support for the 2023 MORPC Water Resources Program and the City Auditor to transfer funds within the Sanitary Sewer, Water, and Stormwater Operating Funds to support this expense. The Program supports regional water resources protection by promoting regional collaboration among water and wastewater utilities, watershed and other environmental groups, and agricultural and rural communities. The fund transfer is needed because funds were budgeted to object class 03, Professional Services, but must be coded to object class, 05, Other Expenditures, per recent guidance on City-provided grants to nonprofit organizations.\n \nMost of the funding will support the Program’s Sustaining Scioto board and working group and associated activities. Funded tasks will establish the board’s roadmap and key performance indicators (KPIs), promote the implementation of structural and nonstructural best management practices within the agricultural community, and sustain partnerships on water quality monitoring. \n \nOther activities these funds will support include plan development and support for water resources protection and infrastructure planning needs through the development and identification of relevant climate data, tools, and resources; updating MORPC’s green infrastructure toolkit; education, outreach, and on-going communications and engagement support; and the planning and development of Riverfest and the Summit on Sustainability.  \n \nThe term of the program is January 1, 2023 through December 31, 2023.\n    \nSUPPLIER:                      \n \nMid-Ohio Regional Planning Commission | D365 Vendor #004591 | Federal EIN on file | Expires 3/25/2024 \n \nMORPC is a nonprofit institution and does not hold MBE/WBE status.\n \nMORPC is not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.\n \nFISCAL IMPACT:  \n \n$60,000.00 is budgeted and available for this expense across the Sanitary Sewer, Water, and Stormwater Operating Funds.\n \n$60,000.00 has been spent in 2023\n$60,000.00 was spent in 2022\n$0.00 was spent in 2021 \n \n \nTitle\n \nTo authorize the Director of the Department of Public Utilities to enter into a grant agreement with the Mid-Ohio Regional Planning Commission to provide funding and support for the 2023 Water Resources Program; to authorize the expenditure of $60,000.00 split among the Sanitary Sewer, Water, and Stormwater Operating Funds; and to authorize the City Auditor to transfer funds between object classes within each of those funds to support this expense. ($60,000.00)\n \n \nBody\n \nWHEREAS, the Department of Public Utilities (DPU) wishes to enter into a grant agreement with the Mid-Ohio Regional Planning Commission (MORPC) to provide funding and support for the 2023 MORPC Water Resources Program; and\n \nWHEREAS, DPU has a need to transfer a total of $60,000.00 between Object Classes within the Sanitary Sewer, Water, and Stormwater Operating Funds; and\n \nWHEREAS, Funds for program were budgeted and are available in Object Class 03 (Professional Services) in each of the respective funds; and\n \nWHEREAS, the Water Resources Program supports regional water resources protection by promoting regional collaboration among water and wastewater utilities, watershed and other environmental groups, and agricultural and rural communities, and DPU has previously provided funding support; and\n \nWHEREAS, the term of this contract is from January 1, 2023 through December 31, 2023; and \n \nWHEREAS, the expenditure of $60,000.00 or so much thereof as may be needed, is hereby authorized from object class 05, Other Expenditures, split among the Water, Sanitary Sewer, and Stormwater Operating Funds, per the accounting codes attached to this ordinance; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities to authorize the Director of the Department of Public Utilities to enter into a grant agreement with the Mid-Ohio Regional Planning Commission (MORPC) to provide funding and support for the 2023 MORPC Water Resources Program and to authorize the City Auditor to transfer appropriation between object classes within the Sanitary Sewer, Water, and Stormwater Operating Funds to support this agreement; NOW, THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the transfer of $60,000.00 or so much thereof as may be needed, is hereby authorized between Object Classes within Fund 6000, Water Operating Fund, Fund 6100, Sanitary Sewer Operating Fund, and Fund 6200, Stomwater Operating Fund, per the accounting codes attached to this ordinance.\n \nSECTION 2. That the Director of the Department of Public Utilities is hereby authorized to enter into a grant agreement with the Mid-Ohio Regional Planning Commission, 111 Liberty St. Ste 100, Columbus, OH 43215, to provide funding and support for the 2023 MORPC Water Resources Program.\n \nSECTION 3.  That the expenditure of $60,000.00 or so much thereof as may be needed, is hereby authorized from object class 05, Other Expenditures, split among the Water, Sanitary Sewer, and Stormwater Operating Funds, per the accounting codes attached to this ordinance.\n \nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6. That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 97,
    "meeting_date": "2023-12-11",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Grants"
    ]
  }
}