{
  "success": true,
  "vote": {
    "id": 8219,
    "item_number": "0",
    "title": "To create the Columbus Housing Community Reinvestment Area (CHCRA); to authorize real property tax exemptions as authorized by Chapter 3735 of the Ohio Revised Code (ORC); to provide that the City’s existing Community Reinvestment Area Housing Council shall serve as the Housing Council for the CHCRA; to designate the Housing Administrator as the Housing Officer for the CHCRA; and to repeal various ordinances establishing or amending currently existing Community Reinvestment Areas that will be absorbed into the boundary of the CHCRA. (AMENDED BY ORD. 1393-2024 PASSED 5/20/2024) (Amended by Ord. 1908-2025 passed on 7/28/2025 -LG)",
    "description": "Background\n \nThe goal of a Community Reinvestment Area is neighborhood revitalization and stabilization.\nThis Ordinance will create the Columbus Housing Community Reinvestment Area (the “CHCRA”), and provide for real property tax exemptions within the area in accordance with Sections 3735.65 to 3735.70 of the Ohio Revised Code (the “ORC”). The real property tax exemptions provided herein will be available only for parcels that are residentially zoned, or parcels where residential use is permitted by variance, and only for properties that are actually used for residential purposes.\nThe Ordinance will provide for exemptions from increases in real property taxation resulting from the construction of new housing, the conversion of buildings from commercial use to residential use, and the renovation of existing single and multi-family housing units, within the established boundaries.\nTitle\nTo create the Columbus Housing Community Reinvestment Area (CHCRA); to authorize real property tax exemptions as authorized by Chapter 3735 of the Ohio Revised Code (ORC); to provide that the City’s existing Community Reinvestment Area Housing Council shall serve as the Housing Council for the CHCRA; to designate the Housing Administrator as the Housing Officer for the CHCRA; and to repeal various ordinances establishing or amending currently existing Community Reinvestment Areas that will be absorbed into the boundary of the CHCRA. \nBody \nWHEREAS, the City of Columbus has established a goal of fostering private sector investment to build mixed income neighborhoods dispersed throughout the City; and\nWHEREAS, the Council of the City of Columbus desires to pursue reasonable and legitimate incentive measures to assist and encourage development in specific areas of the City of Columbus that have not enjoyed the benefit of reinvestment from remodeling or new construction; and\nWHEREAS, Ordinance No. 1698-78, passed on August 3, 1978, authorized the Department of Development to carry out a Community Reinvestment Program, pursuant to Sections 3735.65 to 3735.70 of the Ohio Revised Code, and approved certain administrative procedures for the program; and\nWHEREAS, the City has created 28 Post-1994 Community Reinvestment Areas (“CRAs”) throughout the City to incentivize residential development within those areas; and\nWHEREAS, going forward, combining 26 of the 28 aforementioned Post-1994 CRAs into one CHCRA will simplify the program through fewer pieces of legislation to govern the availability of tax incentives and Affordable Housing Unit requirements that must be met, if any, for residential and mixed use Development Projects; and\nWHEREAS, to consolidate 26 of the 28 Post-1994 CRAs into one CHCRA, City Council must authorize the City’s Director of the Department of Development to file a petition with the Ohio Department of Development for residential projects outlining the geographic boundary thereof, which must also include the percentage and term of the tax incentive and the minimum investment required to be eligible for a CRA exemption; and\nWHEREAS, upon passage of this Ordinance, the following post-1994 CRAs will be dissolved and absorbed into the CHCRA: 161; AC Humko; Brewers Yard; Brookwood; Cassady/I-670; Cleveland Avenue; Crosswoods; Far East; Far South; Far West Broad; Fifth by Northwest; Franklinton / Area G; Front Street/West Street; Gibbard Avenue; Grandview Crossing; High and Second; Hilltop / Area D; Hubbard and High; Jeffrey Square; Kenny and Henderson; Linden / Area A; Livingston and James; Milo Grogan; Nazarene; Near East; North Central; Northeast; Northland; Oak Street; Petzinger Road; Quarry; Riverside; South of Main / Area E; Southeast; Southside / Area C; Weinland Park / Area F; West Scioto; Wilson Road (Residential); and\nWHEREAS, all current CRA Agreements or projects that have an executed agreement or memorandum approved by City Council, entered into by the City and Project Sponsors, prior to the effective date of this Ordinance, will continue subject to the terms and conditions of their respective CRA Agreements, executed agreements, or memorandums; and\nWHEREAS, the City’s current CRA Housing Council formed by the passage of Ordinance 2412-2003 on November 10, 2003, as required by ORC Section 3735.69, shall serve as the CRA Housing Council for the CHCRA; and\nWHEREAS, a housing survey (Exhibit A) and a map of the proposed CRA (Exhibit B), as required by ORC Section 3735.66, have been prepared and are attached to this Ordinance; and\nWHEREAS, City Council adopted the revised changes to the City’s residential tax incentive policy on July 30, 2018 by adopting Ordinance No. 2184-2018, on October 22, 2018 by adopting Ordinance No. 2781-2018, on July 25, 2022 by adopting Ordinance No. 1843-2022, and on July 10, 2023 by adopting Ordinance No. 1839-2023, which is codified in Chapter 4565 of the Columbus City Codes (“CCC”); and\nWHEREAS, the Director of the Department of Development shall designate census tracts within the CHCRA as Market Ready Areas, Ready for Revitalization Areas, or Ready for Opportunity Areas (the “Area Designation”) as provided in Chapter 4565; and\nWHEREAS, specific terms and requirements for the CHCRA will adhere to the requirements of Chapter 4565, including all requirements specific to the Area Designation assigned to the census tract; and\nWHEREAS, the remodeling of existing structures for residential use and construction of new residential structures in the CHCRA constitutes a public purpose for which real property exemptions may be granted, and would serve to encourage economic stability, maintain real property values, and generate new employment opportunities; NOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSection 1. Definitions\nThat the defined terms as used in Chapter 4565 of the CCC shall have the same meaning as in Chapter 4565, unless otherwise defined in this Ordinance. Definitions of CRAs and TIFs referenced in this Ordinance are found in Exhibits C, D, and E, which are incorporated herein by reference.\nSection 2. That City Council finds that the housing survey in Exhibit A, attached hereto and incorporated herein, reflects that the area depicted in Exhibit B, attached hereto and incorporated herein, constitutes an area in which housing facilities or structures of historical significance are located and new housing construction and repair of existing facilities or structures are discouraged. City Council finds that the construction of new structures and the remodeling of existing structures are declared to be a public purpose for which exemptions from real property taxation may be granted as set forth hereinafter.\nSection 3. That pursuant to ORC Section 3735.66, the CHCRA boundary is hereby established in the area as described in this Section:\n(a)                     General Boundary of CHCRA. All parcels within the City of Columbus corporate boundary shall be within the CHCRA boundary, except as provided for this Section.\n \n(b)                     CRAs Absorbed into Boundary of CHCRA. The following CRAs, as defined by Exhibit C, which is hereby incorporated herein by reference, and as previously approved by City Council are hereby dissolved and absorbed into the CHCRA: 161; AC Humko; Brewers Yard; Brookwood; Cassady/I- 670; Cleveland Avenue; Crosswoods; Far East; Far South; Far West Broad; Fifth by Northwest; Franklinton / Area G; Front Street/West Street; Gibbard Avenue; Grandview Crossing; High and Second; Hilltop / Area D; Hubbard and High; Jeffrey Square; Kenny and Henderson; Linden / Area A; Livingston and James; Milo Grogan; Nazarene; Near East; North Central; Northeast; Northland; Oak Street; Petzinger Road; Quarry; Riverside; South of Main / Area E; Southeast; Southside / Area C; Weinland Park / Area F; West Scioto; Wilson Road (Residential) (“Absorbed CRAs”);\n \n(c)                     CRAs Excluded from Boundary of CHCRA. The following currently existing CRAs, as defined by Exhibit D, which is hereby incorporated herein by reference, shall be excluded from the boundary of the CHCRA:\n1)                     Airport Drive\n2)                     Brewers District\n3)                     Downtown\n4)                     Easton Square Place\n5)    Hamilton-161\n65) Hickory Ridge\n76) Jeffrey Residential\n87) Leonard/Taylor\n98) Norton-Crosswind\n109) Old State Road\n1110) Rickenbacker, except for where the territory of the Far South CRA overlaps the Rickenbacker CRA and except for the territory of the Rickenbacker CRA east of Parsons Avenue and south of Williams Road\n1211) Roberts Road\n1312) Short North\n1413) Southside Investment District, except for parcel 010-035183-00, the public right-of-way on South Wall Street bounded by West Morrill Avenue to the north and West Hinman Avenue to the south, and for where the territory of the Far South CRA overlaps the Southside Investment District;\n1514) Stelzer-Stygler\n1615) Wilson Road (Commercial)\n1716) Worthington Galena\n1817) Worthington Industries\n \n(d)                     The following currently existing tax increment financing areas (“TIFs”), as defined by Exhibit E, which is hereby incorporated herein by reference, shall be excluded from the boundary of the CHCRA:\n1)                     3rd Ave. and Olentangy River Road TIF except for where the territory of the Fifth by Northwest CRA overlaps the 3rd Ave. and Olentangy River Road TIF;\n2)                     Easton TIF;\n3)                     Innovation District TIF;\n4)                     New Easton TIF;\n5)                     Polaris TIF;\n6)                     Polaris II TIF;\n7)                     Polaris III TIF;\n8)                     Riverside Methodist Hospital OhioHealth TIF;\n9)                     University TIF;\n \n(e)                     Inclusion of Specific Parcels and Areas Within the CHCRA Boundary. For the avoidance of doubt, the following areas are expressly included within the boundary of the CHCRA:\n \n(i)                     Williams Road Right-of-Way. The CHCRA boundary includes the public right-of-way on Williams Road bounded by the intersection of Williams Road and South High Street on the west and the intersection of Williams Road and Alum Creek Drive on the east;\n \n(ii)                     Performance Way Right-of-Way. The CHCRA boundary includes the public right-of-way on Performance Way bounded by the terminus of Performance Way on the west and the intersection of Performance Way and Alum Creek Drive on the east;\n \n(iii)                     Frank Refugee Expressway Right-of-Way. The CHCRA boundary includes the public right- of-way on Frank Refugee Expressway bounded by the intersection of Frank Refugee Expressway and Lockbourne Road on the west and the intersection of Frank Refugee Expressway and Alum Creek Drive on the east;\n \n(iv)                     Stygler Road Right-of-Way. The CHCRA boundary includes the public right-of-way on Stygler Road North bounded by the intersection of Stygler Road North and Morse Road on the north and the intersection of Stygler Road and Wendler Boulevard on the south;\n \n(v)                                          Lee Road and Ulry Road Right-of-Way. The CHCRA boundary includes the public right-of- way beginning at the intersection of Lee Road and Central College Road, continuing south along Lee Road to the intersection of Lee Road and Ulry Road, continuing south along Ulry Road to the intersection of Ulry Road and Warner Road;\n(vi)                                          Currently Existing Far South CRA Overlap with Southside Investment District CRA. The CHCRA boundary includes the area of the currently existing Far South CRA that overlaps with the Southside Investment District CRA.\n \n(vii)                                          Currently Existing Far South CRA Overlap with Rickenbacker CRA. The CHCRA boundary includes the area of the currently existing Far South CRA that overlaps with the Rickenbacker CRA as well as the area of the Rickenbacker CRA east of Parsons Avenue and south of Williams Road.\n \n(viii)                     Currently Existing Fifth by Northwest CRA Overlap with 3rd Ave. and Olentangy TIF. The CHCRA boundary includes the area of the currently existing Fifth by Northwest CRA that overlaps with the 3rd Ave. and Olentangy TIF.\n \n \n(f)                     Effect of Combining Parcels. In the event that an owner of a parcel combines a parcel within the CHCRA with an adjoining parcel(s) outside the CHCRA, the resultant combined parcel shall be deemed to be within the CHCRA only if: (1) the parcel that was within the CHCRA prior to the parcel combination constitutes at least fifty percent of the total parcel area of the combined parcel; (2) the parcels were combined into a parcel included in the CHCRA at the time of this ordinance; and (3) the parcel(s) that were combined with the parcel inside of the CHCRA are all contiguous with and adjacent to the parcel within the CHCRA.\n \n(g)                     Ordinance Limited to Residential Parcels. Only properties that are residentially zoned pursuant to the Columbus City Codes or parcels for which a variance permitting residential use has been granted will be eligible for exemptions under the CHCRA as established by this Ordinance. For purposes of ORC Sections 3735.65 to 3735.70, rental housing, including without limitation rental housing located in a structure containing multiple residential housing units, is classified as residential.\n \n(h)                     Non-contiguous Areas. Any and all portions within the City of Columbus corporate boundary that are rendered non-contiguous per the above boundary descriptions and/or existing tax incentive district boundaries not impacted by this ordinance shall not be included within the boundary of the CHCRA.\nSection 4. That all CRA Agreements or projects that have an executed agreement or memorandum approved by City Council, entered into by the City and Project Sponsors authorizing a tax exemption for a Development Project located in one of the Absorbed CRAs identified in Section 3 above, prior to the effective date of this Ordinance, will continue in full force and effect pursuant to the terms and conditions of those agreements.\nSection 5. That the following CRAs are hereby dissolved and the ordinance(s) establishing said CRAs and adjusting the boundaries of said CRAs, as described in Exhibit C, are hereby repealed. Exhibit C is incorporated herein by reference.\n1)  161;\n2)                     AC Humko;\n3)                     Brewers Yard;\n4)                     Brookwood;\n5)                     Cassady/I-670;\n6)                     Cleveland Avenue;\n7)                     Crosswoods;\n8)                     Far East;\n9)                     Far South;\n10)                     Far West Broad;\n11)                     Fifth by Northwest;\n12)                     Franklinton / Area G;\n13)                     Front Street/West Street;\n14)                     Gibbard Avenue;\n15)                     Grandview Crossing;\n16)                     High and Second;\n17)                     Hilltop / Area D;\n18)                     Hubbard and High;\n19)                     Jeffrey Square;\n20)                     Kenny and Henderson;\n21)                     Linden / Area A;\n22)                     Livingston and James;\n23)                     Milo Grogan;\n24)                     Nazarene;\n25)                     Near East;\n26)                     North Central;\n27)                     Northeast;\n28)                     Northland;\n29)                     Oak Street;\n30)                     Petzinger Road;\n31)                     Quarry;\n32)                     Riverside;\n33)                     South of Main / Area E;\n34)                     Southeast;\n35)                     Southside / Area C;\n36)                     Weinland Park / Area F;\n37)                     West Scioto;\n38)                     Wilson Road (Residential)\nSection 6.\nThat in the event that an owner of a parcel within the CHCRA combines a parcel within a given census tract with an adjoining parcel(s) in an adjoining census tract, the resultant combined parcel shall be deemed to be within said given census tract only if: (1) the parcel that was within the given census tract prior to the parcel combination constitutes at least fifty percent of the total parcel area of the combined parcel; (2) the parcels were combined into a parcel included in the CHCRA at the time of this ordinance;\nand (3) the parcel(s) that were combined with the parcel inside the given census tract are all contiguous with and adjacent to the parcel within the CHCRA.\nOnly properties that are residentially zoned pursuant to the Columbus City Codes or parcels for which a variance permitting residential use has been granted will be eligible for exemptions under this program. For purposes of ORC Sections 3735.65 to 3735.70, rental housing, including without limitation rental housing located in a structure containing multiple residential housing units, is classified as residential.\nSection 7. That a tax exemption on the increase in the assessed valuation of the Property resulting from improvements as described herein, shall be granted upon proper application by the Project Sponsor, which application must be filed with the Housing Officer no later than two years after construction completion, and certification thereof by the designated Housing Officer for the following periods:\nFor a Development Project involving the remodeling of a structure, or construction of a new structure, containing not more than three (3) family units:\nOne hundred percent (100%) for fifteen (15) years for Affordable Housing Units (as t h a t t e r m i s defined in CCC Section 4565.02) in areas designated Ready for Revitalization Areas or Market Ready Areas, subject to and contingent upon the owner of the structure and the City entering into a written agreement as described in CCC Section 4565.05, 4565.07, or 4565.08. The abatement is revocable upon the First Owner (as the term is defined in CCC Section 4565.02) transferring title to the structure to a third party following the First Owner’s initial occupancy.\nOne hundred percent (100%) for fifteen (15) years in areas designated Ready for Opportunity Areas. As described in CCC Section 4565.09, a written agreement is not required for Ready for Opportunity Areas.\nFor a Development Project involving the remodeling of a structure, or construction of a new structure, containing four (4) or more housing units:\nOne hundred percent (100%) for fifteen (15) years in areas designated Ready for Opportunity Areas, Ready for Revitalization Areas or Market Ready Areas, subject to and contingent upon the owner of the structure and the City entering into a written agreement as described in CCC Section 4565.05, 4565.07, 4565.08, or 4565.09.\nDesignation of census tracts within the CHCRA as a Ready for Opportunity Area, a Ready for Revitalization Area, or a Market Ready Area shall be made by the City’s Director of the Department of Development pursuant to CCC Section 4565.03.\nThe CRA tax exemptions provided for herein shall further be governed by the terms and conditions contained in Chapter 4565 of the CCC, including any amendments thereto, as well as the requirements contained in Sections 3735.65 to 3735.70 of the ORC, including the minimum investment requirements set forth therein. For a remodeling Development Project, including one with multiple structures, the cost of remodeling of any structure containing not more than two (2) family units must be at least two thousand five hundred dollars ($2,500.00) or twenty percent (20%) of the assessed value of the structure, whichever is more. For a remodeling Development Project, including one with multiple structures, the cost of remodeling any structure containing more than two (2) family units must be at least five thousand dollars ($5,000.00) or twenty percent (20%) of the assessed value of the structure, whichever is more.\nSection 8. That Development Project applications that have all necessary building permits issued (as defined in Director’s Rules) following the date of State certification of the CHCRA must use the Area Designation of the census tract that the Development Project’s parcel(s) are located in; however, for Development Project applications that have all necessary building permits issued (as defined in Director’s Rules) prior to or on December 31, 2024, the Project Sponsor may request that their Development Project be instead assigned the Area Designation of the Post-1994 CRA that existed on the Development Project’s parcel(s) prior to State certification of the CHCRA, at the City’s Director of the Department of Development’s discretion.\nSection 9. That a pre-application may be required to ensure program eligibility as well as the compatibility with neighborhood plans and to ensure the maintenance of existing streetscape lines, style, scale setbacks, and landscaping features compatible with the neighborhood.\nSection 10. That, for purposes of this Ordinance and Sections 3735.65 through 3735.70, inclusive, of the ORC, a multiple unit structure is hereby deemed to be a “residential” structure. The term “multiple unit” shall mean a new structure or remodeling incorporating both residential and commercial uses, provided, however, that only those portions of the newly constructed structure or remodeling that are used for residential purposes will qualify for the abatement under this Ordinance. The entire new or remodeled structure does not need to be abated or qualify for abatement in order for the abatement to apply to the qualifying portions of the structure. Abatements may be claimed for, and will only apply to, portions of a structure meeting the required criteria.\nSection 11. That it is declared to be the controlling legislative intent that if any provisions of the Ordinance are held to be invalid, the remaining provisions and the application of such provision to any person or circumstances other than those to which it is held invalid shall not be affected thereby.\nSection 12. That the CRA Housing Council formed by City Council by the passage of Ordinance No. 2412- 2003 on November 10, 2003, and any subsequent amendments thereto, including re-appointments and new appointments of members as authorized by that legislation, is appointed as the CRA Housing Council for the CHCRA to fulfill the duties required by ORC. Section 3735.69.\nSection 13. That the City Clerk is directed to cause notice of the passage of this Ordinance to be published in a newspaper of general circulation in the City once a week for two consecutive weeks immediately following its passage, as required by Section 3735.66 of the ORC.\nSection 14. That to administer and implement the provisions of this Ordinance, the City’s Housing Administrator is designated as the Housing Officer as described in Sections 3735.65 through 3735.70 of the ORC.\nSection 15. That, under ORC Section 3735.66, the CRA Housing Council shall make an annual inspection of the properties within the CHCRA for which an exemption has been granted, and shall hear appeals as required by ORC 3735.70.\nSection 16. That upon adoption of this Ordinance, the City’s Director of the Department of Development shall send one copy of the Ordinance and a map of the CHCRA in sufficient detail to denote the specific boundaries of the area, to the State Director of Development.\nSection 17. That this City Council further authorizes and directs the Mayor, the Clerk of Council, the City’s Director of the Department of Development and/or other appropriate officers of the City, to prepare and sign all agreements and documents and to take any other actions as may be appropriate or necessary to implement this Ordinance.\nSection 18. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 97,
    "meeting_date": "2023-12-11",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Appointments",
      "Budget & Finance",
      "Economic Development"
    ]
  }
}