{
  "success": true,
  "vote": {
    "id": 8227,
    "item_number": "4",
    "title": "To Celebrate the Work of Shellee Fisher and Recognize her Contributions to the City of Columbus",
    "description": "Title\nTo Celebrate the Work of Shellee Fisher and Recognize her Contributions to the City of Columbus\n \nBody\nWHEREAS, Shellee Fisher is the Owner and Lead Photographer of Shellee Fisher Photography & Design, a company she founded in January 2008; and,\n \nWHEREAS, her work is known to capture the essence of a situation, the emotions of people, and telling the story, with an emphasis on documenting activities and their relationships to the environment; and,\n \nWHEREAS, her clientele includes the City of Columbus, Huntington Bank, L Brands, Cardinal Health, Macy’s, Nationwide Insurance, The Ohio State University, PNC Bank, among many more; and,\n \nWHEREAS, Shellee Fisher Photography & Design is certified as a Minority Business Enterprise with the Ohio Minority Supplier Development Council, State of Ohio, City of Columbus, and certified as Woman Business Enterprise certified by the Women’s Business Enterprise National Council; and,\n \nWHEREAS, Shellee Fisher Photography & Design has been recognized numerous times for its stellar work, including being named as a 2017 Small Business Administration’s Home-Based Business of the Year and as a 2016 Women Business Enterprise Supplier of the Year by the Ohio River Valley Women Business Council; and, \n \nWHEREAS, Shellee Fisher’s work has deeply impacted the City of Columbus, having provided many services to the City in the past, each at high caliber of quality; now therefore,\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: That this Council hereby celebrates the work of Shellee Fisher and expresses its gratitude for the services she has provided in the past;\n \nBE IT FURTHER RESOLVED THAT: This Council does hereby extends its deepest well-wishes to Shellee Fisher as she embarks on a new chapter in her life.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 97,
    "meeting_date": "2023-12-11",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}