{
  "success": true,
  "vote": {
    "id": 8232,
    "item_number": "CA-4",
    "title": "To amend Ordinance 2117-2005, as previously amended by Ordinances 0715-2009, 2258-2014, 3123-2016, and 2791-2020 (collectively, the “TIF Ordinance”) and to amend Ordinance 2791-2020, to include any parcel for which more than half of its territory is within the boundary of the Preserve, Dublin-Granville North, and Dublin-Granville East TIFs as set forth in either the TIF Ordinance or Ordinance 2791-2020 to now be wholly included within those respective TIFs and be eligible to be exempt pursuant to the TIF Ordinance or Ordinance 2791-2020; to declare the improvements on the additional territory to the Preserve, Dublin-Granville North, and Dublin-Granville East TIFs parcels to be a public purpose and exempt from real property taxation; to require the owners of the improvements of those TIFs parcels to make service payments in lieu of taxes; to require the distribution of the applicable portion of those service payments to the Columbus City School District, the New Albany Plain Local School District, and the Eastland-Fairfield Career & Technical Schools; and to deposit the remainder of those service payments into the applicable City TIF funds.",
    "description": "Explanation\n \nBackground: \nCity Council by Ordinance 2117-2005 created ten tax increment financing (TIF) incentive districts in NE Columbus pursuant to Ohio Revised Code Section 5709.40(C) including the “Preserve TIF,” “Dublin-Granville South TIF,” and “Dublin-Granville North TIF”. Ordinance 2117-2005 has since been amended for various reasons by Ordinances 0715-2009, 2258-2014, 3123-2016, and 2791-2020 (collectively, the “TIF Ordinance”). Ordinance 2791-2020 (the “New TIF Ordinance”) amended the TIF Ordinance and the Dublin-Granville South and North TIF incentive districts in order to remove parcels from them to combine with other parcels to establish a new separate tax increment financing area pursuant to Ohio Revised Code Section 5709.40(B)  (the “Dublin-Granville East TIF”). The service payments in lieu of taxes from the Preserve TIF, Dublin-Granville South TIF, Dublin-Granville North TIF, and the Dublin-Granville East TIF are pledged under the Amended and Restated Tax Increment Financing & Reimbursement Agreement dated February 28, 2022 between Hamilton Crossing LLC (the “Developer”) and the City, as authorized by Ordinance 1421-2021. \n \nThe Developer has requested the City to amend the boundaries of the Preserve, Dublin-Granville North, and the Dublin-Granville East TIFs in order to fully enclose certain parcels wholly within those TIFs. Due to subsequent parcel combinations after the adoption of the TIF Ordinance and the New TIF Ordinance, Franklin County Tax Parcels 010-274689, 010-247888, and 010-220083 are currently split so a majority of each parcel is within a TIF and a lesser amount is not within any TIF. In addition to causing less revenue to be made available to the City’s TIF, these parcels split between TIFs also create an administrative burden for the Franklin County, Ohio Auditor’s Office. This Ordinance will amend the TIF Ordinance and the New TIF Ordinance and any of their exhibits to adjust the boundaries of the Preserve, Dublin-Granville North, and Dublin-Granville East TIFs to include any parcel for which more than half of its territory is within the boundary of these TIFs as set forth in the TIF Ordinance or the New TIF Ordinance to now be included wholly within those respective TIFs and be eligible to be exempt pursuant to the TIF Ordinance or the New TIF Ordinance, including without limitation, Franklin County Tax Parcels 010-274689, 010-247888, and 010-220083.\n \nFiscal Impact: No funding is required for this legislation. The City is foregoing real property tax revenue that it would have received from the improvements on the new territory added to the Preserve, Dublin-Granville North, and Dublin-Granville East TIFs. Instead, the non-school portion of the new TIF revenue will be diverted to its respective TIF fund.\n \n \nTitle\n \nTo amend Ordinance 2117-2005, as previously amended by Ordinances 0715-2009, 2258-2014, 3123-2016, and 2791-2020 (collectively, the “TIF Ordinance”) and to amend Ordinance 2791-2020, to include any parcel for which more than half of its territory is within the boundary of the Preserve, Dublin-Granville North, and Dublin-Granville East TIFs as set forth in either the TIF Ordinance or Ordinance 2791-2020 to now be wholly included within those respective TIFs and be eligible to be exempt pursuant to the TIF Ordinance or Ordinance 2791-2020; to declare the improvements on the additional territory to the Preserve, Dublin-Granville North, and Dublin-Granville East TIFs parcels to be a public purpose and exempt from real property taxation; to require the owners of the improvements of those TIFs parcels to make service payments in lieu of taxes; to require the distribution of the applicable portion of those service payments to the Columbus City School District, the New Albany Plain Local School District, and the Eastland-Fairfield Career & Technical Schools; and to deposit the remainder of those service payments into the applicable City TIF funds. \n \nBody\n \nWHEREAS, pursuant to Ordinance 2117-2005, as amended by Ordinances 0715-2009, 2258-2014, 3123-2016, and 2791-2020 (collectively the “TIF Ordinance”), City Council created the “Preserve,” “Dublin-Granville North,” and “Dublin-Granville South” TIF incentive districts among ten total TIF incentive districts in NE Columbus by means of Section 5709.40(C) of the Ohio Revised Code; and \n \nWHEREAS, City Council passed Ordinance 2791-2020 (the “New TIF Ordinance”), which in addition to amending the TIF Ordinance, established a new TIF pursuant to Section 5709.40(B) of the Ohio Revised Code from parcels removed from the Dublin-Granville North and South TIFs plus other parcels (the new TIF being, the “Dublin-Granville East TIF”); and\n \nWHEREAS, City Council, by its Ordinance 1421-2021, authorized the Director of the Department of Development to enter into the Amended and Restated Tax Increment Financing & Reimbursement Agreement with Hamilton Crossing LLC (the “Developer”), which provides for the reimbursement of costs of public infrastructure improvements using the revenue from these four aforesaid TIFs; and\n \nWHEREAS, the Developer has requested the City adjust the boundaries of the Preserve, Dublin-Granville North, and Dublin-Granville East TIFs in order to wholly capture certain parcels within these TIFs that are currently split by the boundaries of these TIFs due to parcel combinations that have occurred since the passage of the TIF Ordinance and the New TIF Ordinance (the “Additional Territory”; and\n \nWHEREAS, the Additional Territory does not generate revenue for the TIF and also creates an administrative burden for the Franklin County, Ohio Auditor’s Office; and \n \nWHEREAS, in accordance with the TIF Ordinance or the New TIF Ordinance, the City has determined that an applicable portion of the service payments in lieu of taxes generated from the Additional Territory shall be paid directly to the Columbus City School District, the New Albany Plain Local School District, and the Eastland-Fairfield Career & Technical Schools (the “School Districts”) in an amount equal to the real property taxes that the School Districts would have been paid if the improvement to the Additional Territory located within the School Districts had not been exempt from taxation pursuant to this Ordinance, the TIF Ordinance, or the New TIF Ordinance; and\n \nWHEREAS, the City will simultaneously direct and require the current and future owners of each improvement of the Additional Territory to make annual service payments in lieu of taxes in the same amount as they would have made real property tax payments except for the TIF exemption provided by this Ordinance, the TIF Ordinance, or the New TIF Ordinance; and\n \nWHEREAS, it is in the best interest of the City to clarify the boundaries of the Preserve, Dublin-Granville North, and Dublin-Granville East TIFs to exempt from taxation one hundred percent of the improvements on the Additional Territory to each parcel of the Preserve, Dublin-Granville North, and Dublin-Granville East TIFs that was included in either the TIF Ordinance or the New TIF Ordinance for the remainder of each of those respective exemption terms; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     TIF Amendments. That this Council finds and determines that the applicable parts of Exhibit A to the Original TIF Ordinance for the Preserve and Dublin-Granville North TIFs, as may have been previously amended by this Council, and Exhibit A to the New TIF Ordinance for the Dublin-Granville East TIF, are hereby repealed and replaced with Exhibit A attached hereto to add Additional Territory to those TIFs from parcels partially within those TIFs but not fully enclosed by them.\n \nSECTION 2:                     Preserve TIF. That in order to clarify the boundaries of the Preserve TIF, any parcels for which more than half of its territory is within the boundary of the parcels as set forth in the TIF Ordinance shall be included in the Preserve TIF and eligible to be exempt pursuant to the TIF Ordinance, including, without limitation, tax parcel number 010-274689.\n \nSECTION 3.                     Dublin-Granville North TIF. That in order to clarify the boundaries of the Dublin-Granville North TIF, any parcels for which more than half of its territory is within the boundary of the parcels as set forth in the TIF Ordinance shall be included in the Dublin-Granville North TIF and eligible to be exempt pursuant to the TIF Ordinance, including, without limitation, tax parcel number 010-247888.\n \nSECTION 4.                     Dublin-Granville East TIF. That in order to clarify the boundaries of the Dublin-Granville East TIF, any parcels for which more than half of its territory is within the boundary of the parcels as set forth in the New TIF Ordinance shall be included in the Dublin-Granville East TIF and eligible to be exempt pursuant to the New TIF Ordinance, including, without limitation, tax parcel number 010-220083.\n \nSECTION 5.                     No Other Modifications. That except as provided herein, all other provisions of the TIF Ordinance and the New TIF Ordinance shall remain in full force and effect. It is the intent of City Council that the TIF Ordinance and this Ordinance as well as the New TIF Ordinance and this Ordinance each be separately construed together as single instruments. \n \nSECTION 6.                     Further Authorizations. That this Council ratifies the delivery of the notice of this Ordinance to the School Districts pursuant to Section 5709.40 and Section 5709.83 of the Ohio Revised Code; hereby authorizes and directs the Director of the Department of Development, the City Clerk, or other appropriate officers of the City or their designees to deliver a copy of this Ordinance and status reports to the Ohio Department of Development pursuant to Section 5709.40(I) of the Ohio Revised Code; to make such arrangements as are necessary and proper for the collection of the service payments in lieu of taxes from the Additional Territory added to each TIF; and further authorizes those same officials of the City and their designees to execute such other agreements and instruments and to take all actions necessary to implement this Ordinance.\n \nSECTION 7.                     Effective Date. That this Ordinance shall tax effect and be in force from and after the earliest date permitted by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 97,
    "meeting_date": "2023-12-11",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Economic Development",
      "Property & Real Estate"
    ]
  }
}