{
  "success": true,
  "vote": {
    "id": 8233,
    "item_number": "CA-5",
    "title": "To amend Ordinance No. 1447-2020, as amended by Ordinance No. 2563-2020, to add certain parcels of real property to the Rickenbacker-317 TIF; to declare the nonresidential improvements to those new TIF parcels added by this Ordinance to be a public purpose and 100% exempt from real property taxation for the same 30-year period as the existing parcels; to require the owners of those new parcels to make service payments in lieu of taxes; to require the distribution of the applicable portion of those service payments to the school district(s); and to deposit the remainder of those service payments in the Rickenbacker-317 TIF Fund for public infrastructure improvements.",
    "description": "Explanation\n \nBACKGROUND: Pursuant to the Economic Development Agreement (the “EDA”) with 1489 Rohr Holding LLC (the “Developer”), City Council, by its passage of Ordinance No. 1447-2020 (the “Original TIF Ordinance”), created the Rickenbacker-317 TIF in accordance with Section 5709.40(B) of the Ohio Revised Code encompassing the Developer’s parcels (the “Site”) and additional industrial parcels adjacent to the south then being developed (the “Original Off-Site Parcels”). Pursuant to the EDA, the City and Developer agreed to use service payment in lieu of taxes from the Site to finance some of the public infrastructure improvements required in Ordinance No. 3084-2019 rezoning the Site. City Council expanded the Rickenbacker-317 TIF by its passage of Ordinance No. 2563-2020 (the “2020 Expansion TIF Ordinance”) to include additional industrial developments that were approved after the Original TIF Ordinance (the “New Off-Site Parcels”). In the EDA and subsequent TIF agreements authorized by Ordinance Nos. 1460-2020 and 1664-2022, the City reserved the right to use the service payment in lieu of taxes from the Original Off-Site Parcels and the New Off-Site Parcels to finance additional public infrastructure improvements allowed by the Original TIF Ordinance that benefit the Rickenbacker-317 TIF parcels including without limitation for proactive industrial development. Since the passage of the 2020 Expansion TIF Ordinance, more new industrial developments have commenced on parcels south of State Route 317 adjacent to the Rickenbacker-317 TIF (the “2023 Off-Site Parcels”).\n \nThis Ordinance will amend the Original TIF Ordinance, as amended by the 2020 Expansion TIF Ordinance, to again expand the Rickenbacker-317 TIF to include the 2023 Off-Site Parcels and provide for a 100% exemption from real property taxation on all nonresidential improvements on the 2023 Off-Site Parcels for a period of not more than thirty (30) years coinciding with the term of the Site, Original Off-Site Parcels and New Off-Site Parcels in the Rickenbacker-317 TIF. The Columbus City School District will receive, in the same manner as usual, all amounts that they would have received in real property taxes had the exemption not been granted to the 2023 Off-Site Parcels. Annual service payments in lieu of taxes will be made with respect to new nonresidential improvements on the 2023 Off-Site Parcels. The applicable portion of those service payments will be distributed directly to the Columbus City School District with the remaining non-school portion of those service payments paid to the City for deposit into the existing TIF fund established by the Original TIF Ordinance to be used for public infrastructure improvements.\n \nFISCAL IMPACT: No funding is required for this legislation. The City is foregoing real property tax revenue that it would have received from improvements on the parcels being added by this Ordinance to the Rickenbacker-317 TIF. Instead, the non-school portion of that revenue will be diverted to the Rickenbacker-317 TIF Fund to be used for public infrastructure improvements benefiting the Rickenbacker-317 TIF parcels.\n \n \nTitle\n \nTo amend Ordinance No. 1447-2020, as amended by Ordinance No. 2563-2020, to add certain parcels of real property to the Rickenbacker-317 TIF; to declare the nonresidential improvements to those new TIF parcels added by this Ordinance to be a public purpose and 100% exempt from real property taxation for the same 30-year period as the existing parcels; to require the owners of those new parcels to make service payments in lieu of taxes; to require the distribution of the applicable portion of those service payments to the school district(s); and to deposit the remainder of those service payments in the Rickenbacker-317 TIF Fund for public infrastructure improvements. \n \n \n \nBody\n \nWHEREAS, Sections 5709.40(B), 5709.42 and 5709.43 of the Ohio Revised Code (collectively, the “TIF Statutes”) authorize the legislative authority of a municipal corporation, by ordinance, to: (i) declare the improvement to certain parcels of real property located within the municipal corporation to be a public purpose and exempt from taxation, (ii) require the owner of each parcel to make service payments in lieu of taxes, (iii) provide for the distribution of the applicable portion of such service payments to the joint vocational, city, local or exempted village school district, (iv) establish a municipal public improvement tax increment equivalent fund for the deposit of the remainder of such service payments, and (v) specify public infrastructure improvements made, to be made or in the process of being made that directly benefit, or that once made will directly benefit, those parcels; and\n \nWHEREAS, pursuant to Ordinance No. 1443-2020, the City executed with 1489 Rohr Holding LLC (the “Developer”) an Economic Development Agreement dated July 30, 2020 (the “EDA”) stating the parties’ desire to create a TIF for the Developer’s parcels (the “Site”) and additional industrial parcels to the south of the Site under construction (the “Original Off-Site Parcels”); and \n \nWHEREAS, by Ordinance No. 1447-2020 (the “Original TIF Ordinance”), this Council created the “Rickenbacker-317 TIF” in accordance with the TIF Statutes encompassing the Site and the Original Off-Site Parcels; and\n \nWHEREAS, after the passage of the Original TIF Ordinance, the Department of Development negotiated with other developers to bring more new industrial projects to the area around the Rickenbacker-317 TIF (the “New Off-Site Parcels”), so Council subsequently authorized adding the New Off-Site Parcels to the Rickenbacker-317 TIF by passage of Ordinance No. 2563-2020 (the “2020 Expansion TIF Ordinance”); and\n \nWHEREAS, pursuant to the EDA and subsequent TIF agreements authorized by Ordinance Nos. 1460-2020 and 1664-2022, the City and Developer agreed to use service payment in lieu of taxes from the Site to finance some of the public infrastructure improvements required by Ordinance No. 3084-2019 rezoning the Site; and \n \nWHEREAS, under those agreements, the City reserved the right to use the service payment in lieu of taxes from the Off-Site Parcels and the New Off-Site Parcels to finance public infrastructure improvements allowed in the Original TIF Ordinance that directly benefit the Rickenbacker-317 TIF parcels; and\n \nWHEREAS, in order to more quickly finance public infrastructure improvements in and around the Rickenbacker-317 TIF area, including without limitation for proactive industrial development, the Department of Development desires to again expand the Rickenbacker-317 TIF, pursuant to the TIF Statutes, to include without limitation the parcels of real property identified and depicted on Exhibit A attached hereto (with each existing or future parcel(s) added by this Ordinance referred to herein collectively as the “2023 Off-Site Parcels, and together with the Original Off-Site Parcels and the New Off-Site Parcels, referred to individually as a “Parcel” and collectively as the “Parcels” for purposes of the Original TIF Ordinance); and \n \nWHEREAS, this Ordinance again expands the Rickenbacker-317 TIF  and provides for a 100% exemption from real property taxation on all nonresidential improvements on the 2023 Off-Site Parcels for a period of not more than thirty (30) years coinciding with the same exemption term of the Site, Off-Site Parcels, and New Off-Site Parcels in the Rickenbacker-317 TIF; and\n \nWHEREAS, the City has determined that a portion of the service payments, as applicable, shall be paid directly to the Columbus City School District, Hamilton Local School District, and the Eastland-Fairfield Career and Technical Schools (the \"School Districts\") in an amount equal to the real property taxes that the school district would have been paid if the nonresidential improvements to the 2023 Off-Site Parcels located within the School Districts had not been exempt from taxation; and\n \nWHEREAS, the remaining non-school portion of those service payments from the 2023 Off-Site Parcels will be paid to the City for deposit into the Rickenbacker-317 TIF Fund established in the Original TIF Ordinance to be used to fund public infrastructure improvements directly benefiting the Parcels; and\n \nWHEREAS, notice of this proposed Ordinance has been delivered to the Boards of Education of the School Districts in accordance with and within the time periods prescribed in Sections 5709.40 and 5709.83 of the Ohio Revised Code; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.      TIF Amendments. That Amended Exhibit A of the 2020 Expansion TIF Ordinance is hereby repealed and replaced with Exhibit A, attached hereto, to supplement the Parcels on Amended Exhibit A to include the 2023 Off-Site Parcels in the Rickenbacker-317 TIF as set forth in this Exhibit A. \n \nSECTION 2.                     Parcels of the Rickenbacker-317 TIF.  That the Parcels, as defined in the Original TIF Ordinance and the 2020 Expansion TIF Ordinance and set forth in each prior Exhibit A, are hereby supplemented to include the 2023 Off-Site Parcels as set forth in this Exhibit A; the Site, Original Off-Site Parcels, New Off-Site Parcels, and 2023 Off-Site Parcels shall each be considered a Parcel and included in the Parcels for all purposes of the Original TIF Ordinance, as amended hereby.\n \nSECTION 3.                     2023 Off-Site Parcels Exemption Term.  That the exemption period for one-hundred percent (100%) of the Improvement, as defined in the Original  TIF Ordinance, to those 2023 Off-Site Parcels commences and ends on the same term as the Parcels, all in accordance with the requirements of the Original TIF Ordinance, the 2020 Expansion TIF Ordinance, and the TIF Statutes. \n \nSECTION 4.                     Subordination.  That the TIF exemption granted herein and by the Original TIF Ordinance to the 2023 Off-Site Parcels and the payment obligations established pursuant to the Original TIF Ordinance and this Ordinance are subject and subordinate to any tax exemption applicable to the 2023 Off-Site Parcels pursuant to Section 140.08 or Sections 5709.12 and 5709.121 or under Sections 3735.65 through 3735.70 or 5709.61 through 5709.69 of the Ohio Revised Code.\n \nSECTION 5.                     School Districts.  That, pursuant to the TIF Statutes, the County Treasurer is requested to distribute the applicable service payments and property tax rollback payments to the School Districts in an amount equal to the amount each would otherwise receive as real property tax payments (including the applicable portion of any property tax rollback payments) derived from the Improvement to each Parcel if the Improvement had not been exempt from taxation pursuant to the Original TIF Ordinance, the 2020 Expansion TIF Ordinance, and this Ordinance. \n \nSECTION 6.                     No Other Modifications. That, except as provided herein, all provisions of the Original TIF Ordinance and the 2020 Expansion TIF Ordinance shall remain in full force and effect; it is the intent of City Council that the Original TIF Ordinance, the 2020 Expansion TIF Ordinance, and this Ordinance be construed together as a single instrument.    \n \nSECTION 7.      Further Authorizations.  That this Council ratifies the delivery of the notice of this Ordinance to the School Districts pursuant to Section 5709.40 and Section 5709.83 of the Ohio Revised Code; authorizes and directs the Director of the Department of Development, the City Clerk, and/or other appropriate officers of the City or their designees to deliver a copy of this Ordinance and status reports to the Ohio Department of Development pursuant to Section 5709.40(I) of the Ohio Revised Code; to make such arrangements as are necessary and proper for the collection of the service payments in lieu of taxes from the 2023 Off-Site Parcels; and further authorizes those same officials of the City and their designees to execute such other agreements and instruments and to take all actions necessary to implement this Ordinance.\n \nSECTION 8.                     Effective Date.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 97,
    "meeting_date": "2023-12-11",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Economic Development",
      "Housing"
    ]
  }
}