{
  "success": true,
  "vote": {
    "id": 8237,
    "item_number": "CA-9",
    "title": "To amend Ordinance No. 1237-2015, as previously amended by Ordinance No. 3168-2019, to remove and add certain parcels of real property to the Old Dublin Road TIF; to declare the nonresidential improvements to the 2023 additional parcels added herein to be a public purpose and exempt from real property taxation for a separate exemption period from the 2015 and 2019 Old Dublin Road parcels exemption periods; to require the owner(s) of the 2023 additional parcels added herein to make service payments in lieu of taxes; to require the distribution of the applicable portion of those service payments to the school districts; and to deposit the remainder of those service payments into the Old Dublin Road TIF Fund for public infrastructure improvements.",
    "description": "Explanation\n \nBACKGROUND: City Council created the Old Dublin Road TIF near the northwest intersection of Old Dublin Road and Trabue Road pursuant to Section 5709.40(B) of the Ohio Revised Code by its passage of Ordinance No. 1237-2015 on June 9, 2015.  In order to fund additional public infrastructure improvements in and around the West Scioto Area Commission, City Council expanded the Old Dublin Road TIF area pursuant to Section 5709.40(B) of the Ohio Revised Code by its passage of Ordinance No. 3168-2019 on December 16, 2019. In order to fund additional public infrastructure improvements benefiting proactive industrial development in and around the former Buckeye Yard intermodal railroad terminal, the Department of Development is proposing a second expansion of the Old Dublin Road TIF area pursuant to Section 5709.40(B) of the Ohio Revised Code. \n \nThis Ordinance expands the Old Dublin Road TIF for a second time and provides for a 100% exemption from real property taxation on all nonresidential development on the additional TIF parcels for a separate period of not more than thirty (30) years. The TIF money will be used to finance land acquisition in aid of industry, commerce, distribution, or research, utility lines, traffic improvements, and other public infrastructure improvements needed in the Old Dublin Road TIF area.  The Columbus City School District, South Western City School District, Hilliard City School District, and Tolles Career & Technical School District (collectively the “School Districts”) will receive, in the same manner as usual, all amounts that they would have received in real property taxes had the exemption not been granted. Annual service payments in lieu of taxes will be made with respect to new nonresidential development on each TIF parcel in the 2023 expansion area. The applicable portion of those service payments will be distributed directly to the School Districts, with the remaining non-school portion of those service payments paid to the City for deposit into the existing TIF fund established in Ordinance No. 1237-2015 to be used to fund public improvements benefiting the Old Dublin Road TIF parcels. This Ordinance will also remove certain parcels and areas from the 2019 expansion of the Old Dublin Road TIF.\n \nFISCAL IMPACT: No funding is required for this legislation. The City is foregoing real property tax revenue that it would have received with respect to development on the new TIF parcels.  Instead, the non-school portion of that revenue will be diverted to the existing TIF fund to be used for public infrastructure improvements benefiting the TIF parcels.\n \n \nTitle\n \nTo amend Ordinance No. 1237-2015, as previously amended by Ordinance No. 3168-2019, to remove and add certain parcels of real property to the Old Dublin Road TIF; to declare the nonresidential improvements to the 2023 additional parcels added herein to be a public purpose and exempt from real property taxation for a separate exemption period from the 2015 and 2019 Old Dublin Road parcels exemption periods; to require the owner(s) of the 2023 additional parcels added herein to make service payments in lieu of taxes; to require the distribution of the applicable portion of those service payments to the school districts; and to deposit the remainder of those service payments into the Old Dublin Road TIF Fund for public infrastructure improvements. \n \n \n \nBody\n \nWHEREAS, Sections 5709.40(B), 5709.42 and 5709.43 of the Ohio Revised Code (collectively, the “TIF Statutes”) authorize the legislative authority of a municipal corporation, by ordinance, to: (i) declare the improvement to certain parcels of real property located within the municipal corporation to be a public purpose and exempt from taxation, (ii) require the owner of each parcel to make service payments in lieu of taxes, (iii) provide for the distribution of the applicable portion of such service payments to the city, local or exempted village school district and joint vocational school district, (iv) establish a municipal public improvement tax increment equivalent fund for the deposit of the remainder of such service payments, and (v) specify public infrastructure improvements made, to be made or in the process of being made that directly benefit, or that once made will directly benefit, those parcels; and\n \nWHEREAS, by Ordinance No. 1237-2015 passed on June 9, 2015 (the “2015 TIF Ordinance”), this Council created a tax increment financing area pursuant to the TIF Statutes (the “Old Dublin Road TIF”) whereby the City exempted certain parcels near the northwest intersection of Old Dublin Road and Trabue Road (the “2015 Parcels”) identified and depicted in Exhibit A; and\n \nWHEREAS, pursuant to Ordinance No. 3168-2019 passed on December 16, 2019 (the “2019 TIF Ordinance” and together with the 2015 TIF Ordinance and this Ordinance, the “TIF Ordinance”), this Council expanded the Old Dublin Road pursuant to the TIF Statutes to include additional nonresidential parcels within the West Scioto Area Commission (the “2019 Parcels”) identified and depicted in Exhibit A; and\n \nWHEREAS, in order to provide funds for the construction of public infrastructure improvements needed to benefit proactive industrial development in and around the former Buckeye Yard intermodal railroad terminal, the Department of Development has proposed to again expand the Old Dublin Road TIF area; and\n \nWHEREAS, this Ordinance will repeal and replace Exhibit A to the 2015 TIF Ordinance, as amended and supplemented by the 2019 TIF Ordinance, to add the nonresidential parcels of real property identified and depicted in Exhibit A attached hereto (with each current or future parcel(s) of such real property referred to herein individually as the “2023 Parcel,” or collecting the “2023 Parcels,” and together with the 2015 Parcels and 2019 Parcels shall be treated as a “Parcel” and collectively as the “Parcels” for purposes of the TIF Ordinance); and\n \nWHEREAS, the improvements to the 2023 Parcels will be one-hundred percent (100%) exempt from taxation for a new, separate thirty (30) year term from the Parcels of the 2015 TIF Ordinance and 2019 TIF Ordinance, with each group of Parcels under those ordinances on separate 30-year terms as well; and\n \nWHEREAS, the City has determined that the applicable portion of the service payments in lieu of taxes generated from the 2023 Parcels shall be paid directly to Columbus City Schools, South Western City School District, Hilliard City School District, and Tolles Career & Technical Center (the “School Districts”) in an amount equal to the real property taxes that the School Districts would have been paid if the improvement to the 2023 Parcels located within each of the School Districts had not been exempt from taxation; and\n \nWHEREAS, the remaining non-school service payments in lieu of taxes from the 2023 Parcels will be distributed to the City for deposit into the Old Dublin Road TIF Fund to be used for public infrastructure improvements; and\n \nWHEREAS, notice of this Ordinance has been delivered to the Board of Education of the School Districts in accordance with and within the time periods prescribed in Sections 5709.40 and 5709.83 of the Ohio Revised Code; and\n \nWHEREAS, this Ordinance will also remove from the Old Dublin Road TIF certain 2019 Parcels identified and depicted in Exhibit A attached hereto (the “2019 Removed Parcels”) for administrative purposes as they will be ineligible for this TIF exemption or are anticipated to be included in a future TIF exemption; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     TIF Amendments.  Exhibit A to the 2015 TIF Ordinance and Exhibit A to the 2019 TIF Ordinance are hereby repealed and replaced with Exhibit A attached hereto to add the 2023 Parcels to the Old Dublin Road TIF as well as remove the 2019 Removed Parcels from the Old Dublin Road TIF.\n \nSECTION 2.                     Parcels of the Old Dublin Road TIF.  That the Parcels, as defined in the 2015 TIF Ordinance and the 2019 TIF Ordinance and set forth in each prior Exhibit A, are hereby supplemented to include the 2023 Parcels as set forth in this Exhibit A; the 2015 Parcels, 2019 Parcels, and 2023 Parcels shall each be considered a Parcel and included in the Parcels for all purposes of the TIF Ordinance, as amended hereby.\n \nSECTION 3.                     2023 Parcels Exemption Term.  The exemption period for one-hundred percent (100%) of the Improvement, as defined in the 2015 TIF Ordinance, to those 2023 Parcels commences on a separate term (from the separate terms of the Parcels added by the 2015 TIF Ordinance and 2019 TIF Ordinance) with the first tax year that begins after the effective date of this Ordinance and in which an Improvement first appears on the tax list and duplicate of real and public utility property for any of the 2023 Parcels and ends on the earlier of (a) thirty (30) years after such commencement or (b) the date on which the City can no longer require service payments in lieu of taxes, all in accordance with the requirements of the TIF Statutes.  \n \nSECTION 4.                     Subordination.  The TIF exemption granted herein and by the 2015 TIF Ordinance to the 2023 Parcels and the payment obligations established pursuant to the 2015 TIF Ordinance and this Ordinance are subject and subordinate to any tax exemption applicable to the 2023 Parcels pursuant to Section 140.08 or Sections 5709.12 and 5709.121 or under Sections 3735.65 through 3735.70 or 5709.61 through 5709.69 of the Ohio Revised Code.     \n \nSECTION 5.                     School Districts.  Any reference to the School Districts in the 2015 TIF Ordinance and 2019 TIF Ordinance shall hereafter refer to the School Districts, as defined herein. Pursuant to the TIF Statutes, the County Treasurer is requested to distribute the applicable service payments and property tax rollback payments to the School Districts in an amount equal to the amount each would otherwise receive as real property tax payments (including the applicable portion of any property tax rollback payments) derived from the Improvement to each Parcel if the Improvement had not been exempt from taxation pursuant to the TIF Ordinance. \n \nSECTION 6.                     No Other Modifications. Except as provided herein, all provisions of the TIF Ordinance remain in full force and effect; it is the intent of City Council that the 2015 TIF Ordinance, the 2019 TIF Ordinance, and this Ordinance be construed together as a single instrument.    \n \nSECTION 7.      Further Authorizations.  This Council ratifies the delivery of the notice of this Ordinance to the School Districts pursuant to Section 5709.40 and Section 5709.83 of the Ohio Revised Code; authorizes and directs the Director of the Department of Development, the City Clerk, and/or other appropriate officers of the City or their designees to deliver a copy of this Ordinance and status reports to the Ohio Department of Development pursuant to Section 5709.40(I) of the Ohio Revised Code; to make such arrangements as are necessary and proper for the collection of the service payments in lieu of taxes from the 2023 Parcels; and further authorizes those same officials of the City and their designees to execute such other agreements and instruments and to take all actions necessary to implement this Ordinance.\n \nSECTION 8.                     Effective Date.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 97,
    "meeting_date": "2023-12-11",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Economic Development",
      "Housing"
    ]
  }
}