{
  "success": true,
  "vote": {
    "id": 8260,
    "item_number": "CA-32",
    "title": "To authorize and direct the Director of the Department of Neighborhoods to accept a grant from and enter into a grant agreement with Franklin County Department of Job and Family Services in the amount of $185,000.00 to help coordinate efforts for the My Brother’s Keeper (MBK) program; to authorize the appropriation and expenditure of $185,000.00 within the General Governments Grant Fund; to authorize grantees the authority to use funding for food and non-alcoholic beverages as it is integral to the success programming to ensure students have access to nutritional meals, and to declare an emergency. ($185,000.00).",
    "description": "BACKGROUND: This ordinance authorizes the Director of The Department of Neighborhoods to enter into an agreement with Franklin County Department of Job and Family Services to help coordinate efforts for the My Brother’s Keeper (MBK) Village program and to enter to various grant agreements with non-profit agencies. This ordinance authorizes to encumber and expend grant funding for the purchase of food and/or beverage items at various outreach events, which serve the public purpose of young engagement to advance equity an address youth violence. Food and/or beverage purchases will be subject to what is allowable in the respective grant agreements. Costs will not exceed $15 per person and any purchase of alcohol is strictly prohibited.\n \nIn 2014 President Obama called on cities, non-profits, and the private sector to collaborate and close opportunity gaps for boys and young men of color (B&YMOC). Columbus was one of the first cities to answer this call. The city and partner organizations brought together more than 500 B&YMOC to ensure that Columbus’ My Brother’s Keeper (MBK) work was grounded in testimony from the target population. Numerous non-profit service providers, schools, and companies have created programs to serve vulnerable youth of color since the launch of the national MBK initiative. \n \nThe services included in this contract will include food and beverage and cannot be provided by existing city employees because these services are beyond the City’s current responsibility and capacity to provide. \n \nEmergency Action is requested in order to receive the funds as soon as possible to continue My Brother’s Keeper programming.\nFISCAL IMPACT: This ordinance authorizes the acceptance and appropriation and expenditure of $185,000.00 within the General Governments Grant Fund in an agreement with Franklin County Department of Job and Family Services for the financial support of My Brother’s Keeper. \nCONTRACT COMPLIANCE:  \nAlways With Us Charities 018333 and is valid 1/24/2023 - 1/24/2025\nHeart Of JOB Foundation 041659 and is valid 4/27/2022 - 4/27/2024\nICE Mentors Inc. 042295 and is valid 6/28/2022 - 6/28/2024\n \n Title\nTo authorize and direct the Director of the Department of Neighborhoods to accept a grant from and enter into a grant agreement with Franklin County Department of Job and Family Services in the amount of $185,000.00 to help coordinate efforts for the My Brother’s Keeper (MBK) program; to authorize the appropriation and expenditure of $185,000.00 within the General Governments Grant Fund; to authorize grantees the authority to use funding for food and non-alcoholic beverages as it is integral to the success programming to ensure students have access to nutritional meals, and to declare an emergency. ($185,000.00).\nBody\nWHEREAS, Franklin County Department of Job and Family Services has awarded the City of Columbus, Department of Neighborhoods, a grant in the amount of $185,000 to help coordinate efforts for the My Brother’s Keeper Village (MBK) program.\nWHEREAS, Franklin County Department of Job and Family Services will support the MBK Village Job Fair and programmatic evaluation services with financial resources not to exceed $15,000.00; and\nWHEREAS, Franklin County Department of Job and Family Services will offer resource support for the MBK Conference not to exceed $20,000.00 (i.e. share with partners, extend partner support of event(s); and\nWHEREAS, Franklin County Department of Job and Family Services will provide matching funds for the MBK Round 3 grant recipients not to exceed $150,000.00 ($50,000 per grantee) to the Always with Us Charities, Heart of Job Foundation, ICE Mentors; and\nWHEREAS, grant agreements will allow for the purchase of food and/or beverages in order to provide nutrition to students and families who are often food-insecure, increase public participation in MBK outreach events; and \nWHEREAS, it is necessary to authorize and direct the Director of The Department of Neighborhoods to enter into an agreement with Franklin Department of County Job and Family Services to accept this award; and\nWHEREAS, it is necessary to appropriate $185,000.00 within the General Governments Grant Fund; and\nWHEREAS, an emergency exists in the usual daily operation of The Department of Neighborhoods in that it is immediately necessary authorize the Director to accept and enter into an agreement with Franklin County Department of Job and Family Services, and for the City Auditor to appropriate said grant funds, making them available to comply with the terms of the grant and so that funds are available for the My Brother’s Keeper initiative , thereby preserving the public peace, property, health, safety, and welfare; now, therefore:\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1. That the Director of The Department of Neighborhoods will be and is hereby authorized to accept a grant in the amount of $185,000.00 and enter into an agreement with Franklin County Department of Job and Family Services. \nSECTION 2. That the expenditure of $150,000.00 or so much thereof as may be needed is authorized in Fund 2220, Dept-Div 48-01, in Object Class 05 - Grants to Non-Profit Agencies per the accounting codes in the attachment to this ordinance.\nSECTION 3. That from the unappropriated monies in the General Governments Grant Fund and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the grant period ending December 31, 2024 the sum of $185,000.00 and any eligible interest earned during the grant period is hereby appropriated within fund 2220, Department of Neighborhoods Grant Fund per the account codes in the attachment to this ordinance.\nSECTION 4: That the Director of Neighborhoods is hereby authorized to enter into an agreement with the following organizations to allow to provide matching funds for the MBK Round 3 grant recipients. The grant agreements will allow for a maximum of $15 per person for the purchase of food and/or beverages in order to provide nutrition to students and families who are often food-insecure and to increase public participation in MBK outreach events.  \nAlways with Us Charities $50,000\nHeart of JOB Foundation $50,000\nICE Mentors $50,0000\n \nSECTION 5. That the monies in the foregoing Section 2. shall be paid upon order of the Director of Department of Neighborhoods, and that no order shall be drawn or money paid except by voucher, the form of which shall be approved by the City.\nSECTION 6. At the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements.\n \nSECTION 7. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\nSECTION 8. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 97,
    "meeting_date": "2023-12-11",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}