{
  "success": true,
  "vote": {
    "id": 8293,
    "item_number": "CA-65",
    "title": "To authorize the Director of the Department of Development to modify a Subaward Not-for Profit Service Contract with Faith Mission Inc. (PO361388) from December 31, 2023 to December 31, 2024; to modify the contract to increase the funding in an amount up to $80,000.00; to require the increased contracted amount to be expended by no later than August 31, 2024, which is the end date for performance of the grant associated with the increased expenditure; to authorize the a expenditure of up to $80,000.00 utilizing the 2021 Housing Opportunities for People with AIDS (HOPWA) entitlement; and to declare an emergency. ($80,000.00)",
    "description": "Explanation\n \nBACKGROUND:  This ordinance authorizes the Director of the Department of Development to modify a Subaward Not-for Profit Service Contract with Faith Mission Inc., to provide community services related to the Housing Opportunities for People with AIDS (HOPWA) program (PO361487) from December 31, 2023 to December 31, 2024; to modify the contract to increase the funding in an amount up to $80,000.00; to require the increased contracted amount to be expended by no later than August 31, 2024, which is the end date for performance of the grant associated with the increased contracted amount; to authorize the expenditure of up to $80,000.00 utilizing the 2021 HOPWA entitlement grant from the U.S. Department of Housing and Urban Development; and to declare an emergency.  \n \nOriginal Agreement                     $690,000.00                     Ord. 3266-2022                                          PO361487\nModification No. 2                     $ 80,000.00\nTotal                                                               $770,000.00\n \nHistorically the HOPWA grant has been managed and administrated by Columbus Public Health (CPH).  Starting with the 2022 grant year funds, the HOPWA grant is being managed and administered by the Department of Development (DOD), Division of Housing.  \n \nThe HOPWA program provides for the implementation of long term comprehensive strategies for meeting the housing needs of low income persons with HIV/AIDS and their families.  Eligible services/activities include providing housing information services; resource identification; acquisition, rehabilitation, conversion, lease, and repair of facilities to provide housing and services; new construction of housing units; project or tenant based rental assistance; short term rent, mortgage and utility payments; supportive services; technical assistance and administrative support.  \n \nFaith Mission, Inc. is a provider who specializes exclusively in assisting income eligible individuals/households living with HIV/AIDS in the eight county EMSA.  \n \nThis legislation represents a part of the remaining HOPWA portion of the 2021 Action Plan, the 2022 and 2023 Action Plans, per Ordinances 2345-2020, 2800-2021, and 3353-2022 respectively.\n \nFunds in the amount of $80,000.00 remain to be expended on the 2021 HOPWA Grant, which requires the funds to be expended before August 31, 2024.  \n \nEmergency action is requested to prevent disruption in services by extending the term end date of the contract and to assure funding is expended within the period of performance.  The additional funding within the 2021 HOPWA Grant has a period of performance ending August 31, 2024.\n \nContract Compliance:  the vendor number is 011758 and expires 04/10/2025\n \nFiscal Impact: $80,000.00 is available from the 2021 HOPWA Grant (G502112).\n \nTitle\n \nTo authorize the Director of the Department of Development to modify a Subaward Not-for Profit Service Contract with Faith Mission Inc. (PO361388) from December 31, 2023 to December 31, 2024; to modify the contract to increase the funding in an amount up to $80,000.00; to require the increased contracted amount to be expended by no later than August 31, 2024, which is the end date for performance of the grant associated with the increased expenditure; to authorize the a expenditure of up to $80,000.00 utilizing the 2021 Housing Opportunities for People with AIDS (HOPWA) entitlement; and to declare an emergency. ($80,000.00)\n \n \nBody\n \nWHEREAS, the City of Columbus is a participating jurisdiction of the U.S. Department of Housing and Urban Development; and\n \nWHEREAS, the City of Columbus is the recipient of the Housing Opportunities for People with AIDS (HOPWA) entitlement grant from the U.S. Department of Housing and Urban Development; and\n \nWHEREAS, the Columbus City Council has approved the 2021 Action Plan,  2022, and 2023 Action Plans, per Ordinances 2345-2020, 2800-2021, and 3353-2022 respectively; and\n \nWHEREAS, Faith Mission, Inc. is a provider who specializes exclusively in assisting income eligible individuals/households living with HIV/AIDS in the eight county EMSA; and\n \nWHEREAS, the term end date extension and additional funds are needed, in part, to be able to utilize funds from the 2021 grant entitlement from HUD to be encumbered on or before August 31, 2024; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that the contract modification needs to be executed by the Director at the earliest possible time to ensure continuity of services and the availability of funds in light of the period of performance ending August 31, 2024, all for the immediate preservation of the public peace, property, health, and safety; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Department of Development is hereby authorized to modify to extend the term end date of a Subaward Not-for-Profit Service Contract with Faith Mission, Inc. from December 31, 2023 to December 31, 2024. \n \nSECTION 2.  That the Director of the Department of Development is hereby authorized  to modify the Subaward Not-for-Profit Service Contract with Faith Mission, Inc. to add additional funds in an amount up to $80,000.00 that will be utilizing 2021 HOPWA grant funds, which requires the additional funds to be expended on or before August 31, 2024.\n \nSECTION 3.  That the expenditure of $80,000.00 or so much thereof as may be needed, is hereby authorized in Fund 2220 (General Government Grant Fund), from Dept-Div 44-10 (Housing), G502112 (2021 HOPWA), object class 03 (Services) per the account codes in the attachment to this ordinance.\n \nSECTION 4.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n                                          \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.  At the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements.\n \nSECTION 7.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 97,
    "meeting_date": "2023-12-11",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}