{
  "success": true,
  "vote": {
    "id": 8347,
    "item_number": "SR-6",
    "title": "To authorize the Director of the Department of the Development to amend and restate the Amended and Restated TIF Reimbursement Agreement dated as of October 31, 2019 authorized by Ordinance No. 2043-2019, as amended by Ordinance No. 2932-2021, and to execute the Second Amended and Restated TIF Reimbursement Agreement with NWD Investments, LLC, relating to the extension of certain tax increment financing areas within the Arena District; to authorize the Director of the Department of the Development to enter into one or more housing development agreements with NWD Investments, LLC; and to authorize the appropriation, transfer, and/or expenditure of the service payments in lieu of taxes and property tax rollback payments from the TIFs under the Second Amended and Restated TIF Reimbursement Agreement.",
    "description": "Explanation\n \nBackground: Ordinance No. 2043-2019, as amended by Ordinance No. 2932-2021, authorized the Director of the Department of Development to execute the Amended and Restated TIF Reimbursement Agreement dated as of October 31, 2019 (the “Original Agreement”) relating to certain tax increment financing (“TIF”) areas within the City’s Arena District. The General Assembly enacted and amended Revised Code (“R.C.”) Section 5709.51 in 2019 and 2023, which allows municipal legislative authorities to extend TIFs with annual service payments of at least $1.5 million in a preceding calendar year for an additional thirty-year period. Certain TIFs within the Arena District under the Original Agreement meet this threshold. The developer that utilizes those TIFs with the City pursuant to the Original Agreement has requested that the two of those TIFs under the Original Agreement to be extended for an additional 30-year period in order to provide for the funding of additional public improvements for the continued development of the Arena District. \n \nThe Department of Development has submitted for City Council consideration ordinances to authorize thirty-year extensions for those two TIFs pursuant to R.C. Section 5709.51.The purpose of this Ordinance is to amend and restate the Original Agreement by authorizing the execution of the Second Amended and Restated TIF Reimbursement Agreement (the “Second Agreement”) with the developer in order to fully implement all of the terms and conditions of this Ordinance and the Second Agreement, including but not limited to: (i) govern the terms and conditions of the extension revenues, (ii) provide for the use of additional TIF revenue for projects as identified and determined by the City, (iii) provide the City relief as to its capital improvement budget commitment, (iv) provide for the collection of the City’s economic development fees, (v) provide for the inclusion of minority and women owned businesses for related work, and (vi) make other technical modifications. This Ordinance will appropriate, transfer, and expend funds pursuant to the Second Agreement. This Ordinance will also authorize one or more Housing Development Agreements providing for workforce housing commitments from the developer. \n \nFiscal Impact\nThe City is authorizing the appropriation and expenditure of the service payments in lieu of taxes and property tax rollback payments to be deposited in Fund 4404 and Fund 4405 as a result of the exemption extension authorization provided by certain ordinances submitted by the Department of Development for City Council consideration pursuant to the Second Amended and Restated TIF Reimbursement Agreement authorized by this Ordinance. The City is also authorizing the appropriation and transfer of the service payments in lieu of taxes and property tax rollback payments deposited in Funds 4404, 4405, 7415, 7416, 7470, 7471, 7407, 7409, 7411, and 7427 to a new fund(s) or project accounts within these funds established by this Ordinance in an amount equal to 30% of the annual service payments in lieu of taxes and property tax rollback payments for the TIFs under the Second Amended and Restated TIF Reimbursement Agreement. The City is similarly authorizing the appropriation and yearly transfer of $5,000.00 per each outstanding TIF in the Second Amended and Restated TIF Reimbursement Agreement during the term of such agreement from the service payments in lieu of taxes and property tax rollback payments deposited or to be deposited in Funds 4404, 4405, 7415, 7416, 7470, 7471, 7407, 7409, 7411, and 7427 to Fund 2229. \n \n \nTitle\n \nTo authorize the Director of the Department of the Development to amend and restate the Amended and Restated TIF Reimbursement Agreement dated as of October 31, 2019 authorized by Ordinance No. 2043-2019, as amended by Ordinance No. 2932-2021, and to execute the Second Amended and Restated TIF Reimbursement Agreement with NWD Investments, LLC, relating to the extension of certain tax increment financing areas within the Arena District; to authorize the Director of the Department of the Development to enter into one or more housing development agreements with NWD Investments, LLC; and to authorize the appropriation, transfer, and/or expenditure of the service payments in lieu of taxes and property tax rollback payments from the TIFs under the Second Amended and Restated TIF Reimbursement Agreement. \n \n \nBody\n \nWHEREAS, Ordinance No. 2356-98, passed by this Council on September 14, 1998 pursuant to Ohio Revised Code (“R.C.”) Section 5709.40 (as subsequently amended by Ordinance Nos. 1719-02, 3166-2019, and 3167-2019, collectively, the “Arena (Offsite) TIF Ordinance”), declared improvements to certain parcels of real property that are part of the Arena District (the “Arena (Offsite) TIF Parcels”) to be a public purpose, required the owners of such Arena (Offsite) TIF Parcels to make service payments in lieu of taxes (the “Arena (Offsite) TIF Service Payments”) and otherwise established a tax increment financing program for those Arena (Offsite) TIF Parcels in the Arena District (the “Arena (Offsite) TIF”); and\n \nWHEREAS, Ordinance No. 2357-98, passed by this Council on September 14, 1998 pursuant to R.C. Section 5709.40 (the “Pen Site TIF Ordinance”), declared improvements to certain parcels of real property that are within and around the former Ohio Penitentiary (the “Pen Site TIF Parcels” and together with the Arena (Offsite) TIF Parcels, the “Parcels”) to be a public purpose, required the owners of such Pen Site TIF Parcels to make service payments in lieu of taxes (the “Pen Site TIF Service Payments” and together with the Arena (Offsite) TIF Service Payments, the “Original Service Payments”) and otherwise established a tax increment financing program for those Pen Site TIF Parcels within and around the former Ohio Penitentiary (the “Pen Site TIF”); and\n \nWHEREAS, the City and NWD Investments, LLC (the “Developer”) entered into the Amended and Restated TIF Reimbursement Agreement dated as of October 31, 2019 (the “Original Agreement”) pursuant to Ordinance No. 2043-2019, as amended by Ordinance No. 2932-2021, to provide funding for public improvements necessary for the continued development of the Arena District and the surrounding areas of the Arena (Offsite) TIF and Pen Site TIF; and\n \nWHEREAS, City Council by Ordinance No. 1555-2017 passed June 19, 2017 determined, pursuant to Section 6 of House Bill 384 enacted by the 131st General Assembly, that satisfactory provision had been made for the public improvement needs of the Arena (Offsite) TIF Parcels; and  \n \nWHEREAS, this Council further determined that certain public improvements identified generally on Exhibit B of Ordinance No. 1555-2017 (the “Neighborhood Public Improvements”) will be in support of urban redevelopment within the meaning of R.C. Section 5709.41; and\n \nWHEREAS, pursuant to R.C. Section 5709.51, this Council may amend the Arena (Offsite) TIF Ordinance and the Pen Site TIF Ordinance to extend, for a period not exceeding 30 additional years, the exemption from taxation of improvements to the Parcels granted pursuant to the Arena (Offsite) TIF Ordinance and the Pen Site TIF Ordinance if certain conditions are met; and\n \nWHEREAS, the Developer has requested the City to extend the exemption of the Parcels pursuant to R.C. Section 5709.51, to enable the Developer to make public improvements that will directly benefit the Parcels and to enable the City to make public improvements that will directly benefit the Parcels or for the Neighborhood Public Improvements and continue the job creation and retention activities in the Arena District or in the City, all for the welfare and benefit of the citizens of the City; and\n \nWHEREAS, the Original Agreement limits the City the opportunity under certain conditions to utilize only 20% of the sum from the Original Service Payments plus those service payments in lieu of taxes required by Ordinance Nos. 2092-01, 2093-01, 1648-2016, 3166-2019, 3167-2019, 3169-2019, and 3170-2019, as each ordinance may have been amended, (the “New Service Payments”) for TIF eligible projects at the City’s direction; and\n \nWHEREAS, as a benefit to the City and its residents, the Developer has offered to amend and restate the Original Agreement to provide that the City has the right to retain 30% of the sum of the annual Original Service Payments plus the New Service Payments to be utilized for eligible projects within the Arena District and for the Neighborhood Public Improvements as directed by the City; and\n \nWHEREAS, in the Original Agreement, the City committed to invest $5 million over four consecutive years from the City’s capital improvement budget (the “Public Infrastructure Commitment”) toward the costs of public infrastructure improvements near Vine Street and Neil Avenue, which the City has provided the first $10 million pursuant Ordinance Nos. 2061-2022 and 3425-2022; and\n \nWHEREAS, in recognition of the additional Original Service Payments to be generated during the extension periods, the Developer has agreed as a benefit to the City to relieve the City of the obligation to provide the remaining $10 million of the Public Infrastructure Commitment; and\n \nWHEREAS, any outstanding or future costs that were to be incurred and repaid by the Public Infrastructure Commitment will be reimbursable pursuant to the amendment and restatement of the Original Agreement from the Original Service Payments and the New Service Payments including those service payments in lieu of taxes to be added to the amendment and restatement of the Original Agreement in the future; and\n \nWHEREAS, as a further benefit to the City and its residents, in order to ensure opportunities for qualified minority and women-owned businesses within the City to participate in projects within the Arena District, the Developer has offered to use strong good faith efforts to award at least 30% (in total value) of design and construction contracts to such City determined qualifying minority and women-owned businesses for projects whose costs will be reimbursed pursuant to the amended and restated Original Agreement; and\n \nWHEREAS, in order to provide for additional housing opportunities for low and moderate income families in the Arena District as a further benefit to the City and its residents, the Developer has offered to cause ten percent of the residential units constructed on property currently owned by the Developer or its affiliates within any of the TIFs included under the amended and restated Original Agreement to be affordable to households earning 80% of area median income for all unit types and an additional ten percent of those same residential units to be affordable to households earning 100% of area median income for all unit types, with such commitment to be memorialized in one or more written housing development agreements between the City and the Developer (“Housing Development Agreements”); and\n \nWHEREAS, in consideration of City Council’s approval of the TIF extensions, and in order to provide for the foregoing benefits to the City and its residents (collectively, the “City Benefits”), the City and the Developer desire to amend and restate the Original Agreement and enter into the Second Amended and Restated TIF Agreement (the “Second Agreement”) and the Housing Development Agreements to provide for the Developer’s commitment to provide such City Benefits and to govern the payments and uses of TIF revenue generated by the TIF extensions; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That this Council hereby authorizes the Director of the Department of Development, or his or her designee (collectively, the “Director”), for and in the name of the City, to execute the Second Agreement along with any changes or amendments thereto not inconsistent with this Ordinance and not substantially adverse to the City and which shall be approved by the Director and the City Attorney, provided that the approval of such changes and amendments thereto by the Director, and the character of those changes and amendments as not being substantially adverse to the City, shall be evidenced conclusively by the Director’s execution and delivery thereof.\n \nSECTION 2. That the Director, for and in the name of the City, is authorized to enter into one or more Housing Development Agreements with the Department of Development along with any changes or amendments thereto not inconsistent with this ordinance and not substantially adverse to the City and which shall be approved by the Director and the City Attorney, provided that the approval of such changes and amendments thereto, and the character of those changes and amendments not being substantially adverse to the City, shall be evidenced conclusively by the Director’s execution and delivery thereof.\n \nSECTION 3. That the Director or other appropriate officers of the City, for and in the name of the City, are authorized to execute with the Developer or its designee any subsequent agreements and instruments  as contemplated in the Second Agreement along with any changes, amendments, modifications, or supplements thereto not inconsistent with this Ordinance or the Second Agreement and not substantially adverse to the City (collectively, the “Subsequent Agreements”), and take all actions as may be necessary to implement the transactions contemplated by the Second Agreement and any Subsequent Agreements, and which shall be approved by either the Director or other appropriate officer of the City and the City Attorney, provided that the approval of such Subsequent Agreements and transactions by the Director or other appropriate officer of the City, and the character of those Subsequent Agreements and transactions not being substantially adverse to the City, shall be evidenced conclusively by the Director’s or other appropriate officer’s execution and delivery thereof.\n \nSECTION 4. That the Original Service Payments deposited into Fund 4404 and Fund 4405 as a result of the TIF exemption extension authorization submitted for City Council consideration shall be deemed appropriated for the purposes set forth in the Second Agreement and authorized to be expended therefrom in accordance with the Second Agreement, and the City Auditor is authorized to make payments to the Developer or its designee from such Original Service Payments described herein within Fund 4404 and Fund 4405 in accordance with the Second Agreement upon order of the Director and that no order shall be drawn or money paid except by voucher, the form of which shall be approved by the City Auditor.\n \nSECTION 5. That commencing with the timeframe in the Second Agreement, and thereafter subject to the authorization of the Director, the City Auditor is authorized to appropriate and make annual transfers as funds are received in Funds 4404, 4405, 7415, 7416, 7470, 7471, 7407, 7409, 7411, and 7427 to a new fund(s) or project accounts within those funds established by the City Auditor for the purpose of holding up to a maximum of 30% annually of the sum from the Original Service Payments plus the New Service Payments.\n \nSECTION 6. That subject to the authorization of the Director, the City Auditor is authorized to appropriate and make annual transfers as funds are received in Funds 4404, 4405, 7415, 7416, 7470, 7471, 7407, 7409, 7411, and 7427 to Fund 2229 for the “City TIF Administrative Fee,” as that term is further described in the Second Agreement and is currently $5,000.00 per each outstanding TIF included in the Second Agreement pursuant to this Ordinance and Ordinance 3169-2022.\n \nSECTION 7. That funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this Ordinance and the Second Agreement, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 8. That the City Auditor is authorized to establish such accounting codes, as necessary, to make any accounting changes to revise the funding source for all agreements, contracts, or modifications associated with this Ordinance, or the transactions contemplated by the Second Agreement.\n \nSECTION 9. That the City Auditor is authorized to transfer the unencumbered balance in a project account or subfund to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 10. That this ordinance shall take effect and be in force from and after the earliest date permitted by law.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 1,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 97,
    "meeting_date": "2023-12-11",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "NAY"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Economic Development"
    ]
  }
}