{
  "success": true,
  "vote": {
    "id": 8362,
    "item_number": "LA",
    "title": "To authorize the Director of the Department of Development to enter into a grant agreement with Rickenbacker/Woods Technology Museum & Historic Park, Inc. DBA Rickenbacker Woods Foundation in an amount up to $200,000.00 in support of the Creators, Originators & Innovators of Tomorrow Workforce Initiative; to authorize the transfer of $200,000.00 between the Citywide Account and the Department of Development; to authorize payment for reasonable food and non-alcoholic beverages for participants of programs included in the grant agreement; to authorize the advancement of funds on a pre-determined schedule during the term of the agreement; to authorize the reimbursement of non-food and non-beverage expenditures incurred prior to the establishment of a purchase order; to authorize the expenditure of $200,000.00 from the General Fund; and to declare an emergency.  ($200,000.00)",
    "description": "Explanation\n \nBackground:  This legislation authorizes the Director of the Department of Development to enter into a grant agreement with Rickenbacker/Woods Technology Museum & Historic Park, Inc. DBA Rickenbacker Woods Foundation in an amount up to $200,000.00 in support of the Creators, Originators & Innovators of Tomorrow Workforce Initiative.  \n                     \nThe Rickenbacker Woods Foundation’s Creators, Originators & Innovators of Tomorrow Workforce Initiative empowers youth of Columbus with essential skills and knowledge in the fields of engineering, art, technology, design, media and architecture.\n \nThe initiative is entering its second year and aims to provide high school students in the City of Columbus with opportunities to engage in meaningful workforce development activities.  The program will operate from January 2024 through June 2024, three days a week. Allowing interns to gain hands-on experience and valuable exposure in their areas of interest.\n \nThe program plays a critical role in reducing youth gun violence and other forms of violence by providing constructive, skill-building activities that keep youth engaged and focused on positive goals; especially during the critical hours when they are most susceptible to negative influences. By offering mentorship, a supportive community and exposure to various fields of interest, the program instills a sense of purpose and belonging, reducing the likelihood of involvement in violent activities.\n \nThe grant agreement will include an advancement of funds on a pre-determined schedule and provide payment for reasonable food and non-alcoholic beverages supporting the program.  A portion of this funding will also support intern stipends.\nApproval is also requested for reimbursement of expenses incurred prior to execution of the purchase order, starting November 1, 2023.\nEmergency action is requested to immediately provide resources necessary to sustain human services programming within valuable Columbus communities.\n   \nFiscal Impact:   The funding of $200,000.00 for this contract will be transferred from the General Fund Citywide Account to the Department of Development General Fund Budget. \n \nContract Compliance:  The contract compliance number is 026340 and expires 3/3/24.\n \n \n \nTitle\n \nTo authorize the Director of the Department of Development to enter into a grant agreement with Rickenbacker/Woods Technology Museum & Historic Park, Inc. DBA Rickenbacker Woods Foundation in an amount up to $200,000.00 in support of the Creators, Originators & Innovators of Tomorrow Workforce Initiative; to authorize the transfer of $200,000.00 between the Citywide Account and the Department of Development; to authorize payment for reasonable food and non-alcoholic beverages for participants of programs included in the grant agreement; to authorize the advancement of funds on a pre-determined schedule during the term of the agreement; to authorize the reimbursement of non-food and non-beverage expenditures incurred prior to the establishment of a purchase order; to authorize the expenditure of $200,000.00 from the General Fund; and to declare an emergency.  ($200,000.00)\n \n \nBody\n \nWHEREAS, The Rickenbacker Woods Foundation’s Creators, Originators & Innovators of Tomorrow Workforce Initiative empowers youth of Columbus with essential skills and knowledge in the fields of engineering, art, technology, design, media and architecture; and \n                     \nWHEREAS, the initiative is entering its second year and aims to provide high school students in the City of Columbus with opportunities to engage in meaningful workforce development activities; and\n \nWHEREAS, the program will operate from January 2024 through June 2024, three days a week. Allowing interns to gain hands-on experience and valuable exposure in their areas of interest; and\n \nWHEREAS, the Director of Development desires to enter into a grant agreement with Rickenbacker/Woods Technology Museum & Historic Park, Inc. DBA Rickenbacker Woods Foundation to support their workforce development efforts; and \nWHEREAS, the grant agreement will include advance payments to the organization and provide food and non-alcoholic beverages to participants; and \nWHEREAS, a portion of this funding will also support intern stipends; and \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development, in that it is immediately necessary to authorize the Director of the Department of Development to enter into a grant agreement with the Rickenbacker Woods Technology Museum & Historic Park DBA Rickenbacker Woods Foundation to provide resources necessary to sustain human services programming within valuable Columbus communities, for the immediate preservation of the public peace, health, property, and safety; NOW THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Development is hereby authorized to enter into a grant agreement with the Rickenbacker/Woods Technology Museum & Historic Park, Inc. DBA Rickenbacker Woods Foundation in an amount not to exceed $200,000.00 in support of the Creators, Originators & Innovators of Tomorrow Workforce Initiative.  \nSECTION 2.  That the grant agreement authorized in Section 1 of this Ordinance is hereby authorized to account for payment of  non-food and non-beverage expenditures incurred prior to the purchase order, beginning November 1, 2023; and that the agreement is authorized to advance funds per a schedule to be included in the agreement. \nSECTION 3.                     That the transfer of $200,000.00 or so much thereof as may be needed, is hereby authorized within Fund 1000 (General Fund) from Dept-Div 45-01 (Financial Management), Object Class 10 (Transfer Out Operating) to Dept-Div 44-01 (Administration), Object Class 05 (Other) per the accounting codes in the attachment to this ordinance.    \nSECTION 4.  That for the purposes stated in Sections 1 and 2, the expenditure of $200,000.00 or so much thereof as may be needed, is hereby authorized in Fund 1000 (General Fund), Dept. 44-01 (Administration), in Object Class 05 (Other) per the accounting codes in the attached to this ordinance.   \n \nSECTION 5.That this agreement is awarded pursuant to the relevant provisions of Columbus City Code related to awarding grant agreements.\nSECTION 6. That Columbus City Council deems this expenditure and the distribution of food and non-alcoholic beverages to be a proper public purpose, in that it helps to feed residents in underserved neighborhoods and who disproportionately experience food insecurity.  Food and beverage related expenditures will only be allowable from the execution date of the contract and shall not exceed $20.00 per served individual. \nSECTION 7.                     That the funds are hereby deemed appropriated and transfers authorized to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\nSECTION 8.   That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.    \n \nSECTION 9.                     That for the reasons stated in the Preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 97,
    "meeting_date": "2023-12-11",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}