{
  "success": true,
  "vote": {
    "id": 8404,
    "item_number": "CA-11",
    "title": "To authorize the Director of the Department of Development to enter into contract with Fahlgren Inc. dba Fahlgren Mortine in an amount not to exceed $74,880.00 for content marketing strategy services, to be paid through funds authorized for expenditure from the General Fund by Ordinance No. 2979-2023; to allow for payment of services starting January 1, 2024; and to declare an emergency. ($0.00)",
    "description": "Explanation\n \nBACKGROUND: The Department of Development seeks to enter into a professional service contract with Fahlgren, Inc. dba Fahlgren Mortine to assist with creating the department’s communications strategy in an amount up to $74,880.00 from ACPO authorized by Ordinance 2979-2023.  Ordinance 2979-2023, adopted November 20, 2023, authorized the encumbrance of funds in an amount up to $75,000.00 for a content marketing services contract with a to-be-determined firm.\n \nThe work completed through this contract will educate audiences on how the department helps to make Columbus a more equitable community and foster prosperity for the city’s residents, businesses, and investors; highlight the Columbus Housing Strategy and demonstrate how our programming and funding activate the Strategy; demonstrate how economic development tools attract and retain businesses and promote capital investment; illustrate how our work helps business of all sizes reach their full potential, which in turn, creates community benefits; and show how our work fosters smart and sustainable growth.\n \nThe department utilized the Request for Proposals (RFP) process in accordance with City procurement standards to solicit proposals. Proposals were submitted in response to RFQ026111 in accordance with the relevant provisions of Chapter 329 of the Columbus City Codes. \n \nAfter careful review, the Proposal Evaluation Committee selected Fahlgren, Inc. dba Fahlgren Mortine to provide the Department of Development’s content marketing strategy for 2023.  \n \nFISCAL IMPACT:  Funding is available on ACPO009780.  Only $74,880.00 will be used for this contract with the ACPO being cancelled after the PO is confirmed.\n \nCONTRACT COMPLIANCE:  the vendor number is 009283; and expires 12/12/2025.\n \nEMERGENCY DESIGNATION:  Emergency legislation is requested in order to begin the process of crafting the Recovery and Resiliency report to share with the community to begin implementing recommendations without delay.\n \n \nTitle\n \nTo authorize the Director of the Department of Development to enter into contract with Fahlgren Inc. dba Fahlgren Mortine in an amount not to exceed $74,880.00 for content marketing strategy services, to be paid through funds authorized for expenditure from the General Fund by Ordinance No. 2979-2023; to allow for payment of services starting January 1, 2024; and to declare an emergency. ($0.00)\n \n \nBody\n \nWHEREAS, the City of Columbus is needing to communicate and educate the public on the Department of Development’s work within the communities of Columbus; and \n \nWHEREAS, the City of Columbus, utilized a Request for Proposals (RFP) process to identify and assess qualified firms; and\n \nWHEREAS, proposals were submitted in response to RFQ026111 in accordance with the relevant provisions of Chapter 329 of the Columbus City Code, and Fahlgren Inc. dba Fahlgren Mortine received the highest overall score from the RFP committee; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to authorize the Director of Development to enter into contract with Fahlgren Inc. dba Fahlgren Mortine in order to begin the process of crafting the annual report and communication strategy to share with the community and begin implementing recommendations, for the immediate preservation of the  public health, peace, property, and safety; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Department of Development is hereby authorized to enter into a contract with Fahlgren Inc. dba Fahlgren Mortine to provide content marketing strategy services and reimburse for expenses starting January 1, 2024 in the amount not to exceed $74,880.00 from ACPO009780, which was authorized by Ordinance No. 2979-2023, with funds to be expended from the General Fund.\n \nSECTION 2.  That the expenditure of up to $74,880.00 is hereby authorized from ACPO009780.\n \nSECTION 3. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.  \n \nSECTION 5. That, for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 99,
    "meeting_date": "2024-01-08",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}