{
  "success": true,
  "vote": {
    "id": 8462,
    "item_number": "SR-7",
    "title": "To amend the 2023 Capital Improvement Budget; to authorize the City Auditor to appropriate and transfer funds from the Special Income Tax Fund to the Affordable Housing Bond Fund; to authorize the transfer of cash and appropriation within the Affordable Housing Bond Fund; and to authorize an expenditure in an amount up to $4,000,000.00 from the Affordable Housing Bond Fund per the Housing Development Agreement with Central Ohio Community Land Trust. ($4,000,000.00)",
    "description": "Explanation\n \nBACKGROUND\nThis legislation authorizes the expenditure of $4,000,000.00 from the Affordable Housing Fund per the Housing Development Agreement with Central Ohio Community Land Trust (COCLT).\n                     \nColumbus City Council Ordinance 2522-2022, passed October 3, 2022, authorized the Director of the Department of Development to enter into a $12 million Housing Development Agreement (HDA) with the Central Ohio Community Land Trust (COCLT) and appropriated $4 million for first allocation under the HDA.  The Department of Development now request another allocation $4 million under this HDA.  The COCLT is a successful tool to bring more affordable homeownership opportunities and reutilize Land Bank lots. This agreement will allow the continued expansion of the COCLT and continue ongoing projects.   As of October, 2023, the COCLT has developed and sold 79 houses.\n \nFISCAL IMPACTS\nThis ordinance authorizes an expenditure of $4,000,000.00 in the Affordable Housing Bond Fund. It is necessary to certify the requisite funds in the amount of $3,490,000.00 against the Special Income Tax Fund. It is also necessary to transfer cash and appropriation within the Affordable Housing Bond Fund. An amendment to the 2023 Capital Improvement Budget is required to establish sufficient budget authority within the proper project.\n \nCONTRACT COMPLIANCE:  the vendor number is 039810 and renewal is pending.\n \nTitle\n \nTo amend the 2023 Capital Improvement Budget; to authorize the City Auditor to appropriate and transfer funds from the Special Income Tax Fund to the Affordable Housing Bond Fund; to authorize the transfer of cash and appropriation within the Affordable Housing Bond Fund; and to authorize an expenditure in an amount up to $4,000,000.00 from the Affordable Housing Bond Fund per the Housing Development Agreement with Central Ohio Community Land Trust. ($4,000,000.00)\n \n \nBody\n \nWHEREAS, by Ordinances 0227-2019 and 0872-2020, Columbus City Council authorized the Director of the Department of Development to enter into an agreement with the Central Ohio Community Improvement Corporation to establish a Community Land Trust and authorized the expenditure of $4,000,000.00; and\nWHEREAS, by Ordinance 1059-2021, Columbus City Council authorized the expenditure of an additional $3,060,000 to fund additional trust projects; and\nWHEREAS, by Ordinance 2522-2022, Columbus City Council authorized the Director of Development to execute a Housing Development Agreement for $12,000,000.00 and authorized the expenditure of  $4,000,000.00 under the agreement; and\nWHEREAS, The City and COCLT seek an additional $4,000,000.00 under the Housing Development Agreement, to bring the total expenditure to $8,000,000.00; and \n \nWHEREAS, COCLT is proposing to develop affordable housing under the land trust model that will include retaining ownership of the underlying land to ensure the site remain permanently affordable; and\n \nWHEREAS, the COCLT has been undertaken successful projects in the South Side, Near East, Franklinton, Weiland Park, Milo-Grogan, and Linden in partnership with various co-developers and will expand into additional Columbus neighborhoods and with additional partners; and\n \nWHEREAS, the Parties desire to memorialize their understanding and agreements with respect to such cooperation; and\n \nWHEREAS, the City’s obligation to provide financial assistance as set forth herein is contingent upon the subsequent adoption of appropriate legislation by Columbus City Council authorizing such assistance; and\n \nWHEREAS, it is necessary to transfer funds from the Special Income Tax Fund to fund this project; and\n                     \nWHEREAS, the City will reimburse the Special Income Tax Fund; and\n \nWHEREAS, this transfer should be considered as a temporary funding method; and\n \nWHEREAS, the aggregated principal amount of obligations which the City will issue to finance this project is presently expected not to exceed $3,490,000.00; and\n \nWHEREAS, the City anticipates incurring Original Expenditures (as defined in Section 1.150-2(c) of the Treasury Regulations (the “Treasury Regulations”) promulgated pursuant to the Internal Revenue Code of 1986, as amended) with respect to the project described in this ordinance (the “Project”); and\n \nWHEREAS, a transfer of cash and appropriation is necessary within the Affordable Housing Bond Fund; and\n \nWHEREAS, the City's agreement to provide financial assistance as set forth herein is contingent upon authorization pursuant to subsequent passage of appropriate legislation by Columbus City Council; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.     That the 2023 Capital Improvements Budget authorized by ordinance 1711-2023 be amended as follows to establish sufficient authority for this project:\n \nFund / Project / Project Name / Current / Change /C.I.B. as Amended\n \n7779 / P782012-100000 / Affordable Housing Funds (Voted Carryover) / $510,000.00 / ($510,000.00) / $0\n \n7779 / P782012-100000 / Affordable Housing Funds (Voted 2022 SIT Supported) / $47,200,000.00 / ($3,490,000.00) / $43,710,000.00\n \n7779 / P782025-100000 / Community Land Trust (Voted Carryover)/ $0.00 / $510,000.00 / $510,000.00\n \n7779 / P782025-100000 / Community Land Trust (Voted 2022 SIT Supported)/ $0.00 / $3,490,000.00 / $3,490,000.00 \n \nSECTION 2.                      That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2023, the sum of $3,490,000.00 is appropriated in Fund 4430 (Special Income Tax Fund), Dept-Div 2201 (City Auditor) in Object Class 10 (Transfer Out Operating) and in Fund 7779 (Affordable Housing Bond Fund), Dept-Div 4411 (Land Redevelopment), Project P782025-100000 (Community Land Trust), in Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\n \nSECTION 3. That the transfer of $3,490,000.00, or so much thereof as may be needed, is hereby authorized from Fund 4430 (Special Income Tax Fund), Dept-Div 2201 (City Auditor) to Fund 7779 (Affordable Housing Bond Fund), Dept-Div 4411 (Land Redevelopment) and the transfer between projects of cash and appropriation within Fund 7779 in the amount of $510,000.00 is authorized per the account codes in the attachment to this ordinance.\n \nSECTION 4. That the expenditure of $4,000,000.00 or so much thereof as may be needed for this agreement as previously authorized per Ordinance 2522-2022, approved by Columbus City Council on October 3, 2022, is hereby authorized within Fund 7779 (Affordable Housing Bond Fund), Dept-Div 4411 (Land Redevelopment), in object class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 5. That upon obtaining other funds for this project for the Department of Development, the City Auditor is hereby authorized and directed to repay the Special Income Tax Fund the amount transferred from such fund under Section 3.\n \nSECTION 6. That the City intends that this ordinance constitute an “official intent” for purposes of Section 1.150-2(e) of the Treasury Regulations, and that the City reasonably expects to reimburse itself for certain Original Expenditures incurred with respect to the Project from the proceeds of obligations to be issued by the City in a principal amount currently estimated to be $3,490,000.00 (the “Obligations”).\nThe City intends to make a reimbursement allocation on its books for the Original Expenditures not later than eighteen months following the later to occur of the date of the Original Expenditure to be reimbursed or the date the Project for which such Original Expenditures were made is “placed in service” within the meaning of Treasury Regulations Section 1.150-2(c). Upon the issuance of the Obligations, the proceeds of such Obligations shall be used to reimburse the fund from which the advance for costs of the Project will be made.\nSECTION 7. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 8. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 9. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 99,
    "meeting_date": "2024-01-08",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Housing"
    ]
  }
}