{
  "success": true,
  "vote": {
    "id": 8510,
    "item_number": "CA-41",
    "title": "To authorize the Director of the Department of ,Development to enter into a contract in an amount up to $300,000.00 with The Waterworks, LLC, to provide residential emergency heating, plumbing, and water and sewer services as part of the Division of Housing’s Emergency Repair program; to amend the 2023 Capital Improvement Budget; to authorize the City Auditor to transfer cash and appropriation within the Development Taxable Bond Fund; to authorize the expenditure of up to $300,000.00 from the Development Taxable Bond Fund; to authorize expenditures prior execution of the Purchase Order; and to declare an emergency. ($300,000.00)",
    "description": "Explanation\n \nBACKGROUND\nThis legislation authorizes the Director of the Department of Development to enter into a contract with The Waterworks, LLC, in an amount up to $300,000.00 to provide residential emergency heating, plumbing, and water and sewer services as part of the Division of Housing’s Emergency Repair Program using Housing Preservation Bond funds.  Approval is also requested for reimbursement of expenses incurred prior to execution of the purchase order, starting January 1, 2024.\n \nEmergency Heating, Plumbing, and Water and Sewer Repair is part of the Emergency Repair Program, operated by the Division of Housing.  The program was established to assist low and moderate-income homeowners with heating, plumbing, and water and sewer issues that constitute an emergency condition.  Emergency repairs under this legislation will address small and large-scale capital home improvements that, if not corrected, may require the owner to vacate their home.  Most homeowners are at or below 50% AMI as defined by HUD with exceptions allowed up to 80% AMI. \n \nThe department advertised RFQ026104 on Vendor Services seeking contractors to provide emergency mechanical repairs on October 10, 2023 with bids being due on November 3, 2023.  The Emergency Repair Program is a home repair program operated by the Housing Division.  \nEmergency action is requested to continue performing needed repairs for residents as quickly as possible.\n \nFISCAL IMPACT:  Funding is available within the Development Taxable Bond Fund. An amendment to the 2023 Capital Improvements Budget and a transfer of cash and appropriation are required to establish sufficient budget authority, cash, and appropriation within the proper project.\n \nCONTRACT COMPLIANCE:  \nThe Waterworks, LLC, vendor number 004777 and expires 3/9/2025.\n \n \nTitle\n \nTo authorize the Director of the Department of ,Development to enter into a contract in an amount up to $300,000.00 with The Waterworks, LLC, to provide residential emergency heating, plumbing, and water and sewer services as part of the Division of Housing’s Emergency Repair program; to amend the 2023 Capital Improvement Budget; to authorize the City Auditor to transfer cash and appropriation within the Development Taxable Bond Fund; to authorize the expenditure of up to $300,000.00 from the Development Taxable Bond Fund; to authorize expenditures prior execution of the Purchase Order; and to declare an emergency. ($300,000.00)\n \n \nBody\n \nWHEREAS, the Emergency Repair Program was established to assist low and moderate income homeowners with emergency heating, plumbing, and water and sewer services that would impact a household remaining safely in their home; and \n \nWHEREAS, the Department of Development has advertised Emergency Repair Program-Residential requesting pricing from contractors to provide emergency mechanical services; and \n \nWHEREAS, the Director of Development will enter into a contract with The Waterworks LLC to carry out program repairs; and\n \nWHEREAS, an amendment to the 2023 Capital Improvements Budget, a transfer of cash and appropriation, and expenditure of funds is required in connection with this project; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to authorize the Director to enter into contract with The Waterworks, LLC as there exists no current heating, plumbing, and water and sewer contractor to provide services under the Emergency Repair Program, without which, residents of these households, who cannot afford the expense of services, may not be able to remain in their homes, all for the preservation of the public health, peace, property, safety, and welfare; and NOW THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Development be and is hereby authorized to enter into a contract, in an amount up to $300,000.00, with The Waterworks, LLC, to provide residential emergency heating, plumbing, and water and sewer services as part of the Division of Housing’s Emergency Repair Program. Reimbursement of expenses incurred prior to execution of the purchase order, starting January 1, 2024, is also authorized.\n \nSECTION 2.  That the 2023 Capital Improvements Budget be amended as follows to establish sufficient authority for this project:\n                                       \nFund / Project / Project Name / C.I.B. / Change / C.I.B. as Amended\n7739 / P782004-100001/Vacant Abandoned Demolition & Remediation (Unvoted Carryover) /$1,030,000.00/($300,000.00)/$730,000.00\n7739 / P782001-100000 / Housing Preservation (Unvoted Carryover) / $751,017.00 / $300,000.00 / $1,051,017.00\n \nSECTION 3.  That the transfer of $300,000.00 or so much thereof as may be needed, is hereby authorized within Fund 7739 (Development Taxable Bond Fund), from Dept-Div 44-11 (Land Redevelopment) per the account codes in the attachment to this ordinance.\n \nSECTION 4.  That for the purpose as stated in Section 1, the expenditure of $300,000.00, or so much thereof as may be necessary, is hereby authorized in fund 7739 (Development Taxable Bond Fund), Project P782001-100000, Dept. 44-10 (Housing), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance. \n \nSECTION 5.  That the funds necessary to carry out the purpose of this ordinance are deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 7. That for the reasons stated in the Preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 100,
    "meeting_date": "2024-01-22",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}