{
  "success": true,
  "vote": {
    "id": 8542,
    "item_number": "SR-15",
    "title": "To authorize the Finance and Management Director to associate all general budget reservations resulting from this ordinance with the appropriate current and pending Universal Term Contract Purchase Agreements for the purchase of Sewer Treatment Chemicals for the Division of Sewerage and Drainage; to authorize the expenditure of $5,630,000.00 from the Sewerage Operating Fund; and to declare an emergency. ($5,630,000.00)",
    "description": "Explanation\n \nBACKGROUND: This legislation authorizes the Finance and Management Director to associate all general budget reservations resulting from this ordinance with the following current and pending Universal Term Contract Purchase Agreements listed below for the purchase of Sewer Treatment Chemicals for the Division of Sewerage and Drainage. \n \nThe Purchase Agreement associations listed require approval by City Council in order for the division to expend more than $100,000.00, per Columbus City Code Chapter 329.\n \nUNIVERSAL TERM CONTRACT PURCHASE AGREEMENTS:\nPolymer: Solenis LLC, Vendor #019949, cc exp 12/28/25\nFerric Chloride and Sodium Hypochlorite: Bonded Chemicals, Inc., Vendor 009693, exp 2/17/25\nPolymer: Polydyne, Inc. - Vendor #006874, cc exp  3/3/23 (update pending)\nLiquid Sodium Bisulfite: Southern Ionics Incorporated, vendor 009806, cc exp 1/23/24\n \nThe companies are not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.  \n \nFISCAL IMPACT:  $5,630,000.00 is budgeted and needed for this purchase.  This ordinance is contingent on the passage of the 2024 Operating Budget, Ordinance 3012-2023.\n \n$4,286,947.08 was spent in 2023\n$3,404,248.82 was spent in 2022\n \nEMERGENCY DESIGNATION:  Emergency designation is being requested to avoid the delay of purchasing chemicals necessary for the sewer treatment process. This will allow the Division of Sewerage and Drainage to continue to treat the waste and provide reduced backups and overflows to the citizens of Columbus and surrounding communities.\n \nTitle\n \nTo authorize the Finance and Management Director to associate all general budget reservations resulting from this ordinance with the appropriate current and pending Universal Term Contract Purchase Agreements for the purchase of Sewer Treatment Chemicals for the Division of Sewerage and Drainage; to authorize the expenditure of $5,630,000.00 from the Sewerage Operating Fund; and to declare an emergency. ($5,630,000.00)\n \nBody\n \nWHEREAS, the Purchasing Office has established and pending Universal Term Contract Purchase Agreements for the purchase of Sewer Treatment Chemicals; and\n \nWHEREAS, this ordinance authorizes the expenditure of $5,630,000.00 or so much there of as may be needed for the purchase of sewer treatment chemicals; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Utilities in that it is immediately necessary to authorize the Director of Finance and Management to associate all general budget reservations resulting from this ordinance with the appropriate current and pending Universal Term Contract Purchase Agreements for the purchase of Sewer Treatment Chemicals to continue to treat the waste and provide reduced backups and overflows to the citizens of Columbus and surrounding communities without delay; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Finance and Management Director be and is hereby authorized to associate all general budget reservations resulting from this ordinance with the appropriate current and pending Universal Term Contract Purchase Agreements for the purchase of Sewer Treatment Chemicals for the Department of Public Utilities, Division of Sewerage and Drainage.\n \nSECTION 2.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 3.  That the expenditure of $5,630,000.00 or so much thereof as may be needed is hereby authorized in Fund 6100 (Sewerage Operating-Sanitary); in object class 02 Materials and Supplies per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 100,
    "meeting_date": "2024-01-22",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}