{
  "success": true,
  "vote": {
    "id": 8600,
    "item_number": "2",
    "title": "To Recognize February 12th - 18th as Black Girl Dad Week in the City of Columbus",
    "description": "Title\n \nTo Recognize February 12th - 18th as Black Girl Dad Week in the City of Columbus\n \nBody\nWHEREAS, Black Girl Dad Week is being hosted by Male Behavioral Health the week of February 12th in partnership with Google & the Columbus Urban League.\n \nWHEREAS, Black Girl Dad Week is organized annually to celebrate supportive fathers and their impact on their daughters’ wellbeing; and,\n \nWHEREAS, research demonstrates that strong father-daughter relationships lead to happier and healthier women and leaves a lasting impact on fathers, including changing their behavioral patterns and a longer lifespan; and,\n \nWHEREAS, the pervasive narrative that Black men are absent in their children’s’ lives is both prejudicial and unproductive, and this weeklong event seeks to reshape that narrative by establishing a forum for constructive dialogue about how to foster positive relationships between Black fathers and their daughters; and,\n \nWHEREAS, this year’s iteration of Black Girl Dad Week focuses on seven different thematic areas, one for each day of the week, and includes events like the Black Father Daughter Dance at COSI, among others; and,\n \nWHEREAS, the City of Columbus is grateful to the leadership of Jewel Woods, Founder of Male Behavioral Health, for his dedication and organizing efforts to make this event a success and to uplift an issue that touches the lives of many Columbus residents; and, \n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: That this Council hereby recognizes February 12th - 18th, 2024 as Black Girl Dad Week within the City of Columbus and encourages residents to participate in any associated activities or events.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 102,
    "meeting_date": "2024-02-05",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}