{
  "success": true,
  "vote": {
    "id": 8670,
    "item_number": "SR-8",
    "title": "To authorize and direct the City Attorney to settle the lawsuit captioned James England v. City of Columbus, et al., United States District Court Case No. 2:17-cv-104; to authorize a transfer of $300,000.00 within the General Fund; to authorize the expenditure of the sum of three hundred thousand dollars and zero cents ($300,000.00) from the General Fund in settlement of the lawsuit; and to declare an emergency. ($300,000.00)",
    "description": "Explanation\n \nBackground:                     \n \nThis Ordinance is submitted to settle the lawsuit captioned James England v. City of Columbus, et al., United States District Court Case No. 2:17-cv-104, in the amount of Three Hundred Thousand Dollars ($300,000.00).\n \nOn or about February 6, 2015, Officers Keith Abel, Douglas Fulwider, Amando Dungey and Sergeant Kenneth Griffis arrested James England for a felony assault warrant. During the arrest, Plaintiff was shot and injured by Officer Keith Abel. The facts and circumstances (“the Incident”) are more fully described in Plaintiff’s Complaint filed in the lawsuit captioned James England v. City of Columbus, Ohio, et al., United States District Court Case No. 2:17-cv-104 pending in the Southern District of Ohio (“the Lawsuit”). Plaintiff named Keith Abel, Douglas Fulwider, Amando Dungey, Sergeant Kenneth Griffis and The City of Columbus as defendants in the Lawsuit.  Douglas Fulwider, Amando Dungey and Kenneth Griffis were previous dismissed from the Lawsuit. In the Lawsuit, Mr. England alleged a) violation of his Fourth Amendment right to be free from excessive force against Keith Abel; and b) a §1983 municipal liability claim against the City of Columbus. \n \nThe City Attorney’s Office and the Director of the Department of Public Safety recommend approval of the settlement as being in the best interest of the City. \n \nFiscal Impact:                     \n \nThis ordinance authorizes the settlement of a lawsuit captioned James England v. City of Columbus, et al., United States District Court Case No. 2:17-cv-104; Funds were not specifically budgeted for this settlement; however, sufficient monies are available within Finance’s Citywide Account for this purpose.  This ordinance is contingent upon passage of the 2024 General Fund Budget via Ordinance 3011-2023\n \n \nTitle\n \nTo authorize and direct the City Attorney to settle the lawsuit captioned James England v. City of Columbus, et al., United States District Court Case No. 2:17-cv-104; to authorize a transfer of $300,000.00 within the General Fund; to authorize the expenditure of the sum of three hundred thousand dollars and zero cents ($300,000.00) from the General Fund in settlement of the lawsuit; and to declare an emergency. ($300,000.00)\n \n \nBody\n \nWHEREAS, James England alleges that Columbus Police Officer Keith Abel and the City of Columbus, violated his constitutional rights on or about February 6, 2015 by using excessive force, in violation of his Fourth and Fourteenth Amendment rights; and \n \nWHEREAS, following evaluation of the incident, a settlement in the amount of Three Hundred Thousand Dollars ($300,000.00), to be paid by the City, was deemed to be acceptable in exchange for a release from England of any claims against the City of Columbus and any of its employees, agents, officials, including Columbus Police Officers Keith Abel, Douglas Fulwider, (Retired) Amando Dungey, Sergeant (Retired) Kenneth Griffis; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Department of Public Safety, Division of Police, in that it is necessary for this ordinance to be effective immediately in order for the parties to effectuate the settlement of these claims in accordance with the terms of the settlement agreement, which is in the best interest of the City, and to pay the agreed to sum without delay; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the City Attorney be and hereby is authorized and directed to settle all claims against the City of Columbus, its officers, agents, and employees, including Columbus Police Officers Keith Abel, Douglas Fulwider, (Retired) Armando Dungey and (Retired) Sergeant Kenneth Griffis by payment of the sum of Three Hundred Thousand Dollars and zero cents ($300,000.00) as a reasonable and fair amount and in the best interest of the City of Columbus.\n \nSECTION 2.  That the transfer of $300,000.00, or so much thereof as may be needed, is hereby authorized between object classes within the General Fund from the Department of Finance’s Citywide account to the Department of Public Safety per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That the expenditure of $300,000.00, or so much thereof as may be needed, is hereby authorized as follows in the General Fund object class 05 per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That, upon receipt of an invoice and a release approved by the City Attorney, the City Auditor be and is hereby authorized to draw a warrant upon the City Treasurer for the sum of Three Hundred Thousand Dollars and zero Cents ($300,000.00) made payable to Friedman, Gilbert & Gerhardstein.\n \nSECTION 5.  That for the reasons stated in the preamble hereto, which is made a part hereof, this ordinance is hereby declared to an emergency measure and shall take effect and be in force after passage and approval by the Mayor, or 10 days after passage if the Mayor neither vetoes nor approves the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 103,
    "meeting_date": "2024-02-12",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services"
    ]
  }
}