{
  "success": true,
  "vote": {
    "id": 8675,
    "item_number": "SR-13",
    "title": "To amend Chapter 329 of the Columbus City Codes and the related Food and Beverage Policy to authorize the purchase of food and beverages for a public purpose; and to declare an emergency. ($0.00)",
    "description": "Explanation\n \nBackground: Columbus City Council and various City Departments have a need to purchase food and/or beverage items for various programs and events throughout the year. As such, Ordinance 3197-2022 amended the City Purchasing Code by adding sections 329.35 and 329.351. Section 329.35 added code language regarding the purchase of food and beverages for a public purpose and Section 329.351 added code language regarding the purchase of equipment for public purpose. Pursuant to these additions to City Purchasing Code, the Department of Finance and Management enacted a Food and Beverage Policy that provided guidelines to City Departments for the processing of related expenditures. It has become necessary to amend Section 329.35 and the related Food and Beverage Policy to align with best practices and to conform to the intent of the original code language.\n \nColumbus City Council and City departments host employee recognition, training, and staff development events which both recognize and honor employees for work related achievements and train and develop staff for better programmatic and service delivery to the community. \n \nEmergency action is requested to ensure that necessary code and policy revisions align with passage of the 2024 Operating Budget.\n \nTitle\n \nTo amend Chapter 329 of the Columbus City Codes and the related Food and Beverage Policy to authorize the purchase of food and beverages for a public purpose; and to declare an emergency. ($0.00)\n \nBody\n \nWHEREAS, the health and welfare of residents of the City of Columbus, the public at large, and municipal officers and/or employees is paramount; and\n \nWHEREAS, enhancing public engagement, facilitating public meetings, and providing for the efficient operation of the city serves a public purpose; and\n \nWHEREAS, training, and developing staff for better programmatic and service delivery to the community serves a public purpose; and\n \nWHEREAS, the ability to provide food, refreshments, snacks, meals, mementos, or other like amenities and to rent a site or venue helps to facilitate community programs, staff training and development, and events sponsored by the City; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Department of Finance & Management in that it is immediately necessary to amend Section 329.35 and the related Food and Beverage Policy to align with best practices and to conform to the intent of the original code language in time for passage of the 2024 Operating Budget ; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSection 1.  That Section 329.35 be amended as follows:\n \n329.35 - Purchase of food and beverages for a public purpose\n(A) The authorizations in this section are granted for the public purpose of better providing for the health and welfare of residents of the City of Columbus, the public at large, and municipal officers and/or employees by enhancing public engagement, facilitating public meetings, and providing for the efficient operation of the city.\n(B) Absent any existing restrictions and/or prohibitions on the use of funds for this purpose, funds may be expended, and the expenditure is declared to be a public purpose, in order to provide food, refreshments, snacks, meals, mementos, or other like amenities and, if necessary, to rent a site or venue for the following:\n(1) Community programs and events sponsored by the City; and\n                     (2) Events honoring employees for work-related achievements and/or contributions to the community.\n                     (3) Employee development programs to train and prepare staff for better programmatic and service delivery to the community.\n                     (4) Extraordinary circumstances where food and beverage are needed for employee safety or program delivery.\n(C) The Director of the Department of Finance and Management is authorized to review and approve contracts with vendors to obtain the food, refreshments, snacks, meals, mementos, or other like amenities and to rent sites or venues under division (B) of this section, payable from funds appropriated for this purpose, so long as the expenditure meets both of the following criteria:\n(1) The expenditure is integral to the successful execution or completion of a program, event, or engagement; and\n(2) The expenditure is not manifestly arbitrary or unreasonable, as prescribed by the rules promulgated under Section 329.35(E).\n \n(D) The Director of the Department of Finance and Management, or the Director's designee, shall review all expenditures of funds for the procurement of food, refreshments, snacks, meals, mementos, or other like amenities and to rent sites or venues as provided for in division (B) to assure compliance with the criteria outlined in division (C). No funds shall be expended under this section without the prior, written authorization of the Director of the Department of Finance and Management and no such authorization shall be given unless the request is found by the Director to comply with the criteria listed in divisions (B) and (C).\n \n(E) The Director of the Department of Finance and Management is hereby empowered to adopt, promulgate, and enforce rules and regulations related to the administration and enforcement of the provisions of this section, and which shall establish, but are not limited to, the following standards:\n(1) A per-person, per-meal cost not to exceed the applicable per diem by meal established by location as set by the Federal General Services Administration;\n(2) Maximum allowable delivery fees, services charges, and gratuities.\n \n(F) To be effective, the rules and regulations promulgated by the Director pursuant to this section must be filed with the City Clerk and approved by ordinance of Council.\n \n(G) The procurement process for food, beverages, refreshments, snacks, meals, mementos, or other like amenities shall be as otherwise provided for in this chapter.\n \n(H) The use of funds under this section to procure alcoholic beverages is strictly prohibited.\n \nSection 2. That the exiting Section 329.35 is hereby repealed.\n \nSection 3. That the Food and Beverage Policy is hereby amended as per the attachment to this ordinance and approved.  \n \nSection 4. That for the reasons stated in the preamble hereto, which is made a part hereof, this ordinance is hereby declared to an emergency measure and shall take effect and be in force after passage and approval by the Mayor, or 10 days after passage if the Mayor neither vetoes nor approves the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 103,
    "meeting_date": "2024-02-12",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services"
    ]
  }
}