{
  "success": true,
  "vote": {
    "id": 8751,
    "item_number": "SR-12",
    "title": "To authorize the transfer of funds within the E Broad Commercial TIF Fund; to transfer funds from each of the Lucent Incentive District TIF Fund and the E Broad Dominion TIF Fund to the Lucent Incentive District TIF Capital Fund and the E Broad Dominion TIF Capital Fund respectively; to appropriate funds within the Lucent Incentive District TIF Fund, E Broad Dominion TIF Fund, Lucent Incentive District TIF Capital Fund, the E Broad Dominion TIF Capital Fund, and E Broad Commercial TIF Capital Fund;  to authorize the Interim Director of the Department of Public Service to enter into contract with Trucco Construction Co., Inc. for the Roadway - Westbourne Avenue Extension project; to authorize the expenditure of  $8,665,106.22 from the various TIF funds; and to declare an emergency. ($8,665,106.22)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Interim Director of Public Service to enter into contract with Trucco Construction Company, Inc. for the Roadway - Westbourne Avenue Extension project and to provide payment for construction, construction administration and inspection services.  \n \nThis contract includes the improvement of approximately 0.13 miles of Westbourne Avenue west of Taylor Station Road by resurfacing and widening it to add a southbound right turn lane, and the approximately 0.58 miles extension of Westbourne Avenue between Taylor Station Road and Blossom Field Boulevard. The improvements of the extension include full depth pavement, new curb and gutter, sidewalk, drives, storm sewer system, shared-use path, signage, waterline, tree plantings, and roadway lighting. The improvement will also include a roundabout and a placement of 0.22 miles of a new alignment, called Corrina Drive, south from the roundabout, including full depth pavement, new curb and gutter, sidewalk, drives, storm sewer system, shared-use path, signage, tree plantings, and roadway lighting. Work also involves minor traffic signal improvements at the intersection of Westbourne Avenue and Taylor Station Road, and other work as may be necessary to complete the contract in accordance with the plans and specifications set forth in the Bid Submittal Documents.\n \nThe estimated Notice to Proceed date is April 5, 2024.  The project was let by the Office of Support Services through Vendor Services and Bid Express.  Five bids were received on February 1, 2024, (all majority) and tabulated as follows:   \n      \nCompany Name                                 Bid Amount               City/State                Majority/ODI Certification   \nTrucco Construction Co., Inc.                     $7,877,369.29                     Delaware, Ohio                     MAJ\nShelly & Sands, Inc.                     $8,677,563.32                     Columbus, Ohio                     MAJ\nComplete General Construction                     $8,770,371.5                     Columbus, Ohio                     MAJ\nElite Excavating Co. of Ohio, Inc.                     $11,536,389.48                     Mansfield, Ohio                     MAJ\nDouble Z Construction Company                     $11,531.133.06                     Columbus, Ohio                     MAJ\n \nAward is to be made to Trucco Construction Co., Inc. as the lowest responsive and responsible and best bidder for their bid of $7,877,369.29.  The amount of construction administration and inspection services will be $787,736.93.  The total legislated amount is $8,665,106.22. \n \nSearches in the System for Award Management (Federal) and the Findings for Recovery list (State) produced no findings against Trucco Construction Co., Inc.\n \nThe certifications of Trucco Construction Co., Inc. and all associated subcontractors were in good standing at the time the bid was awarded.  Goldtech’s ODI certification will be renewed before entering into contract.\n \nAs part of their bid Trucco Construction Co., Inc. has proposed the following subcontractors to work on the project:\n \nCompany Name                                                  City/State                                                               Majority/ODI Certification      \nPaul Peterson Company                                                               Columbus, Ohio                                                                                    MAJ                     \nJess Howard Electric                                                               Blacklick, Ohio                                                                                    MAJ\nGriffin Pavement Striping                                          Columbus, Ohio                                                                                    MAJ                     \nComplete Clearing                                                               Marengo, Ohio                                                                                    MAJ\nCap-Stone & Assoc.                                                               Columbus, Ohio                                                                                    WBE\nMP Dory                                                                                    Columbus, Ohio                                                                                    MAJ\nDresden Landscaping                                                               Dresden, Ohio                                                                                    MAJ\nHurts Trucking                                                                                    Marysville, Ohio                                                               MBE                     \nGoldtech                                                                                    Columbus, Ohio                                                                                    MBE (expired)\n \n2. CONTRACT COMPLIANCE INFORMATION\nThe contract compliance number for Trucco Construction Co., Inc. is 004988 and expires 1/10/2026.\n \n3. PRE-QUALIFICATION STATUS\nTrucco Construction Co., Inc. and all proposed subcontractors have met code requirements with respect to pre-qualification, pursuant to relevant sections of Columbus City Code Chapter 329.\n \n4.  FISCAL IMPACT\nFunds in the amount of $4,304,618.84 are available within the Lucent Incentive District TIF Fund, Fund 4427.  It is necessary to appropriate funds with the Lucent Incentive District TIF Fund, Fund 4427, transfer funds to the Lucent Incentive District TIF Capital Fund, Fund 7484, and appropriate funds to align spending in the proper project.  \nFunds in the amount of $3,212,130.68 are available within the E Broad Dominion TIF Fund, Fund 4428.  It is necessary to appropriate funds with the E Broad Dominion TIF Fund, Fund 4428, transfer funds to the E Broad Dominion TIF Capital Fund, Fund 7428, and appropriate funds to align spending in the proper project.  \nFunds in the amount of $1,148,356.70 are available within the E Broad Commercial TIF Fund, Fund 7431.  It is necessary to transfer and appropriate funds within Fund 7431 to align spending in the proper project.  \n5. MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract was bid with an anticipated City of Columbus MBE/WBE Program goal of 12% as assigned by the City’s Office of Diversity and Inclusion (ODI).  Failure by the contractor to meet this goal subjects the contractor to the Penalties for Non-Compliance as described in the “City’s Minority and Women-Owned Business Enterprise & Small Local Business Enterprise Program Manual” and in the “City of Columbus MBE/WBE Program Special Provision” that were part of the bid documents for this contract.\n \n6. EMERGENCY DESIGNATION\nEmergency action is requested in order to complete needed improvements and meet the upcoming construction season’s deadlines.\nTitle\nTo authorize the transfer of funds within the E Broad Commercial TIF Fund; to transfer funds from each of the Lucent Incentive District TIF Fund and the E Broad Dominion TIF Fund to the Lucent Incentive District TIF Capital Fund and the E Broad Dominion TIF Capital Fund respectively; to appropriate funds within the Lucent Incentive District TIF Fund, E Broad Dominion TIF Fund, Lucent Incentive District TIF Capital Fund, the E Broad Dominion TIF Capital Fund, and E Broad Commercial TIF Capital Fund;  to authorize the Interim Director of the Department of Public Service to enter into contract with Trucco Construction Co., Inc. for the Roadway - Westbourne Avenue Extension project; to authorize the expenditure of  $8,665,106.22 from the various TIF funds; and to declare an emergency. ($8,665,106.22)\n \nBody\nWHEREAS, the Department of Public Service is engaged in the Roadway - Westbourne Avenue Extension project; and  \n \nWHEREAS, the work for this project consists of: (i) the improvement of approximately 0.13 miles of Westbourne Avenue west of Taylor Station Road by resurfacing and widening it to add a southbound right turn lane, (ii) minor traffic signal improvements at the intersection of Westbourne Avenue and Taylor Station Road, (iii) the approximately 0.58 miles extension of Westbourne Avenue between Taylor Station Road and Blossom Field Boulevard including a roundabout, and (iv) a placement of 0.22 miles of a new alignment, called Corrina Drive, south from the roundabout; and \n \nWHEREAS, the improvements of the extension and alignment include full depth pavement, new curb and gutter, sidewalk, drives, storm sewer system, shared-use path, signage, waterline, tree plantings, and roadway lighting, and other work as may be necessary to complete the contract in accordance with the plans and specifications set forth in the Bid Submittal Documents; and\n \nWHEREAS, Trucco Construction Co., Inc. will be awarded the contract for the Roadway - Westbourne Avenue Extension project; and \n \nWHEREAS, the Department of Public Service requires funding to be available for the Roadway - Westbourne Avenue Extension project for construction expense along with construction administration and inspection services; and\n \nWHEREAS, it is necessary for Council to authorize a transfer of funds within Fund 7431, E Broad Commercial TIF Fund, to establish sufficient cash to pay for the project; and\n \nWHEREAS, cash and appropriation must be transferred for Department of Public Service use from each of the Lucent Incentive District TIF Fund and the E Broad Dominion TIF Fund to the Lucent Incentive District Capital TIF Fund and the E Broad Dominion Capital TIF Fund respectively in order to allow the Department of Public Service to administer financial requirements of this project; and \n \nWHEREAS, funds must be appropriated within the Lucent Incentive District TIF Fund, the E Broad Dominion TIF Fund, the Lucent Incentive District TIF Capital Fund, the E Broad Dominion TIF Capital Fund, and the E Broad Commercial TIF Capital Fund; and\n \nWHEREAS, this contract opportunity was submitted to the City’s Office of Diversity and Inclusion (ODI) for review and assignment of an MBE/WBE goal prior to bidding; and\n \nWHEREAS, this contract was bid with an anticipated City of Columbus MBE/WBE Program goal of 12% as assigned by the City’s Office of Diversity and Inclusion (ODI); and\n \nWHEREAS, failure by the contractor to meet this goal subjects the contractor to the Penalties for Non-Compliance; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to enter into contract with Trucco Construction Co., Inc. in order to complete construction goals within the upcoming construction season, for the immediate preservation of the public health, peace, property, and safety; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the transfer of $1,148,356.70, or so much thereof as may be needed, is hereby authorized within Fund 7431 (E Broad Commercial TIF Capital Fund), from Dept-Div 4402 (Economic Development), Project P431999-100000 (E Broad TIF Unallocated), Object Class 06 (Capital Outlay) to Dept-Div 5912 (Design and Construction), Project P531037-100000 (Roadway - Westbourne Avenue Extension), Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\n \nSECTION 2.  That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2024, the sum of $1,148,356.70 is appropriated in Fund 7431 (E Broad Commercial TIF Capital Fund), Dept-Div 5912 (Design and Construction), Project P531037-100000 (Roadway - Westbourne Avenue Extension), Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\n \nSECTION 3. That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2024, the sum of $4,304,618.84 is appropriated in Fund 4427 (Lucent Incentive District TIF Fund), Dept-Div 4402 (Economic Development), in Object Class 10 (Transfer Out) per the account codes in the attachment to this ordinance.\nSECTION 4.  That the transfer of $4,304,618.84 or so much thereof as may be needed, is hereby authorized from Fund 4427 (Lucent Incentive District TIF Fund), Dept-Div 4402 (Economic Development) to Fund 7484 (Lucent Incentive District TIF Capital Fund), Dept-Div 5912 (Design and Construction) per the account codes in the attachment to this ordinance.\n \nSECTION 5. That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2024, the sum of $4,304,618.84 is appropriated in Fund 7484 (Lucent Incentive District TIF Capital Fund), Dept-Div 5912 (Design and Construction), Project P531037-100000 (Roadway - Westbourne Avenue Extension), Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\nSECTION 6. That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2024, the sum of $ 3,212,130.68 is appropriated in Fund 4428 (E Broad Dominion TIF Fund), Dept-Div 4402 (Economic Development), in Object Class 10 (Transfer Out) per the account codes in the attachment to this ordinance.\nSECTION 7.  That the transfer of $3,212,130.68 or so much thereof as may be needed, is hereby authorized from Fund 4428 (E Broad Dominion TIF Fund), Dept-Div 4402 (Economic Development) to Fund 7428 (E Broad Dominion TIF Capital Fund), Dept-Div 5912 (Design and Construction) per the account codes in the attachment to this ordinance.\n \nSECTION 8. That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2024, the sum of $3,212,130.68 is appropriated in Fund 7428 (E Broad Dominion TIF Capital Fund), Dept-Div 5912 (Design and Construction), Project P531037-100000 (Roadway - Westbourne Avenue Extension), Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\nSECTION 9.  That the Interim Director of the Department of Public Service be and is hereby authorized to enter into a construction services contract with Trucco Construction Company, Inc. located at 3531 Airport Rd., Delaware, Ohio  43065, for the Roadway - Westbourne Avenue Extension project in the amount of up to $7,877,369.29 in accordance with the specifications and plans on file in the Office of Support Services, which are hereby approved; and to pay for necessary construction administration and inspection costs associated with the project up to a maximum of $787,736.93.\n \nSECTION 10.  That the expenditure of $4,304,618.84, or so much thereof as may be needed, is hereby authorized in Fund 7484 (Lucent Incentive District TIF Capital Fund), Dept-Div 5912 (Design and Construction), Project P531037-100000 (Roadway - Westbourne Avenue Extension), Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 11.  That the expenditure of $1,148,356.70, or so much thereof as may be needed, is hereby authorized in Fund 7431 (E Broad Commercial TIF Capital Fund), Dept-Div 5912 (Design and Construction), Project P531037-100000 (Roadway - Westbourne Avenue Extension), Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 12.  That the expenditure of $3,212,130.68, or so much thereof as may be needed, is hereby authorized in Fund 7428 (E Broad Dominion TIF Capital Fund), Dept-Div 5912 (Design and Construction), Project P531037-100000 (Roadway - Westbourne Avenue Extension), Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 13.  That funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 14.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 15.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 16.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 104,
    "meeting_date": "2024-02-26",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Economic Development"
    ]
  }
}