{
  "success": true,
  "vote": {
    "id": 8779,
    "item_number": "CA-8",
    "title": "To authorize the director of the Department of Finance and Management, with the approval of the Director of the Department of Public Utilities, to execute and acknowledge any document(s), as approved by the City Attorney, necessary to grant to the Ohio Power Company d.b.a. American Electric Power a nonexclusive electric utility easement to burden a portion of the City’s real property near 7000 Jackson Pike.",
    "description": "EXPLANATION\n \nBACKGROUND:\n \nThe City owns real property located in the vicinity of 7000 Jackson Pike, Lockbourne Ohio, 43137, {Franklin County Tax Parcels 010-242552, 010-242553, and 010-242554} (“Property”). The Property is managed by the Department of Public Utilities (“DPU”) and is further described and recorded in Deed Book Vol. 3447, Page 712 and O.R. 17751E16, Recorder’s Office, Franklin County, Ohio. The Ohio Power Company, an Ohio corporation doing business as American Electric Power (“AEP”), is in the process of upgrading its electric service in this area to serve new development in the area including Hanes Brands, Inc., VanTrust, K Nova, Scannell Properties and others. There are also multiple single-family developments being developed by M/I Homes and Pizzuti that will be served by this electric service.  AEP has designed the project in a way to minimize impacts to City of Columbus Property but will still require an approximately 10-foot easement along Jackson Pike to accommodate the size of the poles needed for the project. AEP is requesting an electric utility easement to burden a portion of the Property in order to install and maintain electrical wires and associated appurtenances for the distribution, delivery, and service of electrical energy and impulses for the benefit of real estate in the Property’s vicinity (“Easement”). DPU and the Department of Finance and Management have reviewed the plans and support granting AEP the Easement in consideration that (i) the Easement supports electricity services in the vicinity of the Property, (ii) the Easement will be nonexclusive, (iii) AEP pays the price agreed to by the parties, and (iv) the easement contains language allowing for the city to request a one-time relocation, at AEP’s sole cost and expense, of any poles that are determined to interfere with any future City development of the Property.\n \nCONTRACT COMPLIANCE:  Not applicable. \n \nFISCAL IMPACT:  Not applicable\n \nEMERGENCY JUSTIFICATION:  Not applicable\n \nTITLE\n \nTo authorize the director of the Department of Finance and Management, with the approval of the Director of the Department of Public Utilities, to execute and acknowledge any document(s), as approved by the City Attorney, necessary to grant to the Ohio Power Company d.b.a. American Electric Power a nonexclusive electric utility easement to burden a portion of the City’s real property near 7000 Jackson Pike.\n \nBODY\n \nWHEREAS, the City intends to support electric services in the vicinity of its real property located near 7000 Jackson Pike, Lockbourne Ohio, 43137{Franklin County Tax Parcels 010-242552, 010-242553, and 010-242554} (“Property”); and\n \nWHEREAS, the City intends to grant the Ohio Power Company d.b.a. American Electric Power (“AEP”) an electric utility easement to burden a portion of the Property in order to maintain overhead electric lines and associated appurtenances for the distribution, delivery, and service of electrical energy and impulses (“Easement”) for the benefit of real estate in the Property’s vicinity; and\n \nWHEREAS, the City intends to quitclaim grant AEP the Easement in consideration that (i) the Easement supports electricity services in the vicinity of the Property, (ii) the Easement will be nonexclusive, (iii) AEP pays the price agreed to by the parties, and (iv) the easement contains language allowing for the city to request a one-time relocation, at AEP’s sole cost and expense, of any poles that are determined to interfere with any future City development of the Property; and\n \nWHEREAS, the City intends for the director Department of Finance and Management (“Finance”), with the approval of the Director of the Department of Public Utilities (“DPU”) to execute and acknowledge any document(s) necessary to quitclaim grant the Easement to AEP; and\n \nWHEREAS, the City intends for the City Attorney to approve all document(s) associated with this ordinance; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     That the Director of the Department of Finance and Management (“Finance”), with the approval of the Director of the Department of Public Utilities (“DPU”) be, and hereby is, authorized to execute and acknowledge any document(s) necessary to quitclaim grant to the Ohio Power Company, an Ohio corporation doing business as American Electric Power (“AEP”) and its successors and assigns an electric utility easement to burden the 0.669 acre, more or less, and 0.138 acre, more or less, tracts and portion of the City’s real property in the vicinity of 7000 Jackson Pike, Lockbourne Ohio, 43137, {Franklin County Tax Parcels 010-242552, 010-242553, and 010-242554} (“Property”), described and depicted in the four (4) page attachment, Exhibit-A, which is fully incorporated for reference as if rewritten, in order for AEP to nonexclusively maintain certain overhead electric facilities and associated appurtenances for the distribution, delivery, and service of electrical energy and impulses for the benefit of real estate in the Property’s vicinity.\n \nSECTION 2.                     That the City Attorney is required to preapprove all document(s) executed by the City pursuant to this ordinance.  \n \nSECTION 3.                     That this ordinance shall take effect and be in full force and effect from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 105,
    "meeting_date": "2024-03-04",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Grants",
      "Infrastructure",
      "Property & Real Estate"
    ]
  }
}