{
  "success": true,
  "vote": {
    "id": 8784,
    "item_number": "CA-13",
    "title": "To authorize the Interim Director of the Department of Public Service to enter into a professional services contract with Burgess & Niple, Inc. for the Roadway - LinkUS - Northwest Corridor South Knot project; and to authorize the expenditure of $750,000.00 from the Streets and Highways Bond Fund. ($750,000.00)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Interim Director of the Department of Public Service to enter into a professional services contract with Burgess & Niple, Inc. in the amount of up to $750,000.00 for the Roadway - LinkUS - Northwest Corridor South Knot project.\n \nThe intent of this project is to provide the City of Columbus, Department of Public Service, additional resources for the preliminary design of improvements that would provide direct multimodal connections between Olentangy River Road, which is planned to serve as the Northwest Corridor (NWC) Bus Rapid Transit (BRT) route, and Downtown Columbus via US33. The project area is known as the “South Knot” as identified in the Northwest Corridor Mobility Study. The future multimodal connection is expected to serve a portion or combination of vehicles using general purpose travel lanes, pedestrian/bicycle users, and transit-only lanes that will integrate with the Northwest Corridor Bus Rapid Transit project (currently in conceptual design). This contract will solidify a purpose and need for this connection, explore feasible alternatives through or around the SR315 at I-670 interchange by evaluating traffic capacity and operations, geometrics, structural modifications for existing and/or potential new bridges, and the cost-benefit of these alternatives.\nThe Department of Public Service, Office of Support Services, solicited Requests for Proposals for the Roadway - LinkUS - Northwest Corridor South Knot contract.  The project was formally advertised on the Vendor Services and Bonfire web sites from August 30, 2023, to September 27, 2023.  The city received two (2) responses.  All proposals were deemed responsive and were fully evaluated when the Evaluation Committee met on January 31, 2024.  The responding firms were:  \nCompany Name                                                     City/State                                 Majority/ODI Status\nBurgess & Niple, Inc.                                                                                    Columbus, OH                                                                MAJ\nms consultants, inc.                                                                                    Columbus, OH                                                                MAJ\n \nBurgess & Niple, Inc. received the highest score by the evaluation committee and will be awarded the Roadway - LinkUS - Northwest Corridor South Knot contract.  \n \nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against Burgess & Niple, Inc.\n \nThe certification of Burgess & Niple, Inc. and all associated subcontractors was in good standing at the time the bid was awarded.\n \nAs part of their proposal Burgess & Niple, Inc. has proposed the following 4 subconsultants to work on the project:\n \nCompany Name                                                               City/State                                                               Majority/ODI Certification\nWoolpert                                                               Columbus, Ohio                                                               MAJ\nCompass                                                               Columbus, Ohio                                                               WBE\nLawhon                                                               Columbus, Ohio                                                               WBE\nOHM                                                                                     Columbus, Ohio                                                               MAJ\n \n2.  CONTRACT COMPLIANCE\nBurgess & Niple, Inc.’s contract compliance number is CC004425 and expires 01/10/2026.  \n \n3.  FISCAL IMPACT\nFunding for this contract is available and appropriated within Fund 7704, the Streets and Highways Bond Fund.  \n \n4. MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract was bid with an anticipated City of Columbus MBE/WBE Program goal of 15% as assigned by the City’s Office of Diversity and Inclusion (ODI).  Failure by the contractor to meet this goal subjects the contractor to the Penalties for Non-Compliance as described in the “City’s Minority and Women-Owned Business Enterprise & Small Local Business Enterprise Program Manual” and in the “City of Columbus MBE/WBE Program Special Provision” that were part of the bid documents for this contract.\n \nTitle\nTo authorize the Interim Director of the Department of Public Service to enter into a professional services contract with Burgess & Niple, Inc. for the Roadway - LinkUS - Northwest Corridor South Knot project; and to authorize the expenditure of $750,000.00 from the Streets and Highways Bond Fund. ($750,000.00)\n \nBody\nWHEREAS, there is a need to enter into a professional services contract to provide for additional resources for the preliminary design of improvements that would provide direct multimodal connections between Olentangy River Road, which is planned to serve as the Northwest Corridor (NWC) Bus Rapid Transit (BRT) route, and Downtown Columbus via US33; and\n \nWHEREAS, the Department of Public Service, Office of Support Services, solicited Requests for Proposals for the Roadway - LinkUS - Northwest Corridor South Knot project; and\n \nWHEREAS, Burgess & Niple, Inc. submitted the best overall proposal for this project; and\n \nWHEREAS, it is necessary to enter into a contract with Burgess & Niple, Inc. for the provision of professional engineering consulting services described above in the amount of up to $750,000.00; and\n \nWHEREAS, this contract opportunity was submitted to the City’s Office of Diversity and Inclusion (ODI) for review and assignment of an MBE/WBE goal prior to bidding; and\n \nWHEREAS, this contract was bid with an anticipated City of Columbus MBE/WBE Program goal of 15% as assigned by the City’s Office of Diversity and Inclusion (ODI); and\n \nWHEREAS, failure by the contractor to meet this goal subjects the contractor to the Penalties for Non-Compliance; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Interim Director of the Department of Public Service be, and hereby is, authorized to enter into a professional services contract with Burgess & Niple, Inc. located at 330 Rush Alley, Suite 700, Columbus, OH 43215, for the Roadway - LinkUS - Northwest Corridor South Knot project in an amount up to $750,000.00.\n \nSECTION 2.  That the expenditure of $750,000.00, or so much thereof as may be needed, is hereby authorized in Fund 7704 (Streets and Highways Bond Fund), Dept-Div 5913 (Traffic Management), Project P531024-100003 (Roadway - LinkUS - Northwest Corridor South Knot), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 5.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 6.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 105,
    "meeting_date": "2024-03-04",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Public Works"
    ]
  }
}