{
  "success": true,
  "vote": {
    "id": 8794,
    "item_number": "CA-23",
    "title": "To authorize and direct the Board of Health to accept private funds from Prevention Action Alliance for the Ohio Coalition Institute Training Award grant; to authorize the appropriation of funds from the unappropriated balance of the Health Private Grants Fund; and to authorize the City Auditor to transfer appropriations between object classes for the Ohio Coalition Institute Training Award grant. ($2,500.00)",
    "description": "Explanation\n \nBACKGROUND:  This ordinance authorizes the Board of Health to accept and appropriate $2,500.00 in private funds from Prevention Action Alliance for the Ohio Coalition Institute Training Award grant, for the period of April 1, 2024 through December 31, 2024. The purpose of this private grant is to provide training, development, and technical assistance for a Columbus Public Health staff member associated with the Columbus Health Literacy Coalition and the Minority Health Advisory Committee. An outline of these training opportunities is listed in the awarding email notification and attached to this ordinance.\n \nFISCAL IMPACT:  The Ohio Coalition Institute Training Award grant is fully funded by Prevention Action Alliance.  This program does not generate revenue and does not require a City match. ($2,500.00)\n \nTitle\n \nTo authorize and direct the Board of Health to accept private funds from Prevention Action Alliance for the Ohio Coalition Institute Training Award grant; to authorize the appropriation of funds from the unappropriated balance of the Health Private Grants Fund; and to authorize the City Auditor to transfer appropriations between object classes for the Ohio Coalition Institute Training Award grant. ($2,500.00)\n \nBody\n \nWHEREAS, $2,500.00 in private funds have been awarded to Columbus Public Health from Prevention Action Alliance for the Ohio Coalition Institute Training Award grant, for the period of April 1, 2024 through December 31, 2024; and,\n \nWHEREAS, it is necessary to accept and appropriate these private funds from Prevention Action Alliance for the Ohio Coalition Institute Training Award grant; and,\n \nWHEREAS, the City may receive additional funds awarded from Prevention Action Alliance for the Ohio Coalition Institute Training Award grant; and\n \nWHEREAS, it is necessary to accept and appropriate these additional funds from Prevention Action Alliance for the Ohio Coalition Institute Training Award grant; and,\n \nWHEREAS, it is necessary to allow the City Auditor to transfer appropriations between object classes for the Ohio Coalition Institute Training Award grant as needed upon request by the Columbus Public Health department to carry out the purpose of the grant.; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Board of Health to accept this award from Prevention Action Alliance for the Ohio Coalition Institute Training Award grant to provide training, development, and technical assistance to Columbus Public Health staff;  NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     That the Board of Health is hereby authorized and directed to accept a private grant award of $2,500.00 from Prevention Action Alliance for the Ohio Coalition Institute Training Award grant, for the period of April 1, 2024 through December 31, 2024.\n \nSECTION 2.                     That from the unappropriated monies in the Health Private Grants Fund, Fund No. 2291, and from all monies estimated to come into said fund from any and all sources for the period ending December 31, 2024, the sum of $2,500.00 are hereby appropriated to the Health Department, Division No. 5001 per the accounting codes attached to this ordinance. \n \nSECTION 3.                     That the monies appropriated in the foregoing Section 2 shall be paid upon the order of the Health Commissioner and that no order shall be drawn or money paid except upon voucher, the form of which shall be approved by the City Auditor.\n \nSECTION 4.                       At the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused city match monies may be transferred back to the city fund from which they originated in accordance with all applicable grant agreements.\n \nSECTION 5.                     That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.                      That the Board of Health is hereby authorized and directed to accept any additional grant awards from Prevention Action Alliance for the Ohio Coalition Institute Training Award grant, for the period of April 1, 2024 through December 31, 2024.\n \nSECTION 7.                     That from the unappropriated monies in the Health Private Grants Fund, Fund No. 2291, and from all monies estimated to come into said fund from any and all sources for the period ending December 31, 2024, any additional awarded funds are to be appropriated in Fund 2291 upon notification of award or grant agreement Prevention Action Alliance according to the accounting codes accompanying said notice to the Auditor.\nSECTION 8.                     That the City Auditor is hereby authorized to transfer appropriations between object classes for the Ohio Coalition Institute Training Award grant as needed upon request by the Columbus Public Health department to carry out the purpose of the grant.\n \nSECTION 9.   That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 1,
    "absent": 0,
    "meeting_id": 105,
    "meeting_date": "2024-03-04",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "ABSTAIN"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Grants",
      "Health & Safety"
    ]
  }
}