{
  "success": true,
  "vote": {
    "id": 884,
    "item_number": "CA-26",
    "title": "To authorize the Director of the Department of Public Service to file a Type I annexation petition for the annexation of 5.633 acres within Washington Township as provided in section 709.022 of the Ohio Revised Code.",
    "description": "Explanation\nAN21-009\n \nBACKGROUND:  This ordinance is being submitted to authorize the Director of the Department of Public Service to file a Type I annexation petition for a 5.633 acre site in Washington Township, Franklin County. The annexation involves right of way in Hayden Run Boulevard, from Avery Road west approximately 1,370 feet to the CSX railroad. Annexation will allow all city-owned right of way to be within the corporate boundary. Upon approval by City Council, a certified copy of this ordinance will be provided to the Franklin County Commissioners in conjunction with an annexation petition.\n \nThe use of a Type 1 annexation application is stipulated in the annexation agreement between the City and Washington Township.  The annexation agreement also requires that territory annexed to the City from Washington Township be transferred to Montgomery Township.  A separate ordinance will be submitted upon approval by the Board of Franklin County Commissioners, authorizing acceptance of the annexation and subsequent boundary conformance.\n \nFISCAL IMPACT:  This ordinance has no direct fiscal impact. Provision of municipal services does represent cost to the City; however, the annexation of land also has the potential to create revenue to the City.\n \nTitle\nTo authorize the Director of the Department of Public Service to file a Type I annexation petition for the annexation of 5.633 acres within Washington Township as provided in section 709.022 of the Ohio Revised Code.\n \nBody\nWHEREAS, the City of Columbus owns 5.633 acres of right of way in Washington Township for uses associated with a roadway improvement; and \n \nWHEREAS, the site is not currently within the City of Columbus; and\n \nWHEREAS, the use of a Type I annexation application is stipulated in the annexation agreement between the City and Washington Township; and  \n \nWHEREAS, authorization by City Council is necessary for submission of a Type I annexation petition on behalf of the City of Columbus to the Board of Franklin County Commissioners; and\n \nWHEREAS, a hearing on said petition will subsequently be scheduled before the Board of County Commissioners of Franklin County; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSection 1.  That the Director of Public Service is authorized to file a Type I petition and take the necessary steps to process the annexation of 5.633 acres in Washington Township, Franklin County, located in Hayden Run Boulevard and associated with a roadway improvement project and described more specifically as follows:\nSituated in the State of Ohio, County of Franklin, Washington Township being part of Virginia Military Survey No. 3453, being part of a 5.217 acre tract as described in a deed to the City of Columbus of record in Instrument No. 201409220124635, of which 5.090 acres are in the proposed annexation, being a 0.381 acre and a 0.190 acre tract as described in a deed to the City of Columbus of record in Instrument number 201807100091345, of which 0.443 acre are in the proposed annexation, being a 0.100 acre tract as described in a deed to CITY OF COLUMBUS, a municipal corporation of record in Instrument Number 202009080133297, of which 0.100 acre in the proposed annexation, (All references are to records of the Recorders Office, Franklin County, Ohio) and being more particularly described as follows. \n \nBeginning for reference at the northeast corner of said 5.217 acre tract, being at the southeast corner of a 7.110 acre tract as described in a deed to the Avondale Woods II Senior Housing Limited Partnership of record in Instrument Number 201709130128074, being in the centerline of Avery Road; \n \nThence South 88° 55' 35\" West, along the north property line of said 5.217 acre tract, and the south line of said 7.110 acre tract, a distance of 30.00 feet to a point in the corporation line of the City of Columbus as established by ordinance number 1726-03, being of record in Instrument Number 200312020382931 and being the TRUE POINT OF BEGINNING; \n \nThence South 00°00'00\" West, through said 5.217 acre tract, and along the said corporation line of the City of Columbus, a distance of 369.30 feet to a point in the southerly line of said 0.190 acre tract and being in the northerly line of a 5.031 acre tract as described in a deed to Mohamad & Roya S. Daneshmand of record in Official Record 33245D08; \n \nThence North 90° 00' 00\" West, along the southerly line of said 0.190 acre tract, and the northerly line of said 5.031 acre tract, and the corporation line between the City of Columbus as established by ordinance number 1533-02, a distance of 10.00 feet to a point at the southwesterly corner of said 0.190 acre tract, being the southeasterly corner of an original 3.220 acre tract as described in a deed to Tarek M. Moussa and Bayan Siball of record in instrument number 201304220066013; \n \nThence North 00° 00' 00\" East, along the west line of said 0.190 acre and along the east line of said 3.220 acre tract, a distance of 116.6' to a point;\n \nThence North 20° 07' 03\" West, along the west line of said 0.190 acre tract, and the east line of said 3.220 acre tract, 72.83 feet to a point in the northerly line of said 3.220 acre n•act, and the southerly line of said 5.217 acre tract; \n \nThence North 89° 59' 24\" West, along the northerly line of said 3.220 acre tract and the southerly line of said 5.217 acre tract, a distance of 731.0 feet to a point; at a corner of said 5.217 acre tract and said 3.220 acre tract, and said 0.381 acre tract\n \nThence South 00° 00' 36\" West, along an east line of said 0.381 acre tract, and a line of said 3.220 acre tract, a distance of 10.00 feet to a point; \n \nThence South 83° 00' 42\" West, along a south line of said 0.381 acre tract, and a line of said 3.220 acre tract, and along a north line of an original 2.000 acre tract as described in a deed to Tarek M. Moussa and Bayan Siball of record in instrument number 201304220066012, a distance of 287.0 feet to a point; \n \nThence North 90° 00' 00\" West, along a south line of said 0.381 acre tract and a north line of said 2.000 acre tract, a distance of 179.9 feet to a point in the westerly line of said 2.00 acre tract, being in the easterly line of a 120.07 acre tract as described in a deed to the New York cenb'al Lines, LLC. by deed of record in Instrument No. 200507210144738, being in the corporation line of the City of Columbus, as established by city ordinance number 1533-02; \n \nThence North 33° 48' 59\" West, along the westerly line of said 2.00 acre tract, said 5.217 acre tract, and the easterly line of said 120.07 acre tract, and along the said corporation line of the City of Columbus, a distance of 245.06 feet to a point at the northwesterly corner of said 0.100 acre tract, being the southwesterly corner of an original 139.874 acre tract as described in a deed to Homewood Corporation of record in Official Record 23250-A17, being a corner of the corporation line of the City of Dublin, as established by City of Dublin ordinance number 92-92. \n \nThence North 88° 55' 35\" East, along the northerly line of said 5.217 acre tract, the southerly line of said 139.874 acre tract, the southerly line of said 7.110 acres tract, and the corporation line of the City of Dublin, a distance of 1366.8 feet to the TRUE POINT OF BEGINNING, and containing 5.633 acres in the proposed annexation. \n \nThis document and exhibit were prepared from deeds and records on file in the Recorders office, Franklin County, Ohio. \n \nThis description and exhibit is for Annexation purposes only and is not to be used for transfer. \n \nThe bearings are based on the centerline of Avery road as North 00° 00' 00\" East. \n \nThis document was prepared by the City of Columbus, Department of Public Service, Division of Design and Construction. \n \nTotal perimeter of annexation is 3389 feet of which 614.4 feet is contiguous with the City of Columbus by ordinance number 1533-02 and 1726-03, giving 18% perimeter contiguity.\n \nSection 2. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 14,
    "meeting_date": "2021-05-17",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Public Works"
    ]
  }
}