{
  "success": true,
  "vote": {
    "id": 8920,
    "item_number": "CA-52",
    "title": "To authorize the Public Safety Department Director to accept U.S. Department of Health and Human Services, Substance Abuse and Mental Health Services Administration funding totaling $500,000.00 for year one project expenses related to a four year First Responder grant project; to authorize the appropriation of $500,000.00 to the Department of Public Safety, Division of Police from the unappropriated balance of the General Government Grants Fund to support Rapid Response Emergency Addiction Crisis Team (RREACT) outreach activities; and to declare an emergency. ($500,000.00)",
    "description": "Explanation\n \nBACKGROUND: The City of Columbus received a four year award from the Department of Health and Human Services, Substance Abuse and Mental Health Services Administration (SAMHSA) to support Rapid Response Emergency Addiction and Crisis Team (RREACT) outreach activities.  This ordinance accepts and appropriates year one SAMHSA grant project funds totaling $500,000.00. The project award period is four years with a total grant amount of $2,000,000.00.  It is SAMHSA’s practice to release project funding in annual disbursements. The 2023 grant budget period is September 30, 2023 through September 29, 2024. The full project period is September 30, 2023 through September 29, 2027.  This ordinance authorizes an appropriation of funds upon receipt of annual agreements.\n \nRapid Response Emergency Addiction Crisis Team (RREACT) is an innovative outreach effort to address the opioid crisis ravaging Columbus, Ohio.  RREACT team members go out into the community and do face to face follow up visits with substance users revived from opioid overdose by police or fire first responders who have refused immediate transport to clinical facilities, thereby bi-passing treatment and recovery resources available through emergency rooms across the city. RREACT connects with survivors in their neighborhoods within 48 hours of overdose. The team includes a Crisis Intervention Team (CIT) trained peace officer, a paramedic, a social worker and a trauma specialist.  The goal of the multi-disciplinary outreach team is to help stabilize the household in an effort to reduce barriers to accessing drug and/or behavioral treatment for the substance user. RREACT also provides much needed training on naloxone administration and safety practices for handling opioid and other drugs. Naloxone and safe handling training is done for other first responder teams and other organizations operating in high-need zip codes and/or serving high-risk populations.\n \nSAMHSA funding will enhance and expand critical prevention and intervention activities performed by RREACT.  Funds will support total compensation for two CIT trained RREACT peace officers; a vehicle for outreach and patient transport; RREACT training materials and referral cards for individuals and providers impacted by opioid use/abuse, as well as contract fees for a project manager (as required by the grant).\n \nEmergency Designation: Emergency legislation is necessary to make funds available for the grant funded activity period that started September 30, 2023. \n \nFISCAL IMPACT: This ordinance authorizes the acceptance and appropriation of $500,000.00 in year one of the U.S. Department of Health and Human Services, Substance Abuse and Mental Health Services Administration award monies to fund RREACT outreach activities. This initiative does not generate any revenue nor require a City match.\n \nFederal Award: H79TI086361-01\n§                     Budget period: September 30, 2023 through September 29, 2024- $500,000.00\n§                     Project Period: September 30, 2023 through September 29, 2027- $2,000,000.00\n**Note: Year 2, 3, and 4 award funds to be appropriated to grant project account upon future receipt of annual executed contracts with SAMHSA\n§                     No City match required\n \nTitle\n \nTo authorize the Public Safety Department Director to accept U.S. Department of Health and Human Services, Substance Abuse and Mental Health Services Administration funding totaling $500,000.00 for year one project expenses related to a four year First Responder grant project; to authorize the appropriation of $500,000.00 to the Department of Public Safety, Division of Police from the unappropriated balance of the General Government Grants Fund to support Rapid Response Emergency Addiction Crisis Team (RREACT) outreach activities; and to declare an emergency. ($500,000.00)\n \nBody\n \nWHEREAS, the federal U.S. Department of Health and Human Services, Substance Abuse and Mental Health Services Administration awarded the City of Columbus $500,000.00 in First Responder funds for year one project expenses; and\n \nWHEREAS, it is necessary to accept and appropriate these funds from the U.S. Department of Health and Human Services, Substance Abuse and Mental Health Services Administration to support successful implementation of RREACT outreach activities; and\n \nWHEREAS, the City desires to accept said project award; and\n \nWHEREAS, the year one project award budget period is September 30, 2023 through September 29, 2024 and the full term of the award is September 30, 2023 through September 29, 2027; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Safety, Division of Police in that it is immediately necessary to accept and appropriate $500,000.00 in SAMHSA grant funding so as not to delay the implementation of RREACT outreach services, for the immediate preservation of the public peace, health, property, safety and welfare; NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Office of the Public Safety Director is hereby authorized to accept First Responder year one award money totaling $500,000.00 from the U.S. Department of U.S. Department of Health and Human Services, Substance Abuse and Mental Health Services Administration to support RREACT outreach activities for the budget period of September 30, 2023 through September 29, 2024.\n \nSECTION 2. That from the unappropriated monies in the General Government Grants Fund No. 2220, the sum of $500,000.00 is hereby appropriated to Columbus Division of Police 3003 according to the attached accounting document for the budget period of September 30, 2023 through September 29, 2024.\n \nSECTION 3. That the Office of the Public Safety Director is hereby authorized to accept First Responder years two through four award money from the U.S. Department of U.S. Department of Health and Human Services, Substance Abuse and Mental Health Services Administration to support RREACT outreach activities for the budget period of September 30, 2024 through September 29, 2027 in the amount of $1,500,000.00 and that the Auditor's office is hereby authorized to appropriate funds upon notice of award.  \n \nSECTION 4. That the monies appropriated in the foregoing Section 2 shall be paid upon order of the city departments named above and that no order shall be drawn or money paid except upon voucher, the form of which shall be approved by the City Auditor.\n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6. That, at the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies, if applicable, may be transferred back to the City fund from which they originate in accordance with all applicable grant agreements.\n \nSECTION 7. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 8. That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 106,
    "meeting_date": "2024-03-18",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Community Services",
      "Emergency Services"
    ]
  }
}