{
  "success": true,
  "vote": {
    "id": 894,
    "item_number": "SR-7",
    "title": "To authorize the Director of Public Utilities to enter into a construction contract with Shelly & Sands, Inc. for the Portage Grove Area Sanitary Sewer Improvements Project; to authorize the appropriation and transfer of $2,810,032.68 from the Sanitary Sewer Reserve Fund to the Ohio Water Development (OWDA) Loan Fund; to authorize the appropriation and expenditure of $2,810,032.68 from the Ohio Water Development (OWDA) Loan Fund; to authorize a transfer within and an expenditure up to $2,000.00 for prevailing wage services to the Department of Public Services from the Sanitary General Obligations Voted Bonds Fund; and to amend the 2020 Capital Improvement Budget. ($2,812,032.68)",
    "description": "Explanation\n \nBACKGROUND: Portage Grove Area Sanitary Sewer Improvements, CIP 650700-100000 consists of the construction of approximately 7,800 linear feet of 8” of sanitary sewer main extension and installation of approximately 67 sewer laterals within the right of way and easements along the following streets: Godown Road, West Case Road, Northport Drive, Northport Circle, Portage Drive, Southport Drive & Southport Circle. \n \nCommunity Planning Area: 31 - Northwest.\n \nPROJECT TIMELINE: Contract work is required to be completed in a manner acceptable to the City within 365 days from the date that a Notice To Proceed (NTP) is given by the City.\n \nPROCUREMENT INFORMATION: The Division advertised for competitive bids submission for the subject services on the City's Vendor Services website and in the City Bulletin in accordance with the overall provisions of Chapter 329 of the Columbus City Code. The Division of Sewerage and Drainage received three (3) bids on March 17, 2021 from the following companies: \n \n\n\n\nNAME\n\nTAX ID\n\nDAX #\n\nStatus\n\nExpiration\n\n\n\nShelly & Sands, Inc.\n\n31-4351261\n\n006043\n\nMAJ\n\n2/21/2022\n\n\n\nElite Excavating Co. of Ohio, Inc.\n\n20-1643186\n\n001064\n\nMAJ\n\n2/4/2022\n\n\n\nUnderground Utilities, Inc.\n\n34-1248942\n\n006588\n\nMAJ\n\n3/10/2023\n\n\n\nTrucco Construction Co., Inc.\n\n31-1293605\n\n004988\n\nMAJ\n\n2/13/2022\n\n\n\nComplete General Construction\n\n31-4366382\n\n006056\n\nMAJ\n\n7/8/2021\n\n\n\nSunesis Construction Co.\n\n31-1323837\n\n019623\n\nMAJ\n\n7/10/2022\n\n\n \n \nECONOMIC / ENVIRONMENTAL IMPACT: This project will provide access to sanitary sewer for the Portage Grove Area which is currently being services with home sewage treatment systems. Home sewages treatment systems are a potential ground water pollution hazard.\nFISCAL IMPACT: This Ordinance authorizes the City Auditor to appropriate and transfer $2,810,032.68 from the Sanitary Sewer Reserve Fund 6102 to the Ohio Water Development (OWDA) Loan Fund 6111 in order to fund this expenditure.  This transaction is a temporary measure that is required until such time as the division is able to execute a loan with the OWDA Loan Fund and reimburse the Sanitary Sewer Reserve Fund.  The loan is expected to be approved in May 2021.  Additionally $2,000.00 is necessary for Prevailing Wage Services from the Department of Public Service.  A transfer within and expenditure of up to $2,000.00 is needed from the Sanitary Sewer General Obligation Bond Fund 6109.  An amendment to the 2020 Capital Improvement Budget is also necessary to align the authority.\n \nTitle\n \nTo authorize the Director of Public Utilities to enter into a construction contract with Shelly & Sands, Inc. for the Portage Grove Area Sanitary Sewer Improvements Project; to authorize the appropriation and transfer of $2,810,032.68 from the Sanitary Sewer Reserve Fund to the Ohio Water Development (OWDA) Loan Fund; to authorize the appropriation and expenditure of $2,810,032.68 from the Ohio Water Development (OWDA) Loan Fund; to authorize a transfer within and an expenditure up to $2,000.00 for prevailing wage services to the Department of Public Services from the Sanitary General Obligations Voted Bonds Fund; and to amend the 2020 Capital Improvement Budget. ($2,812,032.68)\n \n \nBody\n \nWHEREAS, the Division of Sewerage and Drainage advertised for competitive bids for the Portage Grove Area Sanitary Sewer Improvements Project, and six (6) bids were received on March 17, 2021; and\n \nWHEREAS, it is necessary to authorize the Director of the Department of Public Utilities to execute a construction contract with Shelly & Sands, Inc. for the Portage Grove Area Sanitary Sewer Improvements Project and to encumber and expend funds to provide for prevailing wage services; and \n \nWHEREAS, it is necessary to both appropriate $2,810,032.68 from the Sewer System Reserve Fund 6102 and to authorize the transfer of said funds to the OWDA Loan Fund 6111 in order to temporarily fund this expenditure until such time as the City receives loan proceeds for the above stated purpose and reimburses the Sewer System Reserve Fund; and\n \nWHEREAS, the City anticipates incurring certain Original Expenditures (as defined in Section 1.150-2(c) of the Treasury Regulations (the “Treasury Regulations” promulgated pursuant to the Internal Revenue Code of 1986, as amended)) with respect to the construction of the Project described in this Ordinance (collectively, the “Project”); and\n \nWHEREAS, it is necessary to authorize the expenditure of up to $2,810,032.68 within the OWDA Loan Fund 6111; and  \n \nWHEREAS, it is necessary to authorize the transfer within and expenditure of up to $2,000.00 from the Sanitary G.O. Voted Bonds Fund 6109 for Prevailing Wage Services to the Department of Public Service; and  \n \nWHEREAS, it is necessary to authorize an amendment to the 2020 Capital Improvement Budget; and  \n \nWHEREAS, it has become necessary in the usual daily operation the Division of Sewerage and Drainage, Department of Public Utilities, to authorize the Director of Public Utilities to enter into a construction contract with Shelly & Sands, Inc. for the preservation of the public health, peace, property, and safety; now, therefore\n \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Public Utilities is hereby authorized to enter into a construction contract with, Shelly & Sands, Inc., 1515 Harmon Ave., Columbus, OH 43223; for the Division of Sewerage and Drainage’s Portage Grove Area Sanitary Sewer Improvements Project, in accordance with the terms and conditions as shown in the agreement on file in the office of the Division of Sewerage and Drainage; and to obtain the necessary prevailing wage services from the Department of Public Services up to a maximum amount of $2,000.00.\n \nSECTION 2.  That from the unappropriated monies in the Sanitary Sewer Reserve Fund 6102 and from all monies estimated to come into said fund from any and all sources, and unappropriated for any other purpose during the fiscal year ending December 31, 2021, the sum of $2,810,032.68 is appropriated in Fund 6102, per the account codes in the funding attachment to this ordinance.\n \nSECTION 3.  That the transfer of $2,810,032.68 or so much thereof as may be needed, is hereby authorized between the Sanitary Sewer Reserve Fund 6102 and OWDA Loan Fund 6111 per the accounting codes in the attachment to this ordinance. \n \nSECTION 4.  That the transfer within and expenditure of up to $2,000.00 is authorized in the Sanitary Sewer General Obligation Bond Fund 6109 per the accounting codes in the attachment to this ordinance for Prevailing Wage Coordination Services to the Department of Public Service.\n \nSECTION 5.  That the expenditure of $2,810,032.68, or so much thereof as may be needed, is hereby authorized per the accounting codes in the attachment to this ordinance.\n \nSECTION 6.  That the 2020 Capital Improvement Budget is amended per the accounting codes in the attachment to this ordinance.\n \nSECTION 7.  That the said company, Shelly & Sands, Inc., shall perform the work to the satisfaction of the Director of Public Utilities and the Administrator of the Division of Sewerage and Drainage.\n \nSECTION 8.  That the City Auditor is hereby authorized to transfer any unencumbered balance in the project account to the unallocated balance within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project; except that no transfer shall be made from a project by monies from more than one source. \n \nSECTION 9.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 10.  That the City Auditor is authorized to establish proper project accounting numbers as appropriate.\n \nSECTION 11.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 12.  That upon obtaining other funds for the purpose of funding sanitary sewer system capital improvement work, the City Auditor is hereby authorized to repay the Sanitary Sewer Reserve Fund the amount transferred above (Section 3), and said funds are hereby deemed appropriated for such purposes.\n \nSECTION 13.  That the City intends that this Ordinance constitute an \"official intent\" for purposes of Section 1.150-2(e) of the Treasury Regulations, and that the City reasonably expects to reimburse itself for certain Original Expenditures incurred with respect to the Project from the proceeds of obligations to be issued by the City in a principal amount currently estimated to be $2,810,032.68 (the \"Obligations\").\n \nThe City intends to make a reimbursement allocation on its books for the Original Expenditures not later than eighteen months following the later to occur of the date of the Original Expenditure to be reimbursed or the date the Project for which such Original Expenditures were made is \"placed in service\" within the meaning of Treasury Regulations Section 1.150-2(c).  Upon the issuance of the Obligations, the proceeds of such Obligations shall be used to reimburse Sanitary/Sewer Reserve Fund 6102, which is the fund from which the advance for costs of the Project will be made.\n \nSECTION 14.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 14,
    "meeting_date": "2021-05-17",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}