{
  "success": true,
  "vote": {
    "id": 8951,
    "item_number": "0",
    "title": "To authorize the appropriation and expenditure of up to $1,050,000.00 of HOME Investment Partnerships Program (HOME-ARP) funds from the U.S. Department of Housing and Urban Development; to authorize the Director of the Department of Development to enter into a commitment letter, loan agreement, promissory note, mortgage, and restrictive covenant with Touchstone Field Place II in an amount up to $1,050,000.00 for the Touchstone Field Place II project. ($1,050,000.00).",
    "description": "Explanation\n \nBACKGROUND: This ordinance authorizes the appropriation and expenditure of up to $1,050,000.00 of grant funding from the U.S. Department of Housing and Urban Development (HUD), throughh the HOME Investment Partnerships Program American Rescue Plan (HOME-ARP) and authorizes the Director of Development to execute a commitment letter, loan agreement, promissory note, mortgage, and restrictive covenant with Touchstone Field Place II, LLC for the Touchstone Field Place II project. In 2021 the City of Columbus authorized via Ordinance 0828-2021 funding in the amount of $500,000.00 of HOME funds for Touchstone Field Place I, which was part of phase one of the project. This initial phase of the project has been completed and is 100% occupied.\n \nTotal City funding for phase two of the project is $1,552,585.00. Of this amount $1,050,000.00 is found within this ordinance and establishes HOME -ARP funding for the Touchstone Field Place II. A subsequent ordinance will be put forth to City Council in an amount up to $502,585.00 for the remaining HOME-ARP funding of this project to provide supportive services for residents at this location over the course of four years.\n \nTouchstone Field Place II will provide forty-four (44), one-bedroom units of permanent supportive housing prioritized for individuals who meet the State of Ohio’s Permanent Supportive Housing Policy Framework. Of the forty-four (44) units, the City’s contribution to phase two of this project will fund six (6) units. Specifically, all forty-four units will prioritize individuals who meet the HUD definition of chronic homelessness. The property will be located at 2565 Lockbourne Road, on the south side of Columbus. The proposed three-story elevator-served building will be U shaped when the two additional buildings will be constructed then joined. The site will include off-street parking spaces and a large recreational area in the rear with outdoor seating areas. A secured main entrance from the parking area will be the only access point to the Touchstone Field Place II building. Front desk staff will monitor the\nsingle-point entry 24 hours a day 7 days a week. Outdoor cameras will assist with security, the common area spaces in the building will include a community room with a full kitchen, TV lounge, computer room, and an informal meeting area. The first floor will also house office spaces for property management, front desk security, and service engagement staff. Other useful amenities will include a bike room, laundry rooms, fitness room, and wellness office. All of the Touchstone Field Place II units are one-bedroom/one-bath garden-style apartments.\n \nThese units will be made available to individuals who are currently residing at 40 W. Long Street and have met the USHS standards for referral to permanent supportive housing. Permanent supportive housing is housing with linkages to services that help residents successfully maintain housing and rebuild their lives. The target population for Touchstone Field Place II will be men and women who are homeless or at risk of homelessness and are disabled by mental illness, substance addition, dual diagnosis, and or a physical disability. With the preference to serve individuals from the 40 W. Long Street, it is assumed that the housing will be primarily men for multiple years, as the residents being transferred are males.\n \nThe supportive services that will be legislated separately will be managed by Community Housing Network (CHN), the developer of Touchstone Field Place II. CHN has been providing affordable housing to individuals experiencing homelessness, mental illness, addiction, and trauma related issues since 1987. CHN will provide overall program management, tenant-centered property management and housing services (including program operations, administration of subsidies, community relations, maintenance and security) they will also facilitate partner meetings, take the lead in admissions, eviction prevention and training, as well as assist with outreach. CHN’s on-site staff will orient tenants to living in a supportive housing program; assist them with housing-related issues; and provide crisis intervention, conflict resolution, and daily assistance. In addition, residents will also be referred to other agencies for\nmedical and dental needs, material needs, and legal assistance.\n \nCHN will also subcontract with YMCA to provide 24/7 front desk coverage. Front desk staff will orient tenants to life in a supportive housing program, by assisting tenants with housing-related issues and providing crisis intervention and conflict resolution as needed. Residents will also be referred to other agencies for medical/dental health needs, material needs, legal assistance and other needs. \n \nYMCA will provide residents with services that include, but are not limited to, on-going assessments, case management, psychiatric services, medication monitoring, health services, employment services, individual counseling and substance abuse treatment. YMCA has a proven track record of successful Medicaid billing and utilization.\n \nThis legislation represents appropriation for a part of the HOME-ARP Allocation Plan portion of the City’s 2021 HUD Annual Action Plan which was amended, per Ordinance 0459-2023.\n \nContract Compliance: the vendor number is 048127 and expires on 02/14/2026\n \nFiscal Impact: $1,050,000.00 is available from and within the HOME-ARP grant (G442101). The commitment of funds through this legislation is conditioned on compliance with HUD’s environmental review requirements. The funding from HOME-ARP Fund (2201) is only authorized if all HOME review and comment requirements have been met prior to any commitment of funds, as approved by the Responsible Entity Agency Official. An Authorization to Utilize Grant Funds will be received by the City from HUD in advance of the execution of documents for this project.\n \n \n \nTitle\n \nTo authorize the appropriation and expenditure of up to $2,175,000.00 of HOME Investment Partnerships Program (HOME-ARP) funds from the U.S. Department of Housing and Urban Development; and to authorize the Director of the Department of Development to enter into a commitment letter, loan agreement, promissory note, mortgage, and restrictive covenant with Berwyn East Place Senior Housing Limited Partnership in an amount up to $2,175,000.00 for the Berwyn East project. ($2,175,000.00)\nTo authorize the appropriation and expenditure of up to $1,050,000.00 of HOME Investment Partnerships Program (HOME-ARP) funds from the U.S. Department of Housing and Urban Development; to authorize the Director of the Department of Development to enter into a commitment letter, loan agreement, promissory note, mortgage, and restrictive covenant with Touchstone Field Place II in an amount up to $1,050,000.00 for the Touchstone Field Place II project. ($1,050,000.00).\n \n \nBody\n \nWHEREAS, the City of Columbus is a participating jurisdiction of the U.S. Department of Housing and Urban Development; and\n \nWHEREAS, the City of Columbus is the recipient of a one-time grant of $16,433,138.00 from the U.S. Department of Housing Urban Development (HUD) through the American Rescue Plan Act and the HOME Investment Partnerships Program (HOME-ARP) ; and\n \nWHEREAS, the Columbus City Council has approved the amendment to the 2021 Action Plan, per Ordinance 0459-2023, as required by HUD for the authorization of the HOME-ARP Allocation Plan; and\n \nWHEREAS, the Director of the Department desires to support the Touchstone Field Place II project with HOME-ARP funds; NOW, THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ending December 31, 2024, the sum of $1,050,000.00 is appropriated in Fund 2201 (HOME-ARP), from Dept-Div 44-10 (Housing), G442101 (HOME-ARP), object class 05 (Other Expenses) per the account codes in the attachment to this ordinance.\n \nSECTION 2. That the expenditure of $1,050,000.00, or so much thereof as may be needed, is hereby authorized in Fund 2201 (HOME-ARP), Dept-Div 4410 (Housing), G442101 (HOME-ARP), object class 05 (Other Expenses) per the account codes in the attachment to this ordinance.\n \nSECTION 3. That the Director of Development is hereby authorized to enter into a commitment letter, loan agreement, promissory note, mortgage, and restrictive covenant with Touchstone Field Place II LLC., for the Touchstone Field Place II Project in an amount up to $1,050,000.00.\n \n \nSECTION 4. Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6. At the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements.\n \nSECTION 7. The commitment of funds through this legislation is conditioned on compliance with HUD’s environmental review requirements. The funding from HOME Fund (2201) is only authorized if all HOME review and comment requirements have been met prior to any commitment of funds, as approved by the Responsible Entity Agency Official. An Authorization to Utilize Grant Funds will be received by the City from HUD in advance of the execution of documents for this project.\n \nSECTION 8. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 107,
    "meeting_date": "2024-03-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Housing"
    ]
  }
}