{
  "success": true,
  "vote": {
    "id": 8955,
    "item_number": "3",
    "title": "To Celebrate Columbus Recreation and Parks Department’s Conservation Team for Women’s History Month and Recognize the Numerous Contributions of the Conservation Team to the City of Columbus",
    "description": "Title\n \nTo Celebrate Columbus Recreation and Parks Department’s Conservation Team for Women’s History Month and Recognize the Numerous Contributions of the Conservation Team to the City of Columbus\n \n \nBody\n \nWHEREAS, Columbus Recreation and Parks Department created the Conservation Section in 2023.\n \nWHEREAS, Columbus relies on the department’s Conservation Team to be among the best in the country at applying evidence-based management to protect natural resources and provide quality outdoor experiences; and\n \nWHEREAS, Conservation efforts are broken into three areas: Natural resource and asset management: Conserve, preserve and protect the City’s ecosystems, wildlife and cultural features. Outdoor recreation and education: Connecting residents with opportunities to learn about our natural environment and the importance of conservation. Field conservation: Preserving and protecting our natural environment through efforts such as invasive species removal and habitat plantings; and\n \nWHEREAS, the department’s Conservation Team is an all women; and\n \nWHEREAS, the department’s Conservation Team has over 14 different types of professional certificates to support their work; and\n \nWHEREAS, the department’s Conservation Team provided Outdoor Education experiences to over 1,400 participants in 2023; and\n \nWHEREAS, the department’s Conservation Team oversees 20 Nature Preserves throughout the region; and\n \nWHEREAS, the department’s Conservation Team in 2023 cleaned 250 acres of parkland and 9 different streams of litter and removed invasive species from 13.14 acres of land; and\n \nWHEREAS, the City of Columbus, through its Sustainable Columbus office, is committed to imparting equity and environmental justice through strong climate action and is guided by the Columbus Climate Action Plan; and\n \nWHEREAS, the department’s Conservation Team is a critical part of the Columbus Climate Action Plan, which has a community-wide goal of carbon neutrality by 2050 and 45% reduction in emissions by 2050; and now, therefore\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: That this Council does hereby recognize the numerous contributions made by Columbus Recreation and Parks Department’s Conservation Team; and honors the Conservation team during Women’s History Month.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 107,
    "meeting_date": "2024-03-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions",
      "Parks & Recreation"
    ]
  }
}