{
  "success": true,
  "vote": {
    "id": 896,
    "item_number": "SR-9",
    "title": "To authorize the City Attorney to file complaints in order to immediately appropriate and accept the remaining fee simple and lesser real estate necessary to timely complete the Arterial Street Rehabilitation - Hudson Street - I-71 to Cleveland Avenue Phase 1 project; to authorize an expenditure of $7,891.00 from existing ACDI001358-10. ($7,891.00)",
    "description": "EXPLANATION\n \nBACKGROUND: The City’s Department of Public Service (“DPS”) is performing the Arterial Street Rehabilitation - Hudson Street - I-71 to Cleveland Avenue Phase 1 project (“Public Project”). The City must acquire certain fee simple title and lesser real estate located in the vicinity of Hudson Street between I-71 and Cleveland Avenue (collectively, “Real Estate”) in order for DPS to timely complete the Public Project. The City passed Ordinance Number 2822-2019 and 2760-2020 authorizing the City Attorney to acquire the Real Estate. Furthermore, the City also adopted Resolution 0109X-2020 establishing the City’s intent to appropriate the Real Estate. The City’s acquisition of the Real Estate will help make, improve, or repair certain portions of the public right-of-way of Hudson Street between I-71 and Cleveland Avenue which will be open to the public without charge. \n                     \nThe City Attorney, pursuant to Columbus City Code, Section 909.03, served notice to all of the owners of the Real Estate of the (i) Public Project’s public purpose and necessity, and (ii) adoption of Resolution 0109X-2020. However, the City Attorney was unable to either locate some of the Real Estate’s owner(s) or agree with some of the Real Estate’s owner(s) in good faith regarding the amount of just compensation.\n \nCONTRACT COMPLIANCE:  Not applicable.\n \nFISCAL IMPACT: Funding to acquire the Real Estate is available through the Streets and Highways GO Bond Fund, Fund Number 7704 pursuant to existing Auditor’s Certificate ACDI001358-10.\n \nEMERGENCY JUSTIFICATION:  Not applicable.\n \nTITLE\n \nTo authorize the City Attorney to file complaints in order to immediately appropriate and accept the remaining fee simple and lesser real estate necessary to timely complete the Arterial Street Rehabilitation - Hudson Street - I-71 to Cleveland Avenue Phase 1 project; to authorize an expenditure of $7,891.00 from existing ACDI001358-10. ($7,891.00)\n \nBODY\n \nWHEREAS, the City intends to make, improve, or repair certain public right-of-ways by completing the Arterial Street Rehabilitation - Hudson Street - I-71 to Cleveland Avenue Phase 1 project (“Public Project”); and\n                     \nWHEREAS, the City intends for the City Attorney to acquire the necessary fee simple title and lesser real estate located in the vicinity of the public right-of-way of Hudson Street between I-71 and Cleveland Avenue; and\n \nWHEREAS, the City, pursuant to the passage of Ordinance Number 2822-2019 and 2760-2020 and the adoption of Resolution Number 0109X-2020, intends to authorize the City Attorney to spend City funds and file the necessary complaints to immediately appropriate and accept title to the remainder of the Real Estate; and\n \nWHEREAS, the City intends for the Real Estate’s acquisition to help make, improve, or repair certain portions of the public right-of-way of Hudson Street between I-71 and Cleveland Avenue which will be open to the public without charge; and now, therefore:\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the fee simple and lesser real estate associated with the project parcel numbers listed in Section Four (4) of this ordinance (“Real Estate”) are (i) fully described in Resolution 0109X-2020 and incorporated into this ordinance for reference as if rewritten, and (ii) to be immediately appropriated and accepted for the public purpose of the Department of Public Service (“DPS”) timely completing the Arterial Street Rehabilitation - Hudson Street - I-71 to Cleveland Avenue Phase 1 project (“Public Project”).\n \nSECTION 2.  That the City declares, pursuant to the City's power and authority under the Ohio Constitution, Ohio Revised Code Sections 715.01, 717.01, 719.01, and 719.02, the City's Charter, and Columbus City Code Chapter 909, the appropriation of the Real Estate is necessary for the Public Project, because the City was unable to locate the Real Estate’s owner(s) or agree in good faith with the Real Estate’s owner(s) regarding the amount of just compensation to be paid by the City for the Real Estate.\n \nSECTION 3.  That the City intends to obtain immediate possession of the Real Estate for the Public Project.\n \nSECTION 4.  That the City declares that the fair market value of the Real Estate as follows:\n \nPUBLIC PROJECT PARCEL NUMBER(S) (FMVE)\nREAL ESTATE OWNER\nOWNER ADDRESS\n \nParcel 104A-WD (FMVE $300) \nJames D. Beekman, deceased and June L. Beekman, deceased\nAddress unknown- Service by publication\n \nParcel 104B-WD (FMVE $300) \nHenrietta Kiner, deceased, Joan Louise Kiner, aka Joan Kiner Reid, deceased, and Henrietta P. Kiner, deceased / City of Columbus\nAddresses unknown- Service by publication\n \nParcel 110-WD, -T (FMVE $4,014)\nOhio Wholesale Auto Sales, LLC\nc/o Steven L. Clements, Reg. Agent\nP.O. Box 248794\nColumbus, OH 43224\n \nParcel 111-WD (FMVE $300)\nReflections II, Inc. \n4920C Reed Road\nColumbus, OH 43220\n \nParcel 115A-WD (FMVE $300)\nArthur H. Kiner, deceased\nAddress Unknown - Service by publication \n \nParcel 116-T (FMVE $300)\nSOA Properties, LLC\n6146 Lampton Pond Drive\nHilliard, OH 43026\n \n                     AND\n \nStanley T. Harris\n2713 Raphael Drive\nColumbus, OH 43232-7701\n \nParcel 157-T (FMVE $401)\nClarence O. Martin Sr. \n1298 Hudson Street \nColumbus, Ohio 43211 \nAnd publication\n \nParcel 167-T (FMVE $300)\nBrian L. Sharp\n1336 E. Hudson Street\nColumbus, Ohio 43211\nAnd publication \n \nParcel 170-T (FMVE $330)\nDaisy L. Jones\n1345 E. Hudson Street\nColumbus, Ohio 43211\nAnd publication\n \nParcel 223A-WD (FMVE $300)\nClarence M. Kiner et al. \nAddresses unknown - Service by publication\n \n           AND\n \nLanette D. Lipscomb\n1520 E. Hudson Street\nColumbus, Ohio 43211\n          \nAND\n \nDuane Judge Et Al.\n1530 E. Hudson Street\nColumbus, Ohio 43211\n \nParcel 225-T (FMVE $746)\nDeborah Ann Wheat, Donita D. Judge, Toya L. Jordan, \nDonald E. Judge, Jr., Duane M. Judge Darryl V. Judge, and Kevin J. Judge\n1530 E. Hudson Street\nColumbus, Ohio 43211\n \nParcel 231A1-WD (FMVE $300) \nPatrick Mcallister, Dec’d\nAddress unknown - Service by publication\n \nSECTION 5.  That the City Attorney is authorized to file petitions necessary to appropriate the Real Estate in the appropriate court of common pleas and impanel a jury to inquire and assess the amount of just compensation for the Real Estate.\n \nSECTION 6.  That the Real Estate’s acquisition for the Public Project is required to make, improve, or repair certain portions of the public right-of-way of Hudson Street between I-71 and Cleveland Avenue and associated appurtenances, which will be open to the public without charge.\n \nSECTION 7.  That the City Attorney, in order to pay for the Real Estate’s acquisition and appropriation costs for the Public Project, is authorized to spend up to Seven Thousand Eight Hundred Ninety-one 00/100 U.S. Dollars ($7,891.00), or so much as may be needed from existing Auditor’s Certificate ACDI001358-10.          \n \nSECTION 8.  That the City Auditor is authorized to make any accounting changes to revise the funding source associated with this ordinance.\n  \nSECTION 9.  That this ordinance shall take effect and be in full force and effect from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 14,
    "meeting_date": "2021-05-17",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Housing",
      "Property & Real Estate"
    ]
  }
}