{
  "success": true,
  "vote": {
    "id": 8964,
    "item_number": "CA-6",
    "title": "To authorize the Director of the Finance and Management Department to associate all General Budget Reservations resulting from this ordinance with the appropriate Universal Term Contract/Purchase Agreement (UTC/PA) for Cisco Voice license and WebEx subscriptions, to authorize the expenditure of $270,486.36 from the Information Services Division, Information Services Operating Fund, and to declare an emergency ($270,486.36).",
    "description": "Explanation\n \nBACKGROUND: \nThis ordinance authorizes the Director of the Finance and Management Department, on behalf of the Department of Technology (DoT), to associate all General Budget Reservations resulting from this ordinance with the appropriate Universal Term Contract/Purchase Agreement (UTC/PA) for the procurement of Cisco Voice licensing and WebEx subscriptions. \nCisco has been established as a citywide standard for our VoIP environment. Cisco is best known for their VoIP phones and networking equipment worldwide. The City migrated to Cisco VoIP telephone solution with the goal of dramatically saving on increasing costs related to aged telephone services provisioned by the traditional carriers over the copper wire. Cisco phones have widely been deployed throughout the City and continued efforts remain in place to depreciate existing aged phones and or phone systems. \nThe following Purchase Agreement association requires approval by City Council in order for the Division to expend more than $100,000.00 in a fiscal year per City Code 329.19(g):\n \nCDW Government: PA005605, Upgrade Network & VoIP Communications\nCDW Government is not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.\n \nCONTRACTOR COMPLIANCE:\nThe contract compliance number for CDW Government is CC034427 and expires 1/3/2025.\nFISCAL IMPACT: \nFunding in the amount of $270,486.36 is budgeted and available in the Department of Technology’s, Information Services Division’s Operating Fund, Fund 5100. \nEMERGENCY DESIGNATION:\nEmergency action is requested to meet the special pricing date offered by the vendor.  After the date set by the vendor the cost for the services will increase.\n \n \nTitle\n \nTo authorize the Director of the Finance and Management Department to associate all General Budget Reservations resulting from this ordinance with the appropriate Universal Term Contract/Purchase Agreement (UTC/PA) for Cisco Voice license and WebEx subscriptions, to authorize the expenditure of $270,486.36 from the Information Services Division, Information Services Operating Fund, and to declare an emergency ($270,486.36).\n \n \nBody\n \nWHEREAS, the Department of Technology has a need to renew its VoIP licenses and WebEx subscriptions; and \nWHEREAS, the Purchasing Office established PA005605 for Upgrade Network & VoIP Communications with CDW Government; and\n \nWHEREAS, it is necessary to authorize the expenditure of up to $270,486.36 from the Information Services Division’s Operating Fund, Fund 5100 to purchase Cisco Voice licensing and WebEx subscriptions; and \n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Technology to authorize the Director of Finance and Management to associate all general budget reservations with the appropriate universal term contracts with CDW Government in accordance with the terms, conditions and specifications of PA005605 on file in the Purchasing Office; and\nWHEREAS, an emergency exists in the usual daily operation of the Department of Technology in that it is necessary to provide funding immediately for continuation of these necessary services to meet the special pricing date offered by the vendor after which date, the cost for services will increase, all for the immediate preservation of the public health, peace, property, and safety and welfare; and now, therefore\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1.  That the Director of Finance and Management, on behalf of the Department of Technology, be and is hereby authorized to associate all General Budget Reservations resulting from this ordinance with the appropriate Universal Term Contract/Purchase Agreement (UTC/PA) for the procurement of Cisco Voice licensing and WebEx subscriptions at a cost of $270,486.36.\nSECTION 2. That the expenditure of $270,486.36 or so much thereof as may be necessary is hereby authorized in Fund 5100 (Information Services Operating Fund), Dept-Div 4702 (Indirect Charge) in Object Class 03 (Purchased Services) per the account codes in the attachment to this ordinance.  (see 0784-2024 EXP)\nSECTION 3. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\nSECTION 4. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\nSECTION 5. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 107,
    "meeting_date": "2024-03-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}