{
  "success": true,
  "vote": {
    "id": 8992,
    "item_number": "CA-35",
    "title": "To authorize the Director of the Department of Public Utilities to modify and increase the contract with Andover Associates, Ltd. for the Department of Sewerage and Drainage Roof Replacements project; to authorize an amendment to the 2023 Capital Improvements Budget; and to authorize an expenditure of up to $800,000.00 within the Sanitary Bond Fund to pay for the contract modification.  ($800,000.00)",
    "description": "Explanation\n1. BACKGROUND\nThis ordinance authorizes the Director of Public Utilities to enter into a planned contract modification for professional engineering services with Andover Associates, Ltd. for the DOSD Roof Replacements No. 3 contract, CIP #650234-100200, in an amount up to $800,000.00.\n \nThe Department of Public Utilities (DPU) Division of Sewerage and Drainage (DOSD) has identified numerous deteriorated roofs on its facilities that require replacement.  Professional engineering services are needed for the design of the various roof replacements, assistance during the bidding process, and also for technical services during construction. This work for DOSD is part of the City’s continuing program to upgrade its treatment facilities, provide efficient, reliable, cost-effective operations, and enhance personnel safety. The work will be carried out on a task order basis with scope and fee defined for each roof that is replaced.\n \nThere are two modifications planned for this contract. This is the first of two modifications. \n \nCommunity Planning Area:  99 Citywide.\n \n1.1 Amount of additional funds to be expended:  $800,000.00\nOriginal Contract Amount:                            $250,000.00 (Ord. 0134-2023; PO367754)\n Modification #1:                                          $800,000.00 (Current)\n Modification #2:                                          $550,000.00 (Future) \nTotal:                                                          $1,600,000.00\n \n1.2. Reason other procurement processes are not used:  \nThis contract was bid through the City’s RFP process with the intention of designing all of the needed roof replacements.  It was originally legislated with two planned modifications to add funding.  This is the first of those modifications.  Another procurement process is not required.\n \n1.3. How cost of modification was determined:\nThe cost of this modification was determined by negotiations between Andover Associates, Ltd., and Department of Public Utilities project staff based upon the existing contract labor titles, maximum labor rates, allowable contract expenses, and the time estimated to be needed to perform assigned tasks.\n \n2. ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT  \nThe performance of this project’s work activities to address replacement and repair of DPU roofs and roofing components will prevent process equipment, electrical components, and other interior furnishings and equipment from moisture damage.  Replacement costs of items due to failed roofing systems could become a major impact to the budget.  No community outreach or environmental factors are considered for this project.\n \n3. CONTRACT COMPLIANCE INFO:  \nAndover Associates, Ltd.’s contract compliance number is CC008980 and expires 4/28/25.\n \nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against Andover Associates, Ltd.\n \n4. MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract was established with a City of Columbus MBE/WBE Program goal of 16.0% as assigned by the City’s Office of Diversity and Inclusion (ODI).  The consultant is required to achieve this goal even with contract modifications.  Andover Associates, Ltd. is classified with ODI as a WBE company.  Andover Associates, Ltd. anticipates performing the work on this contract modification with the use of one subconsultant that is classified by ODI as a majority company.  The MBE/WBE percentage for this modification is expected to be 80%.\n \nAs part of their proposal, Andover Associates, Ltd. has proposed the following subcontractor to perform contract work:\n \nCompany Name                                            City/State                                     ODI Certification Status\nT&M Associates                                          Columbus, Ohio                                       MAJ\n                     \nThe certification of Andover Associates, Ltd. and the above company was in good standing at the time the contract modification was executed.\n \n 5. FISCAL IMPACT\nFunds are available and appropriated in the Sanitary Bond Fund, Fund 6109.  An amendment to the 2023 Capital Improvement Budget is needed to align budget authority with the proper project.  \n \nTitle\nTo authorize the Director of the Department of Public Utilities to modify and increase the contract with Andover Associates, Ltd. for the Department of Sewerage and Drainage Roof Replacements project; to authorize an amendment to the 2023 Capital Improvements Budget; and to authorize an expenditure of up to $800,000.00 within the Sanitary Bond Fund to pay for the contract modification.  ($800,000.00)\n \nBody\nWHEREAS, the Department of Public Utilities is engaged in the DOSD Roof Replacements No. 3 Mod #1 project; and\n \nWHEREAS, Contract No. PO367754 was authorized by Ordinance No. 0134-2023 for the DOSD Roof Replacements No. project; and\n \nWHEREAS, a planned contract modification is needed to fund continued engineering services; and\n \nWHEREAS, an amendment to the 2023 Capital Improvement Budget is needed to align budget authority with the proper project; and\n \nWHEREAS, it is necessary for Council to authorize the Director of Public Utilities to modify the professional engineering services agreement with Andover Associates, Ltd. for the DOSD Roof Replacements No. 3 project to add funds for these services; and \n \nWHEREAS, it is necessary to expend funds from the Sanitary Bond Fund, Fund 6109, to pay for the contract modification; NOW THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2023 Capital Improvement Budget authorized by Ordinance 1711-2023 be amended as follows to establish sufficient budget authority for this project:\n \nFund / Project Number / Project Name / Current / Change / Amended\n6109 / 650234-100100 / DOSD Roof Replacements, No. 2 (Voted Sanitary Carryover) / $ 2,385,796.00 / $1,585,796.00 / ($800,000.00)\n6109 / 650234-100200 / DOSD Roof Replacements, No. 3 (Voted Sanitary Carryover) / $750,000.00 / $1,550,000.00 / $800,000.00\n \nSECTION 2.  That an expenditure of $800,000.00, or so much thereof as may be needed, is hereby authorized from the Sanitary Bond Fund, Fund 6109, to pay for this contract modification per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That the Director of Public Utilities is hereby authorized to modify and increase the professional engineering services contract with Andover Associates, Ltd., 1335 Dublin Road Suite 223A, Columbus, Ohio  43215; for the DOSD Roof Replacements No. 3 project in an amount up to $800,000.00.\n \nSECTION 4.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 7.  That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 107,
    "meeting_date": "2024-03-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}