{
  "success": true,
  "vote": {
    "id": 9010,
    "item_number": "LA",
    "title": "To authorize the Director of the Department of Development to submit the Single Family Tax Credit Application as Project Development Owner to the Ohio Housing Finance Agency; to authorize the Department of Development to designate Columbus Housing Partnership, Inc. dba Homeport on the Development Team as the lead applicant and Designated Reporter; and to declare an emergency. ($0.00)",
    "description": "Explanation\nBACKGROUND:  The Single Family Tax Credit (SFTC) program leverages public-private partnerships to increase the inventory of affordable, single-family housing for Ohio’s growing workforce. The program provides $50 million a year for four years to fill the financing gap to develop or substantially rehabilitate housing in Ohio. Proposed projects may receive up to $50,000 in tax credits per dwelling. The tax credits may be claimed upon completion of the project. Each dwelling in a development project must be sold to a qualified buyer who will use it as their primary residence. The sale price of the house must be affordable (i.e., no more than 30% of the qualified buyer’s monthly income). Additionally, each dwelling in the project must remain affordable for 10 years after the initial sale.\nThis ordinance will Grant authority to the Director of the Department of Development to be the Project Development Owner (PDO) for a 24-unit single family homeownership project in American Addition to serve families earning up to 120% AMI.   Per the Ohio Housing Finance Agency guidelines, as the PDO, this legislation will also give the Director of Development the authority to designate another member (Columbus Housing Partnership Inc. dba Homeport) of the Development Team as the lead applicant and Designated Reporter by providing sufficient proof that the PDO has approved such designee. \n \nThe City of Columbus and Homeport have a long standing relationship with the community of American Addition, where local and federal funds have been invested in infrastructure, such as roads, sewer and water, and in the development of new single family homes. This new funding will allow continuation of the project with the development of 24 new units. The city is working with Homeport to integrate net zero elements into the design of the homes, thus lowering the energy costs for the buyers. \nOHFA introduced the Single Family Tax Credit as the initial tax credit offering for single family development, and has prepared an application for units of government to submit for SFTC award consideration.  The deadline for said application is April 5, 2024.  The City of Columbus will use HOME funds and Bond funds as gap financing for the project.\n \nEmergency action is requested to authorize the Department of Development to be the Project Development Owner and designate Homeport to the Development team as the lead applicant and Designated Reporter on the SFTC application prior to the April 5, 2024 State application deadline.\n                 \nFiscal Impact:   No funding is required for this legislation.\n \nTitle\nTo authorize the Director of the Department of Development to submit the Single Family Tax Credit Application as Project Development Owner to the Ohio Housing Finance Agency; to authorize the Department of Development to designate Columbus Housing Partnership, Inc. dba Homeport on the Development Team as the lead applicant and Designated Reporter; and to declare an emergency. ($0.00)     \n \nBody\nWHEREAS, the Single Family Tax Credit (SFTC) program leverages public-private partnerships to increase the inventory of affordable, single-family housing for Ohio’s growing workforce; and\n          \nWHEREAS, this ordinance will Grant authority to the Director of Development to be the Project Development Owner (“PDO”) for a 24-unit single family homeownership project in American Addition to serve families earning up to 120% AMI; and\n  \nWHEREAS, per the Ohio Housing Finance Agency (OHFA) guidelines and Ohio Revised Code Section 175.17, this legislation will also give the Director of Development as the PDO the authority to designate another member of the Development Team, Columbus Housing Partnership, Inc. d/b/a Homeport (Homeport) as the lead applicant and Designated Reporter by providing sufficient proof that the PDO has approved such designee; and\n     \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to authorize the Department of Development to be the Project Development Owner for purposes of the SFTC Application to OHFA, and designate Homeport to the Development team as the lead applicant and Designated Reporter prior to the April 5, 2024 State application deadline, such action being necessary for the immediate preservation of the public health, peace, property, and safety; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     That the Director of the Department of Development is authorized to submit the Single Family Tax Credit Application as Project Development Owner to the Ohio Housing Finance Agency, and the Director of the Department of Development is authorized to designate Homeport to the Development team as the lead applicant and Designated Reporter per Ohio Revised Code Section 175.17. \n \nSECTION 2.   That for the reasons stated in the Preamble hereto, which is hereby made a part hereto, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after passage and approval by the Mayor or ten days after the passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 107,
    "meeting_date": "2024-03-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Appointments",
      "Budget & Finance",
      "Emergency Services"
    ]
  }
}