{
  "success": true,
  "vote": {
    "id": 9029,
    "item_number": "SR-26",
    "title": "To authorize the Director of the Department of Public Utilities to enter into a construction contract with D & M Painting Corp. for the Rome-Hilliard West Tank Painting Improvements project; to authorize an amendment to the 2023 Capital Improvement Budget; to authorize the transfer of cash and appropriation between projects within the Water Bond Fund; and to authorize the expenditure of up to $1,734,758.50 for the project.  ($1,734,758.50)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Utilities to enter into a construction contract with D & M Painting Corp. for the Rome-Hilliard West Tank Painting Improvements project, C.I.P. Number 690477-100020, in an amount up to $1,732,758.50, and to establish an encumbrance to pay the Department of Public Service for prevailing wage services in an amount up to $2,000.00, for a total expenditure of $1,734,758.50. \n \nThis project provides painting improvements for the maintenance of a steel elevated water storage tank that has a 2 million gallon capacity.  These improvements will keep this tank in optimal condition and prolong its service life.  Regular maintenance inspections have determined that the Rome-Hilliard West tank exterior needs to be blasted and recoated at this time. The interior wet ceiling and spots of the interior dry area coating systems also need to be blasted and recoated.  The project will also include various safety improvements such as fall protection tie-off lugs on the roof and a rooftop handrail opening safety gate.\n \nThe Community Planning Area is 36 - Far West.\n \nTIMELINE:  All work shall be completed within 180 calendar days of the Notice to Proceed. The City anticipates issuing a Notice to Proceed in May 2024.\n \nESTIMATED COST OF PROJECT:  The bid amount and proposed award amount is $1,732,758.50,  including a 10% construction contingency amount that will be utilized to fund needed and approved changes in the work.  No contract modifications are anticipated at this time; however, construction exigency might later compel modification of this contract if unforeseen difficulties are encountered.\n \nCost summary: \n \nOriginal Contract                                               $1,732,758.50\nFuture Anticipated Needs                        $            0.00\nCONTRACT TOTAL                                  $1,732,758.50\nPrevailing Wage Charge                          $      2,000.00\n                                                                                             $1,734,758.50\n \n2.  ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT\nThere are currently 38 water tanks in the distribution system and 26 of them are maintained by the City of Columbus, Division of Water.  To keep these tanks in optimal condition, each year tank interiors or exteriors are identified to be recoated.  Special consideration towards environmentally friendly operations will be implemented, one of which is the recycling of the Garnet abrasive blast media, which results in significantly reducing the volume of waste sent to the landfill. \n \n3.  BID INFORMATION\nThis project was formally advertised on the Vendor Services and Bid Express websites from 12/21/23 through January 24, 2024.   Five bids were received:\n \n     Name                                          Bid Amount________City/State                            Status                     \nD & M Painting Corp.                                            $1,732,758.50           Washington, PA             MAJ\nAmerican Suncraft Co., Inc.                           $1,773,442.00             Medway, OH                          MAJ\nClearcreek Coatings, LTD                   $1,929,550.00           New Carlisle, OH            MAJ                     \nViking Painting, LLC                                                $2,045,230.00             La Vista, NE                 MAJ\nSeven Brothers Painting, Inc.                       $1,474,500.11         Shelby County, MI             MAJ                     \n \nSeven Brothers Painting, Inc. was deemed Non-Responsive for not being construction  pre-qualified at time of bid opening.  All other bids were deemed responsive. \n \nD & M Painting Corp.’s certification was in good standing at the time of the contract award.\n \n4.  CONTRACT COMPLIANCE INFORMATION\nD & M Painting Corp.’s contract compliance number is CC001949 and expires 2/5/26.  Searches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against D & M Painting Corp. \n \n5.  MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract opportunity was submitted to the City’s Office of Diversity and Inclusion (ODI) for review and assignment of an MBE/WBE goal prior to bidding.  ODI determined there was not an opportunity for MBE/WBE participation in this contract and did not assign a goal.  This contract was not bid with a City of Columbus MBE/WBE Program goal and the requirements of the City’s MBE/WBE Program are not applicable to this contract.\nD & M Painting Corp. does not have any subcontractors performing contract work on this project.\n \n6.  PRE-QUALIFICATION STATUS\nD & M Painting Corp. has met code requirements with respect to pre-qualification, pursuant to relevant sections of Columbus City Code Chapter 329. \n \n7.  FISCAL IMPACT\nFunding in the amount of $1,734,758.50 is available and appropriated within the Water Bond Fund, Fund 6006.  An amendment to the 2023 Capital Improvement Budget is needed to align budget authority with the proper project.  A transfer of cash and appropriation between projects within the Water Bond Fund is needed to align cash and appropriation with the proper project.\n \nTitle\nTo authorize the Director of the Department of Public Utilities to enter into a construction contract with D & M Painting Corp. for the Rome-Hilliard West Tank Painting Improvements project; to authorize an amendment to the 2023 Capital Improvement Budget; to authorize the transfer of cash and appropriation between projects within the Water Bond Fund; and to authorize the expenditure of up to $1,734,758.50 for the project.  ($1,734,758.50)\n \nBody\nWHEREAS, the Department of Public Utilities is engaged in the Rome-Hilliard West Tank Painting Improvements project; and\n \nWHEREAS, five bids for the Rome-Hilliard West Tank Painting Improvements project were received and opened on 1/24/24; and\n \nWHEREAS, it is necessary to authorize the Director of the Department of Public Utilities to enter into a construction services contract with D & M Painting Corp. for the Rome-Hilliard West Tank Painting Improvements project; and \n \nWHEREAS, the 2023 Capital Improvements Budget must be modified to align budget authority with the proper project; and\n \nWHEREAS, it is necessary to transfer cash and appropriation between projects within the Water Bond Fund, Fund 6006, to align cash and appropriation with the proper project; and\n \nWHEREAS, it is necessary to expend funds to pay for this project; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2023 Capital Improvements Budget authorized by Ordinance 1711-2023 be amended as follows to establish sufficient budget authority for this project:\n \nFund / Project Number / Project Name (Funding Source) / Current Authority / Revised Authority / Change \n6006 / 690502-100001 / Fourth Water Plant Transmission Main (Voted Water Carryover) / $1,141,662.00 / $0.00 / ($1,141,662.00) \n6006 / 690502-100000 / Dublin Road 30” Water Line (Voted Water Carryover) / $716,102.00 / $123,005.00 / ($593,097.00)\n \n6006 / 690477-100020 / Rome-Hilliard West Tank Painting Improvements (Voted Water Carryover) / $396,719.00 / $2,131,478.00 / $1,734,759.00\n \nSECTION 2.  That the transfer of $1,734,758.50, or so much thereof as may be needed, is hereby authorized within the Water Bond Fund, Fund 6006, per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That the Director of Public Utilities is hereby authorized to enter into a construction services contract for the Rome-Hilliard West Tank Painting Improvements project with D & M Painting Corp., 1500 Amity Ridge Road, Washington, PA 15301, in an amount up to $1,732,758.50, in accordance with the terms and conditions of the contract on file in the Department of Public Utilities; and to pay the Department of Public Service up to $2,000.00 for prevailing wage services.\n \nSECTION 4.  That the expenditure of up to $1,734,758.50, or so much thereof as may be needed, is hereby authorized from the Water Bond Fund, Fund 6006, per the accounting codes in the attachment to this ordinance.\n \nSECTION 5.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 7.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 8.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 107,
    "meeting_date": "2024-03-25",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}