{
  "success": true,
  "vote": {
    "id": 904,
    "item_number": "2",
    "title": "To honor, recognize, and celebrate May 2021 as Asian American and Pacific Islander Heritage Month in Columbus, Ohio.",
    "description": "Title\nTo honor, recognize, and celebrate May 2021 as Asian American and Pacific Islander Heritage Month in Columbus, Ohio.\n \nBody\nWHEREAS, Asian American and Pacific Islander (AAPI) Heritage Month is observed annually in May to celebrate the contributions that generations of AAPIs have made to American history, society, and culture; and\n                     \nWHEREAS, AAPI Heritage Month was originally founded by the United States 95th Congress through multiple resolutions as Asian/Pacific American Heritage Week and received its first presidential proclamation in 1979. Later President George H.W. Bush declared May 1990 as the first Asian/Pacific American Heritage Month. May was permanently designated as AAPI Heritage Month in 1992; and\n \nWHEREAS, the Federal Asian Pacific American Council selected Advancing Leaders Through Purpose-Driven Service as the theme of AAPI Heritage Month for May 2021; and\n \nWHEREAS, over 50,000 AAPIs live in Columbus and contribute to Columbus’ vibrancy and growth as leaders in business, science, education, arts, healthcare, and community service; and\n \nWHEREAS, the COVID-19 pandemic has prompted an increase in racist and xenophobic rhetoric. The “Stop AAPI Hate” reporting center received over 6,500 incident reports from March 2020 to 2021, a large increase from previous years; and\n \nWHEREAS, AAPI communities continually face systemic barriers to economic justice, health equity, educational attainment, and personal safety; and\n \nWHEREAS, on March 16, 2021, there was a tragic shooting targeting AAPI community members and the Columbus City Council responded by passing a resolution condemning anti-Asian hate, discrimination, and violence. These incidents don’t happen in isolation but are interconnected with what is happening across the nation and globe in regards to ongoing oppression, discrimination, and prejudice; and\n \nWHEREAS, Columbus City Council reaffirms our commitment to uplifting AAPI voices, to learning about the complex and rich histories of Asians and AAPIs in the United States, and celebrating the countless contributions of these communities in the past and present; now, therefore\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS:  That this Council does hereby honor, recognize, and celebrate May 2021 as Asian American and Pacific Islander Heritage Month in Columbus, Ohio.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 15,
    "meeting_date": "2021-05-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}