{
  "success": true,
  "vote": {
    "id": 9046,
    "item_number": "CA-3",
    "title": "To Congratulate Dorsey Hager as the 2024 George Meany Awards Community Service Award Recipient.",
    "description": "Title\n \nTo Congratulate Dorsey Hager as the 2024 George Meany Awards Community Service Award Recipient.\n \nBody\n \nWHEREAS, the George Meany Awards Banquet, the largest labor recognition of its kind in the country, is a night for the Central Ohio AFL-CIO and the United Way Community Services Department to recognize local business and labor leaders who have given outstanding volunteer service to the community; and\n \nWHEREAS, the George Meany Awards, named after the late George Meany, former President of the national AFL-CIO, are presented by the Central Ohio AFL-CIO to a labor person for outstanding leadership and support of health, welfare, and recreation services to the Central Ohio Community; and\n \nWHEREAS, Mr. Hager’s involvement in organized labor began in 1994 when he became an apprentice member with the International Association of Heat and Frost Insulators Local 50. Upon completing his apprenticeship, he became a journeyman insulator; and\n \nWHEREAS, in December 2000, he took his first leadership position when was elected Financial Secretary. Soon after, in December 2003, he was elected Business Manager, a role he served 11 years in; and\n \nWHEREAS, in March 2014, Mr. Hager was elected by his peers to his current position as the Executive Secretary-Treasurer of the Columbus/Central Ohio Building & Construction Trades Council. In this role, he has made it a priority to promote union construction in Central Ohio and to create partnerships between unions, contractors, and owners to ensure union construction jobs; and \n \nWHEREAS, Mr. Hager has dedicated his time to service through his participation and leadership on various boards including, the Workforce Development Board of Central Ohio, the Ohio Consumer Council, and as the Vice-President of Creating Central Ohio Futures, underscoring his steadfast commitment to uplifting communities through the power of organized labor; now therefore,\n \nBE IT RESOLVED BY THE COUNCIL OF THE CITY OF COLUMBUS: \nThat we hereby congratulate Dorsey Hager as the 2024 George Meany Awards Community Service Award recipient.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 108,
    "meeting_date": "2024-04-08",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Ordinances & Resolutions"
    ]
  }
}