{
  "success": true,
  "vote": {
    "id": 9054,
    "item_number": "CA-11",
    "title": "To authorize the Director of the Department of Finance and Management to execute those documents necessary to transfer ownership of a transmitter system, VHF antenna, and associated lines and cables, to the U.S. Department of Commerce, National Oceanic and Atmospheric Administration that have no further value to the City; and to waive the provisions of Columbus City Code regarding the sale of City-owned personal property.",
    "description": "Explanation\n \nBackground: The City of Columbus currently owns and maintains a transmitter system, VHF antenna, and associated lines and cables located on the roof of the Rhodes Tower at 30 E. Broad Street used by the National Oceanic and Atmospheric Administration (NOAA) for its emergency notification operations for the surrounding region. The equipment is not utilized by the City of Columbus, or the Department of Public Safety, Division of Support Services and is of no further value to the City. NOAA has requested that the City transfer ownership and the maintenance of the equipment to NOAA.  It has been determined that the transfer of the ownership of and maintenance responsibility for this equipment to the NOAA is in the City’s best interest and is recommended. \n \nFiscal Impact: No funds are required. \n \nTitle\n \nTo authorize the Director of the Department of Finance and Management to execute those documents necessary to transfer ownership of a transmitter system, VHF antenna, and associated lines and cables, to the U.S. Department of Commerce, National Oceanic and Atmospheric Administration that have no further value to the City; and to waive the provisions of Columbus City Code regarding the sale of City-owned personal property.\n \n \nBody\n \nWHEREAS, the City owns and maintain of certain personal property located on the roof of the Rhodes Tower at 30 E. Broad Street, identified as a transmitter system, VHF antenna, and associated lines and cables used in collaboration with the National Oceanic and Atmospheric Administration (NOAA) operations; and \n \nWHEREAS, the City the City no longer uses the equipment for its operations and it is of no further value to the City; and \n \nWHEREAS, NOAA has requested that the City transfer of the ownership and the maintenance of the equipment to NOAA for its continued use for its emergency notification operations; and\n \nWHEREAS, after investigation by the City, it has been determined that it is in the best interests of the City to transfer ownership of the equipment to the U.S. Department of Commerce, National Oceanic and Atmospheric Administration; and\n \nWHEREAS, it is necessary in the usual daily operation of the Department of Finance and Management to authorize the Director to execute, on behalf of the City, those documents necessary to transfer ownership of the transmitter system, VHF antenna, and associated lines and cables to the U.S. Department of Commerce, National Oceanic and Atmospheric Administration; now, therefore;\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSection 1. That the Director of the Department of Finance and Management is hereby authorized and directed to execute those documents, as approved by the Department of Law, necessary to transfer ownership of the transmitter system, VHF antenna, and associated lines and cables located on top of Rhodes Tower at 30 E. Broad Street to the U.S. Department of Commerce, National Oceanic and Atmospheric Administration.\n \nSection 2. That the Council of the City of Columbus finds it is in the best interests of the City to waive City Code Section 329.34 Sale of City-owned personal property, and it is hereby waived to permit the transfer of the equipment specified in SECTION 1 to the U.S. Department of Commerce, National Oceanic and Atmospheric Administration.\n \nSection 3.                      That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 108,
    "meeting_date": "2024-04-08",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Property & Real Estate"
    ]
  }
}