{
  "success": true,
  "vote": {
    "id": 9056,
    "item_number": "CA-13",
    "title": "To authorize the appropriation and expenditure of FY 2023 Department of Finance and Management - Grants Management Administration funds in the amount of $35,262.99 (Fund 2248); to authorize and direct the Director of the Department of Finance and Management to pay outstanding invoices for services rendered by Stone Environmental Engineering and Science Inc.; and to declare an emergency. ($35,262.99)",
    "description": "Explanation\n \n \nBACKGROUND: This ordinance authorizes the Director of the Department of Finance and Management to establish a purchase order with CAP STONE & Assoc Inc. (dba and referred to throughout as Stone Environmental Engineering and Science Inc.) for environmental review services. PO377372 was established with the passage of Ordinance 0478-2023. PO377372 was created with FY 2023 Community Development Block Grant (CDBG) funds. \n \nOrdinance 2444-2023 authorized a modification to the contract with Stone Environmental Engineering and Science Inc. to add $30,000 of HOME Investment Partnership (HOME) funds to the contract. These funds were appropriated and will be used to complete an expense correction for HOME eligible expenses and will make $30,000 of CDBG funds available for expenditure again. \n \nThere are now outstanding invoices from Stone Environmental Engineering and Science Inc. in the amount of $35,262.99 for services rendered during the contract period. \n \nThis ordinance is needed to authorize the expenditure of FY 2023 CDBG Grants Management Administration funds that were appropriated through Ordinances 3360-2022 and 0996-2023 to pay these outstanding invoices. This Ordinance will allow the Department of Finance and Management to issue a new purchase order with the $30,000 of restored CDBG funds and $5,262.99 of additional CDBG administration budget funds for a total purchase order in the amount of $35,262.99 for services rendered during the contract period. \n \n \nFISCAL IMPACT:  This ordinance will authorize the appropriation and expenditure of $35,262.99 from the 2023 Community Development Block Grant Fund (Fund 2248).\n \nEMERGENCY DESIGNATION: An emergency exists in the usual daily operation of the Department of Finance and Management in that it is immediately necessary to authorize the Director to pay outstanding invoices so that Stone Environmental Engineering and Science Inc. will have the ability to continue assisting the Department of Finance and Management with preparing environmental review records and avoid disruption in providing such services, to comply with federal requirements, and for the immediate preservation of the public health, peace, property, safety and welfare. \n \n \nTitle\n \nTo authorize the appropriation and expenditure of FY 2023 Department of Finance and Management - Grants Management Administration funds in the amount of $35,262.99 (Fund 2248); to authorize and direct the Director of the Department of Finance and Management to pay outstanding invoices for services rendered by Stone Environmental Engineering and Science Inc.; and to declare an emergency. ($35,262.99)\n \n \nBody\n \nWHEREAS, the City of Columbus is an entitlement community and a Participating Jurisdiction of the U.S. Department of Housing and Urban Development, and the City is a current recipient of Community Development Block Grant funds from HUD; and\n \nWHEREAS, an environmental review is the process of reviewing a project and its potential environmental impacts to determine whether it meets federal, state, and local environmental standards; and\n \nWHEREAS, the environmental review process is required for all HUD-assisted projects to ensure that the proposed project does not negatively impact the surrounding environment and that the property site itself will not have an adverse environmental or health effect on end users; and\n \nWHEREAS, the Department of Finance and Management utilized a Request for Proposals (RFP) process to identify and assess qualified firms for providing environmental review services; and \n \nWHEREAS, proposals were submitted in response to RFQ015377 in accordance with the relevant provisions of Chapter 329 of City Code pertaining to professional services contracts, through which process Stone Environmental Engineering and Science Inc. received the highest overall score; and\n \nWHEREAS, it became necessary in the usual daily operation of the Department of Finance and Management to authorize the Director of Finance and Management to enter into a contract with Stone Environmental Engineering and Science Inc., in accordance with the terms, conditions and specifications of Solicitation Number: RFQ015377 on file in the Purchasing Office; and\n \nWHEREAS, Ordinance 0478-2023 authorized the Director of Finance and Management to enter into a professional services contract with Stone Environmental Engineering and Science Inc. (PO377372) to assist the City in preparing Environmental Review Records in the amount of $57,000.00 in FY 2023 CDBG funds for the time period commencing January 1, 2023 and ending December 31, 2023; and\n \nWHEREAS, Ordinance 2444-2023 authorized the Director of Finance and Management to modify that contract by adding funds in the amount of $30,000.00 in HOME funds; and\n \nWHEREAS, it is necessary to authorize the appropriation and expenditure of $35,262.99 in FY 2023 CDBG Grants Management Administration funds in order to pay outstanding invoices for services rendered during the contract period; and \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Finance and Management in that it is immediately necessary to authorize the Director to pay these outstanding invoices so that Stone Environmental Engineering and Science, Inc. will have the ability to continue assisting the Department of Finance and Management with preparing environmental review records and avoid disruption in providing such services, for the immediate preservation of the public health, peace, property, and safety; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ending December 31, 2024, the sum of $35,262.99 is appropriated in Fund 2248 Community Development Block Grant Fund per the account codes in the attachment to this ordinance.\n \nSECTION 2.  That the expenditure of $35,262.99 is hereby authorized within the CDBG fund 2248 per the accounting codes in the attachment to this ordinance. \n \nSECTION 3.  That the Director of the Department of Finance and Management is hereby authorized to pay outstanding invoices in the amount of $35,262.99 for environmental review services rendered during the 2023 contract period. \n \nSECTION 4.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 108,
    "meeting_date": "2024-04-08",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services",
      "Grants"
    ]
  }
}