{
  "success": true,
  "vote": {
    "id": 9079,
    "item_number": "CA-36",
    "title": "To amend Ordinance No. 3549-2023, passed by Columbus City Council on December 11, 2023, to allow for the correction of the date in which food and non-alcoholic beverage related expenditures would be allowable within the Beneficiary Agreement with the Community Shelter Board; and to declare an emergency. ($0.00)",
    "description": "Explanation\n \nBACKGROUND:   This legislation authorizes an amendment to Ordinance No. 3549-2023, passed by Columbus City Council on December 11, 2023, to allow for a correction in the date that food and non-alcoholic beverage related expenditures would be allowable.  The initial ordinance stated the expenditures related to food and non-alcoholic beverage was only allowable from the execution date of the contract; however, after further discussion with the City Attorney’s Office, it was determined that food and non-alcoholic beverage expenditures could be allowable from the effective date of the legislation as long as City Council approves.  This ordinance is to seek approval to allow those expenditures starting from the effective date of Ordinance No. 3549-2023.  \n \nOrdinance No. 3549-2023 and amended ordinance 0216-2024 authorized the Director of Development to enter into a Beneficiary Agreement with Community Shelter Board (CSB) in an amount up to $1,200,000.00 of which $600,000.00 utilized federal American Rescue Plan Act (ARPA) dollars and the remaining $600,000.00 from the Neighborhood Initiatives Subfund of the General Fund to support winter warming services that will help keep unhoused individuals safe during dangerous weather.  \n \nEmergency action is requested to allow for the expenditure of food and non-alcoholic beverages to be an allowable expense from the date of passage of the original ordinance 3549-2023 to assure that the funding is in place to cover those allowable items and not cause an undue hardship upon the Community Shelter Board. \n \nCONTRACT COMPLIANCE:  The vendor number is 004795 and expires on 01/09/25.  \n \nTitle\n \nTo amend Ordinance No. 3549-2023, passed by Columbus City Council on December 11, 2023, to allow for the correction of the date in which food and non-alcoholic beverage related expenditures would be allowable within the Beneficiary Agreement with the Community Shelter Board; and to declare an emergency. ($0.00) \n \nBody\n \nWHEREAS,  upon further discussion with the City Attorney’s Office it was deemed that the food and non-alcoholic beverage expenditures could be an allowable expense from the passage date of the original ordinance as long as City Council approves; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to amend Ordinance 3549-2023, passed by Columbus City Council on December 11, 2023, to allow for the correction in the date for which food and non-alcoholic beverage expenses would be allowable to prevent undue hardship on the Community Shelter Board; NOW, THEREFORE,\n                      \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That Section 4 of Ordinance No. of 3549-2023 be amended to read as follows with additions in underline and deletions in strikethrough:  \n \nSECTION 4. That Columbus City Council deems this expenditure and the distribution of food and non-alcoholic beverages to be a proper public purpose, in that it helps to feed residents in underserved neighborhoods and who disproportionately experience food insecurity.  Food and non-alcoholic beverage related expenditures will only be allowable from the execution date of the contract effective date of this ordinance and shall not exceed $20.00 per meal per served individual per day.\n \nSECTION 2.  That existing Section 4 of Ordinance No. 3549-2023 is hereby repealed.\n \nSECTION 3.  That for the reasons stated in the Preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 108,
    "meeting_date": "2024-04-08",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}