{
  "success": true,
  "vote": {
    "id": 9083,
    "item_number": "CA-40",
    "title": "To authorize the Municipal Court Clerk to modify all contracts and purchase orders with ITPartners+ by assigning all past, present, and future contracts and purchase orders to ITPartners Plus Inc; to authorize the Municipal Court Clerk to enter into a renewal contract with ITPartners Plus Inc. for data storage services for the Franklin County Municipal Court; and to authorize the expenditure of $71,658.00 from the Municipal Court Clerk Computer Fund. ($71,658.00)",
    "description": "Explanation\n \nBackground:\n \nThis legislation authorizes the Franklin County Municipal Court, Clerk of Court (“Municipal Court Clerk”) to modify all past, present, and future contracts and purchase orders with IT Partners (FID:84-2570784) also referred to as ITPartners+; authorizes the assignment of all past, present and future business done by the Franklin County Municipal Clerk (City of Columbus) with ITPartners+ (FID:84-2570784) to ITPartners Plus Inc. (93-1432979).  The W-9 was updated to reflect the change in the Federal Identification Number (FID). \n \nThis legislation also authorizes the Municipal Court Clerk to enter into the third year of a three (3) year contract renewal with ITPartners Plus Inc. for remote back-up and recovery storage services (“data storage services”) for the Franklin County Municipal Court in the amount of $71,658.00.\n \nOrdinance 1007-2023 authorized the Municipal Court Clerk to enter into the second year of a three (3) year renewal with ITPartners+ for data storage services for the Franklin County Municipal Court.\n \nOrdinance 2246-2022 authorized the Municipal Court Clerk to modify the contract with ITPartners+ for additional storage services. \n \nOrdinance 1245-2022 authorized the Municipal Court Clerk to enter into the first year of a three (3) year renewal with ITPartners+ for data storage services for the Franklin County Municipal Court.\n \nOrdinance 1192-2021 authorized the Municipal Court Clerk to modify and extend the existing contract for an additional three (3) years with ITPartners+, and to upgrade the hardware for additional remote back-up and recovery storage services; to waive the competitive bidding provisions of Columbus City Code.\n \nOrdinance 2080-2020 authorized the Municipal Court Clerk to modify all past, present, and future contracts and purchase orders with Computer Rescue 911; authorizes the assignment of all past, present and future business done by the Municipal Court Clerk with Computer Rescue to ITPartners+.\n \nOrdinance 1137-2017 authorized the Municipal Court Clerk to enter into a one (1) year contract, with four (4) consecutive one (1) year renewal options with Computer Rescue 911, LLC for data storage services for the Franklin County Municipal Court.\n \nBid Information:  The Municipal Court Clerk's Office solicited competitive bids through RFQ004790 in accordance with Columbus City Code 329.  Proposals were received from three (3) companies; two (2) of the proposals were incomplete. The proposals were reviewed by a committee and evaluated in accordance with the committee's criteria.  Computer Rescue 911, LLC achieved the highest score.  In agreement with the committee, the Municipal Court Clerk awarded the bid to Computer Rescue 911, LLC\n \nContracts:\nContracts: \nOrdinance 1137-2017; PO058825; $22,587.00 \nOrdinance 2887-2017; PO090264; $16,800.00\nOrdinance 2887-2017; PO090274; $12,385.00\n2018; PO109833; $44,388.00\n2019; PO177102; $44,388.00\n2020; PO227321; $44,388.00\nOrdinance 2080-2020: $0\nOrdinance 1192-2021; PO276020; $66,292.00\nOrdinance 1245-2022; PO332224; $63,588.00\nOrdinance 2246-2022; PO346443; $6,789.00\nOrdinance 1007-2023; PO389825; $71,658.00\nOrdinance 0306-2024; $71,658.00\n \nContract Compliance:\nITPartners Plus, Inc. Contract Compliance#: 93-1432979\nExpiration Date: 03/08/2026\nVendor Number: 048405\n                                                                                                                                                                                                                                 \nFiscal Impact:  Funds totaling $71,658.00 are available within the Municipal Court Clerk Computer Fund. \nTitle\n \nTo authorize the Municipal Court Clerk to modify all contracts and purchase orders with ITPartners+ by assigning all past, present, and future contracts and purchase orders to ITPartners Plus Inc; to authorize the Municipal Court Clerk to enter into a renewal contract with ITPartners Plus Inc. for data storage services for the Franklin County Municipal Court; and to authorize the expenditure of $71,658.00 from the Municipal Court Clerk Computer Fund. ($71,658.00)\n \nBody\n \nWHEREAS, it is necessary to assign all past, present, and future contracts and purchase orders from ITPartners+ to ITPartners Plus Inc.; and\n \nWHEREAS, it is necessary to enter into the third year of a three (3) year renewal contract with ITPartners Plus Inc. for data storage services for the Franklin County Municipal Court, contingent upon ITPartners Plus Inc. being authorized to transact business in the State of Ohio; and \n \nWHEREAS, 1192-2021 specifically authorized the Municipal Court Clerk to modify and extend the then-existing contract with an option for an additional three (3) years renewals with ITPartners+; and \n \nWHEREAS, it has become necessary in the usual daily operation of the Franklin County Municipal Court to authorize the Municipal Court Clerk to assign all past, present, and future contracts and purchase orders from ITPartners+ to ITPartners Plus Inc and to enter into the third year of a three (3) year contract renewal with ITPartners Plus Inc. for data storage services; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Municipal Court Clerk is hereby authorized to assign all past, present, and future contracts and purchase orders with ITPartners+ (FID: 84-2570784) to ITPartners Plus Inc. (FID: 93-1432979).\n \nSECTION 2. That the Municipal Court Clerk be and is hereby authorized to enter into the third year of a three (3) year renewal contract with ITPartners Plus Inc., in the amount of $71,658.00 for the provision of data storage services for the Franklin County Municipal Court, contingent upon ITPartners Plus Inc. being authorized to transact business in the State of Ohio.\n \nSECTION 3.  That the expenditure sum of $71,658.00 or so much as may be needed, be and hereby is authorized in Fund 2227 (Computer Fund), Department-Division 2601 (Municipal Court Clerk), in Object Class 03 (Contractual Services), per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary,\n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 6. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 108,
    "meeting_date": "2024-04-08",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements"
    ]
  }
}