{
  "success": true,
  "vote": {
    "id": 9110,
    "item_number": "SR-10",
    "title": "To authorize the Director of the Department of Development to enter into a contract with Thomas Mundell d/b/a Quality Lawn Care TAM to support routine mowing, removal of brush and excessive high grass, all foreign material, and similar work for properties held by the Land Redevelopment Division; to authorize an expenditure from the Land Management Fund; to authorize expenditures incurred prior to the creation of the Purchase Order; to waive the competitive bidding provisions of Columbus City Codes; and to declare an emergency ($4,827.00).",
    "description": "Explanation\n \nThis legislation authorizes the Director of the Department of Development to enter into a contract with Thomas Mundell d/b/a/ Quality Lawn Care TAM in an amount up to $4,827.00 to support routine mowing, removal of brush and excessive high grass, and all foreign material, and similar work for properties held by the Land Redevelopment Division.\n                     \nColumbus City Council approved Ordinance 3444-2022 on December 14, 2022 authorizing a Modification to add funding to the agreement with Quality Lawn Care T A M in an amount up to $15,000.00.  The term of the agreement expired on February 28, 2024.  In order to complete the services, a new agreement is desired with a start date of August 1, 2023 in an amount not to exceed $4,827.00. \nOriginal contract amount                     $ 20,000.00                     Ord. N/A                                            PO313165\nModification No. 1 amount                     $   1,000.00                     Ord 2021-2022                                          PO369972\nModification No. 2 amount                     $ 15,000.00                     Ord 3444-2022                                          PO369972\nTotal contract amount                                                               $ 36,000.00\n \nA waiver of competitive bidding is requested due to maintain Land Bank properties per city ordinance.\nEmergency Designation: Emergency action is requested to ensure that Quality Lawn Care T A M is made whole for additional assigned properties to mow, which caused him to exceed the original budgeted contract amount, the work was performed in good faith.\nFiscal Impact: Funds are available within the Land Management Fund. \nContract Compliance: the vendor number is 008791 and expires 6/23/2024.\n \n \nTitle\n \nTo authorize the Director of the Department of Development to enter into a contract with Thomas Mundell d/b/a Quality Lawn Care TAM to support routine mowing, removal of brush and excessive high grass, all foreign material, and similar work for properties held by the Land Redevelopment Division; to authorize an expenditure from the Land Management Fund; to authorize expenditures incurred prior to the creation of the Purchase Order; to waive the competitive bidding provisions of Columbus City Codes; and to declare an emergency ($4,827.00).\n \n \nBody\n \nWHEREAS, Thomas Mundell d/b/a Quality Lawn Care TAM (\"Quality Lawn Care TAM\") is made whole for additional assigned properties to mow, which caused him to exceed the original budgeted contract amount, the work was performed in good faith; and\nWHEREAS, Columbus City Council approved Ordinance 3444-2022 on December 14, 2022 authorizing a Modification to add funding to the agreement with Quality Lawn Care TAM in an amount up to $15,000.00; and \n \nWHEREAS, the agreement expired before a modification could be executed and it is now necessary to request additional funding; and \n \nWHEREAS, it is necessary to authorize the Director of the Department of Development to enter into a contract with Quality Lawn Care TAM in an amount up to $4,827.00 to support mowing, removal of brush and excessive high grass, and all foreign material, and similar work for properties held by the Land Redevelopment Division; and\n \nWHEREAS, it has been determined that it is in the best interests of the City to waive the competitive bidding requirement to ensure that Quality Lawn Care TAM can be reimbursed for mowing work already completed in good faith; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Development in that it is immediately necessary to authorize the Director to enter into a contract with Quality Lawn Care TAM so it can be reimbursed for mowing work already completed in good faith, all for the immediate preservation of the public health, peace, property, and safety; NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS: \n \nSECTION 1.  That the Director of the Department of Development is hereby authorized to enter into a contract beginning August 1, 2023, with Quality Lawn Care TAM to support mowing, removal of brush and excessive high grass, and all foreign material, and similar work for properties held by the Land Redevelopment Division.  Lawn care service costs associated with the Land Redevelopment Division prior to the execution of the purchase order, starting August 1, 2023, are hereby determined to be a valid public purpose and will be reimbursed.\n \nSECTION 2.  That for the purpose as stated in Section 1, the expenditure of $4,827.00, or so much thereof as may be necessary, is hereby authorized in fund 2206 (Land Management Fund), Dept-Div 4411 (Land Redevelopment), object class 03 (Services) per the account codes in the attachment to this ordinance.\n \nSECTION 3:  That this Council finds it is in the best interests of the City to waive the competitive bidding provisions of Chapter 329 of Columbus City Codes to enter into this contract and such are hereby waived.\n \nSECTION 4.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 108,
    "meeting_date": "2024-04-08",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}