{
  "success": true,
  "vote": {
    "id": 9112,
    "item_number": "SR-12",
    "title": "To authorize the Public Safety Director to enter into a contract with ZOLL Medical Corporation for ZOLL defibrillators/monitors cloud-based detailed post-case data services for the Division of Fire; to waive the competitive bidding provisions of the Columbus City Code; to authorize the expenditure of $17,206.74 from the General Fund; and to declare an emergency. ($17,206.74)",
    "description": "Explanation\n \nBackground:   This ordinance authorizes the Director of Public Safety to enter into a contract with ZOLL Medical Corporation for cloud-based detailed post-case data that is accumulated from ZOLL Medical Corporation’s defibrillators/monitors.  In 2020, the Columbus Division of Fire standardized to ZOLL Medical Corporation’s defibrillators/monitors.  ZOLL Medical Corporation’s proprietary cloud-based software is designed to work with ZOLL Medical Corporation’s defibrillators/monitors to collect data from the defibrillators/monitors.  The Division utilizes this collected data to improve EMS protocols.  This contract in the amount of $25,810.11 is for a three (3) year contract price based on $8,603.37 annual payments. The three (3) year contract term provides a reduction in annual cost, thus providing an overall cost savings to the City. A payment of $8,630.37 was made for this service in 2023.\nBid Waiver Justification:  The Division of Fire has the ability to purchase directly from ZOLL Medical Corporation for ZOLL defibrillators/monitors proprietary cloud-based detailed post-case data services, ensuring the lowest available price for post-case data collection, storage, and analysis services for ZOLL defibrillators/monitors.\n \nVendor Data:  ZOLL Medical Corporation #04-2711626 Vendor #000197\n \nEmergency Designation:  Emergency action is required so that the post-case data from Fire’s ZOLL Medical Corporation’s defibrillators/monitors is not deleted due to a lapse in service, thus depriving Fire of this vital data.\n \nFISCAL IMPACT:  This ordinance authorizes an expenditure of $17,206.74 from the General Fund, for the expense for this contract between the Columbus Division of Fire and ZOLL Medical Corporation for 2024 and 2025.  The Fire Division spent $8,630.37 in 2023 for this service.  \nTitle\n \nTo authorize the Public Safety Director to enter into a contract with ZOLL Medical Corporation for ZOLL defibrillators/monitors cloud-based detailed post-case data services for the Division of Fire; to waive the competitive bidding provisions of the Columbus City Code; to authorize the expenditure of $17,206.74 from the General Fund; and to declare an emergency. ($17,206.74)\n \nBody\n \nWHEREAS, the Fire Division utilizes ZOLL Medical Corporation’s defibrillators/monitors on its emergency medical and first responder vehicles; and\n \nWHEREAS, there is a need for the Division of Fire to utilize ZOLL Medical Corporation’s cloud-based detailed post-case data collected from the Division of Fire’s ZOLL defibrillators/monitors to improve the viability of members of the public in need of emergency medical care; and\n \nWHEREAS, it is necessary to authorize the Director of Public Safety, on behalf of the Division of Fire, to enter into a contract with ZOLL Medical Corporation for the aforementioned services; and\n \nWHEREAS, it is in the best interest of the City to waive the competitive bidding provisions of City Code Chapter 329 to purchase said ZOLL defibrillators/monitors proprietary cloud-based detailed post-case data services directly from ZOLL Medical Corporation in order to receive the best possible pricing; and,\n \nWHEREAS, an emergency exists in the usual daily operations of the Department of Public Safety, Division of Fire, in that it is immediately necessary to authorize the Director to enter into a contract with ZOLL Medical Corporation for cloud-based detailed post-case data services so that Fire's ability to utilize this service remains uninterrupted which prevents the deletion of cloud-stored data, all for the immediate preservation of the public health, peace, property, safety, and welfare; and now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Public Safety be and is hereby authorized to enter into a three (3) year contract with ZOLL Medical Corporation in the amount of $25,810.11, for cloud-based detailed post-case data services, including CPR quality on compression depth, rate, pause time and release velocity, as well as ECG, shocks, EtCO2 and SpO2 vital signs for the Division of Fire.\n \nSECTION 2. That this Council finds it to be in the best interests of the City to waive the relevant provisions of Chapter 329 of City Code relating to Competitive bidding for this purchase.\n \nSECTION 3.  That the expenditure of $8,630.37 from purchase order PO404527 from the 2023 general operating budget is hereby deemed authorized.\n \nSECTION 4.  That the expenditure of $17,206.47 from the 2024 general budget, or so much thereof as may be necessary, is hereby authorized to be expended from the general operating fund 1000-100010 per the accounting codes in the attachment to this ordinance.\n \nSECTION 5.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish accounting codes as necessary.\n \nSECTION 6.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 7. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 108,
    "meeting_date": "2024-04-08",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}