{
  "success": true,
  "vote": {
    "id": 9126,
    "item_number": "0",
    "title": "To amend various sections within Columbus City Codes Chapter 921 regarding watercraft on reservoirs and to declare an emergency.",
    "description": "Explanation\n \nBackground: Columbus Recreation and Parks Department has a need to alter and amend various sections within Columbus City Codes Chapter 921, regarding watercraft on reservoirs. These changes are a result of recent code review and current permitting processes for activities on waters of the City. The changes will ensure that paddle craft, without a safety vessel, must operate within 100’ of shore as they do today.  Paddle craft include, but are not limited to: rowing shells, kayaks, canoes, and paddleboards. \n \nRowing organizations do have a need to operate a safety vessel that exceeds 22’ maximum length as noted within existing code.  These vessels may only be used when actively supporting a legal recreational vessel.  The boats are designed to be low wake and the size is required to be able to rescue 8 members of a rowing shell if it were to capsize and need to be rescued.  These safety vessels are primarily 27’ in length. For this reason, an exemption in the code was created to allow safety vessels to exceed the 22’ maximum up to 28’ in size with permission from the Director.  Rowing Shells accompanied by a safety vessel must operate as close to shore as practically possible but may extend beyond 100’ when necessary to perform to a standard for their sport.  An open zone, free from rowing shells and safety vessels, of at least 150’ in the center of the reservoir must remain open for two way traffic at all times.\nIn addition, these changes will require substantial amendment to code definitions applicable throughout 921 in order to conform to definitions in the Ohio Revised Code. \n \nEmergency Justification: N/A\n \nBenefits to the Public: This amendment to code regarding watercraft on reservoirs will to help ensure consistency in boating and the safety of users. \n \nCommunity Input/Issues:  Providing the safety and consistency for the experience of utilizing our parks and reservoirs.\n \nArea(s) Affected: Citywide (99)\n \nMaster Plan Relation: This project will support the Recreation and Parks Master Plan by promoting the safety of parks and reservoirs.\n \nFiscal Impact: No fiscal action is required at this time. \nTitle\n \nTo amend various sections within Columbus City Codes Chapter 921 regarding watercraft on reservoirs and to declare an emergency.\n  \n \nBody\n \nWHEREAS, it is necessary to amend various sections within Columbus City Codes Chapter 921 regarding watercraft on reservoirs; and \n \nWHEREAS, this amendment will alter definitions within Columbus City Codes 921 to conform to the Ohio Revised Code; and\n \nWHEREAS, the Recreation and Parks Commission, by action of March 12, 2024, has reviewed and voted to recommend the City Code changes contained herein; and\n \nWHEREAS, in the usual daily operations of the Recreation and Parks Department in that it is immediately necessary to authorize the amendment of various sections within Columbus City Codes Chapter 921, regarding watercraft on reservoirs, in order to be complete prior to the spring 2024 boating season to help ensure the safety of residents utilizing the reservoirs, all for the preservation of the public health, peace, property, safety, and welfare; and NOW, THEREFORE,\n \nWHEREAS, an emergency exists in the usual daily operation in the City of Columbus in that it is immediately necessary to pass this ordinance due to the current watercraft using our reservoirs. The boating season has already commenced, and the enforcement of boating regulations are dependent on this code change, for the immediate preservation of the public peace, property, health and safety; now, therefore:\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That Section 921.01 Definitions be amended as follows:\n921.01 Definitions.\nAs used in this chapter: \n(1)                     \"Canoe\" means a paddlecraft that is normally an open, narrow vessel of shallow draft, typically pointed at both ends and propelled by its occupants through the use of paddles while kneeling or sitting on a raised seat, including a flat-backed canoe and a racing canoe. human muscular effort, and includes kayaks, racing shells, and rowing sculls. \n(2)                     “City-controlled” includes all city-owned land, including but not limited to leases, easement and other legal agreements and all waters within the territorial limits of the city of Columbus or bounded by city-owned lands. \n(3)(2)                     \"Coast Guard approved,\" means bearing an approval number assigned by the United States Coast Guard. \n(4)(3)                     \"Director, auditor, treasurer\" shall mean the duly appointed officers of the city acting in their official capacity or through their deputies or employees legally authorized to act in their stead.  Director, without further clarification, shall mean the Director of the Department of Recreation and Parks.\n(5)(4)                     \"Diver's flag\" means a red flag not less than one (1) foot square having a diagonal white stripe extending from the masthead to the opposite lower corner that when displayed indicates that divers are in the water. \n(6)(5)                     \"Dock\" means a structure or platform designed to provide access to or an area to secure watercraft. Boat docking facility means any facility supporting watercraft and designated by the director of recreation and parks, which excludes private permitted dock structures. \n(6)                     \"Drug of abuse\" has the same meaning as in section 4506.01 of the Revised Code.\n(7)                     \"Idle speed\" means the slowest possible speed needed to maintain steerage or maneuverability. \n(8)                     \"Inflatable watercraft\" means any vessel constructed of rubber, canvas, or other material that is designed to be inflated with any gaseous substance, constructed with two (2) or more air cells, and operated as a vessel. An Inflatable watercraft propelled by a motor is a shall be classified as powercraft and shall be registered by length. An Inflatable watercraft propelled by a sail is a shall be classified as a sailboat and shall be registered by length. An inflatable watercraft propelled by human muscular effort utilizing a paddle or pole is a paddlecraft. An inflatable watercraft propelled by human muscular effort utilizing an oar with the aid of a fulcrum provided by oarlocks, tholepins, crutches, or similar arrangements is a rowboat. Excludes any contrivances that do not bear a Hull Identification Number (HIN) recognized by the United States Coast Guard. \n(9)                     \"In operation\" in reference to a vessel means that the vessel is being navigated or otherwise used on the waterways of this city. \n(10)                     \"Kayak\" means a paddlecraft that is typically pointed at both ends and is propelled by human muscular effort by one or more seated individuals who use a double-bladed paddle, including an open kayak with an open deck for operator seating, an enclosed kayak designed to enclose an occupant within a cockpit, a tandem kayak designed for multiple occupants, and a racing kayak.\n(10)(11)                     \"Law enforcement vessel\" means any vessel used in law enforcement and under the command of a law enforcement officer. \n(11)(12)                     \"Muffler\" means an acoustical suppression device or system that is designed and installed to abate the sound of exhaust gases emitted from an internal combustion engine and that prevents excessive or unusual noise. \n(12)(13)                     \"Navigable waters,\" means waters which that come under the jurisdiction of the Department of the Army of the United States and any waterways within or adjacent to this state, except inland lakes having neither a navigable inlet nor outlet. \n(13)(14)                     \"No wake\" has the same meaning as \"idle speed.\" \n(14)(15)                     \"Operator\" includes any person who uses, navigates, employs, or has under the person's control a vessel, or vessel and detachable motor, on the waters of this city. \n(15)(16)                     \"Owner\" includes any person, other than a secured party, who claims lawful possession of a vessel by virtue of legal title or equitable interest therein that entitled the person to use or possess the vessel that possession. including a person entitled to use or possess a vessel subject to a security interest in another person, but does not include a lessee under a lease not intended as a security.\n(17)                     \"Paddlecraft\" means any type of canoe, kayak, paddleboard, or other vessel powered only by its occupants using a single or double-bladed paddle as a lever without the aid of a fulcrum provided by oarlocks, tholepins, crutches, or similar mechanisms.\n(16)(18)                     \"Pedal boat,\" means any watercraft designed to be propelled by pedals only through human muscular effort. Pedal boat does not include kayaks. \n(17)(19)                     \"Person\" includes any legal entity defined as a person in Section 1.59 of the Revised Code and any body politic, except the United States and this state, and includes any agent, trustee, executor, receiver, assignee, or other representative thereof. \n(18)(20)                     \"Personal watercraft\" means a vessel, less than sixteen (16) feet in length, that is propelled by a water-jet pump or other machinery and designed to be operated by an individual sitting, standing, or kneeling on the vessel rather than by an individual sitting or standing inside the vessel. \n(19)(21)                     \"Powercraft\" means any vessel propelled by machinery, fuel, rockets, or similar device. \n(20)(22)                     \"Reservoirs\" shall mean the O'Shaughnessy, Griggs and Hoover water supply storage reservoir, and all adjacent city lands, unless specifically designated otherwise, from the dams upstream to the further most upstream extent of city owned shores of the streams feeding into the reservoirs. \n(21)(23)                     \"Rowboat\" means an open any vessel, other than a paddlecraft, except a canoe, that is designed to be rowed and that is propelled by human muscular effort utilizing by oars with the aid of a fulcrum provided by oarlocks, tholepins, crutches, or similar arrangements or paddles and upon which no mechanical propulsion device, electric motor, internal combustion engine, or sail has been affixed or is used for the operation of the vessel. \n(24)                                          “Rowing shell” means a narrow and long rowing vessel also referred to as a rowing scull or racing shell, typically fitted with outriggers, which is used for racing or exercise and is operated by one or more occupants by use of oars at a fixed fulcrum point. \n(25)                     “Safety Vessel” means a vessel accompanying a paddlecraft, rowing shell or sailboat with the primary purpose of providing direct safety support for those operating the secondary vessel.  A Safety Vessel that is not a law enforcement vessel must obtain a permit from the Director.\n(26)                      “Sailboard” means a board type sailboat without a rigidly affixed mast. \n(22)(27)                     \"Sailboat\" means any vessel, equipped with mast and sails, dependent upon the wind to propel it in the normal course of operation. \n(a)                     A vessel with sail as its primary method of propulsion and mechanical propulsion as its secondary method of propulsion is an auxiliary sail. Any sailboat equipped with an inboard engine is deemed a powercraft with auxiliary sail. \n(b)                     Any sailboat equipped with detachable motor is deemed a sailboat with auxiliary power. \n(c)(b)                     Any sailboat being propelled by mechanical power, whether under sail or not, is deemed a powercraft and subject to all laws and rules governing powercraft operation. \n(23)(28)                     \"Sewage\" means human body wastes and the wastes from toilets and other receptacles intended to receive or retain body waste. \n(24)                     \"South Side Scioto River Park\" means the area bounded downstream by the spillway at Greenlawn Avenue and upstream a distance of one and one quarter (1 1/4) statute miles. \n(25)(29)                     \"Type one personal flotation device\" means a device that is designed to turn an unconscious person floating in water from a face downward position to a vertical or slightly face upward position and that has at least nine (9) kilograms, approximately twenty (20) pounds, of buoyancy. \n(26)(30)                     \"Type two personal flotation device\" means a device that is designed to turn an unconscious person in the water from a face downward position to a vertical or slightly face upward position and that has at least seven (7) kilograms, approximately fifteen and four tenths (15.4) pounds, of buoyancy. \n(27)(31)                     \"Type three personal flotation device\" means a device that is designed to keep a conscious person in a vertical or slightly face upward position and that has at least seven (7) kilograms, approximately fifteen and four tenths (15.4) pounds of buoyancy. \n(28)(32)                     \"Type four personal flotation device,\" means a device that is designed to be thrown to a person in the water and not worn and has at least seven and five tenths (7.5) kilograms, approximately sixteen and five tenths (16.5) pounds, of buoyancy. \n(29)(33)                     \"Type five personal flotation device\" means a device that, unlike other personal flotation devices, has limitations on its approval by the United States Coast Guard, including, without limitation, all any of the following: \n(a)                     A designation that states the device is approved only for use while participating in specific activities; The approval label on the type five personal flotation device indicates that the device is approved for the activity in which the vessel is being used or as a substitute for a personal flotation device of the type required on the vessel in use; \n(b)                     A designation that states the device is approved only for use by an operator or passenger of specific types of vessels; The personal flotation device is used in accordance with any requirements on the approval label; \n(c)                     A designation that states the device is specifically approved as a substitute for the type of personal flotation device required for use while engaged in certain activities or as an operator or passenger of a vessel. The personal flotation device is used in accordance with the requirements in its owner's manual if the approval label refers to such a manual. \n(30)(34)                     \"Vessel\" includes every description of watercraft, including non displacement craft, multimodal craft, and submersibles, and seaplanes, designed to be used as a means of transportation on water. Excludes any contrivances that do not bear a Hull Identification Number (HIN) recognized by the United States Coast Guard. \n(31)(35)                     \"Visible\" means visible on a dark night with clear atmosphere. \n(32)(36)                     \"Watercraft\" means any of the following when used or capable of being used for transportation on the water: \n(a)                     A vessel operated by machinery either permanently or temporarily affixed; \n(b)                     A sailboat other than a sailboard; Board type sailboats without rigidly affixed masts; commonly referred to as \"sailboards\" are not watercraft; excludes any contrivances that do not bear a Hull Identification Number (HIN) recognized by the United States Coast Guard. \n(c)                     An inflatable, manually propelled boat vessel that is required by federal law to have a hull identification number meeting the requirement of the United States Coast Guard; \n(d)                     A canoe, kayak, pedal boat or rowboat. \n(e)                      Any of the following multimodal craft being operated on waters in this state:\n(i) An amphibious vehicle;\n(ii) A submersible;\n(iii) An airboat or hovercraft.\n(f)                      A vessel that has been issued a certificate of documentation with a recreational endorsement under 46 C.F.R. 67.\n\"Watercraft\" does not include ferries as referred to in Chapter 4583 of the Revised Code. \n\"Watercraft\" excludes any contrivances that do not bear a Hull Identification Number (HIN) recognized by the United States Coast Guard. \nWatercraft subject to Section 1547.54 of the Revised Code shall be divided into five (5) classes as follows: \nClass A: Less than sixteen (16) feet in length; \nClass 1: At least sixteen (16) feet but less than twenty six (26) feet in length; \nClass 2: At least twenty six (26) feet but less than forty (40) feet in length; \nClass 3: At least forty (40) feet but less than sixty five (65) feet in length. \nClass 4: At least sixty five (65) feet in length. \n(33)                     “Watercraft dealer” means any person who is regularly engaged in the business of manufacturing, selling, displaying, offering for sale, or dealing in vessels at an established place of business. “Watercraft dealer” does not include a person who is a marine salvage dealer or any other person who dismantles, salvages, or rebuilding vessels using used parts. \n (34)(37)                     \"Waters of the city\" shall mean means all city administered water including, but not limited to reservoirs, reservoir lands, rivers, lakes, creeks, streams, ponds, waterways of the city, and water filled quarries. Unless otherwise provided, this chapter applies to all vessels operating on waters of this city. Nothing in this chapter shall be construed in contravention of any valid federal act or regulations, but is in addition to such act or regulation where not inconsistent. \n(38)                     “Waterways of the city” means all waters within the territorial limits of the city of Columbus or bounded by city owned lands. \n(40)                     \"Drug of abuse\" has the same meaning as in section 4506.01 of the Revised Code. \n \nSECTION 2.  That Section 921.01-1Vessels and operations on waterways be amended as follows:\n \n921.01-1 Vessel and operations on waterways.\n(A)                     In all waterways of the city except Griggs, O'Shaughnessy and Hoover Reservoirs and the downtown Scioto River Pool or as otherwise authorized by this chapter, no person shall operate any vessel of: \n(1)                     Less than eight (8) feet or more than twenty-two (22) feet in length or; \n(2)                     Less than thirty-six (36) inches in beam or; \n(3)                     Less than fifty (50) pounds in weight; \n(4)                     More than ten (10) horsepower. \n(B)                     Canoes, kayaks, rowing shells, pedal boats and inflatable watercraft bearing a Hull Identification Number (HIN) recognized by the United States Coast Guard as vessels and watercraft are permitted and specifically exempted from the length, beam and weight requirements. \n(C)                     No watercraft shall operate beyond the safety cable at those dams where safety cables have been installed. Except as otherwise provided in this chapter, in those areas where there are no safety cables, no vessel shall operate within one hundred (100) feet of the upriver or downriver side of any dam. This section shall not prohibit the launching or loading of a vessel in designated areas as provided for in Section 921.01-15. \n(D)                     Except as otherwise provided in this chapter, no person shall operate any motorized vessel on any waterways of the city at a speed exceeding idle speed within a distance of one hundred (100) feet of the shorelines. \n(E)                     No person shall swim or wade in any waterways of the city, except as a means of rescue, nor allow a minor, who is in custodial care, to swim or wade. This section shall not prohibit wading for the purpose of fishing. \n(F)                     Personal watercraft, which are classified by the Coast Guard as small Class A-1 or A-2 vessels and which use, as their primary source of mechanical power, an inboard or outboard motor powering a jet pump, and which are designed to be operated by a person in a sitting, standing, or kneeling position rather than that of the conventional manner of either sitting or standing inside the vessel, are prohibited on all waters of the city. city controlled waterways. \n(G)                     No person shall operate any motorized vessel on waterways of the city at a speed exceeding ten (10) miles per hour between sunset and sunrise. \n(H)                     Between the dates of November 30 of each year to April 1 of the following year, all vessels must be removed from all stakes, boat docks, sailboat moorings and waterways. Any vessel found unattended in any waterways of the city or park controlled by the City of Columbus between the dates as specified in this paragraph will be considered abandoned by the owner and will be impounded by a law enforcement officer and will be subject to provisions as set forth elsewhere in this chapter.   \n(I)                     Sailboarding for the purpose of this chapter shall be limited to those sailboats without a rigidly affixed mast and which meet all the other requirements of this chapter. \n(J)                     No person shall engage or attempt to engage in any sailboard activity without wearing an adequate and effective Coast Guard approved type one, two or three personal floatation device in good and serviceable condition and of appropriate size, or a jacket or harness specifically manufactured for sailboarding, and which provides for positive buoyancy in the water. \n(K)                     This section shall not be construed or interpreted so as to prevent or prohibit boating on waterways of the city between the dates of November 30 of each year and April 1 of the following year, except in restricted areas, provided that the vessel is not stored on city property and is immediately removed from the waterway after use.\n \nSECTION 3.  That Section 921.01-3 Vessel and operations in Griggs Reservoir be amended as follows:\n921.01-3 Vessel and operations in Griggs Reservoir.\n(A)                     Unless otherwise authorized in this chapter, no person shall operate in Griggs Reservoir any vessel of: \n(1)                     Less than eight (8) feet or more than twenty-two (22) feet.\n(2)                         Less than thirty-six (36) inches in beam or; \n(3)                     Less than fifty (50) pounds in weight. \n(B)                     Exceptions: Canoes, kayaks, rowing shells, pedal boats, Safety Vessels with a valid permit, and inflatable watercraft bearing a Hull Identification Number (HIN) and recognized by the United States Coast Guard as vessels and watercraft are permitted and are specifically exempted from the length, beam and weight requirements provided: \n(1)                     Rowing shells are permitted during the months of May through September on weekdays from one (1) hour before sunrise 5:00 a.m. until sunset and on weekends and holidays from 5:00 a.m. one (1) hour before sunrise until 10:00 a.m. Rowing shells are permitted at all times during the months of October through April on all days of the week. \n(a)                      Rowing shells not accompanied by a Safety Vessel\n(i)                      Rowing shells will be operated parallel to the shoreline at a distance no greater than one hundred (100) feet except that north of the Hayden Run Bridge rowing shells will be operated no greater than fifty (50) feet of the shoreline, except for the safe operation around a navigational hazard.\n(ii)                     Rowing shells longer than forty-five (45) feet will not be permitted north of the Hayden Run Road Bridge. \n(iii)                     There will be four (4) crossing areas and rowing shells will utilize only those areas designated for crossing.\n                     (b)                     Rowing shells accompanied by a Safety Vessel\n                                          (i)                     Rowing shells, when accompanied by a Safety Vessel, will be operated parallel to the shoreline and as close to the shoreline as is reasonably practicable while maintaining a straight-line course. A corridor of at least one hundred fifty (150) feet in the middle of the reservoir that is free of rowing shells and Safety Vessels must be maintained for safe passage of other vessels underway.\n                                          (ii)                     Rowing shells and Safety Vessels longer than forty-five (45) feet will not be permitted north of the Hayden Run Road Bridge.\n                                          (iii)                     There will be four (4) crossing areas and rowing shells will utilize only those areas designated for crossing.\n(2)                     The crossing areas will be: \n(a)                     The no wake zone south of buoy number one (1). Designated no-wake zones that span the entire width of the reservoir.\n(b)                     Between the north side of the Fishinger Road Bridge and buoy number three (3). \n(c)                     At buoy number four (4) (\"Fisher's Wall\"). Rowing shells will not stop within the open zone when crossing. \n(d)                     Between buoy number five (5) and the south side of the Hayden Run Road Bridge. \n(3)                     The rowing shell course shall be: \n(a)                     Northbound shells leaving the west side boathouse shall immediately assume a course on the west side of the river to the Fishinger Road Bridge. Shells launching on the east side, shall cross to the west side in the no wake zone south of buoy number one (1) to begin the course and use the same route when returning. \n(b)                     Northbound on the east side of the river from the Fishinger Road Bridge to the Hayden Run Road Bridge. \n(c)                     Northbound on the west side of the river between Hayden Run Road Bridge and the Griggs Park northern boundary line approximately two hundred (200) feet south Rt. 161. \n(d)                     Southbound or returning shells shall hug the west bank all the way back to the boathouse. \n(4)(3)                     Canoes, kayaks, pedal boats, rowboats and inflatable watercraft shall operate parallel to the shoreline at a distance no greater than fifty (50) feet from the shoreline in all areas parallel and adjacent to an open zone except for the safe operation around a navigational hazard. There will be two (2) crossing areas and canoes, kayaks, pedal boats, rowboats and inflatable watercraft will utilize only those areas designated for crossing. \n(a)                     The crossing areas will be: \n(1)                     Within one hundred (100) feet either side of the Fishinger Road Bridge. \n(2)                     Within one hundred (100) feet either side of the Hayden Run Road Bridge. \n(b)                     Canoes, kayaks, rowing shells, rowboats, pedal boats and inflatable watercraft will not operate on the east side of the river between buoy number six (6) and buoy number seven (7). \n(C)                     Operations of sailboats and sailboards are prohibited. \n(D)                     The waterway from the safety cables north of the dam shall be open to boating at all times. \n(E)                     Motorized vessel operations, zones, and their speed limits shall be: \n(1)                     From the safety cables north of the dam to buoy number one (1), motorized vessels shall be operated at idle speed; \n(2)                     From buoy number one (1) to buoy number two (2), on the eastern half of the river, motorized vessels shall be operated at idle speed, and on the western half, motorized vessels shall be operated at a speed not to exceed forty (40) miles per hour; \n(3)                     The speed limit from buoy number two (2) north to buoy number three (3) is idle speed; \n(4)                     The speed limit from buoy number three (3) north to buoy number five (5) is forty (40) miles per hour. \n(5)                     The speed limit from buoy number five (5) north to buoy number six (6) is idle speed. \n(6)                     The speed limit from buoy number six (6) north to buoy number seven (7) shall be forty (40) miles per hour, except within the eastern two-thirds (2/3) of the waterways when skiing is being conducted, no motorized vessel, which is not actively engaged in towing water-skiers shall be operated at a speed exceeding idle speed; \n(7)                     The speed limit from buoy number seven (7) north to two hundred (200) feet south of Rt. 161 shall be idle speed. \n(F)                     Water-skiing will be permitted only between buoy number three (3) to buoy number five (5) and between buoy number six (6) to buoy number seven (7). \n(G)                     The eastern two-thirds (2/3) of the waterway, from buoy number six (6) to buoy number seven (7) is designated as a water sports practice and tournament zone, with a ski jump area on the eastern portion thereof as well as a slalom course. \n(H)                     No person shall operate any motorized vessel at a speed exceeding idle speed within a distance of one hundred (100) feet of the shorelines. \n \nSECTION 4.  That Section 921.01-6 Permits for special water events be amended as follows:\n921.01-6 - Permits for special water events and temporary water access. \n(A) No person or organization shall conduct any race, regatta, or other special event upon the waters waterways of the city without first obtaining written permission, upon application not less than thirty (30) days prior to the time of the proposed race, regatta, or event from the director of recreation and parks. The director of recreation and parks shall have the authority to direct the procedures of these scheduled events and, if necessary, prevent the operation of other boats in certain areas during the designated time of such event. The director of recreation and parks shall timely inform the chief of police of the approved scheduled event.\n(B) Waterways Waters of the city shall be open to all citizens on equal terms and none shall be given special privileges thereon, or be permitted to make use of the waterways waters of the city for any purpose not practically common to all, except, upon written application, when it is in the best interest of the city to further recreational opportunities or to allow for temporary permissions, the director of recreation and parks shall have has the authority to issue permits and promulgate rules and regulations providing for the safe operation of activities conducted conduct upon the waters of the city park property that may otherwise be in violation of this chapter, and to attach conditions to such permits.\n(C) Nothing in this section shall be construed to mean that the operator of a vessel competing in a specially authorized race, regatta, or special event shall not attempt to attain high speeds on a marked racing course. Such events will provide for vessel operation on an hourly basis from non-affected areas.\n(D) It shall be the duty of every person or organization claiming to have a permit for a special water event issued by the director of recreation and parks pursuant to this section to produce and display such permit upon the request of any law enforcement officer or authorized city of Columbus official.\n(E) No person or organization shall recklessly fail to comply with the terms and conditions of any permit issued pursuant to this section.\n(F) No person or organization shall operate or permit to be operated any vessel on the waters of the City in violation of division (A) of this section.\n \nSECTION 5.  That the existing Sections 921.01, 921.01-1, 921.01-3, and 921.01-6 are hereby repealed.\n \nSECTION 6.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law. \n \nSECTION 6. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or 10 days after its passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 109,
    "meeting_date": "2024-04-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services",
      "Infrastructure"
    ]
  }
}