{
  "success": true,
  "vote": {
    "id": 9140,
    "item_number": "CA-3",
    "title": "To authorize the Director of the Department of Technology, on behalf of the Office of the Mayor, to enter into contract with Indigov Corporation for software licensing services in accordance with the provisions of sole source procurement of Columbus City Codes; and to authorize the expenditure of $63,168.00 from the Information Services Operating Fund. ($63,168.00)",
    "description": "Explanation\n \nThis legislation authorizes the Director of the Department of Technology, on behalf of the Mayor's Office, to enter into contract with Indigov Corporation, a Delaware Corporation, for software licensing services, in the amount of $63,168.00.\nThis software is an important management tool in the effective and proactive communication with constituents. The solution is custom built for public officials and allows staff and public officials to efficiently triage incoming communications, reply to those messages and conduct communication and data analysis. The total cost associated with this legislation is $63,168.00. This contract will be for one year, beginning on June 30, 2024 and ending on June 29, 2025.\nIndigov is the sole proprietor and manufacturer of Indigov software products. Thus Indigov software maintenance and support can only be provided by Indigov. As such, this ordinance is submitted in accordance with the provisions of sole source procurement of Columbus City Codes, Section 329.\nThis ordinance also authorizes the expenditure of $63,168.00 for the above-described purpose.\nFISCAL IMPACT\nFunds are budgeted and available in the Department of Technology, Information Services Operating Fund.\nCONTRACT COMPLIANCE\nIndigov Corporation\nVendor Account # 041171\n \n \nTitle\n \nTo authorize the Director of the Department of Technology, on behalf of the Office of the Mayor, to enter into contract with Indigov Corporation for software licensing services in accordance with the provisions of sole source procurement of Columbus City Codes; and to authorize the expenditure of $63,168.00 from the Information Services Operating Fund. ($63,168.00)\n \n \nBody\n \nWHEREAS, the Office of the Mayor uses Indigov software to effectively and proactively communicate with constituents; and\nWHEREAS, this ordinance authorizes entering into contract with Indigov for software maintenance and support; and\nWHEREAS, the aforementioned contract will be for one year, starting on June 30, 2024 and ending on June 29, 2025, at a total cost of $63,168.00; and\nWHEREAS, because Indigov is the sole proprietor and manufacturer of Indigov software products, and because software maintenance and support can only be provided by Indigov, this ordinance is submitted in accordance with the provisions of sole source procurement of Columbus City Codes, Chapter 329; and\nWHEREAS, it is necessary to authorize the Director of the Department of Technology, on behalf of the Office of the Mayor, to enter into contract with Indigov Corporation for software licensing services in accordance with the provisions of sole source procurement of Columbus City Codes, Chapter 329 for the preservation of the public health, peace, property, and safety; NOW THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1. That the Director of the Department of Technology, on behalf of the Mayor's Office, be and is hereby authorized to enter into a contract with Indigov Corporation for software licensing services for a one year period, starting on June 30, 2024 to June 29, 2025 at a total cost of $63,168.00, in accordance with the sole source procurement provisions of Chapter 329 of the Columbus City Codes.\nSECTION 2. That the expenditure of $63,168.00, or so much thereof as may be necessary, is hereby authorized to be expended from the Information Services Operating fund, as shown on the attachment to this ordinance. (see 0823-2024EXP)\nSECTION 3. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\nSECTION 4. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\nSECTION 5. That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 109,
    "meeting_date": "2024-04-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements"
    ]
  }
}