{
  "success": true,
  "vote": {
    "id": 9192,
    "item_number": "SR-17",
    "title": "To authorize the Director of Public Utilities to enter into a construction contract with Trucco Construction Company, Inc., for the Blueprint Linden Hudson McGuffey, Manchester Ave Water Line Improvements, & Celebrate One Blueprint Linden Hudson McGuffey Sidewalk project; to authorize the appropriation and transfer of funds from the Sanitary Sewer Reserve Fund to the Sanitary Revolving Loan Fund and the Water Reserve Fund to the Water Supply Revolving Loan Fund; to authorize the appropriation of funds within the Sanitary Revolving Loan Fund, the Water Supply Revolving Loan Fund, and the Sewer Grants Sanitary Fund; to authorize an amendment to the 2023 Capital Improvement Budget; to authorize the transfer of funds between projects within the Streets and Highways Bond Fund; and to authorize the expenditure of up to $23,423,354.00 to pay for the project.   ($23,423,354.00).",
    "description": "Explanation    \n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Utilities to enter into a construction contract with Trucco Construction Company, Inc., for public sanitary sewers for the Blueprint Linden Hudson McGuffey, Manchester Ave Water Line Improvements, and Celebrate One Blueprint Linden Hudson McGuffey Sidewalk projects, CIP numbers 650870-100701, 690236-100113, and 590955-100062, in an amount up to $23,421,354.00; and to encumber funds with the Department of Public Service for construction administration and inspection services in an amount up to $2,000.00 (for a total expenditure of $23,423,354.00). \n \nThis project is part of the Blueprint Columbus program which is the mechanism by which the City will fulfill its commitments agreed to in the Sanitary Sewer Overflow consent order with the Ohio EPA.  This project will improve water quality within the region by treating the surface runoff before it discharges to the waterways with the construction of rain gardens, permeable paver parking lanes, and regional green infrastructure basins.  The project will also install bump outs, curb, sidewalk, and an 8-inch water main in the area bounded generally by Weber Road, Cleveland Avenue, Hudson Street and Hamilton Avenue. \nThe Community Area for this ordinance will be 40, North Linden.  \n \nTIMELINE:  All work shall be substantially complete within 540 calendar days of the Notice to Proceed, with final completion to occur within 630 calendar days. The City anticipates issuing a Notice to Proceed in May 2024.\n \nESTIMATED COST OF PROJECT:  The bid amount and proposed award amount is $23,421,354.00, including a 20% construction contingency amount that will be utilized to fund needed and approved changes in the work.  No contract modifications are anticipated at this time; however, construction exigency might later compel modification of this contract, if unforeseen difficulties are encountered.\n \nCost summary: \n \nOriginal Contract                                       $23,421,354.00\nFuture Anticipated Needs                                        $0.00 \nPrevailing Wage Services                                  $2,000.00\nCONTRACT TOTAL                               $23,423,354.00\n \n2.  ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT\nThis project is being completed as part of the City’s Blueprint Columbus program.  This project will construct various types of green infrastructure throughout the neighborhood which will provide a higher water quality within the region by treating the surface runoff before it discharges to the waterways. Community outreach has been conducted throughout all phases of design via public meetings, distribution of literature, and identification of the location/limits of the proposed work via field markings and signage.\n \n3.  CONSTRUCTION CONTRACT AWARD\nAn Invitation for Bids for the Public Sanitary Sewers for Blueprint Linden Hudson McGuffey, Manchester Ave Water Line Improvements, & Celebrate One Blueprint Linden Hudson McGuffey Sidewalk project was advertised on the Vendor Services and Bid Express websites from 11/8/23 through 12/1/23.  Two bids were received for the project and were opened on 12/1/23.  The following company submitted a bid:\n  \nCompany                                                   Bid Amount                Compliance Number       ODI Status\n1. Trucco Construction Company, Inc.         $23,421,354.00                  CC004988                         MAJ\n2. Complete General Construction               $24,874,303.20                  CC006056                         MAJ\n \nThe Trucco Construction Company, Inc. bid was deemed the lowest, best, most responsive and responsible bid in the amount of $23,421,354.00.\n \n4.  CONTRACT COMPLIANCE INFORMATION\nTrucco Construction Company, Inc.’s contract compliance number is CC004988 and expires 1/10/26.   \n \nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against Trucco Construction Company, Inc. \n \n5.  MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract was bid with an anticipated City of Columbus MBE/WBE Program goal of 12% as assigned by the City’s Office of Diversity and Inclusion (ODI).  After ODI’s review of the Utilization Plan and other related information the contractor submitted with their bid response, ODI has approved an MBE/WBE Program goal of 12% for this contract.  Failure by the contractor to meet this goal subjects the contractor to the Penalties for Non-Compliance as described in the “City’s Minority and Women-Owned Business Enterprise & Small Local Business Enterprise Program Manual” and in the bid documents for this contract.\nTrucco Construction Company, Inc. listed the following companies as subcontractors for this project:\n \nCompany Name                                            City/State                                     ODI Certification Status\nCAP-Stone & Associates, Inc.                      Columbus, Ohio                                      WBE\n4K Landscape LLC                                       Dublin, Ohio                                           MAJ\nComplete Clearing, Inc.                                 Marengo, Ohio                                        MAJ\nDecorative Paving Company                         Loveland, Ohio                                        MAJ\nBridges Bros. Trucking                                 Columbus, Ohio                                       MBE\nJLD Construction, LLC                                 Columbus, Ohio                                       MBE\nPaul Peterson Company                                Columbus, Ohio                                       MAJ\n \nThe certification of Trucco Construction Company, Inc., Inc. and the above companies was in good standing at the time the bid was awarded.\n \n6.  PRE-QUALIFICATION STATUS\nTrucco Construction Company, Inc. and all subcontractors have met code requirements with respect to pre-qualification, pursuant to relevant sections of Columbus City Code Chapter 329.  \n \n7.  FISCAL IMPACT\nDivision of Sewerage and Drainage (DOSD) Funding\nThe DOSD portion of this project (CIP #650870-100701 for $20,453,522.96) is anticipated to be financed with a grant from the Ohio Department of Development (ODOD), a loan from the Water Pollution Control Loan Fund (WPCLF), and funds from the Sanitary Bond Fund, Fund 6109.\nThe ODOD grant is a $3,500,000.00 reimbursement grant.  The grant agreement has been executed and assigned Grant #G602302 by the Auditor’s Office.  Funds in the amount of $3,500,000.00 will need to be appropriated in the Sewer Grants Sanitary Fund, Fund 6103, for G602302.  The Department of Public Utilities will pay the contractor and then submit reimbursement requests to ODOD.  All project costs are eligible for reimbursement by the ODOD grant.  The Department of Public Utilities intends to submit the first $3,500,000.00 of charges for this contract to ODOD for reimbursement.  The contract with ODOD states they will not make the final reimbursement payment until the project is complete.\n \nThe WPCLF program is jointly administered by the Ohio EPA's Division of Environmental and Financial Assistance and the Ohio Water Development Authority (OWDA) and will fund $16,951,522.96 of the DOSD project cost.  City Council authorized this loan application and acceptance of funding via Ordinance 2767-2023 passed by Council on 10/30/2023.  This loan is expected to be approved in April of 2024.  Funds will need to be certified against the Sanitary Sewer Reserve Fund, Fund 6102, to proceed with this project until the loan has been approved.  Funds will need to be appropriated within the Sanitary Sewer Reserve Fund, Fund 6102, transferred to the Sanitary Revolving Loan Fund, Fund 6111, and then appropriated in the Sanitary Revolving Loan Fund, Fund 6111, in order to fund this expenditure.  This transaction is a temporary measure that is required until such time as the division is able to execute a loan with the WPCLF and reimburse the Sanitary Sewer Reserve Fund.  An amendment to the 2023 Capital Improvement Budget is needed to reflect the loan funding for this project.    \n \nFunding in the amount of $2,000.00 is appropriated and available within the Sanitary Bond Fund, Fund 6109, to pay the Department of Public Service to provide prevailing wage services for this project.  An amendment to the 2023 Capital Improvement Budget is necessary to align budget authority with the proper project. \nDivision of Water (DOW) Funding\nThe DOW portion of this project (CIP#690236-100113 for $2,194,755.84) is anticipated to be funded with a loan from the Water Supply Revolving Loan Account (WSRLA).  The WSRLA program is jointly administered by the Ohio EPA’s Division of Environmental and Financial Assistance and the Ohio Water Development Authority (OWDA). City Council authorized these loan applications and acceptance of funding via Ordinance 0944-2023, passed by Council on 4/24/23.  This loan is expected to be approved in April, 2024.  Funds will need to be certified against the Water Reserve Fund, Fund 6003, to proceed with this project until the loan has been approved.  Funds will need to be appropriated within the Water Reserve Fund, Fund 6003, transferred to the Water Revolving Loan Fund, Fund 6011, and then appropriated in the Water Revolving Loan Fund, Fund 6011, in order to fund this expenditure.  This transaction is a temporary measure that is required until such time as the division is able to execute a loan with the WSRLA and reimburse the Water Reserve Fund.  An amendment to the 2023 Capital Improvement Budget is needed to reflect the loan funding for this project. \n \nDepartment of Public Service (DPS) Funding\nThe DPS portion of this project (CIP #590955-100062) is appropriated and available within the Streets and Highways Bond Fund, Fund 7704. An amendment to the 2023 Capital Improvement Budget is necessary to align budget authority with the proper project. A transfer of cash and appropriation between projects within the Streets and Highways Bond Fund is needed to align cash and appropriation with the proper project.\nTitle\nTo authorize the Director of Public Utilities to enter into a construction contract with Trucco Construction Company, Inc., for the Blueprint Linden Hudson McGuffey, Manchester Ave Water Line Improvements, & Celebrate One Blueprint Linden Hudson McGuffey Sidewalk project; to authorize the appropriation and transfer of funds from the Sanitary Sewer Reserve Fund to the Sanitary Revolving Loan Fund and the Water Reserve Fund to the Water Supply Revolving Loan Fund; to authorize the appropriation of funds within the Sanitary Revolving Loan Fund, the Water Supply Revolving Loan Fund, and the Sewer Grants Sanitary Fund; to authorize an amendment to the 2023 Capital Improvement Budget; to authorize the transfer of funds between projects within the Streets and Highways Bond Fund; and to authorize the expenditure of up to $23,423,354.00 to pay for the project.   ($23,423,354.00). \n  \nBody\nWHEREAS, the Department of Public Utilities is engaged in the Blueprint Linden Hudson McGuffey, Manchester Ave Water Line Improvements, & Celebrate One Blueprint Linden Hudson McGuffey Sidewalk project; and\n \nWHEREAS, two bids for the Public Sanitary Sewers for the Blueprint Linden Hudson McGuffey, Manchester Ave Water Line Improvements, & Celebrate One Blueprint Linden Hudson McGuffey Sidewalk project were received and opened on 12/1/23; and\n \nWHEREAS, the lowest, best, most responsive and responsible bid was from Trucco Construction Company, Inc.; and\n \nWHEREAS, Ordinance 2767-2023 authorized part of this this project to be funded by a loan to be obtained through the Water Pollution Control Loan Fund (WPCLF) and Ordinance 0944-2023 authorized part of this project to be funded by a loan to be obtained through the Water Supply Revolving Loan Account (WSRLA); and\n \nWHEREAS, it is necessary to both appropriate funds from the Sanitary Sewer Reserve Fund and the Water Reserve Fund and to authorize the transfer of said funds into the Sanitary Revolving Loan Fund and the Water Supply Revolving Loan Account in order to temporarily fund these expenditures until such time as the City is able to execute loans for the above stated purpose and reimburse the Sanitary Sewer Reserve Fund and the Water Reserve Fund; and\n \nWHEREAS, the funds transferred into the Sanitary Revolving Loan Fund and the Water Supply Revolving must be appropriated; and\n \nWHEREAS, a reimbursement grant in the amount of $3,500,000.00 was obtained from the Ohio Department of Development to help pay for the project; and\n \nWHEREAS, the grant funds need to be appropriated; and \n \nWHEREAS, the 2023 Capital Improvement Budget must be modified to align budget authority with the proper projects; and\n \nWHEREAS, it is necessary to transfer funds within the Streets and Highways Bond Fund to align cash and appropriation with the proper project; and\n \nWHEREAS, the City anticipates incurring certain Original Expenditures (as defined in Section 1.150-2(c) of the Treasury Regulations (the “Treasury Regulations”) promulgated pursuant to the Internal Revenue Code of 1986, as amended) with respect to the construction of the Project described in this Ordinance (collectively, the “Project”); and\n \nWHEREAS, it is necessary to authorize the Director of the Department of Public Utilities to enter into a construction contract with Trucco Construction Company, Inc. for the for the Blueprint Linden Hudson McGuffey, Manchester Ave Water Line Improvements, & Celebrate One Blueprint Linden Hudson McGuffey Sidewalk project; and \n \nWHEREAS, it is necessary to authorize an expenditure of funds from the Sanitary Revolving Loan Fund, the Sanitary Bond Fund, the Water Supply Revolving Loan Fund, and the Streets and Highways Bond Fund to pay for this project; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2023 Capital Improvement Budget authorized by Ordinance 1711-2023 be amended as follows to establish sufficient budget authority for this project:\n \nFund / Project Number / Project Name (Funding Source) / Current Authority / Revised Authority / Change \n6111 / 650870-100701 / Blueprint Linden - Hudson / McGuffey (WPCLF/OWDA) / $0.00 / $16,951,523.00 / $16,951,523.00 (To match the loan amount)\n \n6011 / 690236-100113 / Manchester Ave Water Line Improvements (WSRLA Loan) / $0.00 / $2,194,756.00 / $2,194,756.00 (To match the loan amount)\n \n6109 / 650870-109152 / Blueprint 5th Ave by Northwest - Edgehill / Meadow (Voted Sanitary Carryover) / $373,133.00 / $371,133.00 / ($2,000.00)\n6109 / 650870-100701 / Blueprint Linden - Hudson / McGuffey (Voted Sanitary Carryover) / $20,499.00 / $22,499.00 / $2,000.00\n \n7704 / 590105-100112 / Pedestrian Safety Improvements - Refugee Road - Winchester Pike to Hamilton Road (Voted Carryover) / $0.00 / $819,641.00 / $819,641.00 (to match cash)\n \n7704 / 590105-100444 / Pedestrian Safety Improvements-Linden Blueprint New Sidewalk Contributions (Voted Carryover) / $100,000.00 / $0.00 / ($100,000.00) \n7704 / 590105-100112 / Pedestrian Safety Improvements - Refugee Road - Winchester Pike to Hamilton Road (Voted Carryover) / $819,641.00 / $144,566.00 / ($675,075.00) \n \n7704 / 590955-100062 / CelebrateOne - Blueprint Linden - Hudson McGuffey Sidewalk (Voted Carryover) / $0.00 / $775,075.00 / $775,075.00\n \nSECTION 2.  That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ending December 31, 2024, the sum of $22,646,278.80 is appropriated in the Sanitary Reserve Fund, Fund 6102, the Water Reserve fund, Fund 6003, and the Sewer Grants Sanitary Fund, Fund 6103 per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That the transfer of $16,951,522.96, or so much thereof as may be needed, is hereby authorized between the Sanitary Reserve Fund, Fund 6102, and the Sanitary Revolving Loan Fund, Fund 6111; and the transfer of $2,194,755.84, or so much thereof as may be needed, is hereby authorized between the Water Reserve Fund, Fund 6003, and the Water Supply Revolving Loan Fund, Fund 6011, per the account codes in the attachment to this ordinance.\n \nSECTION 4.  That the appropriation of $16,951,522.96, or so much thereof as may be needed, is hereby authorized in the Sanitary Revolving Loan Fund, Fund 6111, and the appropriation of $2,194,755.84, or so much thereof as may be needed, is hereby authorized in the Water Supply Revolving Loan Fund, Fund 6011, per the accounting codes in the attachment to this ordinance.\n \nSECTION 5.  That the transfer of $100,000.00, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5912 (Design and Construction), Project P590105-100444 (Pedestrian Safety Improvements-Linden Blueprint New Sidewalk Contributions), Object Class 06 (Capital Outlay) to Dept-Div 5912 (Design and Construction), Project P590955-100062 (CelebrateOne - Blueprint Linden - Hudson McGuffey Sidewalk), in Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\n \nSECTION 6.  That the transfer of $655,075.20, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5912 (Design and Construction), Project P590105-100112 (Pedestrian Safety Improvements - Refugee Road - Winchester Pike to Hamilton Road), Object Class 06 (Capital Outlay) to Dept-Div 5912 (Design and Construction), Project P590955-100062 (CelebrateOne - Blueprint Linden - Hudson McGuffey Sidewalk), in Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\n \nSECTION 7.  That the Director of Public Utilities is hereby authorized to enter into a construction contract for the Blueprint Linden Hudson McGuffey, Manchester Ave Water Line Improvements, & Celebrate One Blueprint Linden Hudson McGuffey Sidewalk project with Trucco Construction Company, Inc., 4500 Snodgrass Road, Mansfield, Ohio 44903, in an amount up to $23,421,354.00; in accordance with the terms and conditions of the contract on file in the Department of Public Utilities; and to obtain the necessary construction administration and inspection services for this project from the Department of Public Services in an amount up to $2,000.00.\n \nSECTION 8.  That the expenditure of $23,423,354.00, or so much thereof as may be needed, is hereby authorized to pay for this contract per the accounting codes in the attachment to this ordinance. \n \nSECTION 9.  That upon obtaining other funds for the purpose of funding sewer system capital improvement work, the City Auditor is hereby authorized to repay the Sanitary System Reserve Fund, Fund 6102, and the Water Reserve Fund, Fund 6003, the amount transferred above (Section 3), and said funds are hereby deemed appropriated for such purposes.\n \nSECTION 10.  That the City intends that this Ordinance constitute an \"official intent\" for purposes of Section 1.150-2(e) of the Treasury Regulations, and that the City reasonably expects to reimburse itself for certain Original Expenditures incurred with respect to the Project from the proceeds of obligations to be issued by the City in a principal amount currently estimated to be $19,146,278.80 (the \"Obligations\").\n \nThe City intends to make a reimbursement allocation on its books for the Original Expenditures not later than eighteen months following the later to occur of the date of the Original Expenditure to be reimbursed or the date the Project for which such Original Expenditures were made is \"placed in service\" within the meaning of Treasury Regulations Section 1.150-2(c).  Upon the issuance of the Obligations, the proceeds of such Obligations shall be used to reimburse the Sanitary Reserve Fund, Fund 6102, and the Water Reserve Fund, Fund 6003, which are the funds from which the advance for costs of the Project will be made.\n \nSECTION 11.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 12.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 13.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 14.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 109,
    "meeting_date": "2024-04-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Grants"
    ]
  }
}