{
  "success": true,
  "vote": {
    "id": 920,
    "item_number": "CA-16",
    "title": "To authorize the Director of Recreation and Parks to enter into contract with M&D Blacktop for the Hard Surface Improvements 2020-2021 Project; to authorize the transfer of $1,033,010.02 within the Recreation and Parks Voted Bond Fund, to authorize the amendment of the 2020 Capital Improvements Budget; to authorize the expenditure of $903,826.80 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($903,826.80)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Director of the Recreation and Parks Department to enter into contract with M&D Blacktop for the Hard Surface Improvements 2020-2021 Project. The contract amount is $622,826.80, with a contingency of $279,000.00, for a total of $901,826.80. An additional $2,000.00 is being authorized for interdepartmental inspections and fees for a total of $903,826.80 being authorized by this ordinance.\n \nEach year, the Recreation and Parks Department allocates a portion of the Capital Improvements Budget to the improvement of existing hard surfaces and new installations of hard surfaces. This particular contract focuses on the removal and replacement of existing asphalt and concrete surfaces that are highly used by the public, including entry drives, parking lots, and walkways.  By improving these surfaces, safe and easy access can be ensured to the parks and facilities. Areas for improvement were initially considered through recommendations from internal staff and public involvement. All requests were assessed through a Pavement Condition Rating (PCR) form and were given a rating from 0, meaning the worst condition, to 100, meaning the best condition. All requests were prioritized for action based on their respective PCR scores. From there, staff confirmed which projects to move forward with. \n \nThe Hard Surface Improvements 2020-2021 Project includes the following locations:\n \nFranklin Park\nMadison Mills Park\nKrumm Park\nNorthmoor Park\nInnis Park\nWillow Creek Park\nNorthcrest Park\nDriving Park\nGoodale Park\nBlackburn Park\nMentel Memorial Golf Course\nAirport Golf Course\nWhetstone Park\nLazelle Woods Park\nDodge Park\n \nVendor Bid/Proposal Submissions (ODI designation status):\n \nBids were advertised through Vendor Services, in accordance with City Code Section 329, on February 25, 2021  and received by the Recreation and Parks Department on March 18, 2021. This project was also picked up by various local and regional plan rooms and distributed to their membership. Bids were received from the following companies:\n \nM&D Blacktop (MAJ): $498,744.30 - Base bid, prior to alternates and contingency being added\n \nAfter reviewing the bids that were submitted, it was determined that M&D Blacktop was the lowest and most responsive bidder. M&D Blacktop and all proposed subcontractors have met code requirements with respect to prequalification, pursuant to relevant sections of Columbus City Code Chapter 329.\n \nPrincipal Parties: \nPavement Protectors DBA M&D Blacktop\n2020 Longwood Avenue, Grove City, OH, 431123 \nMark Nance; (614) 875-9989\nContract Compliance Number, Tax ID: 004731, 31-1131599\nContract Compliance Expiration Date: February 1, 2023                     \n \nEmergency Justification: Emergency action is requested as there is a limited window for temperature and weather appropriate construction of hard surface improvements prior to the end of 2021. \n \nBenefits to the Public: This project aims to provide accessible and usable asphalt, concrete, and sport court improvements throughout our park properties.\n \nCommunity Input/Issues: Needed improvements were identified by both internal staff and from community requests. The community has expressed the desire for well-kept facilities and amenities through public workshops, social media, and direct contact with staff.  \n \nArea(s) Affected: Citywide (99)\n \nMaster Plan Relation: This project supports the department’s Master Plan by removing access and circulation barriers to city parks. It also helps meet the goal of improving at least five neighborhood parks per year. \n \nFiscal Impact: $903,826.80 is budgeted and available from within the Recreation and Parks Voted Bond Fund 7702 to meet the financial obligations of this contract.\n \nTitle\n \nTo authorize the Director of Recreation and Parks to enter into contract with M&D Blacktop for the Hard Surface Improvements 2020-2021 Project; to authorize the transfer of $1,033,010.02 within the Recreation and Parks Voted Bond Fund, to authorize the amendment of the 2020 Capital Improvements Budget; to authorize the expenditure of $903,826.80 from the Recreation and Parks Voted Bond Fund; and to declare an emergency. ($903,826.80)\n \nBody\n \nWHEREAS, it is necessary to authorize the Director of the Recreation and Parks to enter into contract with M&D Blacktop for the Hard Surface Improvements 2020-2021 Project; and\n \nWHEREAS, it is necessary to authorize the transfer of $1,033,010.02 within the Recreation and Parks Voted Bond Fund 7702; and\n \nWHEREAS, it is necessary to authorize the amendment of the 2020 Capital Improvements Budget Ordinance 2521-2020 in order to provide sufficient budget authority for this and future projects; and\n \nWHEREAS, it is necessary to authorize the expenditure of $903,826.80 from the Recreation and Parks Voted Bond Fund 7702; and\n \nWHEREAS, an emergency exists in the usual daily operations of the Recreation and Parks Department in that it is immediately necessary to authorize the Director to enter into contract with M&D Blacktop as there is a limited window for temperature and weather appropriate construction of hard surface improvements prior to the end of 2021, all for the preservation of the public health, peace, property, safety, and welfare and, NOW, THEREFORE \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Recreation and Parks be and is hereby authorized to enter into contract with M&D Blacktop for the Hard Surface Improvements 2020-2021 Project.\n \nSECTION 2. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 3. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 4. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 5. That the transfer of $1,033,010.02 or so much thereof as may be needed, is hereby authorized between projects within the Recreation and Parks Bond Fund 7702 per the account codes in the attachment to this ordinance.\n \nSECTION 6. That the 2020 Capital Improvements Budget Ordinance 2521-2020 is hereby amended as follows in order to provide sufficient budget authority for this ordinance and future projects.\nFund / Project / Project Name / Current / Change / Amended\n \nFund 7702; P511000-100000; Renovation - Misc. (SIT Supported) / $1,554,924 / ($233,010) / $1,321,914\nFund 7702; P511007-100000; Hard Surface Improvements (SIT Supported) / $800,000 / ($800,000) / $0\n \nFund 7702; P511007-202102; Hard Surface Improvements 2020-2021 (SIT Supported) / $0 / $1,033,010 / $1,033,010\n \nSECTION 7. For the purpose stated in Section 1, the expenditure of $903,826.80 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Recreation and Parks Voted Bond Fund 7702 in object class 06 Capital Outlay per the accounting codes in the attachments to this ordinance.  \nSECTION 8. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 15,
    "meeting_date": "2021-05-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}