{
  "success": true,
  "vote": {
    "id": 9217,
    "item_number": "CA-13",
    "title": "To amend the 2023 Capital Improvement Budget; to authorize the transfer of cash and appropriation within the Streets and Highways Bond Fund; to authorize the interim Director of Public Service to enter into agreements with and to provide funding to the Ohio Department of Transportation relative to the FRA-270-0.96/1.52  project, PID 105498; to authorize the expenditure of up to $987,360.00 from the Streets and Highways Bond Fund to support that project; and to declare an emergency.  ($987,360.00)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the interim Director of Public Service to enter into agreements with and provide funding to the Ohio Department of Transportation (ODOT) for the FRA-270-0.96/1.52  project, PID 105498.  \n \nThe aforementioned effort encompasses various improvements including: widening the deck of bridge structure FRA-270-0.96 (Gantz Rd over I-270) to accommodate a shared use path along with approach sidewalk, and preparing the North side of FRA-270-1.52 (McComb Rd over I-270) for a future sidewalk, which includes excavation, embankment, sidewalk, curb ramps, and drainage.\n \nOrdinance 1399-2023 previously authorized the Director of Public Service to grant consent and propose cooperation with ODOT relative to the FRA-270-0.96/1.52  project, PID 105498. The purpose of this legislation is to enable the Department of Public Service to satisfy its administrative and financial obligations related to that effort by authorizing: 1) the execution of a contribution agreement or other instrument, and any amendments or modifications thereto, between the Department of Public Service, acting through its interim director, and ODOT, and 2) the encumbrance and expenditure of up to $987,360.00 to support completion of the project. \n \n2.  FISCAL IMPACT\nFunding in the amount of up to $987,360.00 is available within the Streets and Highways Bond Fund within the Department of Public Service to support the local share of estimated construction costs; however, the final cost to the City may vary based on the results of the competitive bidding process administered by ODOT. An amendment to the 2023 Capital Improvement Budget and a transfer of cash and appropriation within the Streets and Highways Bond Fund is necessary for the purpose of providing sufficient spending authority for the aforementioned expenditure. \n \n3.  MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nODOT is a political subdivision of the State of Ohio. As such, City of Columbus MBE/WBE/SLBE program requirements are not applicable. \n \n4.  EMERGENCY DESIGNATION\nEmergency action is requested to enable the Department of Public Service to execute and return the necessary contribution agreement along with the requisite payment to ODOT on or before April 19, 2024, in order to maintain the project schedule established by ODOT and to promote highway safety. \n \nTitle\nTo amend the 2023 Capital Improvement Budget; to authorize the transfer of cash and appropriation within the Streets and Highways Bond Fund; to authorize the interim Director of Public Service to enter into agreements with and to provide funding to the Ohio Department of Transportation relative to the FRA-270-0.96/1.52  project, PID 105498; to authorize the expenditure of up to $987,360.00 from the Streets and Highways Bond Fund to support that project; and to declare an emergency.  ($987,360.00) \n \nBody\nWHEREAS, the Ohio Department of Transportation (ODOT) is administering the FRA-270-0.96/1.52 project, PID 105498, which encompasses various improvements including widening the deck of bridge structure FRA-270-0.96 (Gantz Rd over I-270) to accommodate a shared use path along with approach sidewalk, and preparing the North side of FRA-270-1.52 (McComb Rd over I-270) for a future sidewalk, which includes excavation, embankment, sidewalk, curb ramps, and drainage; and\n \nWHEREAS, the aforementioned project is located within the corporate boundaries of Columbus; and\n \nWHEREAS, Ordinance 1399-2023 authorized the Director of the Department of Public Service to grant consent and to agree to cooperate with ODOT relative to the aforementioned project; and \n \nWHEREAS, this legislation authorizes the Director of Public Service to enter into agreements with and to make payment in the amount of $987,360.00 to ODOT relative to the aforementioned project; and\n \nWHEREAS, it is necessary to authorize an amendment to the 2023 Capital Improvement Budget for the purpose of providing sufficient budget authority for the aforementioned project expenditure; and\n \nWHEREAS, it is necessary to authorize a transfer of cash and appropriation within the Streets and Highways Bond Fund; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to authorize the passage of this legislation to enable the interim Director to execute and return the necessary contribution agreement along with the requisite payment to ODOT on or before April 19, 2024, in order to maintain the schedule established by ODOT and to promote highway safety, all for the immediate preservation of the public health, peace, property, and safety; and NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the 2023 Capital Improvement Budget authorized by Ordinance 1711-2023 be and is hereby amended to provide sufficient budget authority for the expenditure as follows:\n \nFund / Project / Project Name / Current / Change / Amended\n7704 / P590105-100115 / Pedestrian Safety Improvements - Third Avenue Sidewalks (Voted Carryover) / $495,000.00 / ($495,000.00) / $0.00\n7704 / P590105-100005 /  Pedestrian Safety Improvements - Sidewalk Program - Citywide Sidewalk Repairs (Voted Carryover) / $328,558.00 / ($328,558.00) / $0.00\n7704 / P590105-100083 / Pedestrian Safety Improvements - Wilson Road Shared Use Path (Voted Carryover) / $66.00 / ($66.00) / $0.00\n7704 / P590955-910030 / CelebrateOne Sidewalk - Hilltop (Belvidere from Mound to Sullivant) (Voted Carryover) / $261,732.00 / ($163,736.00) / $97,996.00\n \n7704 / P590105-100480 / Pedestrian Safety Improvements - Gantz Rd and McComb Rd (Voted Carryover) / $0.00 / $987,360.00 / $987,360.00\n \nSECTION 2.  That the transfer of $163,736.00, or so much thereof as may be needed, is hereby authorized in Fund 7704 (Streets and Highways Bond Fund), Dept-Div 59-12 (Division of Design and Construction), Project P590955-910030 (CelebrateOne Sidewalk - Hilltop (Belvidere from Mound to Sullivant)), Object Class 06 (Capital Outlay), to Dept-Div 59-11 (Division of Infrastructure Management), Project P590105-100480 (Pedestrian Safety Improvements - Gantz Rd and McComb Rd), Object Class 06 (Capital Outlay), per the accounting codes in the attachment to this ordinance. \n \nSECTION 3.  That the interim Director of Public Service be and is hereby authorized to enter into a contribution agreement, and any amendments or modifications thereto as may be necessary, with the Ohio Department of Transportation (ODOT) and to make payment to ODOT relative to the FRA-270-0.96/1.52 project, PID 105498.\n \nSECTION 4.  That the expenditure of $987,360.00, or so much thereof as may be needed, is hereby authorized in Fund 7704 (Streets and Highways Bond Fund), Dept-Div 59-11 (Division of Infrastructure Management), Project P590105-100480 (Pedestrian Safety - Gantz Rd and McComb Rd), in Object Class 06 (Capital Outlay), per the accounting codes in the attachment to this ordinance. \n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 7.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 8.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the mayor, or ten days after passage if the mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 110,
    "meeting_date": "2024-04-29",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}