{
  "success": true,
  "vote": {
    "id": 9234,
    "item_number": "CA-30",
    "title": "To authorize and direct the Board of Health to accept a two month grant extension from Ohio Department of Health in the amount of $203,275.00 for the Implementing Enhanced HIV Prevention and Surveillance for Health Departments to End the HIV Epidemic in Ohio Grant Program, for a new total award amount of $1,103,275.00, and a new grant period of August 1, 2023 through July 31, 2024; to authorize the appropriation of $203,275.00 from the unappropriated balance of the Health Department Grants Fund; and to declare an emergency. ($203,275.00)",
    "description": "Explanation\n \nBACKGROUND: Columbus Public Health has been awarded a two month extension for the Implementing Enhanced HIV Prevention and Surveillance for Health Departments to End the HIV Epidemic in Ohio Grant Program from the Ohio Department of Health. This ordinance authorizes the Board of Health to accept and appropriate an additional $203,275.00 in grant monies to fund Implementing Enhanced HIV Prevention and Surveillance for Health Departments to End the HIV Epidemic in Ohio Grant Program, for the period of August 1, 2023, through July 31, 2024. The new total award amount is $1,103,275.00, originating Ordinance for the Implementing Enhanced HIV Prevention and Surveillance for Health Departments to End the HIV Epidemic in Ohio Grant Program is referenced in Ordinance No. 2072-2023.\nThe Implementing Enhanced HIV Prevention and Surveillance for Health Departments to End the HIV Epidemic in Ohio Grant Program enables Columbus Public Health (CPH) to prevent new HIV infections by focusing on four (4) pillars: Treat , Diagnose, Prevent, and Respond. This grant specifically focuses on the Diagnose and Prevent pillars. Columbus Public Health (CPH) embraces the Center for Disease Control and Prevention’s mantra toward Ending the HIV Epidemic, which is to create “Disruptive Innovation”. In conjunction with community leaders and stakeholders, a strategic plan to reduce the number of people living with HIV by 75% in 5 years and 90% in 10 years is the goal of this program.\nEmergency action is requested to allow the financial transaction to be posted in the City's accounting system as soon as possible. Up to date financial posting promotes accurate accounting and financial management to meet deliverables required by grantor and reduces the risk of being in forfeiture of grant funds.\n \nFISCAL IMPACT: The Implementing Enhanced HIV Prevention and Surveillance for Health Departments to End the HIV Epidemic in Ohio Grant Program is entirely funded by the Ohio Department of Health and does not generate revenue or require a City Match. ($203,275.00) \nTitle\nTo authorize and direct the Board of Health to accept a two month grant extension from Ohio Department of Health in the amount of $203,275.00 for the Implementing Enhanced HIV Prevention and Surveillance for Health Departments to End the HIV Epidemic in Ohio Grant Program, for a new total award amount of $1,103,275.00, and a new grant period of August 1, 2023 through July 31, 2024; to authorize the appropriation of $203,275.00 from the unappropriated balance of the Health Department Grants Fund; and to declare an emergency. ($203,275.00) \nBody\nWHEREAS, $203,275.00 in additional grant funds have been made available through the Ohio Department of Health for the Implementing Enhanced HIV Prevention and Surveillance for Health Departments to End the HIV Epidemic in Ohio Grant Program as a two month extension for the period of August 1, 2023, through July 31, 2024; and, \nWHEREAS, it is necessary to accept and appropriate these funds from the Ohio Department of Health for the continued support of Implementing Enhanced HIV Prevention and Surveillance for Health Departments to End the HIV Epidemic in Ohio Grant Program; and, \nWHEREAS, it is necessary to allow the City Auditor to transfer appropriations between object classes and grant numbers for the Implementing Enhanced HIV Prevention and Surveillance for Health Departments to End the HIV Epidemic in Ohio Grant Program as needed upon request by the Columbus Public Health department to carry out the purpose of the grant; and, \nWHEREAS, an emergency exists in the usual daily operation of Columbus Public Health in that it is immediately necessary to authorize the Board of Health to accept these grant funds from the Ohio Department of Health and to appropriate these funds to Columbus Public Health due to the grant extension start date, to not delay the funding for essential grant personnel, and for the immediate preservation of the public health, peace, property, safety and welfare, and to avoid delay in client services; NOW, THEREFORE, \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS: \nSECTION 1. That the Board of Health is hereby authorized and directed to accept a two month grant extension award of $203,275.00 from the Ohio Department of Health for the Implementing Enhanced HIV Prevention and Surveillance for Health Departments to End the HIV Epidemic in Ohio Grant Program, for a new total award amount of $1,103,275.00, and a new grant period of August 1, 2023 to July 31, 2024.\nSECTION 2. That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the grant period, the sum of $203,275.00 is hereby appropriated upon receipt of an executed grant agreement to The Health Department Grants Fund, Fund 2251, Department of Health, Division 5001, per the account codes in the attachment to this ordinance. \nSECTION 3. That the monies appropriated in the foregoing Section 2 shall be paid upon the order of the Health Commissioner and that no order shall be drawn or money paid except upon voucher, the form of which shall be approved by the City Auditor. \nSECTION 4. At the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements. \nSECTION 5. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n SECTION 6. That the City Auditor is hereby authorized to transfer appropriations between object classes and grant numbers for the Implementing Enhanced HIV Prevention and Surveillance for Health Departments to End the HIV Epidemic in Ohio Grant Program as needed upon request by the Columbus Public Health department to carry out the purpose of the grant. \nSECTION 7. That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 110,
    "meeting_date": "2024-04-29",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services",
      "Grants"
    ]
  }
}