{
  "success": true,
  "vote": {
    "id": 9264,
    "item_number": "SR-14",
    "title": "To authorize the Director of the Department of Public Utilities to enter into a construction contract with The Righter Co., Inc. for the Stelzer Road Pressure Reducing Valve; to authorize an amendment to the 2023 Capital Improvement Budget; to authorize the appropriation and transfer of funds from the Water System Reserve Fund to the Water-Fresh Water Market Rate Program Fund; to authorize the appropriation and expenditure of $2,158,963.54 from the Water-Fresh Water Market Rate Program Fund for the contract; and to authorize an expenditure of $2,000.00 from the Water Bond Fund to pay for the prevailing wage services for the project.  ($2,160,963.54)",
    "description": "Explanation    \n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Utilities to enter into a construction contract with The Righter Co., Inc. for the Stelzer Road PRV project, CIP #690473-100019, in an amount up to $2,158,963.54, and to encumber funds with the Department of Public Service for prevailing wage services in an amount up to $2,000.00, for a total expenditure of $2,160,963.54.\n \nWork consists of constructing a new pressure reducing valve, and the associated piping and vault, that will be located adjacent to an existing 30-inch diameter emergency connection between parallel 48-inch diameter transmission mains near the intersection of Stelzer Rd and Easton Commons.  This Division of Water (DOW) project was deemed necessary by our Master Plan consultants and planning group to provide sufficient water to the Morse Pressure District, from the North Pressure District, in order to allow the DOW to meet the projected short-term increase in demands projected for the North-Eastern quadrant of our Distribution System between 2025 and 2029. The addition of this Pressure Reducing Valve will allow us to supply an additional average flow of 5 million gallons a day to the district, which will provide sufficient water to buffer the projected increase of near-term demands until the Fourth Water Plant is constructed and commissioned.\n \nThe Community Planning Area is “41 - Northeast”\n \nTIMELINE: All work shall be complete within 365 calendar days from the Notice to Proceed.  The City anticipates issuing a Notice to Proceed in June 2024.  \n \nESTIMATED COST OF PROJECT:  The bid amount and proposed award amount is $2,158,963.54, including a 15% construction contingency amount that will be utilized to fund needed and approved changes in the work.  No contract modifications are anticipated at this time; however, construction exigency might later compel modification of this contract, if unforeseen difficulties are encountered.\n \nCost summary: \n \nOriginal Contract                                           $2,158,963.54\nFuture Anticipated Needs                              $0.00\nCONTRACT TOTAL                            $2,158,963.54\nPrevailing Wage Charge                            $2,000.00\n                                                                                          $2,160,963.54\n \n2.  ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT\nThis Division of Water (DOW) project was deemed necessary by our Master Plan consultants and planning group to provide sufficient water to the Morse Pressure District, from the North Pressure District, in order to allow the DOW to meet the projected short-term increase in demands projected for the North-Eastern quadrant of our Distribution System between 2025 and 2029. The addition of this Pressure Reducing Valve will allow us to supply an additional average flow of 5 million gallons a day to the district, which will provide sufficient water to buffer the projected increase of near-term demands until the Fourth Water Plant is constructed and commissioned.  The Neighborhood Liaison(s) will be contacted and informed of this project during the design phase.  Further community outreach may result through the Neighborhood Liaison Program.\n \n3.  BID INFORMATION\nThis project was formally advertised on the Vendor Services and Bid Express websites from 1/11/2024 through 2/14/2024.   Two bids were received:\n \n     Name                                                           Bid Amount________City/State              Status  \nComplete General Construction Company           $1,765,865.25               Columbus, OH            MAJ\nThe Righter Co., Inc.                                         $2,158,963.54               Columbus, OH            MAJ\n \nCompete General Construction Company’s bid was deemed unresponsive as they did not meet the City’s MBE/WBE goal and ODI deemed their good faith effort was not sufficient to allow their bid to be considered for contract award.  The Righter Co., Inc.’s bid was deemed the lowest, best, most responsive bid.  \n \n4.  CONTRACT COMPLIANCE INFORMATION\nThe Righter Co., Inc.’s contract compliance number is CC004433 and expires 10/25/25.  \n \n5.  MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract was bid with an anticipated City of Columbus MBE/WBE Program goal of 15% as assigned by the City’s Office of Diversity and Inclusion (ODI).  After ODI’s review of the Utilization Plan and other related information the contractor submitted with their bid response, ODI has approved an MBE/WBE Program goal of 15% for this contract.  \n \nAs part of their proposal, The Righter Co., Inc. has proposed the following subcontractors to perform contract work:\n \nCompany Name                                         City/State                                     ODI Certification Status \nU.S. Utility Contractor Company                Columbus, Ohio                                                WBE                                \nCAP-Stone & Associates, Inc.                    Westerville, Ohio                                             WBE \nPaul Peterson Company                              Columbus, Ohio                                               MAJ\n                                                                                                                                                                               \nThe certification of The Righter Co., Inc. and the above companies was in good standing at the time the bid was awarded.\n \n6. PRE-QUALIFICATION STATUS\nThe Righter Co., Inc. and all subcontractors have met code requirements with respect to pre-qualification, pursuant to relevant sections of Columbus City Code Chapter 329. \n \n7.  FISCAL IMPACT\nFunding for this contract will be obtained through the Ohio Water Development Authority (OWDA) Direct Loan Program.  City Council authorized applying for these types of loans and the acceptance of the loan funding via Ordinance 0997-2023, passed by Council on 4/24/23.  This specific project was added to the list after the ordinance was approved per Section 2 of the Ordinance that authorizes the Director of Public Utilities to add or subtract projects from the list per department need. \n \nThe Ohio Water Development Authority (OWDA) Direct Loan Program is a reimbursement program.  Purchase orders will need to be established to The Righter Co., Inc. for these contracts.  Public Utilities will need to pay invoices directly to The Righter Co., Inc. and then submit reimbursement requests based upon these paid invoices to OWDA for OWDA to reimburse Public Utilities.   \nA transfer of funds from the Water System Reserve Fund, Fund 6003, to the Water-Fresh Water Market Rate Program, Fund 6014 in the amount of $2,158,963.54 is needed to fund construction for this project.  This transaction is a temporary measure that is required until a loan is executed with the OWDA to reimburse the Water System Reserve Fund.  The loan is expected to be approved in April 2024.  These funds will also need to be appropriated to be transferred and then appropriated after transfer to the new fund. An amendment to the 2023 Capital Improvement Budget is needed to align budget authority with the proper project.\n   \nFunds in the amount of $2,000.00 are budgeted, available and appropriated within the Water Bond Fund, Fund 6006, to pay the Department of Public Service to provide prevailing wage services for this project.\n  \nTitle\nTo authorize the Director of the Department of Public Utilities to enter into a construction contract with The Righter Co., Inc. for the Stelzer Road Pressure Reducing Valve; to authorize an amendment to the 2023 Capital Improvement Budget; to authorize the appropriation and transfer of funds from the Water System Reserve Fund to the Water-Fresh Water Market Rate Program Fund; to authorize the appropriation and expenditure of $2,158,963.54 from the Water-Fresh Water Market Rate Program Fund for the contract; and to authorize an expenditure of $2,000.00 from the Water Bond Fund to pay for the prevailing wage services for the project.  ($2,160,963.54)\n \nBody\nWHEREAS, the Department of Public Utilities is engaged in the Stelzer Road PRV project; and\n \nWHEREAS, two bids for the Stelzer Road PRV project were received and opened on 2/14/2024; and\n \nWHEREAS, the bid from The Righter Co., Inc. was determined to be the lowest, responsive, and responsible bid; and\n \nWHEREAS, it is necessary to authorize the Director of the Department of Public Utilities to enter into a  construction services contract with The Righter Co., Inc. for the Stelzer Road PRV project; and \n \nWHEREAS, Ordinance 0997-2023 authorized the use of loans from the Ohio Water Development Authority (OWDA) Direct Loan Program to finance Public Utilities projects; and\nWHEREAS, loan applications will be submitted to OWDA to finance this project; and\nWHEREAS, the 2023 Capital Improvements Budget must be modified to align budget authority with the proper project; and\n \nWHEREAS, it is necessary to both appropriate and transfer funds from the Water System Reserve Fund, Fund 6003, to the Water-Fresh Water Market Rate Program Fund, Fund 6014, in order to temporarily fund this expenditure until such time as the City receives loan proceeds from the Ohio Water Development Authority to reimburse the Water System Reserve Fund; and\n \nWHEREAS, it is necessary to appropriate and expend funds from the Water-Fresh Water Market Rate Fund, Fund 6014, to pay for the construction of this project; and,\n \nWHEREAS, the City anticipates incurring certain Original Expenditures (as defined in Section 1.150-2(c) of the Treasury Regulations (the “Treasury Regulations”) promulgated pursuant to the Internal Revenue Code of 1986, as amended) with respect to the services of the Project described in this Ordinance (collectively, the “Project”); and\n \nWHEREAS, it is necessary to authorize an expenditure of funds within the Water Bond Fund, Fund 6006, to pay for the prevailing wage services for the project; NOW, THEREFORE,  \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2023 Capital Improvements Budget authorized by Ordinance 1711-2023 be amended as follows to establish sufficient budget authority for this project:\n \nFund / Project Number / Project Name (Funding Source) / Current Authority / Revised Authority / Change \n6014 / P690473-100019 / Stelzer Road PRV (OWDA Direct Loan) / $0.00 / $2,158,964.00 / $2,158,964.00 (To match loan amount)\n \nSECTION 2.  That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ending December 31, 2024, the sum of $2,158,963.54 is appropriated in the Water System Reserve Fund, Fund 6003, per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That the transfer of $2,158,963.54, or so much thereof as may be needed, is hereby authorized between the Water System Reserve Fund, Fund 6003, and the Water-Fresh Water Market Rate Program, Fund 6014, per the account codes in the attachment to this ordinance.\n \nSECTION 4.  That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ending December 31, 2024, the sum of $2,158,963.54 is appropriated in the Water-Fresh Water Market Rate Program, Fund 6014, per the account codes in the attachment to this ordinance.\n \nSECTION 5.  That the Director of the Department of Public Utilities is hereby authorized to enter into a construction services contract for the Stelzer Road PRV project with The Righter Co., Inc., 2424 Harrison Rd, Columbus, Ohio 43204, in an amount up to $2,158,963.54, in accordance with the terms and conditions of the contract on file in the Department of Public Utilities; and to expend up to $2,000.00 to pay the Department of Public Service to perform prevailing wage services for the contract.\n \nSECTION 6.  That the expenditure of $2,160,963.54, or so much thereof as may be needed, is hereby authorized to pay for this contract per the accounting codes in the attachment to this ordinance.\n \nSECTION 7.  That upon obtaining other funds for the purpose of funding water capital improvement work, the City Auditor is hereby authorized to repay the Water System Reserve Fund the amount transferred above (Section 3), and said funds are hereby deemed appropriated for such purposes.\n \nSECTION 8.  That the City intends that this Ordinance constitute an \"official intent\" for purposes of Section 1.150-2(e) of the Treasury Regulations, and that the City reasonably expects to reimburse itself for certain Original Expenditures incurred with respect to the Project from the proceeds of obligations to be issued by the City in a principal amount currently estimated to be $2,158,963.54 (the \"Obligations\").\n \nThe City intends to make a reimbursement allocation on its books for the Original Expenditures not later than eighteen months following the later to occur of the date of the Original Expenditure to be reimbursed or the date the Project for which such Original Expenditures were made is \"placed in service\" within the meaning of Treasury Regulations Section 1.150-2(c).  Upon the issuance of the Obligations, the proceeds of such Obligations shall be used to reimburse Water System Reserve Fund, Fund 6003, which is the fund from which the advance for costs of the Project will be made.\n \nSECTION 9.  That funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\nSECTION 10.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 11.  That the City Auditor is authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\nSECTION 12.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 110,
    "meeting_date": "2024-04-29",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}