{
  "success": true,
  "vote": {
    "id": 9279,
    "item_number": "CA-6",
    "title": "To authorize the Finance and Management Director to enter into a Universal Term Contract for the option to purchase Liquefied Petroleum Gas (Propane) with Ferrellgas, L.P.; and to authorize the expenditure of $1.00. ($1.00)",
    "description": "Explanation\nBACKGROUND:  This legislation authorizes the Finance and Management Director to establish a Universal Term Contract (UTC) for the option to purchase Liquefied Petroleum Gas (Propane) with Ferrellgas, L.P.  Propane is used citywide to fuel mowers, forklifts and various other equipment.  The term of the proposed option contract would be approximately two (2) years, expiring June 30, 2026, with the option to renew for one (1) additional year.  The Purchasing Office opened formal bids on March 14, 2024.  In addition, the expenditure of $1.00 is hereby authorized from General Budget Reservation BRPO002726.\n                     \n \nThe Purchasing Office advertised and solicited competitive bids in accordance with the relevant provisions of Section 329 relating to competitive bidding (Request for Quotation No. RFQ026788).    Two (2) bids were received.  \n \nThe Purchasing Office is recommending award to the overall lowest, responsive, responsible and best bidder as follows:\n \nFerrellgas, L.P., CC# 008029 pending, All Items, $1.00\nTotal Estimated Annual Expenditure: $100,000.00 Citywide\n \nThe company is not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.   \n \nFISCAL IMPACT:  The expenditure of $1.00 is hereby authorized from General Budget Reservation BRPO002726.  City Agencies will be required to obtain approval to expend from their own appropriations for their estimated annual expenditures.  \n \nTitle\n \nTo authorize the Finance and Management Director to enter into a Universal Term Contract for the option to purchase Liquefied Petroleum Gas (Propane) with Ferrellgas, L.P.; and to authorize the expenditure of $1.00. ($1.00)\n \nBody\n \nWHEREAS, the Liquefied Petroleum Gas (Propane) UTC will provide for the purchase of propane to fuel various City equipment; and,  \n \nWHEREAS, the Purchasing Office advertised and solicited formal bids on March 14, 2024 and selected the overall lowest, responsive, responsible and best bidder; and\n \nWHEREAS, it has become necessary in the daily operation of the Department of Finance and Management to authorize the Director of Finance and Management to enter into a Universal Term Contract for the option to purchase Liquefied Petroleum Gas; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Finance and Management Director is hereby authorized to enter into the following Universal Term Contract for the option to purchase Liquefied Petroleum Gas (Propane) in accordance with Request for Quotation RFQ026788 for a term of approximately two (2) years, expiring June 30, 2026, with the option to renew for one (1) additional year, as follows:\n \nFerrellgas, L.P., All Items, $1.00\n \nSECTION 2.  That the expenditure of $1.00 is hereby authorized from General Budget Reservation BRPO002726 of this ordinance to pay the cost thereof.\n \nSECTION 3.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 111,
    "meeting_date": "2024-05-06",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements"
    ]
  }
}