{
  "success": true,
  "vote": {
    "id": 9281,
    "item_number": "CA-8",
    "title": "To authorize an appropriation within the Neighborhood Initiatives subfund in support of City Clerk grants as authorized by Council in support of Council programming. ($15,000.00)",
    "description": "Explanation\nThe purpose of this ordinance is to authorize an appropriation in the Neighborhood Initiatives subfund in support of City Clerk grant making pursuant to direction of Council in support of Council programming for which subsequent legislation is not required. This includes grants under $5,000.\n \nFiscal Impact: Funds are available within the Neighborhood Initiatives subfund.\n \nTitle\nTo authorize an appropriation within the Neighborhood Initiatives subfund in support of City Clerk grants as authorized by Council in support of Council programming. ($15,000.00)\n \nBody\nWHEREAS, the City Clerk frequently enters into grant agreements with external organizations in support of community programming and events; and\n \nWHEREAS, this ordinance authorizes an appropriation in the Neighborhood Initiatives subfund in support of City Clerk grant making pursuant to direction of Council in support of Council programming for which subsequent legislation is not required; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Auditor is hereby authorized and directed to appropriate $15,000.00 within the Neighborhood Initiatives subfund, fund 1000, subfund 100018, per the accounting codes in the attachment to this ordinance.\n \nSECTION 2. That this ordinance shall take effect at the earliest date allowable by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 111,
    "meeting_date": "2024-05-06",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Grants"
    ]
  }
}