{
  "success": true,
  "vote": {
    "id": 9325,
    "item_number": "SR-1",
    "title": "To authorize the Director of Development to enter into a grant agreement with the Columbus Downtown Development Corporation in an amount up to $1,200,000.00 for the purpose of targeting central city areas to advance economic and community development initiatives; to authorize the appropriation and expenditure of up to $1,200,000.00 from the Neighborhood Economic Development Fund; to advance funding per a predetermined schedule. ($1,200,000.00)",
    "description": "Explanation\n \nBACKGROUND\nThis legislation authorizes the Director of the Department of Development to enter into a Grant Agreement with Columbus Downtown Development Corporation in an amount up to $1,200,000.00 for the purpose of targeting central city areas to advance economic and community development initiatives; work with community leaders to expand affordable housing opportunities; work to increase office occupancy in the downtown area; and reimagine key development sites within the downtown area.\n \nColumbus Downtown Development Corporation (CDDC) is a private, non-profit development corporation with a mission to lead city-changing projects in the heart of Ohio's capital city. CDDC helped lead the creation of the 2010 Downtown Columbus Strategic Plan. This plan established a thoughtful roadmap, and together, we elevated the quality, vitality, and success of Downtown. Now, 14 years later, CDDC is working with community leaders to effectuate the 2022 Downtown Columbus Strategic Plan which explored expanding affordable housing opportunities, increasing office occupancy, reimagining key development sites, and cultivating connectivity between Downtown and adjacent areas. \n \nFISCAL IMPACT:  Funding is available in Neighborhood Economic Development Fund (2237).\n \nCONTRACT COMPLIANCE:  the vendor number is 010217 and expires 6/8/2024.\n \n \nTitle\n \nTo authorize the Director of Development to enter into a grant agreement with the Columbus Downtown Development Corporation in an amount up to $1,200,000.00 for the purpose of targeting central city areas to advance economic and community development initiatives; to authorize the appropriation and expenditure of up to $1,200,000.00 from the Neighborhood Economic Development Fund; to advance funding per a predetermined schedule. ($1,200,000.00)\n \n \nBody\n \nWHEREAS, the Department of Development desires to enter into a Grant Agreement with CDDC for the purpose of targeting central city areas to advance economic and community development initiatives; work with community leaders to expand affordable housing opportunities; work to increase office occupancy in the downtown area; and reimagine key development sites within the downtown area; and\n                     \nWHEREAS, CDDC is a private, non-profit development corporation with a mission to lead city-changing projects in the heart of Ohio's capital city; and\n \nWHEREAS, this legislation would authorize the Director of Development to execute a Grant Agreement in the amount $1,200,000.00 funded from the Neighborhood Economic Development Fund; and \n \nWHEREAS, funding will be advanced to the agency on a predetermined schedule; and NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Development be and is hereby authorized to enter into a Grant Agreement, in an amount up to $1,200,000.00, with Columbus Downtown Development Corporation and to advance funding per a predetermined schedule.\n                                                            \nSECTION 2. That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2024, the sum of $1,200,000.00 is appropriated in Fund 2237 (Neighborhood Economic Development Fund), Dept-Div 44-02 (Economic Development Division), in object class 05 (Other) per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That for the purpose as stated in Section 1, the expenditure of $1,200,000.00 or so much thereof as may be needed is hereby authorized in Fund 2237 (Neighborhood Economic Development Fund), Dept-Div 44-02 (Economic Development Division), in object class 05 (Other) per the accounting codes in the attachment to this ordinance.\nSECTION 4.  Funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this Ordinance and the City Auditor shall establish such accounting codes as necessary.\nSECTION 5.  That the City Auditor is authorized to establish such accounting codes as necessary, to make any accounting changes to revise the funding source for all agreements, contracts, or modifications associated with this Ordinance. \n \nSECTION 6.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 1,
    "absent": 1,
    "meeting_id": 111,
    "meeting_date": "2024-05-06",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "ABSTAIN"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Economic Development"
    ]
  }
}