{
  "success": true,
  "vote": {
    "id": 937,
    "item_number": "SR-4",
    "title": "To authorize the Office of the Mayor to accept two private grants from the Cities for Financial Empowerment Fund, Inc., in the amounts of $20,000.00 and up to $40,000.00 in support of the city’s Financial Empowerment Center Initiative and Financial Navigator Program; to authorize the appropriation of the grant amounts received; and to declare an emergency. ($60,000.00)",
    "description": "Explanation\n BACKGROUND:  This legislation authorizes the City of Columbus, through the Office of the Mayor, to accept two private grants from Cities for Financial Empowerment Fund, Inc. (CFE Fund) in the amount of $20,000.00 and up to $40,000.00, to execute the Memorandum of Understanding (grant agreement) for both grants, and to authorize the appropriation of funds for each grant upon receipt of the funds.\nIn 2019, the Office of the Mayor, through the Columbus Women’s Commission, and Columbus City Council President Pro Tem Elizabeth Brown, together launched an effort dedicated to supporting the financial empowerment of women and families in Columbus. The Cities for Financial Empowerment Fund (CFE Fund) awarded a planning grant in 2019 to support the City’s creation of a Financial Empowerment Roadmap, which identified the future work to be undertaken by the City. In 2020, with additional support from the CFE Fund and federal CARES Act funds, the City began its implementation of the Roadmap with the launch of the Financial Navigator program that helps families financially challenged by the COVID-19 pandemic access needed resources with the support of trained financial navigators.\nIn March 2021, the City of Columbus and CFE Fund announced their selection to receive more than two years of funding and technical support to implement proven financial empowerment programming in Columbus. In 2021, Columbus will receive support to develop a plan for investing in free, professional, one-on-one financial counseling as a public service to residents, particularly of need as they deal with the financial impacts of COVID-19. Columbus is one of 35 local governments across the country that are working with the CFE Fund to offer this proven model developed initially by Mayor Michael R. Bloomberg in New York City in 2008.\nThe $20,000.00 grant award is made available through January 30, 2022, and the funds granted will be used to draft an implementation plan to launch a Financial Empowerment Center. The implementation plan will include the City’s financial empowerment goals, actionable strategies, sustainability approaches, and an implementation roadmap rooted in local insights. The implementation plan will be developed with stakeholder feedback and engagement.\n \nBecause the City received the Planning Grant, the City also had the opportunity to apply for additional funds from CFE Fund to support continuation of the Financial Navigator initiative.  It is estimated that the additional funding will be up to $40,000.00.  Receipt of this award will support the Financial Navigator initiative to provide free remote-based financial triage and guide clients to a range of national and local programs, services, and resources.\n \nThis ordinance is submitted as an emergency so as to allow the financial transaction to be posted in the City's accounting system as soon as possible. Up to date financial posting promotes accurate accounting and financial management.\nFISCAL IMPACT:  The Department of Finance and Management will notify the Auditor’s Office when the grant agreements are executed in order to set up the grants and to appropriate the funds.  Due to timing issues, the City will fund contracts, legislated by ordinances 1120-2021 and 1121-2021, to support the initiative from other city funds and will then submit an expenditure correction to the Auditor’s Office to move the expense from the other funds to the grant.  Should expenses post to the grant that are not reimbursed, a transfer of funding from another source will be necessary.\nTitle\n \nTo authorize the Office of the Mayor to accept two private grants from the Cities for Financial Empowerment Fund, Inc., in the amounts of $20,000.00 and up to $40,000.00 in support of the city’s Financial Empowerment Center Initiative and Financial Navigator Program; to authorize the appropriation of the grant amounts received; and to declare an emergency. ($60,000.00)\n \nBody\n WHEREAS, the success and vitality of Columbus as a whole is inexorably linked to the financial security of families; and\n WHEREAS, according to the Urban Institute, 57% of Columbus families are financially insecure with less than $2,000 in savings and 38% of residents have subprime credit scores; and\n WHEREAS, according to that same study, the existence of financial insecurity creates significant costs to the government and is estimated to be between $17 and $39 million each year; and\n WHEREAS, the Office of the Mayor, through the Columbus Women’s Commission, in collaboration with City Council was awarded a competitive grant from Cities for Financial Empowerment Fund, Inc., in the amount of $20,000.00,to create an implementation plan to provide free, professional, one-on-one financial counseling as a public service to residents; and\n WHEREAS, the goal of this grant is to craft an implementation plan that will recommend next steps based on the needs of residents, City priorities, and partnership opportunities identified through a series of briefing and advisory meetings with stakeholders; and\n \n WHEREAS, the City also applied to CFE Fund to support continuation of the Financial Navigator initiative, and anticipates receiving a grant in the amount of up to $40,000.00; and\n \n WHEREAS, it is necessary to seek City Council approval to accept the grant and to appropriate the funds upon receipt of the grant; and \n WHEREAS, Cities for Financial Empowerment Fund has conducted extensive programmatic work with government leaders in more than 80 cities and is supporting the effort in Columbus with staffing and technical guidance for the drafting of the implementation plan; and\n WHEREAS, an emergency exists in the usual daily operation of the Office of the Mayor in that it is immediately necessary to accept these grant funds from the Cities for Financial Empowerment Fund, Inc. so as to allow the financial transaction to be posted in the City's accounting system as soon as possible. Up to date financial posting promotes accurate accounting and financial management for the immediate preservation of the public health, peace, property, safety and welfare; now, therefore\n BE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n SECTION 1. That the Office of the Mayor is hereby authorized to accept two private grants from the Cities for Financial Empowerment Fund, Inc. in support of the City’s Financial Empowerment Center and Financial Navigator Initiative, and to execute related grant agreements.  One grant will be accepted in the amount of $20,000.00 and the second grant is expected to be up to $40,000.00.\n SECTION 2.  That from the unappropriated monies in Fund 2291 (Private Grants) and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the grant period, the sum of $20,000.00 is appropriated in Fund 2291 (Private Grants), Dept-Div 40-4001, Grant No. G402103, Object Class 03 (Services) Amount $20,000.00 per the accounting codes in the attached document.\n SECTION 3.  That from the unappropriated monies in Fund 2291 (Private Grants) and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the grant period, the sum of up to $40,000.00 is appropriated upon receipt of an executed grant agreement in Fund 2291 (Private Grants), Dept-Div 40-4001, Grant No. to be determined by the Auditor, Object Class 03 (Services) Amount up t $40,000.00 per the accounting codes in the attached document.\n SECTION 4.  That the monies appropriated in the foregoing Section 2 shall be paid upon the order of the Mayor and that no order shall be drawn or money paid except upon voucher, the form of which shall be approved by the City Auditor.\n SECTION 5.  That at the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements.\n SECTION 6.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n SECTION 7.  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 15,
    "meeting_date": "2021-05-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services",
      "Grants"
    ]
  }
}