{
  "success": true,
  "vote": {
    "id": 9387,
    "item_number": "CA-37",
    "title": "To authorize and direct the Office of CelebrateOne to enter into a grant agreement with Restoring Our Own Through Transformation (ROOTT) to support community-oriented Perinatal Support Doula care; to authorize a reduction of appropriation in the Health Operating Fund; to authorize the transfer of appropriation within the General Fund; and to declare an emergency. ($500,000.00)",
    "description": "Explanation\nThis ordinance authorizes The Office of CelebrateOne to enter into a grant agreement with ROOTT (Restoring Our Own Through Transformation) in support of the organization’s holistic, community-oriented Perinatal Support Doula care.\n \nROOTT is a non-profit organization in Columbus, Ohio that was established in 2017 dedicated to collectively restoring the well-being of Black families. ROOTT’s integrated perinatal support model focuses on innovative interventions designed to improve perinatal conditions and birth outcomes for Black mothers and families. Since 2017, ROOTT has served over 500 families and has produced a 0% maternal and infant mortality rate.\n \nROOTT’s Doulas provide a variety of integrated, holistic care including:\n•                     Nutritional evaluation and support;\n•                     Evaluation of psychosocial needs and connections to wraparound services;\n•                     Advocacy and support for family empowerment;\n•                     Clinical assessments and documentation to identify early signs, symptoms, and risk factors in maternal health;\n•                     Direct lines of communication with primary care providers; and\n•                     Consultation as Certified Lactation Consultants.\n \nCare provided by ROOTT doulas is supplementary to and in conjunction with the additional care a mother receives through her primary care provider, OB-GYN, and/or midwife.\n \nEmergency action is necessary to ensure the continued provision of care to Black families through ROOTT programming.\n \nFISCAL IMPACT: This ordinance will reduce Health Operating fund subsidy and appropriations by $500,000.00 and transfer $500,000.00 of appropriations within, and expenditure of up to $500,000.00 from, the General Fund.\n \nTitle\nTo authorize and direct the Office of CelebrateOne to enter into a grant agreement with Restoring Our Own Through Transformation (ROOTT) to support community-oriented Perinatal Support Doula care; to authorize a reduction of appropriation in the Health Operating Fund; to authorize the transfer of appropriation within the General Fund; and to declare an emergency. ($500,000.00) \n \nBody\nWHEREAS, Restoring Our Own Through Transformation (ROOTT) provides integrated perinatal support and innovative interventions of Black families in Columbus; and\n \nWHEREAS, the infant mortality rate in Franklin County is 7.6%, and the Non-Hispanic Black infant mortality rate is nearly three times higher than the Non-Hispanic White infant mortality rate; and\n \nWHEREAS, ROOTT has eradicated the infant and maternal mortality rate among their clients and seeks to expand perinatal doula care to more of the Columbus community; and\n \nWHEREAS, it is necessary to reduce the Health Operating Fund 2250 appropriations by $500,000.00; and\n \nWHEREAS, it is necessary to transfer up to $500,000.00 of appropriations within General Fund 1000; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Office of CelebrateOne in that it is immediately necessary to authorize the Board to enter into a grant agreement with ROOTT all for the preservation of the public Health, peace, property, safety and welfare, and to ensure the continued progress of ROOTT services; \nNOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Office of CelebrateOne is hereby authorized to enter into a grant agreement with Restoring Our Own Through Transformation (ROOTT), a non-profit corporation, to support community-oriented Perinatal Support Doula care for a twelve-month period that begins on or after January 1, 2024.\n \nSECTION 2. That the Health Operating Fund appropriations are reduced by $500,000.00 per the accounting codes in the attachment to this ordinance. \n \nSECTION 3. That the transfer of $500,000.00 of appropriations or so much thereof as may be needed, is hereby authorized within the General Fund 1000 per the accounting codes in the attachment to this ordinance. \n   \nSECTION 4.  That the expenditure of up to $500,000.00 is authorized within Fund 1000 per the accounting codes in the attachment to his ordinance.\n \nSECTION 5.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 6. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 7. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 112,
    "meeting_date": "2024-05-13",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}