{
  "success": true,
  "vote": {
    "id": 951,
    "item_number": "SR-18",
    "title": "To amend various sections of Chapters 139 and 2331 of the Columbus City Codes to enhance the ability of the Community Relations Commission to protect individuals from discrimination that may occur within the City of Columbus.",
    "description": "Explanation\nBACKGROUND\nIn alignment with Mayor Ginther’s equity agenda, the members of the Community Relations Commission, in partnership with the Department of Neighborhoods and the City Attorney’s Office, recommend updating various sections of Columbus City Code Chapters 139 and 2331 to better protect individuals from discrimination.    \nSince the City of Columbus first adopted civil rights protections in 1991, a growing number of communities have enacted similar non-discrimination ordinances. As more communities have acted to protect their residents, updated language and approaches have emerged.  The proposed amendments to Chapters 2331 and 139 will allow the City of Columbus to better serve residents who have been subject to discrimination and maintain its leadership position in the area of civil rights.  \nAmendments to sections of Chapter 139 will adjust the number of Commission members, align code language with current practice and add the ability for the Community Relations Commission to contract for investigation services as well as hearing officers.  \nThe amendments to sections of Chapter 2331 will enhance the complaint resolution process by providing the Community Relations Commission with an additional tool to address discrimination when formal and informal dispute resolution efforts are unsuccessful. The updates will also provide protection from retaliation for those who file complaints in the area of Public Accommodation and language will be added to ensure alignment with current case law regarding the free exercise of religion. Additionally, the definitions of Sexual Orientation and Sex will be updated.\nThe updated definition of Sex will provide protections against discrimination on the basis of one’s sexual and reproductive health choices. Beginning in 2019, President Pro Tem Elizabeth Brown engaged with the community and partners to understand what kinds of discrimination residents experience with regard to the reproductive health choices they and their families make. That direct resident engagement highlighted the need to provide clear protections for sexual and reproductive health decisions in City Code as a foundation for rooting out this kind of discrimination in Columbus. In addition to making explicit that discrimination against breastfeeding and pumping is discrimination on the basis of sex, the updated language also makes clear that discrimination on the basis of sex includes discrimination pertaining to reproductive and sexual health decisions; this includes the use of products or services for pregnancy or its termination, fertility treatment, contraception, or sterilization. Crucially, the updated provision is also inclusive of sexual and reproductive health decisions that the trans and non-binary communities make to affirm their gender identity. This update recognizes that protecting sexual and reproductive health decisions plays an essential role in empowering residents to take charge of their sexual and reproductive health, whatever that means for them, and also in ensuring that Columbus is an inclusive community that supports the privacy, bodily autonomy, and self-determination of every resident. \nThis legislation is aligned with and further supports ordinance 2880-2020 that was approved in December 2020. The ordinance introduced by Council Members Priscilla Tyson and Shayla Favor provides protections for those who wear natural hair styles.  \nFISCAL IMPACT: There is no fiscal impact of this legislation\nTitle\nTo amend various sections of Chapters 139 and 2331 of the Columbus City Codes to enhance the ability of the Community Relations Commission to protect individuals from discrimination that may occur within the City of Columbus.   \nBody\nWHEREAS, the Community Relations Commission, a division of the Department of Neighborhoods, is established in Columbus City Code Section 139.01 and has primary responsibility for enforcement of Columbus City Code Sections 2331.01 through 2331.05, and\nWHEREAS, the proposed amendments to further protect individuals from discrimination that may occur within the City of Columbus were identified through conversation with the members of the Community Relations Commission, a review of recently adopted municipal civil rights ordinances from other communities in Ohio and a detailed legal review by the City Attorney’s Office, and  \nWHEREAS, direct resident engagement also highlighted the need to provide clear protections for sexual and reproductive health decisions in City Code as a foundation for rooting out this kind of discrimination in Columbus; and\nWHEREAS, this amendment recognizes that protecting sexual and reproductive health decisions plays an essential role in empowering residents to take charge of their sexual and reproductive health, whatever that means for them, and also in ensuring that Columbus is an inclusive community that supports the privacy, bodily autonomy, and self-determination of every resident; and\nWHEREAS, the Department of Neighborhoods recommends this proposed code change to Columbus City Council for adoption; now, therefore,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSection 1: That section 139.01 is hereby amended to read as follows: \n139.01 - Created, membership-Compensation and term of members-Meetings. \nThere is hereby created and established a commission to be known as the community relations commission, consisting of twenty-three (23) fifteen (15) members to be appointed by the mayor with the approval of the city council. The mayor, city attorney, president of city council, department of public safety director, and health commissioner, and the and two (2) citizens appointed by the mayor shall each appoint one (1) city employee to sit ex officio serve as a non-voting advisor to on the commission. It is important that a community relations commission be fully responsive to the diversity represented by the city of Columbus' various racial, religious, national, cultural and ethnic groups. They shall serve without compensation, but shall be reimbursed for expenses actually and necessarily incurred in connection with their duties as members of the community relations commission subject to approval by the department of finance and management. \nOf the twenty-three (23) fifteen (15) members so appointed, eight (8) five (5) shall be one serve an initial term for (1) year, eight (8) five (5) for two (2) years and seven (7) five (5) for three (3) years and thereafter appointments shall be for three (3) year terms. In the event of death or resignation of any members, his or her successor shall be appointed by the mayor to serve for the unexpired term for which such member had been appointed. The community relations commission shall meet when necessary to conduct business and shall adopt, by majority rule, such rules as it shall deem expedient for the conduct of its business. Such rules shall be adopted in accordance with Section 121.05 of the Columbus City Codes, 1959. \nSection 2: That section 139.02 is hereby amended to read as follows:\n139.02 - Duties. \nThe community relations commission is created and established under the Department of Neighborhoods to recommend ways and means of initiating and improving city government programs designed to help eliminate discrimination or to remove the effects of past discrimination in the city of Columbus. \nIn performing this function, the commission shall strive to increase the effectiveness of these programs, to increase the fairness with which these programs are operated and to increase inter-departmental harmony in the operations of these programs. To achieve advance these objectives the community relations commission shall may: \n(a)  Promote the development of mutual understanding and respect among all racial, religious, nationality, cultural and ethnic groups in the city of Columbus by making recommendations to city officials on means to prevent discriminatory practices against such groups. \n(b)  Aid in seeing that no person is deprived of equal services by city government by reason of discrimination on account of race, color, religion, national origin, sex, age, marital status, political orientation, sexual orientation or handicap race, sex, sexual orientation, gender identity or expression, color, religion, ancestry, national origin, age, disability, familial status or military status. \n(c)  Encourage, receive, investigate and evaluate from any person a claim of discrimination in accordance with section 2331 of the Columbus City Codes, by city employees, and make public the procedures which a person may use to complain of discrimination. \n(d)  Confer with the city attorney or designee on such complaints pertaining to the city of Columbus or criminal conduct as appear to require a legal process after initial investigation and/or failure to achieve conciliation. \n(e)  Initiate and conduct or refer for mediation hearings in situations in which the commission has reason to believe that discrimination has may have occurred. \n(f)  Engage a hearing officer to conduct administrative hearings. \n(g)                      Investigate upon request or initiate investigation of racial incidents alleged discriminatory practices and make recommendations for corrective action and coordinate efforts toward their resolution. \n(g)(h)  Verify information relating to complaints of alleged discrimination practices. \n(h)(i)  Formulate, develop and disseminate programs of community information, educational materials, and reports which will assist in the elimination of prejudice, intolerance and discrimination or which promote good will and result in better human relations. \n(i)(j)  Coordinate with the city's equal employment officers, local employers, unions, and employment agencies to improve employment opportunities in city government for persons who have been the traditional targets of discrimination in employment. \n(j)(k)  Assist community groups and various fraternal, service and benevolent organizations in the promotion of educational campaigns devoted to the elimination of group prejudices, racial or neighborhood tensions, and tolerance and discrimination. \n(k)(l)  Conduct research to ascertain the status and treatment of racial, religious, and ethnic groups in the city and the best means of progressively improving human relations in Columbus. \n(l)(m)  Cooperate with and render assistance to the mayor's action center, the equal employment opportunity officers and other branches of city government entities in the area of human rights. \n(m)(n)  Cooperate with and render assistance to county, state, federal and other governmental agencies in the area of discrimination. \n(n)(o)  Prepare and publish an annual report and such other factual reports and recommendations as it deems necessary concerning problems relating to the discrimination, racial tensions and other human relations concerns. Copies of all such reports and recommendations shall be filed with the city council. \n(p)                     Contract with an entity not affiliated with the City of Columbus government to conduct investigations.   \n \nSection 3: That section 2331.01 is hereby amended to read as follows:\n2331.01 - Definitions. \n(A)  As used in Chapter 2331 of the Columbus City Codes: \n(1) \"Person\" includes one (1) or more individuals, partnerships, associations, organizations, corporations, legal representatives, trustees, trustees in bankruptcy, receivers, and other organized groups of persons. It also includes, but is not limited to, any owner, lessor, assignor, builder, manager, broker, salesman, agent, employee, lending institution; and the city of Columbus, and all political subdivisions, authorities, agencies, boards and commissions thereof. \n(2) \"Employer\" means any person who employs four (4) or more persons, within the City of Columbus, including the city of Columbus, its departments, boards, commissions, and authorities. \n(3)   \"Employee\" does not include any individual employed in the domestic service of any person. \n(4)  \"Labor organization\" includes any organization which exists for the purpose, in whole or in part, of collective bargaining or of dealing with employers concerning grievances, terms or conditions of employment, or for other mutual aid or protection in relation to employment. \n(5)   \"Employment agency\" means any persons regularly undertaking with or without compensation, to procure opportunities for employment or to procure, recruit, refer, or place employees. \n(6)   \"Discriminate and discrimination\" includes segregate or separate and any difference in treatment based on race, sex, sexual orientation, gender identity or expression, color, religion, ancestry, national origin, age, disability, familial status or military status. \n(7)   \"Unlawful discriminatory practice\" means any act prohibited by Title 23, Chapter 2331 of the Columbus City Codes. \n(8)   \"Place of public accommodation\" means any inn, restaurant, eating house, barbershop, public conveyance by air, land or water, theater, store, or other place for the sale of merchandise, or any other place of public accommodation or amusement where the accommodation, advantages, facilities, or privileges thereof are available to the public, or a private club which has more than two hundred (200) members, provides regular meal service and regularly receives payment for dues, fees, use of space, facilities, services, meals or beverages directly or indirectly from or on behalf of nonmembers for the furtherance of trade or business. \"Place of public accommodation\" does not mean a benevolent corporation incorporated as such or a religious corporation incorporated as such under the laws of Ohio.  \n(9)   \"Housing accommodations\" includes any building or structure or portion thereof which is used or occupied or is intended, arranged, or designed to be used or occupied as a home residence or sleeping place of one (1) or more individuals, groups or families, whether or not living independently of each other; and any vacant land offered for sale or lease. \nIt also includes any housing accommodations held or offered for sale or rent by a real estate broker, salesman, or agent, or by any other person pursuant to authorization of the owner, by the owner, or by such person's legal representative. \n(10) \"Restrictive covenant\" means any specification in a deed, land contract or lease limiting the use of any housing because of race, sex, sexual orientation, gender identity or expression, color, religion, ancestry, national origin, age, disability, familial status or military status or any limitation based upon affiliation with or approval by any person, directly or indirectly, employing race, sex, sexual orientation, gender identity or expression, color, religion, ancestry, national origin, age, disability, familial status or military status as a condition of affiliation or approval. \n(11) \"Burial lot\" means any lot for the burial of deceased persons within any public burial ground or cemetery, including but not limited to, cemeteries owned and operated by the City of Columbus or companies or associations incorporated for cemetery purposes. \n(12) \"Sexual orientation\" means a person's actual or perceived homosexuality; bisexuality; or heterosexuality, by orientation or practice, by and between consenting adults. \n(13) “Racial profiling\" means to stop, detain, investigate, search, seize or arrest an individual based on the racial or ethnic status of such individual except when based upon a physical description of a suspect in a criminal or traffic offense. The use of race or ethnicity as a factor for determining the existence of reasonable suspicion and/or probable cause in the absence of actual physical evidence or observations linking that individual to a crime constitutes a violation of Section 2331.07 of this chapter. \n(14) \"Age\" means at least forty (40) years old. \n(15) \"Disability\" means a physical or mental impairment that substantially limits one (1) or more major life activities, including the functions of caring for one's self, performing manual tasks, walking, seeing, hearing, speaking, breathing, learning, and working; a record of a physical or mental impairment; or being regarded as having a physical or mental impairment. \n(16) (a) \"Except as provided in division (b) of this subsection, \"physical or mental impairment\" includes any of the following: \n(i)                      Any physiological disorder or condition, cosmetic disfigurement, or anatomical loss affecting one (1) or more of the following body systems: neurological; musculoskeletal; special sense organs; respiratory, including speech organs; cardiovascular; reproductive; digestive; genitor-urinary; hemic and lymphatic; skin; and endocrine; \n(ii)                      Any mental or psychological disorder, including, but not limited to, mental retardation, organic brain syndrome, emotional or mental illness, and specific learning disabilities; \n(iii) Diseases, blood disorders and conditions, including, but not limited to, orthopedic, visual, speech, and hearing impairments, cerebral palsy, autism, epilepsy, muscular dystrophy, multiple sclerosis, cancer, heart disease, diabetes, sickle cell, human immunodeficiency virus infection, mental retardation, emotional illness, drug addiction, and alcoholism. \n(b) \"Physical or mental impairment\" does not include any of the following: \n(i)                      Pedophilia, exhibitionism, voyeurism, or other sexual behavior disorders; \n(ii)                     Compulsive gambling, kleptomania, or pyromania; \n(iii)                      Psychoactive substance use disorders resulting from current illegal use of a controlled substance. \n (17) \"Sex\" means male, or female, neither, or both. The terms \"because of sex\" and \"on the basis of sex\" include but are not limited to pregnancy, any illness arising out of and occurring during the course of pregnancy, childbirth, or related medical conditions, breastfeeding or pumping, or other sexual or reproductive health decisions.\n(a) For the purposes of this section the term “sexual or reproductive health decisions” means decisions relating to the use or intended use of products or services for contraception, sterilization, fertility treatment, pregnancy or its termination, hormone therapy including that which alters gender expression or affirms gender identity, or medical treatments that affirm gender identity. Nothing in this division shall be construed to require an employer to provide health insurance benefits for sexual or reproductive health products or services.  \n(18) \"Gender identity or expression\" means having or being perceived as having gender-related identity, appearance, expression, or behavior, whether or not that identity, appearance, expression, or behavior is different from that traditionally associated with the person's actual or perceived sex. \n(19) \"Familial status\" means either of the following: \n(i)                      One (1) or more individuals who are under eighteen (18) years of age and who are domiciled with a parent or guardian having legal custody of the individual or domiciled, with the written permission of the parent or guardian having legal custody, with a designee of the parent or guardian; \n(ii)                      Any person who is pregnant or in the process of securing legal custody of any individual who is under eighteen (18) years of age. \n(iii)                      \"Family\" includes a single individual. \n(20) \"Military status\" means a person's status in \"service in the uniformed services\" as defined in Section 5923.05 of the Ohio Revised Code. \n(21) \"Service in the uniformed services\" means the performance of duty, on a voluntary or involuntary basis, in a uniformed service, under competent authority, and includes active duty, active duty for training, initial active duty for training, inactive duty for training, full-time national guard duty, and performance of duty or training by a member of the Ohio organized militia pursuant to Chapter 5923. of the Revised Code. \"Service in the uniformed services\" includes also the period of time for which a person is absent from a position of public or private employment for the purpose of an examination to determine the fitness of the person to perform any duty described in this division. \n(22) \"Uniformed services\" means the Armed Forces, the Ohio organized militia when engaged in active duty for training, inactive duty training, or full-time national guard duty, the commissioned corps of the public health service, and any other category of persons designated by the president of the United States in time of war or emergency. \n(23) “Race” is inclusive of traits historically associated with race, including, but not limited to, hair textures and protective and cultural hairstyles.\n(24) “Protective and cultural hairstyles” includes, but is not limited to, such hairstyles as braids, locs, cornrows, bantu knots, afros, and twists, whether or not hair extensions or treatments are used to create or maintain any such style, and whether or not hair is adorned by hair ornaments, beads, or headwraps.\n (B) Nothing in Columbus City Code Sections 2331.01-2331.04 shall be construed to bar any religious or denominational institution or organization or any organization operated for charitable or educational purposes, which is operated, supervised or controlled by or in connection with a religious organization, from limiting employment or sales or rentals of housing accommodations or admission to or giving preference to persons of the same religion or denomination or from engaging in the free exercise of religion.  \nSection 4: That section 2331.02 is hereby amended to read as follows:\n2331.02 - Fair housing.                      \n(A)  It shall be an unlawful discriminatory practice for any person to recklessly: \n(1)                     Refuse to sell, transfer, assign, rent, lease, sublease, finance or otherwise deny or withhold housing accommodations from any person because of the race, sex, sexual orientation, gender identity or expression, color, religion, ancestry, national origin, age, disability, familial status or military status of any prospective owner, occupant, or user of such housing accommodations; \n(2)                     Represent to any person because of the race, sex, sexual orientation, gender identity or expression, color, religion, ancestry, national origin, age, disability, familial status or military status of any prospective owner, occupant, or user of such housing accommodations that housing accommodations are not available for inspection when in fact they are so available; \n(3)                     Refuse to lend money, whether or not secured by mortgage or otherwise, for the acquisition, construction, rehabilitation, repair, or maintenance of housing accommodations or otherwise withhold financing of housing accommodations from any person because of the race, sex, sexual orientation, gender identity or expression color, religion, ancestry, national origin, age, disability, familial status or military status of any present or prospective owner, occupant, or user of such housing accommodations, provided such person, whether an individual, corporation, or association of any type, lends money as one of the principal aspects of their business or incidental to their principal business and not only as apart of the purchase price of an owner occupied residence they are selling nor merely casually or occasionally to a relative or friend; \n(4)                      Discriminate against any person in the terms or conditions of selling, transferring, assigning, renting, leasing or, subleasing any housing accommodations or in furnishing facilities, services, or privileges in connection with the ownership, occupancy or use of any housing accommodations because of the race, sex, sexual orientation, gender identity or expression, color, religion, ancestry, national origin, age, disability, familial status or military status of any present or prospective owner, occupant, or user of such housing accommodations; \n(5)                      Discriminate against any person in the terms or conditions of any loan of money, whether or not secured by mortgage or otherwise, for the acquisition, construction, rehabilitation, repair, or maintenance of any housing accommodations because of the race, sex, sexual orientation, gender identity or expression, color, religion, ancestry, national origin, age, disability, familial status or military status of any present or prospective owner, occupant, or user of such housing accommodations; \n(6)                      Print, publish, or circulate any statement or advertisement relating to the sale, transfer, assignment, rental, lease, sublease, or acquisition of any housing accommodations or the loan of money, whether or not secured by mortgage or otherwise, for the acquisition, construction, rehabilitation, repair, or maintenance of housing accommodations which indicates any preference, limitation, specification, or discrimination based upon the race, sex, sexual orientation, gender identity or expression, color, religion, ancestry, national origin, age, disability, familial status or military status; \n(7)                      Make any inquiry, elicit any information, make or keep any record, or use any form of application containing questions or entries concerning the race, sex, sexual orientation, gender identity or expression, color, religion, ancestry, national origin, age, disability, familial status or military status in connection with the sale or lease of any housing accommodations or the loan of any money, whether or not secured by a mortgage or otherwise, for the acquisition, construction, rehabilitation, repair or maintenance of housing accommodations. \n(8)                      Include in any deed, land contract, or lease of accommodations any covenant, honor or exercise, or attempt to honor or exercise, any covenant, that would prohibit, restrict, or limit the sale, transfer, assignment, rental, lease, sublease, or finance of housing accommodations to or for any person because of the race, sex, sexual orientation, gender identity or expression, color, religion, ancestry, national origin, age, disability, familial status or military status of any prospective owner, occupant, or user of such housing accommodations provided that prior inclusion of a restrictive covenant in the chain of title shall not be deemed a violation of this provision; \n(9)                      Induce or solicit, or attempt to induce or solicit, any housing accommodations listing, sale, or transaction by representing that a change has occurred or may occur in the block, neighborhood, or area in which the property is located, which change is related to the presence or anticipated presence of persons of any race, sex, sexual orientation, gender identity or expression, color, religion, ancestry, national origin, age, disability, familial status or military status. \n(10) Induce or solicit or attempt to induce or solicit, any housing accommodations listing, sale, or transaction by representing that the presence or anticipated presence of persons of any race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status in the area will or may have results such as the following: \n(a)  The lowering of property values; \n(b)  An increase in criminal or antisocial behavior in the area; or \n(c)  A decline in the quality of schools serving the area; \n(11) Discourage or attempt to discourage the purchase by prospective purchasers of any housing accommodations by representing that any block, neighborhood, or area has or might undergo a change with respect to the race, sex, sexual orientation, gender identity or expression, color, religion, ancestry, national origin, age, disability, familial status or military status of the residents; \n(12) Deny any person access to or membership or participation in any multiple listing service, real estate, brokers' organization, or other service, organization, or facility relating to the business of selling or renting housing accommodations, or to discriminate against them in the terms or conditions of such access, membership, or participation, on account of race, sex, sexual orientation, gender identity or expression, color, religion, national origin or ancestry, age, disability, familial status or military status. \n(13) Coerce, intimidate, threaten, or interfere with any person in the exercise or enjoyment of, or on account of their having exercised or enjoyed, or on account of their having aided or encouraged any other person in the exercise or enjoyment of, any right granted or protected by this section; \n(14) Whether or not acting under color of law, by force or threat of force willfully injure, intimidate or interfere with, or attempt to injure, intimidate, or interfere with: \n(a)                      Any person because of their race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status and because that person is or has been selling purchasing, renting, financing, occupying or contracting or negotiating for the sale, purchase, rental, financing, or occupation of any dwelling, or applying for or participating in any service, organization, or facility relating to the business of selling or renting housing accommodations; \n(b)                      Any person because that person is or has been, or in order to intimidate such person or any other person or any class of persons from: \n(1)                      Participating, without discrimination on account of race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status in any of the activities, services, organizations, or facilities described in division (A)(14)(a) of this section. \n(2)                      Affording another person or class of persons opportunity or protection so to participate; or \n(c)                      Discouraging any person from lawfully aiding or encouraging other persons to participate, without discrimination on account of race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status in any of the activities, services, organizations, or facilities described in division (A)(14)(a) of this section, or participating lawfully in speech or peaceful assembly opposing any denial of the opportunity to so participate; \n(15)                      Refuse to sell, transfer, assign, rent or lease, sublease, finance or otherwise deny or withhold a burial lot from any person because of the race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status of any prospective owner or user of such lot; or \n(16) For any person to discriminate in any manner against any other person because that person has opposed any unlawful practice defined in Title 23, Chapter 2331 of the Columbus City Codes, or because that person has made a charge, testified, assisted, or participated in any manner, in any investigation, proceeding, or hearing under the provisions of Title 23, Chapter 2331 of the Columbus City Codes. \n(B)                      Nothing in this section shall bar any religious or denominational institution or organization, or any charitable or educational organization, which is operated, supervised, or controlled by or in connection with a religious organization, from giving preference to persons of the same religion or denomination, or from making such selection as is calculated by such organization to promote the religious principles or the aims or purposes for which it is established or maintained. \n(C) (B)Nothing in this section shall bar any person from refusing to rent, lease, or sublease any room, suite of rooms, or apartment to any person because of sex if such room, suite of rooms, or apartment is located in a building in which the only toilet and bathroom facilities provided for such room, suite of rooms, or apartment are for the common use of all occupants. \n(D) (C)Whoever recklessly violates this section is guilty of a misdemeanor of the first degree. \nSection 5: That section 2331.03 is hereby amended to read as follows:\n2331.03 - Unlawful employment practices. \n(A)                      It shall be an unlawful discriminatory practice, except where based upon applicable national security regulations established by the United States: \n(1)                      For any employer, because of the race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status to refuse to hire that person or otherwise to discriminate against that person with respect to hire, tenure, terms, conditions, or privileges of employment, or any matter directly or indirectly related to employment; \n(2)                      For any employer, employment agency, or labor organization to establish, announce or follow a policy of denying or limiting, the employment or membership opportunities of any person or group of persons because of race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status. \n(3)                      For any employer, labor organization, or joint labor-management committee controlling apprentice training programs to discriminate against any person because of that person's race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status in admission to employment in any program established to provide apprentice training; \n(4)                      For any employer, employment agency, or labor organization to publish or circulate, or to cause to be published or circulated, any notice or advertisement relating to employment or membership which indicates any preference, limitation, specifications or discrimination based upon race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status; \n(5)                      For any person seeking employment to publish or to cause to be published any advertisement which specifies or in any manner indicates that person's race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status or expresses a limitation or preference as to the race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status of any prospective employer; \n(6)                      For any employment agency to refuse or fail to accept, register, classify properly, or refer for employment or otherwise to discriminate against any person because of race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status; \n(7)                      For any employer, employment agency, or labor organization to utilize in the recruitment or hiring of persons, any employment agency, placement service, labor organization, training school or center, or any other employee-referring source, known to discriminate against persons because of race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status; \n(8)                      For any labor organization to discriminate against any person or limit that person's employment opportunities, or otherwise adversely affect that person's status as an employee, or that person's wages, hours, or employment conditions, because of race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status; \n(9)                      For an employment agency, to comply with, accommodate, or otherwise assist with locating an employee related to, a request from an employer for referral of applicants for employment if the request indicates, directly or indirectly, that the employer fails, or may fail, to comply with Title 23, Chapter 2331, of the Columbus City Codes; \n(10)                      For any labor organization to limit or classify its membership on the basis of race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status; \n(11)                      For any employer, employment agency or labor organization to: \n(a)                      Elicit or attempt to elicit any information concerning the race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status of an applicant for employment or membership; \n(b)                      Use any form of application for employment or personnel or membership blank seeking to elicit information regarding race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status but an employer holding a contract containing a non-discrimination clause with the government of the United States or any department or agency thereof, may require an employee or applicant for employment to furnish documentary proof of United States citizenship and may retain such proof in the employer's personnel records and may use photographic or fingerprint identification for security purposes. \n(12)                      For any employer, employment agency or labor organization to discriminate against any person because that person has opposed any practice forbidden by Title 23, Chapter 2331, of the Columbus City Codes, or because that person has made a complaint or testified or assisted in any manner in any investigation or proceeding under Title 23, Chapter 2331, of the Columbus City Codes. \n(13)                      For any person, whether or not an employer, employment agency or labor organization, to aid, incite, compel, coerce, or participate in the doing of any act declared to be unlawful discriminatory practice by Title 23, Chapter 2331, of the Columbus City Codes, or to obstruct or prevent any person from enforcing or complying with the provisions of this chapter, or to attempt directly or indirectly to commit any act declared by this chapter, to be an unlawful discriminatory practice. \n(B)                      Whoever recklessly violates this section is guilty of unlawful employment practices, a misdemeanor of the first degree. \n(C)  Recklessness is intended to be imposed as the culpable mental state for a violation of this section. \nSection 6: That section 2331.04 is hereby amended to read as follows:\n2331.04 - Unlawful public accommodations. \nIt shall be an unlawful discriminatory practice: \n(A)                      For any proprietor or his employee, keeper, or manager of a place of public accommodation to deny to any person except for reasons applicable alike to all persons regardless of race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status the full enjoyment of the accommodations, advantages, facilities, or privileges thereof; \n(B)                      For any proprietor or his employee, keeper, or manager of a place of public accommodation to publish, circulate, issue, display, post or mail, either directly or indirectly, any printed or written communication, notice or advertisement to the effect that any of the accommodations, advantages, facilities, goods, products, services and privileges of any such place shall be refused, withheld or denied to any person on account of race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status or that such person is unwelcome, objectionable, or not acceptable, desired or solicited; \n(C)                     For any proprietor or employee, keeper, or manager of a place of public accommodation to discriminate against any person because that person has opposed any practice forbidden by Title 23, Chapter 2331, of the Columbus City Codes, or because that person has made a complaint or testified or assisted in any manner in any investigation or proceeding under Title 23, Chapter 2331, of the Columbus City Codes.\n(C)(D) For any person, whether or not included in divisions (A) and (B) in this section, to aid, incite, compel, coerce, or participate in the doing of any act declared to be an unlawful discriminatory practice under this section.\n(D)(E) Whoever recklessly violates this section is guilty of unlawful public accommodations, a misdemeanor of the first degree; or \n(E)  Recklessness is intended to be imposed as the culpable mental state for a violation of this section. \nSection 7: That section 2331.05 is hereby amended to read as follows:\n2331.05 - Complaint procedure. \n(A)                      Whenever it is alleged in a complaint, charged in writing, by a person or aggrieved organization, hereinafter referenced to as \"complainant,\" that any person, employer, employment agency, and or labor organization, hereinafter referred to as the \"respondent,\" has engaged in or is engaging in any unlawful discriminatory practices as defined in Title 23, Chapter 2331 of the Columbus City Codes, or upon its own initiative, in matters relating to such discriminatory practices, the community relations commission staff may initiate a preliminary investigation. Such charge complaint shall be filed with the community relations commission within six (6) months after the alleged unlawful discriminatory practices are committed. \n(1)                     If the community relations commission staff determines after such investigation, that there is no reasonable basis to believe it is not probable that unlawful discriminatory practices have been or are being engaged in, it staff may shall notify recommend to the community relations commission that the complaint be dismissed.  If the commission approves, staff shall notify the complainant that it has so determined, and the complaint will be dismissed. that it will not initiate prosecution of the matter. \n(2)                     If the community relations commission staff determines, after such investigation, that there is a reasonable basis to believe it is probable that unlawful discriminatory practices have been or are being engaged in, it they shall endeavor to eliminate such practices by informal methods of conference, conciliation, and persuasion. \n(a) If after such investigation and conference the community relations commission staff is satisfied that any unlawful discriminatory practice of the respondent will be eliminated, staff may recommend to the community relations commission that it may treat the complaint as conciliated. If the commission agrees, staff shall and notify the complainant that the complaint will be dismissed. it will not initiate prosecution of the matter. \n(b) If the community relations commission staff fails to effect the elimination of such unlawful discriminatory practices or to obtain conciliation of the matter, or, if the circumstances warrant, in advance of or during any such preliminary investigation or endeavors to conciliate the matter, the community relations commission shall may refer the complaint to the City Prosecutor to evaluate for criminal prosecution.  \n(c) If the community relations commission staff fails to effect the elimination of such unlawful discriminatory practices or to obtain conciliation of the matter and no referral to the City Prosecutor to evaluate for criminal prosecution is then pending, the community relations commission may direct staff to issue and cause to be served upon the respondent a notice of an finding of an administrative violation and imposition of civil penalty.  The notice shall investigative hearing, notifying the respondent of the right to request an administrative hearing investigative hearing before a hearing officer appointed by the community relations commission to contest the finding of administrative violation.  at a time and place therein fixed to be held not less than ten (10) days after the service of such notice and stating the charges specified in the original charge against the respondent. Failure to request an administrative hearing within fifteen (15) days of receipt of the notice of violation shall constitute a waiver of the right to a hearing.\n(B) If a hearing officer is appointed, the hearing officer shall have the authority to:\n(1)                     Conduct an administrative hearing;\n(2)                     Provide to all the parties, witnesses, and the Community Relations Commission timely notice of the hearing date, time, and location;\n(3)                     Direct the exchange of discovery;\n(4)                     Set, change as necessary, and timely communicate to the parties such reasonable procedural rules as the hearing officer shall deem appropriate including:\n(a)                     A member of the Community Relations Commission staff shall have the burden of going forward with the presentation of evidence. All parties shall have the right to appear and be heard in person, or by legal counsel, to present their case. \n(b)                     All parties shall have the right to: offer and examine witnesses and present evidence in support of their case; cross examine adverse witnesses; and proffer evidence into the record if its admission has been denied. \n(c)                     Testimony shall be given under oath.  \n(d)                     The hearing officer shall make recommendations on all matters of evidence. In so doing, the hearing officer is not strictly bound by the rules of evidence.  The hearing officer may ask questions of any witness at any point in the proceedings and may set time and other limitations for each side in the presentation of evidence.  A record of proceedings shall be kept.  Parties seeking a stenographic record shall acquire such stenographic record at their own expense. \n(5)                     Except as otherwise prescribed by law, the hearing officer shall submit to the Community Relations Commission a written report setting forth the hearing officer’s findings of fact and conclusions of law and a recommendation of the action to be taken by the Commission. \n(a)                     If the Hearing Officer finds, by a preponderance of the evidence, that respondent did engage in, or continues to engage in, an unlawful discriminatory act or practice under this chapter as noticed in the finding of administrative violation, the Hearing Officer’s report shall so indicate by recommending that the finding of violation be upheld.\n(b)                     If the Hearing Officer finds that the evidence presented failed to support the finding of violation, the Hearing Officer’s report shall so indicate by recommending that the finding of administrative violation be overturned and the complaint dismissed.  \n(c)                     The final report of the Hearing Officer may not include any orders for reinstatement of employment, refund of monies paid, other mitigation of damages, or any other orders for corrections or sanctions, except as provided in this section.\n(6)                     A copy of the Hearing Officer’s written report and recommendation shall, within five days of the date of filing thereof, be served upon the respondent or respondent’s attorney, by certified mail. The respondent may, within ten days of receipt of the copy of the written report or recommendation, file with the Community Relations Commission written objections to the report and recommendation, which objections shall be considered by the Community Relations Commission before approving, modifying, or disapproving the recommendation. The Community Relations Commission may grant extensions of time to the respondent within which to file such objections. No recommendation of the Hearing Officer shall be approved, modified, or disapproved by the Community Relations Commission until ten days after the service of the report and recommendation as provided in this section. The Community Relations Commission may order additional testimony to be taken or permit the introduction of further documentary evidence.\n(7)                     The Community Relations Commission, by majority vote, may approve, modify or disapprove the recommendation from the Hearing Officer by written decision which shall become effective upon service to the affected parties, unless otherwise stated in the Community Relation Commission’s decision. \n(8)                     The final decision of the Community Relations Commission may be appealed pursuant to the provisions of R.C. Chapter 2506.\n \nAny such charge may be amended by the community relations commission or complainant at any time prior to or during the hearing based thereon. The respondent shall have the right to file an answer or to amend an answer to the original or amended charge, and to appear at such hearing in person, or by attorney, or otherwise to examine and cross-examine witnesses. \nThe complainant shall be a party to the proceeding, and any person who is an indispensable party to a complete determination or settlement of the question involved in the proceeding shall be joined. Any person who has or claims an interest in the subject of the hearing and in obtaining or presenting relief against the acts or practices complained of, may be, in the discretion of the community relations commission, permitted to appear for the presentation of oral or written argument. \nIn any proceeding the community relations commission shall not be bound by the rules of evidence prevailing in the courts of law or equity, but shall in ascertaining the practices followed by the respondent, take into account all reliable, probative, and substantial evidence, statistical, or otherwise, produced at the hearing, which may tend to prove the existence of an unlawful discriminatory practice or a predetermined pattern of unlawful discriminatory practices under Title 23, Chapter 2331, of the Columbus City Codes provided that nothing contained in this section shall be construed to authorize or require any person to observe the proportion which persons of any race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status bear to the total population or in accordance with any criterion other than the individual qualifications of the applicant. \nThe testimony taken at the hearing shall be under oath and shall be reduced to writing, and filed with the community relations commission. Thereafter, in its discretion, the community relations commission, upon notice to the plaintiff and to the respondent, with an opportunity to be present, may take further testimony or hear arguments. \nNo person shall be compelled to be a witness against himself in any hearing, formal or informal, before the community relations commission. \nIn conducting any hearing as provided herein, the community relations commission may subpoena as witnesses any person believed to have knowledge of facts relevant to such hearing, may compel the production of books, papers, records or other evidence relative to such hearing by the person having custody or control thereof and may administer oaths, take testimony and issue such rules as shall be necessary to effectuate an investigatory hearing under this section. \nUpon written application of the respondent, complainant or community relations commission, the community relations commission shall issue subpoenas as if issued on its own motion. \nIf upon all the reliable, probative and substantial evidence the community relations commission determines that the respondent has engaged in, or is engaging in, any unlawful discriminatory practice under Title 23, Chapter 2331, of the Columbus City Codes, whether against the complainant or others, the community relations commission may endeavor to eliminate such practices by informal methods of conference, conciliation, and persuasion. If the community relations commission fails to effect the elimination of such unlawful discriminatory practices or to obtain conciliation of the matter, or if the circumstances warrant, in advance of or during such investigative hearing, or endeavors to conciliate the matter, the community relations commission may initiate prosecution of the matter. If the community relations commission finds that no probable cause exists for crediting the charges, or if upon all the evidence the community relations commission finds that the respondent has not engaged in any unlawful discriminatory practice under Title 23, Chapter 2331, of the Columbus City Codes, against the complainant or others, it shall state its findings of fact, and shall notify the complainant and respondent that it will not initiate prosecution of the matter. 25\n(B)                      Whoever fails to comply with a subpoena issued by the community relations commission as provided in this section is guilty of a minor misdemeanor. \n(B) Civil Penalties\n(1)                     Upon an administrative finding of violation by the commission, a civil penalty in an amount not to exceed one thousand dollars ($1,000) may be imposed;\n(2)                     Upon an administrative finding of violation by the commission, if the violator has been found to have committed one violation of this Chapter during the five-year period immediately preceding the date on which a complaint was filed with the community relations commission, a civil penalty in an amount not to exceed two thousand five hundred dollars ($2,500) may be imposed;\n(3)                     Upon an administrative finding of violation by the commission, if the violator has been found to have committed two or more violations of this Chapter during the five-year period immediately preceding the date on which a complaint was filed with the community relations commission, a civil penalty in an amount not to exceed five thousand dollars ($5,000) may be imposed;\n(E) If a civil penalty has been imposed by the Community Relations Commission, and any portion thereof remains unpaid thirty days following receipt of service of the notice of finding of violation or, if an administrative hearing had been requested, thirty days following receipt of service of the final written decision of the Community Relations Commission, the City Attorney may institute civil enforcement proceedings against the respondent.\nSection 8: That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 15,
    "meeting_date": "2021-05-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "General"
    ]
  }
}