{
  "success": true,
  "vote": {
    "id": 9512,
    "item_number": "CA-15",
    "title": "To authorize the Director of the Department of Development to enter into a Grant Agreement in an amount up to $20,000.00 with The Ohio Historical Society, Inc. DBA Ohio History Connection to provide a grant to support architectural cost for construction on exterior and interior preservation and renovation for Poindexter Village; to authorize a transfer of $20,000.00 within the General Fund; and to authorize an expenditure up to $20,000.00 from the General Fund. ($20,000.00)",
    "description": "Explanation\n \nBACKGROUND: This legislation authorizes the Director of Development to enter into a Grant Agreement, in an amount up to $20,000.00 with The Ohio Historical Society, Inc., doing business as Ohio History Connection, a non-profit corporation, to cover the cost of architectural services with Moody Nolan to complete construction on exterior and interior preservation and renovation, as well as site work and landscaping for Poindexter Village.\n \nIn 1940 the Columbus Metropolitan Housing Authority (CMHA) developed 426 dwelling units in 33 buildings to provide affordable housing for primarily African American residents of the East side of Columbus.  The development was named after pastor and activist Reverend James A. Poindexter.  Many national and local individuals, including Aminah Robinson, Nancy Wilson and Jimmy Rogers, were residents of Poindexter Village.    \n \nIn 2008, CMHA initiated the process to redevelop the Poindexter Village site.  Although the majority of the original buildings were demolished, CMHA preserved two of the original buildings.  In December 2016, CMHA approved the sale of the buildings to the Ohio History Connection for long term preservation.  The Ohio History Connection collaborated with the James Preston Poindexter Foundation to create exhibits and programming at the site that promotes the history and story of the residents.\n   \nColumbus City Council, per ordinance number 2761-2017, authorized the Director of the Department of Development to enter an agreement with a capital grant of $1,100,000.00 to support Phase 1 of the Poindexter Village project.  \n \nIn further support of Phase 2 of the project, Columbus City Council, per ordinance number 2612-2022, on October 10, 2022, authorized the Director of the Department of Development to enter into a Grant Agreement, in an amount up to $1,400,000.00 with Ohio History Connection to complete Phase 2.   \n \nThe City of Columbus is committed to continue support of the Phase 2 of the Poindexter Village project with a grant of up to $20,000.00 for architectural costs.    \n \n \nFISCAL IMPACT: Funding is available in the 2024 Development General Fund Budget. \n \nCONTRACT COMPLIANCE:  The vendor’s contract compliance 006096 is active and expires on 10/13/25.\n \n \nTitle\n \nTo authorize the Director of the Department of Development to enter into a Grant Agreement in an amount up to $20,000.00 with The Ohio Historical Society, Inc. DBA Ohio History Connection to provide a grant to support architectural cost for construction on exterior and interior preservation and renovation for Poindexter Village; to authorize a transfer of $20,000.00 within the General Fund; and to authorize an expenditure up to $20,000.00 from the General Fund. ($20,000.00)\n \n \nBody\n \nWHEREAS, in 1940 the Columbus Metropolitan Housing Authority (CMHA) developed 426 dwelling units in 33 buildings to provide affordable housing for primarily African American residents of the East side of Columbus.  The development was named after pastor and activist Reverend James A. Poindexter.  Many national and local individuals, including Aminah Robinson, Nancy Wilson and Jimmy Rogers, were residents of Poindexter Village; and    \n \nWHEREAS, in 2008, CMHA initiated the process to redevelop the Poindexter Village site.  Although the majority of the original buildings were demolished, CMHA preserved two of the original buildings.  In December 2016, CMHA approved the sale of the buildings to the Ohio History Connection for long term preservation.  The Ohio History Connection collaborated with the James Preston Poindexter Foundation to create exhibits and programming at the site that promotes the history and story of the residents; and\n \nWHEREAS, Columbus City Council, per ordinance number 2761-2017, authorized the Director of the Department of Development to enter an agreement with a capital grant of $1,100,000.00 to support Phase 1 of the Poindexter Village project; and\n \nWHEREAS, In further support of Phase 2 of the project, Columbus City Council, per ordinance number 2612-2022, on October 10, 2022, authorized the Director of the Department of Development to enter into a Grant Agreement, in an amount up to $1,400,000.00 with Ohio History Connection to complete Phase 2; and   \n \nWHEREAS, the City of Columbus is committed to continue support of  Phase 2 of the Poindexter Village project with a grant of up to $20,000.00 for the purpose of architectural cost; NOW THEREFORE:   \n \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \n \nSECTION 1.                     That the Director of the Department of Development be and is hereby authorized to enter into a Grant Agreement in an amount up to $20,000.00 with The Ohio Historical Society, Inc. DBA Ohio History Connection, to provide a grant to support architectural cost in support of construction on exterior and interior preservation and renovation for Poindexter Village.\n \nSECTION 2.                     That the transfer of $20,000.00, or so much thereof as may be needed, is hereby authorized within Fund 1000 (General Fund), from Dept.-Div 44-02 (Economic Development), object class 03 (Services) to object class 05 (Other) per the account codes in the attachment to this ordinance.\n \nSECTION 3.                     That for the purpose stated in Section 1, the expenditure of $20,000.00, or so much thereof as may be needed, is hereby authorized in Fund 1000 (General Fund), Dept-Div 44-02 (Economic Development) in Object Class 05 (Other) per the accounting codes in the attachment to this ordinance. \n \nSECTION 4.                     That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.                     That this agreement is awarded in accordance with the relevant provisions of City Code Chapter 329 relating to not-for-profit service contracts.  \n \nSECTION 6.   That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modification associated with this ordinance.\n \nSECTION 7.                     That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 114,
    "meeting_date": "2024-06-03",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Grants"
    ]
  }
}