{
  "success": true,
  "vote": {
    "id": 9514,
    "item_number": "CA-17",
    "title": "To dissolve the Enterprise Zone Agreement with Middle West Spirits, LLC (hereinafter referred to as “Enterprise”), and to direct the Director of the Department of Development to notify as necessary the local and state tax authorities.",
    "description": "Explanation\n \nBACKGROUND: Columbus City Council (COUNCIL), by Ordinance No. 2349-2020, passed November 9, 2020, authorized the City of Columbus (CITY) to enter into an Enterprise Zone Agreement (the “AGREEMENT”) with Middle West Spirits, LLC (hereinafter referred to as “ENTERPRISE”) for a tax abatement of seventy-five percent (75%) for a period of ten (10) consecutive years in consideration of an investment of approximately $6,205,000.00, which included $3,920,000.00 in acquisition cost, $2,000,000.00 in real property improvements, and $285,000.00 in machinery and equipment to renovate and redevelop a vacant industrial warehouse site for the purposes of relocating and expanding its corporate headquarters and warehouse operation. The proposed industrial site included five (5) parcels: parcel numbers 010-113456 and 010-112129 at 1165 Alum Creek Drive (approximately 35,189 sq. ft.), parcel number 010-009409, a vacant lot parcel at 1185 Alum Creek Drive (0.89 acres), parcel number 010-114985 at 1195 Alum Creek Drive upon which are located two vacant warehouses (totaling approximately 17,044 sq. ft.) and parcel number 010-099174 at 1221 Alum Creek Drive (approximately 47,139 sq. ft.), Columbus, Ohio 43209 (collectively, and hereinafter referred to as the “PROJECT SITE”). Additionally, the ENTERPRISE committed to create thirteen (13) net new full-time permanent positions with an estimated annual payroll of approximately $668,000.00 and retain fourteen (14) full-time jobs with an annual payroll of approximately $897,200.00 at the PROJECT SITE, to preserve or create employment opportunities within the Columbus Enterprise Zone, (hereinafter referred to as the “PROJECT”). The AGREEMENT was made and entered into effective June 17, 2021 (EZA #023-21-01). \n \nIn a letter received by the CITY from the ENTERPRISE, dated March 13, 2024 and through ensuing correspondence, it was confirmed that Middle West Spirits, LLC has not received any benefit from the tax abatement and requested that the tax abatement be dissolved. The ENTERPRISE will pursue a tax abatement through the City’s expanded Southside Investment District Community Reinvestment Area. As such, the need exists to dissolve the AGREEMENT.\n \nThis legislation is to authorize the Director of the Department of Development to dissolve the AGREEMENT between the CITY and the ENTERPRISE.    \n \nFISCAL IMPACT: No funding is required for this legislation.\n \n \nTitle\n \nTo dissolve the Enterprise Zone Agreement with Middle West Spirits, LLC (hereinafter referred to as “Enterprise”), and to direct the Director of the Department of Development to notify as necessary the local and state tax authorities.\n \n \nBody\n \nWHEREAS, the City of Columbus (“CITY”) entered into an Enterprise Zone Agreement (the “AGREEMENT”) with Middle West Spirits, LLC (hereinafter referred to as “ENTERPRISE”), approved by Columbus City Council (“COUNCIL”) on November 9, 2020 by Ordinance No. 2349-2020 with this AGREEMENT made and entered into effective June 17, 2021; and\n \nWHEREAS, the AGREEMENT granted a 75%/10-Year abatement on real property improvements; and\n \nWHEREAS, the incentive was granted in consideration of an investment of approximately $6,205,000.00, which included $3,920,000.00 in acquisition cost, $2,000,000.00 in real property improvements, and $285,000.00 in machinery and equipment to renovate and redevelop a vacant industrial warehouse site for the purposes of relocating and expanding its corporate headquarters and warehouse operation on the proposed industrial sites that included five (5) parcels: parcel numbers 010-113456 and 010-112129 at 1165 Alum Creek Drive (approximately 35,189 sq. ft.), parcel number 010-009409, a vacant lot parcel at 1185 Alum Creek Drive (0.89 acres), parcel number 010-114985 at 1195 Alum Creek Drive upon which are located two vacant warehouses (totaling approximately 17,044 sq. ft.) and parcel number 010-0099174 at 1221 Alum Creek Drive (approximately 47,139 sq. ft.), Columbus, Ohio 43209 (collectively, and hereinafter referred to as the “PROJECT SITE”) in Columbus Ohio, within the Columbus City School District and within the Columbus Enterprise Zone; and  \n \nWHEREAS, the ENTERPRISE committed to create thirteen (13) net new full-time permanent positions with an estimated annual payroll of approximately $668,000.00 and retain fourteen (14) full-time jobs with an annual payroll of approximately $897,200.00 at the PROJECT SITE; and\n \nWHEREAS, in a letter received by the CITY from the ENTERPRISE, dated March 13, 2024, and through ensuing correspondence, it was confirmed that Middle West Spirits, LLC has not received any benefit from the tax abatement and requested that the tax abatement be dissolved. The ENTERPRISE will pursue a tax abatement through the City’s expanded Southside Investment District Community Reinvestment Area. As such, the need exists to dissolve the AGREEMENT; and\n \nWHEREAS, this legislation is to be legislated in the most expedient manner as possible so that this dissolution of the AGREEMENT can be reported to the necessary local and state agencies prior to the end of calendar year 2024, and to preserve the public health, property, safety and welfare; and NOW THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS\n \nSECTION 1.                     That Columbus City Council hereby dissolves the Middle West Spirits, LLC Enterprise Zone Agreement (EZA#023-21-01) as of December 31, 2023, which was to apply a 75%/10-year real property tax abatement to the value of real property improvements made to the five (5) parcel numbers: 010-113456, 010-112129, 010-009409, 010-114985, and 010-099174 within the Columbus Enterprise Zone.\n \nSECTION 2.                     That the Director of the Department of Development is hereby directed to notify the necessary local and state agencies that the Enterprise Zone Agreement between the CITY and the ENTERPRISE has terminated. \n \nSECTION 3.                     That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 114,
    "meeting_date": "2024-06-03",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Economic Development"
    ]
  }
}