{
  "success": true,
  "vote": {
    "id": 952,
    "item_number": "SR-19",
    "title": "To amend Division (F) of Section 362.18 of the Columbus City Codes to bring it into conformity with Ohio law, and to declare an emergency.",
    "description": "Explanation\n \nBACKGROUND:  On November 2, 2015, Columbus City Council passed Ordinance 2658-2015 to enact Chapter 362 of the Columbus City Codes to reform the City’s municipal income tax code and apply the new municipal income tax code starting on January 1, 2016.  This reformation of the City’s municipal income tax code was necessitated by Amended Substitute House Bill 5, passed by the 130th General Assembly of the State of Ohio, which revised Chapter 718 of the Ohio Revised Code governing municipal income taxation and expressly required municipalities to bring their municipal income tax codes into conformity with Chapter 718.\nPursuant to Ordinance 2658-2015, the City adopted Section 362.18, which pertains to the constitution and administration of a local Board of Tax Review, an administrative adjudicatory body designed to hear and decide appeals of assessments issued by the Columbus Tax Administrator.  Division (F) of 362.18 contains certain terms governing the Board’s access to information and documentation pertinent to the appeals that it hears.  These terms require the Board to relinquish all documentation to the Division of Income Tax immediately upon the conclusion of a hearing.  These terms are not required under the Ohio Revised Code and they significantly impair the ability of the Board to make reasoned decisions following the hearing.  Both City Code and state law allow the Board to decide any appeal pending before it up to ninety (90) days following a hearing.  In order to allow Board members to make reasoned decisions, it is necessary that the code be changed in order to allow the Board members secure access to certain documentation pertinent to the appeals pending before it.  \nFISCAL IMPACT:  No funding is required for this legislation.\n \nTitle\n \nTo amend Division (F) of Section 362.18 of the Columbus City Codes to bring it into conformity with Ohio law, and to declare an emergency. \n \nBody\n \nWHEREAS, on November 2, 2015, the Columbus City Council passed ordinance 2658-2015, creating Chapter 362 of the Columbus City Codes in order to adopt a new municipal income tax code for tax year 2016 and beyond and to bring the City’s municipal income tax code into conformity with Ohio law, as required by House Bill 5, passed by the 130th General Assembly; and\nWHEREAS, Section 362.18 of the Columbus City Codes governs the constitution and administration of a local Board of Tax Review, an administrative adjudicatory body designed to hear and decide appeals of assessments issued by the Columbus Tax Administrator; and \nWHEREAS, Division (F) of Section 362.18 contains certain terms governing the Board’s access to information and documentation pertinent to the appeals that it hears, which terms will require the Board to relinquish all documentation and working papers to the Tax Administrator immediately upon the conclusion of a hearing, and which terms are not required pursuant to the Ohio Revised Code; and \nWHEREAS, Section 362.18(E) of the Code expressly authorizes the Board to rule on such appeals up to 90 days after the Board’s final hearing on the appeal; and\nWHEREAS, in order to enable the Board to make reasoned decisions up to ninety (90) days following the final hearing, it is necessary that Board members be allowed secure access to some documentation concerning the appeal after the hearing; and\nWHEREAS, an emergency exists in the usual daily operation of the Board of Tax Review in that it is immediately necessary to remove this language from the Columbus City Codes such that the Board may adopt rules for its operation that allow it secure access to certain documentation outside of the strict confines of the hearing, as consistent with Ohio law, for the immediate preservation of the public health, peace, property, safety, and welfare; NOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1. That Division (F) of Section 362.18 of the Columbus City Codes be amended as follows: \n(F)  The Local Board of Tax Review created pursuant to this section shall adopt rules governing its procedures, including a schedule of related costs, and shall keep a record of its transactions. The rules governing the Local Board of Tax Review procedures shall be in writing, and may be amended as needed by the Local Board of Tax Review. Such records are not public records available for inspection under section 149.43 of the Ohio Revised Code. For this reason, any documentation, copies of returns or reports, final determinations, or working papers for each case must be maintained in a secure location under the control of the Tax Administrator. No member of the Local Board of Tax Review may remove such documentation, copies of returns or reports, final determinations, or working papers from the hearing. Hearings requested by a taxpayer before a Local Board of Tax Review created pursuant to this section are not meetings of a public body subject to section 121.22 of the Ohio Revised Code. For this reason, such hearings shall not be open to the public, and only those parties to the case may be present during the hearing.\nSECTION 2.  That the current version of Division (F) of Section 362.18 is hereby repealed.     \nSECTION 3.  That, for the reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage or approval by the Mayor or ten days after its passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 15,
    "meeting_date": "2021-05-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Emergency Services"
    ]
  }
}