{
  "success": true,
  "vote": {
    "id": 9533,
    "item_number": "CA-36",
    "title": "To authorize the City Clerk to enter into a grant agreement with the Columbus Historical Society to support organizational and facility implementation costs; to authorize an appropriation and expenditure within the Neighborhood Initiatives subfund; and to declare an emergency. ($300,000.00)",
    "description": "Explanation\nThis ordinance authorizes the City Clerk to enter into a grant agreement with the Columbus Historical Society (CHS) to support organizational and facility implementation costs.\n \nThe Columbus Historical Society continues to preserve the great multi-cultural history of Columbus and shares that history with the community through a variety of educational programming. The Columbus Historical Society purchased Engine House #6 to create a permanent home for the important multi-cultural history of Columbus and Central Ohio.  The restoration/renovation of the 1890 building has recently begun.  The building will create extensive educational opportunities for the community, a community meeting space, a specialized research library, space for archival storage, and offices for the Society.\n \nThis year the Columbus Historical Society is increasing its community programming, which will also include co-hosting a convention for museums and similar organizations. The August convention is expected to welcome between 400-600 attendees.\n \nFiscal Impact: Funding is available within the Neighborhood Initiatives subfund.\n \nEmergency action is requested in order to provide CHS with resources necessary to plan and execute an August convention, including production of presentation materials.\n \nTitle\nTo authorize the City Clerk to enter into a grant agreement with the Columbus Historical Society to support organizational and facility implementation costs; to authorize an appropriation and expenditure within the Neighborhood Initiatives subfund; and to declare an emergency. ($300,000.00)\n \nBody\nWHEREAS, the Columbus Historical Society continues to preserve the great multi-cultural history of Columbus and shares that history with the community through a variety of educational programming; and\n \nWHEREAS, The Columbus Historical Society purchased Engine House #6 to create a permanent home for the important multi-cultural history of Columbus and Central Ohio; and\n \nWHEREAS, this year the Columbus Historical Society is increasing its community programming, which will also include co-hosting a convention for museums and similar organizations with an anticipated 400-600 attendees; and\n \nWHEREAS, an emergency exists in the usual daily operation of the city Clerk's office in that it is immediately necessary to authorize the Clerk to enter into a grant agreement with the Columbus Historical Society in order to provide CHS with resources necessary to plan and execute an August convention, including production of presentation materials; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the City Clerk is hereby authorized to enter into a grant agreement with the Columbus Historical Society to support organizational and facility implementation costs.\n \nSECTION 2:  That the City Auditor is hereby authorized and directed to appropriate $300,000.00 in the Neighborhood Initiatives subfund, fund 1000, subfund 100018, to Columbus City Council per the accounting codes in the attachment to this ordinance.\n \nSECTION 3:  That per the action authorized by Section 1 of this ordinance, the expenditure of $300,000.00, or so much thereof as necessary, is hereby authorized in the Neighborhood Initiatives subfund, fund 1000, subfund 100018, per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this legislation.\n \nSECTION 5.  That, for the reasons stated in the Preamble hereto, which is hereby made a part hereof, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 114,
    "meeting_date": "2024-06-03",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}