{
  "success": true,
  "vote": {
    "id": 954,
    "item_number": "SR-21",
    "title": "To amend various sections and supplement the Columbus Zoning Code, Title 33, in order to adopt a definition of a Produce Stand, expand the agricultural uses allowed, and provide for on-site produce sales and pickup in various residential zoning districts.",
    "description": "Explanation \n \nThis ordinance creates provisions within the City of Columbus Zoning Code to allow for the on-site sale and/or pickup of produce grown by small-scale producers in residentially zoned neighborhoods. These provisions implement shared goals and recommendations that are within the 2016 Columbus and Franklin County Local Food Action Plan and 2017 Green Business and Urban Agriculture Strategic Plan, which both aim to enable, support, and grow a stronger and more efficient local food system. \n \nThrough these changes, the City of Columbus Zoning Code will reflect the way urban growers within Columbus sell their produce, by allowing on-site sales and/or pickup on residentially zoned parcels regardless of size (subject to specific development standards). These updates will increase access to fresh produce for residents, in a time when over 274,000 Franklin County residents have identified as having “low access” to a local full service grocery store (United States Department of Agriculture, 2015).\n \nTwo Columbus Urban Farmer Networking Meetings held during 2020 yielded over 40 attendees and the majority were supportive of the initiative. Additionally, a three-month public comment period took place between September 2020 and December 2020, which yielded additional community comments that were all supportive and in favor of the proposed code change.\n \nA public hearing was held before the Columbus Development Commission on April 8, 2021 whereupon they voted to recommend this proposed code change be forwarded to Columbus City Council for adoption.\n \nFISCAL IMPACT: \nNo funding is required for this legislation.\n \nTitle\nTo amend various sections and supplement the Columbus Zoning Code, Title 33, in order to adopt a definition of a Produce Stand, expand the agricultural uses allowed, and provide for on-site produce sales and pickup in various residential zoning districts.\n \nBody\n \nWHEREAS, it has become necessary to create provisions within the Columbus Zoning Code, Title 33, to allow for the on-site sale and/or pickup of produce grown by small-scale producers in residentially zoned neighborhoods; and\n \nWHEREAS, through these changes, the Zoning Code will reflect the way urban growers within Columbus sell their produce, by allowing on-site sales on residentially zoned parcels regardless of size; and \n \nWHEREAS, these updates will increase access to fresh produce for residents, in a time when over 274,000 Franklin County residents have identified as having “low access” to a local full service grocery store; and\n \nWHEREAS, two Columbus Urban Farmer Networking Meetings held during 2020 yielded over 40 attendees and the majority were supportive of the initiative; and\n \nWHEREAS, additionally, a three-month public comment period took place between September 2020 and December 2020, which yielded additional community comments that were all supportive and in favor of the proposed code change; and\n \nWHEREAS, a public hearing was held before the Columbus Development Commission on April 8, 2021, whereupon they voted to recommend this proposed code change be forwarded to Columbus City Council for adoption; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Building and Zoning Service to amend and supplement the Zoning Code; now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS\n \nSECTION 1. That existing Section 3303.16 of the Columbus City Code is hereby amended to read as follows:\n \n3303.16 Letter P.\n\"Panel antenna\" means the combination of a rectangular panel not to exceed two feet wide by six feet tall by six inches deep and any associated support structure used to facilitate wireless radio and telecommunication transmissions. This definition excludes lattice, guyed, dish or erector-style antennas.\n\"Parking space\" means a rectangular area, exclusive of any driveway or other circulation area, accessible from a street, alley, or maneuvering area and designed for parking a motor vehicle.\n\"Parking lot\" means any off-street area or facility which meets one of the following conditions:\n1.Contains one or more parking, loading or stacking space for commercial, institutional or industrial use; or\n2.Contains five or more parking spaces for any residential use.\n\"Pennant\" means a flag or banner that is triangular in shape. (See \"Banner,\" \"Flag\" and \"String of pennants.\")\nPermanent Sign. See \"Sign.\"\n\"Person\" means, without limitation, a natural person, his heirs, executors, administrators, or assigns, and also includes a corporation, partnership, an unincorporated society or association, or any other type of business or association, including respective successors or assigns, recognized now or in the future under the laws of the state or the city.\n\"Personal assistance\" means supervision as required and services including help in walking, bathing, dressing, feeding, or getting in and out of bed.\n\"Pickup unit\" means a building or portion thereof that, by design, permits customers to receive goods or services while remaining in a motor vehicle.\n\"Pitch\" means the slope of a roof expressed in feet as a ratio of vertical rise to horizontal run.\n\"Pole cover\" means a decorative enclosure that covers the structural support of a sign.\n\"Porch\" means a roofed platform projecting from a building at an entrance and is separated from the building by the walls of the building, and is partially supported by piers, posts or columns. A porch may be open, enclosed or partially enclosed. \"Open porch\" means a porch which is unenclosed (except possibly for screens) by anything higher than 36 inches above the floor except for the roof and roof supports.\n\"Portable building\" means any building or vehicle designed with running gear permanently attached for transportation on the public streets and highways under its own power or towed behind another vehicle, arriving at the site, substantially ready for use, whether for residential, office, commercial or manufacturing use. Removal of packing and baffles; interconnection of two or more buildings or vehicles; and connection of or to utilities shall not be considered in determining whether a portable building is substantially ready for use. The towing hitch, wheels, axles, and other running gear may not be removed from a portable building preventing it from being portable.\nPortable Sign. See \"Sign.\"\n\"Portable storage container\" means a non-permanent, non-habitable, self-contained structure of less than 169 square feet in size and eight feet in height designed for temporary placement on and subsequent removal from a parcel for the purpose of facilitating off-site storage.\n\"Premises\" means land together with the buildings and structures thereon.\n\"Primary building frontage\" means a building frontage that abuts a street listed as a primary street in the applicable overlay areas.\n\"Principal building\" means a building in which the principal use of the property is conducted. All parcels containing at least one building shall be deemed to have a principal building.\n\"Private access\" means driveway as defined and regulated in the parking chapter hereof.\n\"Private club\" means a building and accessory facilities owned and operated by an association, a corporation, or a group of individuals established for the cultural, educational, fraternal, recreational, or social enrichment of its members and not primarily for profit, and whose members pay dues and meet certain prescribed qualifications for membership.\n\"Private garage\" means a building or portion of a building for the housing of motor vehicles as an accessory use permitted in a residential district or an apartment district and in which no service, work, trade, occupation, or business is carried on connected in any way with a motor vehicle as defined by Ohio Revised Code Section 4511.01.\n\"Private residence\" means a place of usual or customary abode.\n\"Private roadway\" means a privately owned and maintained strip of land designed, improved, and intended to be used for vehicular traffic.\n“Produce Stand” means a stand that is an open and non-enclosed structure that is not a building and does not exceed 120 square feet in gross floor area for the display, sale, and/ or pickup of fresh, unprocessed vegetables or produce (as defined by Chapter 3717 of the Ohio Revised Code), flowers, orchard products, or ornamental crops. The stand shall not employ the use of appliances or mechanical refrigeration.\nProjecting Sign. See \"Sign.\"\nProjector Graphic. See \"Graphic.\"\nProperty Frontage. See \"Frontage.\"\nProperty Owner. See \"Owner.\"\n\"Public garage\" means any building or portion of a building other than a private garage, for the housing of commercial or noncommercial motor vehicles.\n\"Public notice\" of a hearing or proceedings means ten days notice of the time and place thereof printed (see \"printed\" in 101.03 Interpretation) in The City Bulletin.\n\"Public nuisance\" means any structure which is permitted to be or remain in any of the following conditions:\n(A)In a dilapidated, decayed, unsafe or unsanitary condition detrimental to the public health, safety, and welfare, or well being of the surrounding area; or\n(B)A fire hazard; or\n(C)Any vacant building that is not secured and maintained in compliance with Chapter 4513; or\n(D)Land, real estate, houses, buildings, residences, apartments, or premises of any kind which are used in violation of any division of Section 2925.13, Ohio Revised Code.\n\"Public nuisance\" also means any structure or real property which is not in compliance with any building, housing, zoning, fire, safety, air pollution, health or sanitation ordinance of the Columbus City Code or Columbus City Health Code, or any real property upon which its real property taxes have remained unpaid in excess of one year from date of assessment.\n\"Public police station\" means all government police uses including but not limited to police stations and substations; police headquarters; community policing centers; police heliports; police administrative offices; and police academies.\n\"Public service announcement\" means a temporary graphic display for the purpose of informing the public about events or activities involving the arts, or involving community service or not-for-profit organizations.\n\"Public-private setback zone\" means an area between a principal building and a public street utilized for seating, outdoor dining, public art and/or other pedestrian amenities.\nPublic Sign. See \"Public graphic\" and \"Sign.\"\n\"Public way\" means an alley, boulevard, bridge, channel, ditch, easement, expressway, freeway, highway, lane, parkway, right-of-way, road, sidewalk, street, subway, tunnel, viaduct, walk or other way in which a public entity has a proprietary right, or which is dedicated whether or not it has been improved.\n \nSECTION 2. That existing Section 3332.040 of the Columbus City Code is hereby amended to read as follows:\n \n3332.040 Agricultural and stable standards.\nA. An agricultural use, farm, field crops, garden, greenhouse, or nursery may be conducted in any residential district contained in this chapter or a district allowing primary residential uses without restriction as to the operation of incidental vehicles and machinery or restriction as to the incidental sale and marketing, including produce stands, of products raised on the premises, provided that:\n1. The agricultural use is located on-premises and on a minimum lot area of one (1) acre five acres; and\n2. A poultry and livestock building, structure and yard is located on-premises and is located a minimum distance of 100 feet from a lot or street line; and\n3. Poultry and livestock for sale are kept in approved enclosures.\n4. The agricultural standards comply with the appropriate regulations of the Columbus Health Department.\nB. A stable may be erected in any residential district contained in this chapter provided that:\n1. The stable is located on-premises and on a minimum lot area of five acres; and\n2. The stable complies with the appropriate regulations of the Columbus Health Department.\nC. On lot areas of less than one (1) acre, Produce Stands shall be allowed as an accessory use to the parcel’s primary use or the on-site agricultural use in any residential district, subject to the following:\n1. The Produce Stand may be in operation during the growing season. The growing season is considered to be the months of April through December.\n2. Sales shall be limited to two (2) days per week.\n3. Sales shall be limited to between 8:00 a.m. and 8:00 p.m.\n4. Only one (1) Produce Stand is permitted per parcel.\n5. For parcels that contain a dwelling unit, Produce Stands must be removed from the premises or stored inside a structure at the end of each day \n6. For parcels that contain a dwelling unit, one (1) sign that is non-illuminated and with a maximum area of four (4) square feet, may be displayed during the growing season but must be removed from the premises or stored inside a structure at other times of the year. All signs shall comply with zoning code standards of Chapter 3376 On Premises Signs in Residential Districts.\n7. For parcels that do not contain a dwelling unit, Produce Stands or Signs do not need to be stored or removed. Furthermore, two (2) signs that are non-illuminated and with a maximum area of four (4) square feet each, may be displayed.\n8. The area used for the Produce Stand shall comply with the vision clearance requirements of zoning code Chapter 3321.05 General Site Development Standards.\n \nSECTION 3. That Columbus City Code Chapter 3333 is hereby supplemented with the creation of a new section, numbered 3333.258, reading as follows:\n \n3333.258 Agricultural and stable standards.\nA. An agricultural use, farm, field crops, garden, greenhouse, or nursery may be conducted in any apartment residential district contained in this chapter without restriction as to the operation of incidental vehicles and machinery or restriction as to the incidental sale and marketing, including produce stands, of products raised on the premises, provided that:\n1. The agricultural use is located on-premises and on a minimum lot area of one (1) acre; and\n2. A poultry and livestock building, structure and yard is located on-premises and is located a minimum distance of 100 feet from a lot or street line; and\n3. Poultry and livestock for sale are kept in approved enclosures.\n4. The agricultural standards comply with the appropriate regulations of the Columbus Health Department.\nB. A stable may be erected in any residential district contained in this chapter provided that:\n1. The stable is located on-premises and on a minimum lot area of five acres; and\n2. The stable complies with the appropriate regulations of the Columbus Health Department.\nC. On lot areas of less than one (1) acre, Produce Stands shall be allowed as an accessory use to the parcel’s primary use or the on-site agricultural use in any residential district, subject to the following:\n1. The Produce Stand may be in operation during the growing season. The growing season is considered to be the months of April through December.\n2. Sales shall be limited to two (2) days per week.\n3. Sales shall be limited to between 8:00 a.m. and 8:00 p.m.\n4. Only one (1) Produce Stand is permitted per parcel.\n5. For parcels that contain a dwelling unit, Produce Stands must be removed from the premises or stored inside a structure at the end of each day \n6. For parcels that contain a dwelling unit, one (1) sign that is non-illuminated and with a maximum area of four (4) square feet, may be displayed during the growing season but must be removed from the premises or stored inside a structure at other times of the year.  All signs shall comply with zoning code standards of Chapter 3376 On Premises Signs in Residential Districts.\n7. For parcels that do not contain a dwelling unit, Produce Stands or Signs do not need to be stored or removed. Furthermore, two (2) signs that are non-illuminated and with a maximum area of four (4) square feet, may be displayed.\n8. The area used for the Produce Stand shall comply with the vision clearance requirements of zoning code Chapter 3321.05 General Site Development Standards.\n \nSECTION 4. That Columbus City Code Chapter 3345 is hereby supplemented with the creation of a new section, numbered 3345.164, reading as follows:\n \n3345.164 Agricultural and stable standards.\nA. An agricultural use, farm, field crops, garden, greenhouse, or nursery may be conducted in any Planned Unit Development district as allowed by this chapter without restriction as to the operation of incidental vehicles and machinery or restriction as to the incidental sale and marketing, including produce stands, of products raised on the premises, provided that:\n1. The agricultural use is located on-premises and on a minimum lot area of one (1) acre; and\n2. A poultry and livestock building, structure and yard is located on-premises and is located a minimum distance of 100 feet from a lot or street line; and\n3. Poultry and livestock for sale are kept in approved enclosures.\n4. The agricultural standards comply with the appropriate regulations of the Columbus Health Department.\nB. A stable may be erected in any residential district contained in this chapter provided that:\n1. The stable is located on-premises and on a minimum lot area of five acres; and\n2. The stable complies with the appropriate regulations of the Columbus Health Department.\nC. On lot areas of less than one (1) acre, Produce Stands shall be allowed as an accessory use to the parcel’s primary use or the on-site agricultural use in any residential district, subject to the following:\n1. The Produce Stand may be in operation during the growing season. The growing season is considered to be the months of April through December.\n2. Sales shall be limited to two (2) days per week.\n3. Sales shall be limited to between 8:00 a.m. and 8:00 p.m.\n4. Only one (1) Produce Stand is permitted per parcel.\n5. For parcels that contain a dwelling unit, Produce Stands must be removed from the premises or stored inside a structure at the end of each day\n6. For parcels that contain a dwelling unit, one (1) sign that is non-illuminated and with a maximum area of four (4) square feet, may be displayed during the growing season but must be removed from the premises or stored inside a structure at other times of the year.  All signs shall comply with zoning code standards of Chapter 3376 On Premises Signs in Residential Districts.\n7. For parcels that do not contain a dwelling unit, Produce Stands or Signs do not need to be stored or removed. Furthermore, two (2) signs that are non-illuminated and with a maximum area of four (4) square feet each, may be displayed.\n8. The area used for the Produce Stand shall comply with the vision clearance requirements of zoning code Chapter 3321.05 General Site Development Standards.\n \nSECTION 5. That Columbus City Code Chapter 3347 is hereby supplemented with the creation of a new section, numbered 3347.124, reading as follows:\n \n3347.124 Agricultural and stable standards.\nA. An agricultural use, farm, field crops, garden, greenhouse, or nursery may be conducted in any Planned Community district as allowed by this chapter without restriction as to the operation of incidental vehicles and machinery or restriction as to the incidental sale and marketing, including produce stands, of products raised on the premises, provided that:\n1. The agricultural use is located on-premises and on a minimum lot area of one (1) acre; and\n2. A poultry and livestock building, structure and yard is located on-premises and is located a minimum distance of 100 feet from a lot or street line; and\n3. Poultry and livestock for sale are kept in approved enclosures.\n4. The agricultural standards comply with the appropriate regulations of the Columbus Health Department.\nB. A stable may be erected in any residential district contained in this chapter provided that:\n1. The stable is located on-premises and on a minimum lot area of five acres; and\n2. The stable complies with the appropriate regulations of the Columbus Health Department.\nC. On lot areas of less than one (1) acre, Produce Stands shall be allowed as an accessory use to the parcel’s primary use or the on-site agricultural use in any residential district, subject to the following:\n1. The Produce Stand may be in operation during the growing season. The growing season is considered to be the months of April through December.\n2. Sales shall be limited to two (2) days per week.\n3. Sales shall be limited to between 8:00 a.m. and 8:00 p.m.\n4. Only one (1) Produce Stand is permitted per parcel.\n5. For parcels that contain a dwelling unit, Produce Stands must be removed from the premises or stored inside a structure at the end of each day. \n6. For parcels that contain a dwelling unit, one (1) sign that is non-illuminated and with a maximum area of four (4) square feet, may be displayed during the growing season but must be removed from the premises or stored inside a structure at other times of the year. All signs shall comply with zoning code standards of Chapter 3376 On Premises Signs in Residential Districts.\n7. For parcels that do not contain a dwelling unit, Produce Stands or Signs do not need to be stored or removed. Furthermore, two (2) signs that are non-illuminated and with a maximum area of four (4) square feet each, may be displayed.\n8. The area used for the Produce Stand shall comply with the vision clearance requirements of zoning code Chapter 3321.05 General Site Development Standards.\n \nSECTION 6. That the prior existing sections 3303.16 and 3332.040 of the Columbus City Code are hereby repealed.\n \nSECTION 7. That this ordinance shall take effect and be in force from and after the earliest period provided by law.",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 15,
    "meeting_date": "2021-05-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Housing",
      "Planning & Development"
    ]
  }
}