{
  "success": true,
  "vote": {
    "id": 9549,
    "item_number": "CA-52",
    "title": "To authorize the Board of Health to modify existing contracts with the following vendors: Aids Healthcare Foundation, Equitas Health, and Columbus Neighborhood Health Center, Inc. dba Primary One Health, for the Implementing Enhanced HIV Prevention and Surveillance for Health Departments to End the HIV Epidemic in Ohio grant program; for the provision of services allowable under the grant for eligible clients for the period August 1, 2023 through July 31, 2024; to authorize the expenditure of $77,556.80 from the Health Department Grants Fund; and to declare an emergency. ($77,556.80)",
    "description": "Explanation\nBACKGROUND: Columbus Public Health was awarded a two-month extension for the Implementing Enhanced HIV Prevention and Surveillance for Health Departments to End the HIV Epidemic (EHE) in Ohio Grant Program from the Ohio Department of Health. Also, referenced in Ordinance 1046-2024. This ordinance authorizes the Board of Health to modify existing contracts with the following qualified vendors: Aids Healthcare Foundation, Equitas Health, and Columbus Neighborhood Health Center, Inc. dba Primary One Health. \nThese services include, but are not limited to, outpatient ambulatory services, resource navigation, counseling, testing, referral services, and client transportation. These services are needed to identify people living with HIV, while simultaneously supporting at-risk clients that test HIV-negative access resources to help them prevent HIV acquisition, including PrEP and other resources that disrupt negative health outcomes by addressing social determinants of health. \n \nThe contract terms for all modifications included in this ordinance are from August 1, 2023, through extended grant end date of July 31, 2024. Aids Healthcare Foundation, Equitas Health and Columbus Neighborhood Health Center, Inc. dba Primary One Health are not for profit agencies and are exempt from bidding according to bidding requirements of the City Code 329.30. \n \nAIDS Healthcare Foundation (CC-010938): contract increased by $11,056.80, for a new total amount not to exceed $66,340.80.\nEquitas Health (CC-004721): contract increased by $42,500.00, for a new total amount not to exceed $212,500.00.\nColumbus Neighborhood Health Center, Inc. dba Primary One Health (CC-005542): contract increased by $24,000.00, for a new total amount not to exceed $144,000.00.\n \nTotal contract modification amounts: $77,556.80\n \nThis ordinance is submitted as an emergency in order to ensure that quality Ending the Epidemic (EHE) services continue to be available to eligible EHE clients, to ensure timely payment to providers, and for the vendors included in this ordinance to able to continue offering Ending the HIV Epidemic services to their existing work which aligns with grant deliverables \n \nFISCAL IMPACT:\n \nThese contracts are fully funded by the Implementing Enhanced HIV Prevention and Surveillance for Health Departments to End the HIV Epidemic in Ohio grant program and does not generate any revenue or require a city match.\n \nTitle\nTo authorize the Board of Health to modify existing contracts with the following vendors: Aids Healthcare Foundation, Equitas Health, and Columbus Neighborhood Health Center, Inc. dba Primary One Health, for the Implementing Enhanced HIV Prevention and Surveillance for Health Departments to End the HIV Epidemic in Ohio grant program; for the provision of services allowable under the grant for eligible clients for the period August 1, 2023 through July 31, 2024; to authorize the expenditure of $77,556.80 from the Health Department Grants Fund; and to declare an emergency. ($77,556.80)\n \nBody\n \nWHEREAS, the Board of Health has a need to modify existing contracts with Aids Healthcare Foundation, Equitas Health, and Columbus Neighborhood Health Center, Inc. dba Primary One Health for the provision of services allowable under the grant for eligible EHE clients for the period of August 1, 2023 through July 31, 2024 ; and\n \nWHEREAS, Aids Healthcare Foundation, Equitas Health, and Columbus Neighborhood Health Center, Inc. dba Primary One Health has the expertise; and\n \nWHEREAS, an emergency exists in the usual daily operation of Columbus Public Health in that it is immediately necessary to authorize the Board of Health to modify contracts with Aids Healthcare Foundation, Equitas Health, and Columbus Neighborhood Health Center, Inc. dba PrimaryOne Health in order to ensure continuity of services for Ending the HIV Epidemic (EHE) clients, all for the immediate preservation of the public health, peace, property, safety and welfare; and Now, therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Board of Health is hereby authorized to enter into a contract modification with Aids Healthcare Foundation, Equitas Health, and Columbus Neighborhood Health Center, Inc. dba Primary One Health, for a total amount not to exceed $77,556.80, for Ending the HIV Epidemic (EHE) related services for eligible EHE Clients, for the period of  August 1, 2023 through July 31, 2024.\n \nSECTION 2.                     That to pay the cost of said contract, the expenditure of $77,556.80, or so much thereof as may be needed, is hereby authorized from the Health Department Grants Fund, Fund No. 2251, object class 03 per the attached accounting document. \n \nSECTION 3.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 4.  That the City Auditor is authorized to make any accounting changes necessary to ensure that this contract is properly accounted for and recorded accurately on the city's financial records.\n \nSECTION 5.  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 114,
    "meeting_date": "2024-06-03",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}