{
  "success": true,
  "vote": {
    "id": 9564,
    "item_number": "CA-67",
    "title": "To authorize the Director of Public Utilities to apply for a U.S. Department of Energy (USDOE) Energy Efficiency and Conservation Block Grant (EECBG); to authorize the acceptance and execution of the grant with the U.S. Department of Energy; to authorize a sub recipient agreement with the Human Service Chamber of Franklin County to administer said grant on behalf of the Department of Public Utilities for a commercial energy audit and technical assistance program for nonprofit organizations; to authorize the expenditure of any awarded funds and the refund of any unused funds; and to declare an emergency.  ($0.00).",
    "description": "Explanation \n1.  BACKGROUND\nThe U.S. Department of Energy’s Energy Efficiency and Conservation Block Grant (EECBG) Program is designed to assist states, local governments, and Tribes in implementing strategies to reduce energy use, reduce fossil fuel emissions, and improve energy efficiency. \nThe City of Columbus is anticipated to receive $778,900.00 through an EECBG formula grant and will use funds to enter into a sub recipient agreement with the Human Service Chamber of Franklin County to administer a commercial energy audit and technical assistance program for nonprofit organizations providing health and human services to residents. \nThe goals of the program are to reduce greenhouse gas emissions and facilitate energy and cost-saving measures for non-profit organizations serving the city's low-income and disadvantaged communities. The energy audits and technical assistance will help building owners develop a plan to reduce energy use, and set up participants to take advantage of local, state, federal and philanthropic funding opportunities for implementation of energy-saving improvements.\n \n2.  FISCAL IMPACT\nApproval of this legislation will authorize the Director of Public Utilities to apply for and accept a U.S. Department of Energy (USDOE) Energy Efficiency and Conservation Block Grant (EECBG). Once the grant is awarded additional legislation will be presented to request appropriation and expenditure of said grant funds and authorize a sub recipient agreement for administration of the grant funds.  \n \n3.  EMERGENCY DESIGNATION\nEmergency action is requested to provide Council's approval to apply for, accept and administer U.S. Department of Energy (USDOE) Energy Efficiency and Conservation Block Grant (EECBG) funds, and to enter into a sub recipient agreement, prior to the anticipated award of the grant in July of 2024.  \n \nTitle\nTo authorize the Director of Public Utilities to apply for a U.S. Department of Energy (USDOE) Energy Efficiency and Conservation Block Grant (EECBG); to authorize the acceptance and execution of the grant with the U.S. Department of Energy; to authorize a sub recipient agreement with the Human Service Chamber of Franklin County to administer said grant on behalf of the Department of Public Utilities for a commercial energy audit and technical assistance program for nonprofit organizations; to authorize the expenditure of any awarded funds and the refund of any unused funds; and to declare an emergency.  ($0.00). \nBody\nWHEREAS, the U.S. Department of Energy (USDOE) provides funding for the Energy Efficiency and Conservation Block Grant Program (EECBG), designed to assist states, local governments, and Tribes in implementing strategies to reduce energy use, to reduce fossil fuel emissions, and to improve energy efficiency; and\nWHEREAS, the USDOE’s Energy’s Energy Efficiency and Conservation Block Grant (EECBG) Program will provide the City up to $778,900.00 in formula grant funds; and \nWHEREAS, the City requests the use of EECBG funding to provide commercial building energy audits and technical assistance to nonprofit organizations to facilitate energy and cost-saving measures and to reduce greenhouse gas emissions in furtherance of the Columbus Climate Action Plan; and \nWHEREAS, the City requests authorization to enter into a sub recipient agreement with the Human Service Chamber of Franklin County for administration of the energy audits and technical assistance; \nWHEREAS, it is necessary to authorize the Director of the Department of Public Utilities to submit an application, execute grant agreements, accept and expend grant funds, and issue refunds if necessary after final accounting of the approved project;\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Utilities in that it is immediately necessary to authorize the Director to apply for Energy Efficiency and Conservation Block Grant Program (EECBG) funds and to execute a grant agreement and a sub recipient agreement as soon as said grant funds are anticipated to be awarded in July 2024, all for the immediate preservation of the public health, peace, property, safety, and welfare; and \n \nNOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1.  That the Director of Public Utilities be and is hereby authorized to submit an application for a grant for the USDOE Energy Efficiency Block Grant Program; to accept said grant, if awarded; and to execute a grant agreement and any other documents necessary to effectuate said application, acceptance, or agreement on behalf of the Department of Public Utilities.\nSECTION 2.  That the Director of Public Utilities be and hereby is authorized to execute a sub recipient agreement with Human Service Chamber of Franklin County for administration of the grant funds. \nSECTION 3.  That the Department of Public Utilities be and hereby is authorized to expend any awarded grant funds in accordance with the terms and conditions of said grant and sub recipient agreement. \nSECTION 4.  That, at the end of the grant period, or upon request of the grantor, any repayment of unencumbered balances required by the grantor is hereby authorized.\nSECTION 5.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 114,
    "meeting_date": "2024-06-03",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Community Services",
      "Contracts & Agreements"
    ]
  }
}