{
  "success": true,
  "vote": {
    "id": 9633,
    "item_number": "CA-19",
    "title": "To authorize the Director of the Department of Recreation and Parks to modify an existing contract with API Services, Inc. for security services at City of Columbus pools, sports facilities and other locations to authorize the expenditure of $50,000.00 from the Recreation and Parks Operating Fund; and to declare an emergency. ($50,000.00)",
    "description": "Explanation\n \nBackground: This ordinance authorizes the Director of the Recreation and Parks Department to modify an existing indefinite quantity contract with API Services, Inc. for security services at City of Columbus pools, sports facilities and other locations as needed. The initial contract, PO446298, is not to exceed $50,000.00.  The modification amount being authorized by this ordinance is an increase of $50,000.00 for an aggregate maximum obligation of $100,000.00.\n \nThe Recreation and Parks Department utilizes the Columbus Police Department for all security needs when possible.  If there are needs that exceed the ability of CPD to assist then private security companies are scheduled to fulfill those needs.  API is currently the primary back up security service for all pool, athletic complex and other facilities operated by the Recreation and Parks Department.  Due to heightened security concerns at the outdoor pools and difficulty in filling all openings through the police department, additional private security officers may be needed.  The total amount needed will be determined by the number of hours that CPD officers are not available when security is needed.  The initial $50,000 contract may be adequate to cover the department through the summer and if that is the case then the additional requested $50,000 shall not be expended and shall be canceled.  This additional $50,000.00 will ensure that funding is readily available to ensure that all facilities are kept secure.  \n \nRFQ026642 was advertised on Vendor Services.  Four (4) bidders responded and all four will be awarded indefinite quantity contracts.  API provides security for CRPD pools and athletic complexes due to their experience level in providing security and the ability of the company to provide officers when needed for CRPD.  It is in the City's best interest to modify this contract in order to provide continuity of reliable service by a provider who has experience in providing the required security to the Recreations and Parks Department thereby ensuring the highest level of service due to their knowledge of CRPD operations and locations.\n \nAll other terms of the original contract shall remain the same including all agreed upon rates.\n \nPrincipal Parties: \nAPI Services, Inc.  \n867 High Street Ste D\nWorthington, OH 43085 \nContract Compliance Number: 007115\n \nEmergency Justification: Emergency action is requested to ensure that Recreation and Parks facilities continue to operate safely during the summer season and for the immediate preservation of the public peace, property, health and safety.\n \nFiscal Impact: This ordinance will modify the previously authorized amount by $50,000.00.  $50,000.00 is budgeted and available in the Recreation and Parks Operating Fund 2285 to meet the financial obligations of this contract modification. The aggregate total amount authorized, including this modification, is $100,000.00.\nTitle\n \nTo authorize the Director of the Department of Recreation and Parks to modify an existing contract with API Services, Inc. for security services at City of Columbus pools, sports facilities and other locations to authorize the expenditure of $50,000.00 from the Recreation and Parks Operating Fund; and to declare an emergency. ($50,000.00)\n \nBody\n \nWHEREAS, it is necessary to authorize the Director of the Recreation and Parks to modify an existing contract with API Services, Inc. for security services at City of Columbus pools, sports facilities and other locations; and\n \nWHEREAS, it is necessary to authorize the additional expenditure of $50,000.00 from the Recreation and Parks Operating Fund 2285 for a total aggregate contract amount of $100,000.00; and\n \nWHEREAS, an emergency exists to public safety such that it is immediately necessary to ensure that Recreation and Parks facilities continue to operate safely during the summer season and for the immediate preservation of the public peace, property, health and safety; NOW, THEREFORE\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Recreation and Parks be and is hereby authorized to modify an existing contract with API Services, Inc. for security services at City of Columbus pools, sports facilities and other locations. The amount of the modification is $50,000.00 and the aggregate total amount authorized, including this modification, is $100,000.00.\n \nSECTION 2. That for the purpose stated in Section 1, the expenditure of $50,000.00 or so much thereof as may be necessary to pay the cost thereof, be and is hereby authorized from the Recreation and Parks Operating Fund 2285 per the accounting codes in the attachments to this ordinance.\n \nSECTION 3. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 4. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 5. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 115,
    "meeting_date": "2024-06-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}