{
  "success": true,
  "vote": {
    "id": 9656,
    "item_number": "CA-42",
    "title": "To authorize the Director of the Department of Public Utilities to modify to increase funding to the contract with ARCOS, LLC., for the implementation and support of an Overtime Call-Out System for the Department of Public Utilities; to authorize the expenditure of $245,898.00 from the Electricity Operating Fund, the Water Operating Fund, the Sewer System Operating Fund, and the Stormwater Operating Fund. ($245,898.00)",
    "description": "Explanation\n \nBACKGROUND:  This legislation authorizes the Director of Public Utilities (DPU) to enter into a contract modification No. 1 with ARCOS LLC, for the implementation and support of an Overtime (OT) Call-out System, in the amount of $245,898.00.\nDPU is in the process of implementing the ARCOS OT Call-out to standardize and automate the OT callout process. This system will be used Department wide by all of DPU's Divisions, including Water, Sewerage & Drainage and Power. DPU has approximately 850 overtime-eligible employees across all Divisions. The project is expected to go-live in 2024 and DPU will need to renew the SaaS (cloud) subscription annually. \nPROCUREMENT:   Request for proposals (RFQ022200) were formally advertised on the Vendor Services and Bonfire websites in accordance with the procedures set forth in Columbus City Codes, Chapter 329 from June 27, 2022 to July 29, 2022.  The city received three (3) responses.  The proposals were deemed responsive and were fully evaluated when the Evaluation Committee met on August 24, 2022. Of the three (3) responses, the committee selected these firms for additional interviews to further discuss their project proposals. These interviews were conducted on October 4-12, 2022. The Evaluation Committee met again on November 18, 2022 submitted final scores and recommended that the Overtime Call-Out System project be awarded to ARCOS, LLC. The committee felt that ARCOS LLC submitted the strongest proposal overall for the following reasons: 1.) Solution offered various methods for contacting employees 2.) Well developed solutions for overtime equalization needs. The Director concurred. \nThe term of this contract shall be for a period of five (5) years from date of execution to June 1, 2028. For each year of the five (5) year contract, funds for services shall be reviewed, and expenditures shall be approved by ordinance of City Council, and appropriation and certification of funds by the City Auditor, with the option to renew for an additional five (5) one (1) year terms for a total of ten (10) years based on funding availability; mutual agreement between the parties, approval of ordinance of Columbus City Council, and appropriation and certification of funds by the City Auditor. \nThe maximum obligation of the City for services described in this contract for the period commencing from date of execution or June 2, 2024 whichever comes first, through June 1, 2025 (“Year 2\") is limited to the amount of $245,898.00 unless all the following occur: this Contract is modified in writing; Columbus City Council enacts an ordinance approving the new amount; and the Columbus City Auditor has certified the availability of the additional funds.  Funds for years two (2) through five (5) are subject to annual approval by Columbus City Council and appropriation by the Columbus City Auditor and shall be memorialized in a written modification to this Contract.  \nOrdinance #1022-2023 authorized the original contract. \nThis ordinance authorizes the first planned modification, and is being submitted in accordance with the relevant provisions of Chapter 329 of City Code.  \n \n1. Amount of additional funds:  Total amount of additional funds needed for this contract modification No. 1 is to ADD $245,898.00.  Total contract amount including this modification No. 1 is $706,793.00.\n \n2. Reasons additional funds were not foreseen:  The need for additional funds were known at the time of the initial contract. This funding is to provide for the payment of services through June 1, 2025.\n \n3. Reason other procurement processes were not used:  Work under this modification No. 1 is a continuation of services included in the scope of the original bid contract.  No lower pricing/more attractive terms and conditions are anticipated at this time.\n \n      4. How cost was determined:  The cost, terms and conditions are in accordance with the original agreement.\n \nSUPPLIER: ARCOS, LLC, Vendor# 031696, Contract Compliance# CC-031696 expires 12/21/24, MAJ. \nThe company is not debarred according to the Excluded Party Listing System of the Federal Government or prohibited from being awarded a contract according to the Auditor of State Unresolved Findings for Recovery Certified Search.  \n \nFISCAL IMPACT: $245,898.00 is budgeted for this service.\n \n$460,895.00 was spent in 2023\n$0.00 was spent in 2022\n \nTitle\n \nTo authorize the Director of the Department of Public Utilities to modify to increase funding to the contract with ARCOS, LLC., for the implementation and support of an Overtime Call-Out System for the Department of Public Utilities; to authorize the expenditure of $245,898.00 from the Electricity Operating Fund, the Water Operating Fund, the Sewer System Operating Fund, and the Stormwater Operating Fund. ($245,898.00)\n \nBody\n \nWHEREAS, the Department of Public Utilities has a need for professional services for an Overtime Call-Out System that will implement and assist in the tracking, reporting and automated calling of DPU employees for overtime opportunity; and \n \nWHEREAS, the Department of Public Utilities solicited a Request for Proposals for an Overtime Call-Out System (RFQ022200) in accordance with relevant provisions of Columbus City Code Chapter 329 relating to awarding professional service contracts through requests for proposals.  Three (3) Requests for Proposal (RFP) were received. Of the three (3) responses, the committee selected all of them for additional interviews and requested clarification of their proposals. These interviews were conducted in October 2022, The Evaluation Committee met again in November 2022 to submit final scores and recommended that the Overtime Call-Out System project be awarded to ARCOS, LLC; and\nWHEREAS, the contract amount will be utilized to provide services under this contract related to the Overtime Call-Out System for use throughout the Department of Public Utilities; and \n \nWHEREAS, services under this agreement are to be provided for a period of five (5) years from date of execution to June 1, 2028. For each year of the five (5) year contract, funds for services shall be reviewed, and expenditures shall be approved by ordinance of City Council, and appropriation and certification of funds by the City Auditor, with the option to renew for an additional five (5) one (1) year terms for a total of ten (10) years based on funding availability; mutual agreement between the parties, approval of ordinance of Columbus City Council, and appropriation and certification of funds by the City Auditor. This contract funding is for year two (2). \n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities to authorize the Director to enter into a modification of the agreement with ARCOS, LLC for the implementation of Overtime Call-Out System for the Department of Public Utilities; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS: \n \nSection 1.  That the Director of the Department of Public Utilities be and is hereby authorized to enter into a contract modification No. 1 for implementation and support of the Overtime Call-Out System with ARCOS, LLC, 8800 Lyra Drive, suite 200, Columbus. OH 43240, in accordance with the terms on file in the office of the Department of Public Utilities.\n \nSECTION 2.  The said firm shall conduct the work to the satisfaction of the Director of the Department of Public Utilities.    \n \nSECTION 3.  That the expenditure of $245,898.00 or so much thereof as may be needed, is hereby authorized per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.                     That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n                     \nSECTION 6.                     That this Ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 115,
    "meeting_date": "2024-06-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Infrastructure"
    ]
  }
}