{
  "success": true,
  "vote": {
    "id": 966,
    "item_number": "CA-5",
    "title": "To authorize the Director of Finance and Management to modify and extend a contract, on behalf of the Office of Construction Management, with BBCO Design, LLC for continuing professional architectural & engineering services; to authorize the expenditure of $250,000.00 from the Construction Management Capital Improvement Fund; and to declare an emergency. ($250,000.00)",
    "description": "Explanation\nBACKGROUND:  This legislation authorizes the Finance and Management Director to modify and extend a contract on behalf of the Office of Construction Management with BBCO Design LLC in an amount up to $250,000.00 for Professional Architectural and Engineering Services (A/E). The original contract was authorized by Ordinance No. 1169-2018 and approved by City Council on May 24, 2018. \n \nThe modification of the contract is necessary to provide the Office of Construction Management with continuing, contractual access to professional Architectural/Engineering services as well as provide technical expertise, complete architectural design and construction administration for each project, including but not limited to: structural, mechanical, electrical, and civil engineering; programming/space planning, site development, full design, cost estimating, construction inspection, shop drawing review; and geotechnical, environmental site assessment, and other services as required for the completion of the project.\n \nThis modification will also extend the contract through May 10, 2022. \n \nPrices already established in the contract were used to determine the cost of this modification. \n \nBBCO Design LLC Contract Compliance No. 27-1134922, expire March 31, 2022 \n \nEmergency action is requested so that design work may continue as required without interruption.\n \nFiscal Impact: This ordinance authorizes the expenditure of $250,000.00 from the Construction Management Capital Improvement Fund with BBCO Design LLC for continuing, contractual access to professional Architectural/Engineering services. \n\n\n\nOriginal Purchase Order Amount (1169-2018):  $300,000.00\n\n \n\n\n\nModification No. 1: \n\n   $97,802.00\n\n\n\nModification No. 2 (current): \n\n  $250,000.00\n\n\n\nTotal (Original and Modification):\n\n  $647,802.00 \n\n\n \nTitle\nTo authorize the Director of Finance and Management to modify and extend a contract, on behalf of the Office of Construction Management, with BBCO Design, LLC for continuing professional architectural & engineering services; to authorize the expenditure of $250,000.00 from the Construction Management Capital Improvement Fund; and to declare an emergency. ($250,000.00)\n \nBody\nWHEREAS, the Finance and Management Department, Office of Construction Management desires to modify and extend a contract for professional architectural and engineering services; and\n \nWHEREAS, it is necessary to modify and extend a contract with BBCO Design LLC  in an amount up to $250,000.00 for professional architectural and engineering services, and\nWHEREAS, the original contract was authorized by Ordinance No. 1169-2018 and approved by City Council on May 24, 2018, and\nWHEREAS, it is necessary to authorize the expenditure of $250,000.00 from the Construction Management Capital Improvement Fund; and\nWHEREAS, these services include but are not limited to structural, mechanical, electrical, and civil engineering; programming/space planning, site development, full design, cost estimating, construction inspection, shop drawing review; and geotechnical, environmental site assessment, and other services as required for the completion of the project; and,\nWHEREAS, an emergency exists in the usual daily operation of the Department of Finance and Management, Office of Construction Management, in that it is immediately necessary to authorize the Director to modify and extend a contract with BBCO Design, LLC. so that the professional architectural and engineering services projects can proceed on behalf of City departments without interruption, thereby preserving the public health, peace, property, safety, and welfare; now, therefore\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSECTION 1.  That the Finance and Management Director is hereby authorized to modify and extend a contract, on behalf of the Office of Construction Management, with BBCO Design, LLC for professional architectural and engineering services.\nSECTION 2.  That the expenditure of $250,000.00, or so much thereof that may be necessary in regards to the action authorized in SECTION 1, is hereby authorized in Fund 7733 Construction Management Capital Improvement Fund, in Object Class 06 - Capital Outlay, per the accounting codes in the attachment to this ordinance.  \n \nSECTION 3. That the monies in the foregoing Sections shall be paid upon order of the Director of Finance and Management, and that no order shall be drawn or money paid except by voucher, the form of which shall be approved by the City Auditor.\n \nSECTION 4. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 6. That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 7.  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared an emergency measure and shall take effect and be enforced from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 16,
    "meeting_date": "2021-06-07",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 2,
        "full_name": "Elizabeth Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Mitchell Brown",
        "vote_choice": "AYE"
      },
      {
        "member_id": 10,
        "full_name": "Priscilla Tyson",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}