{
  "success": true,
  "vote": {
    "id": 9666,
    "item_number": "SR-2",
    "title": "To authorize the City Auditor to modify the existing contract with Dayforce US, Inc. for the renewal of the Dayforce software subscription, support, hardware, and services; to authorize the expenditure of $1,688,150.00 from the Department of Technology operating fund; to authorize the expenditure of $80,000.00 from the Employee Benefits fund. ($1,768,150.00)",
    "description": "Explanation\n \nBACKGROUND\nThis ordinance authorizes the City Auditor to fund year two (2) of the existing three (3) year contract with Dayforce US, Inc., formerly known as Ceridian HCM, Inc, and to provide funding for the support, hosting, services, hardware, and maintenance of Dayforce software as a service; to authorize the expenditure of up to $ 1,688,150.00 from the Department of Technology operating fund; to authorize the expenditure of $80,000.00 from the Employee Benefits fund. Ceridian HCM, Inc changed the company name and branding to Dayforce US, Inc in 2024; however, the company structure, federal tax identification, and other pertinent details related to the contract remain the same. \nThe current contract for these services, was authorized by Ordinance 1919-2023 and was passed on July 17, 2023. The agreement has pricing and services extended for 3 years, subject to annual authorization and appropriation of City Council. This is the second year of the agreement and includes licensing, hosting, maintenance, support, and professional services for the Dayforce system and time clocks manufactured by Dayforce US, Inc. for enterprise-wide benefits administration, payroll, personnel management, and employee self-service system. This contract also includes extended support and consultation services of a technical account manager as authorized by Ordinance 0693-2023 and passed by City Council on March 20, 2023 and merges the service dates with this agreement. Finally, professional services related to managing configurations for the overall system and extra Benefits Administration related professional services are included in this agreement. These additional services are being procured to support planned changes and updates to the City’s various benefits plans, open enrollment planning, and any changes necessary to facilitate exports or reporting. By bundling the hours with services related to this contract, the City can receive these services at a reduced rate. \nFISCAL IMPACT\nThis ordinance will fund year two of the three year extended term for Dayforce subscription and services including maintenance and support of time clocks across City and additional funding lines for clocks in the Department of Public Utilities and Department of Technology from available and approved funding in the Department of Technology, Information Services Division, Information Services fund as follows: \nDescription                                                                                                                                                                        Amount\nDayforce subscription, maintenance and support, and services                                          1,670,000.00\nDepartment of Public Utilities clocks maintenance and support                                          17,490.00\nDepartment of Technology clocks maintenance and support                                          660.00\n                                                                                                                                                   TOTAL                     $1,688,150.00\nFor Benefits related professional services, funding is available in the Employee Benefits fund in the amount of $80,000.00.\nCONTRACT COMPLIANCE \nThe vendor contract compliance number is CC-025904 and is valid through May 7, 2026.  \n \nTitle\n \nTo authorize the City Auditor to modify the existing contract with Dayforce US, Inc. for the renewal of the Dayforce software subscription, support, hardware, and services; to authorize the expenditure of $1,688,150.00 from the Department of Technology operating fund; to authorize the expenditure of $80,000.00 from the Employee Benefits fund. ($1,768,150.00)\n \nBody\n \nWHEREAS, Ceridian HCM, Inc has changed its company name and is now doing business as Dayforce US, Inc; and\nWHEREAS, the current contract between Ceridian HCM, Inc, now known as  Dayforce US, Inc and the City Auditor for three years was authorized by Ordinance 1919-2023, subject to annual appropriation and approval by City Council; and\nWHEREAS, it is necessary to authorize the City Auditor (DoT) to provide funding for issuing a purchase order for year two of a three year agreement with Dayforce, Inc. for the purchase of annual Dayforce software subscription, maintenance, professional consulting, hardware, and support services, in the total amount of $1,768,150; and \nWHEREAS, Dayforce software and touch clocks are a critical component of processing benefits, personnel time & attendance, and payroll for the employees of the City of Columbus. The software as a service provides the City with the capability to web-enable employee self-service, employee onboarding, as well as maintain benefits, manage personnel, and execute payroll functions. Passage of this ordinance ensures continued use and maintains compliance with the subscription agreements; and \nWHEREAS, professional consulting services are needed for continuing and changing City configurations, reports, and benefits administration management beyond standard support agreement services; NOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS: \nSECTION 1: That the City Auditor be and is hereby authorized to modify its existing contract with Ceridian HCM, Inc.to reflect the name change to Dayforce Us, Inc. and to fund the contract with Dayforce US, Inc. for the year two of three of the Dayforce software subscription, maintenance, professional, and support services, in the amount of $1,768,150.00 to fund year-two of the renewal term. \nSECTION 2: That the expenditure of $1,670,000.00 or so much thereof as may be necessary is hereby authorized to be expended from the Department of Technology, Information Services Division, Information Services Operating fund and the Department of Technology, Information Services Operating fund as follows (Please see attachment ORD 1197-2024 ACPO): Dayforce US, Inc. - Dept.: 47 | Div.: 47-02 | Obj Class: 03 | Main Account: 63945 | Fund: 5100 | Sub-fund: 510001 | Program: IT005 | Section 3: N/A | Section 4: N/A | Section 5: N/A | Amount: $1,670,000.00 \nSECTION 3: That the expenditure of $1,067.00 or so much thereof as may be necessary is hereby authorized to be expended from the Department of Technology, Information Services Division, Information Services Operating fund and the Department of Technology, Information Services Operating fund (Direct Charge budget) as follows (Please see attachment ORD 1197-2024 ACPO): Dayforce US, Inc.  - Dept.: 47 | Div.: 47-01 | Obj Class: 03 | Main Account: 63050 | fund: 5100 | Sub-fund: 510001 | Program: CW001 | Section 3: 470104 | Section 4: IS02 Section 5: IT1308 | Amount: $1,067.00\nSECTION 4: That the expenditure of  $6,786.00  or so much thereof as may be necessary is hereby authorized to be expended from the Department of Technology, Information Services Division, Information Services Operating fund and the Department of Technology, Information Services Operating fund (Direct Charge budget) as follows (Please see attachment ORD 1197-2024 ACPO): Dayforce US, Inc.  - Dept.: 47 | Div.: 47-01 | Obj Class: 03 | Main Account: 63050 | Fund: 5100 | Sub-fund: 510001 | Program: CW001 | Section 3: 470104 | Section 4: IS02 | Section 5: IT1309 | Amount: $6,786.00\nSECTION 5: That the expenditure of  $7,608.00  or so much thereof as may be necessary is hereby authorized to be expended from the Department of Technology, Information Services Division, Information Services Operating fund and the Department of Technology, Information Services Operating fund (Direct Charge budget) as follows (Please see attachment ORD 1197-2024 ACPO): Dayforce US, Inc. - Dept.: 47 | Div.: 47-01 | Obj Class: 03 | Main Account: 63050 | Fund: 5100 | Sub-fund: 510001 | Program: CW001 | Section 3: 470104 | Section 4: IS02 | Section 5: IT1310 | Amount: $7,608.00\nSECTION 6: That the expenditure of  $2,029.00  or so much thereof as may be necessary is hereby authorized to be expended from the Department of Technology, Information Services Division, Information Services Operating fund and the Department of Technology, Information Services Operating fund (Direct Charge budget) as follows (Please see attachment ORD 1197-2024 ACPO): Dayforce US, Inc. - Dept.: 47 | Div.: 47-01 | Obj Class: 03 | Main Account: 63050 | Fund: 5100 | Sub-fund: 510001 | Program: CW001 | Section 3: 470104 | Section 4: IS02 | Section 5: IT1311 | Amount: $2,029.00\nSECTION 7: That the expenditure of $660.00 or so much thereof as may be necessary is hereby authorized to be expended from the Department of Technology, Information Services Division, Information Services Operating fund and the Department of Technology, Information Services Operating fund as follows (Please see attachment ORD 1197-2024 ACPO): Dayforce US, Inc. - Dept.: 47 | Div.: 47-02 | Obj Class: 03 | Main Account: 63050 | Fund: 5100 | Sub-fund: 510001 | Program: IT004 | Section 3: N/A | Section 4: N/A | Section 5: N/A | Amount: $660\nSECTION 8: That the expenditure of $80,000.00 or so much thereof as may be necessary is hereby authorized to be expended from the Department of Human Resources, Risk Management Division, Information Services Operating fund and the Employee Benefits fund as follows (Please see attachment ORD 1197-2024 ACPO): Dayforce US, Inc.  - Dept.: 46 | Div.: 46-01 | Obj Class: 03 | Main Account: 63050 | Fund: 5502 | Sub-fund: 550201 | Program: RM002 | Section 3: N/A | Section 4: N/A | Section 5: N/A | Amount: $80,000.00| \nSECTION 9: That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \nSECTION 10: That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \nSECTION 11: This ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 115,
    "meeting_date": "2024-06-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements"
    ]
  }
}