{
  "success": true,
  "vote": {
    "id": 9668,
    "item_number": "SR-4",
    "title": "To authorize the Director of the Department of Technology to enter into a Grant Agreement with Rise Together Innovation Center, dba Rise Together Innovation Institute, an Ohio non-profit corporation, to help fund the “Rise Together Blueprint for Reducing Poverty in Franklin County;” to authorize the transfer of $5,000,000.00 within the general fund, from the Finance Department’s general fund citywide account to the Department of Technology; to authorize the subsequent appropriation of $5,000,000.00 to the Department of Technology; to authorize the expenditure of $5,000,000.00; and to declare an emergency. ($5,000,000.00)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of the Department of Technology to enter into a Grant Agreement (Agreement) with Rise Together Innovation Center, Inc. dba Rise Together Innovation Institute, an Ohio nonprofit corporation. The purpose of this agreement is to provide funding to the Rise Together Innovation Center (Center).\n \nThe Rise Together Innovation Center was established to assist in compiling the recent countywide poverty assessment and strategic plan, entitled the “Rise Together Blueprint for Reducing Poverty in Franklin County” (or “Blueprint\"). As part of this effort, the Community Information Exchange (CIE) was created. The CIE is a key player in the continued development and implementation of the “Blueprint,” with Columbus holding one of fifteen seats on CIE’s executive committee. This committee member is appointed by the Mayor.\n \nThe above-referenced Agreement authorizes the City of Columbus to provide a total of $5,000,000.00 to the Rise Together Innovation Center to assist in the efforts stated therein. These funds will be encumbered for three years with passage of this ordinance and released over that same time period, with $1,500,000.00 being provided to the Center during the first year.\n \nThis ordinance also authorizes the transfer of $5,000,000.00 within the general fund, from the Finance Department’s general fund citywide account to the Department of Technology. These funds will then be subsequently appropriated to the Department of Technology. Finally, the total expenditure of $5,000,000.00, over a three year period, for the above described purpose from the appropriated moneys is authorized.\n \n2. FISCAL IMPACT\n$5,000,000.00 is available and budgeted in the Finance Department’s general fund citywide account to accommodate the requested transfer and appropriate to the Department of Technology. \n \n3. CONTRACT COMPLIANCE\nRise Together Innovation Center will have an active contract compliance number before the grant is executed. \n \n4. EMERGENCY\nEmergency designation is requested to ensure that the needed funds are released to the Rise Together Innovation Center on the earliest possible date to provide funding to assist in compiling the recent countywide poverty assessment and strategic plan to allow programs across the social services sector to coordinate and better connect residents with the services they need to reduce poverty.  \n \nTitle\nTo authorize the Director of the Department of Technology to enter into a Grant Agreement with Rise Together Innovation Center, dba Rise Together Innovation Institute, an Ohio non-profit corporation, to help fund the “Rise Together Blueprint for Reducing Poverty in Franklin County;” to authorize the transfer of $5,000,000.00 within the general fund, from the Finance Department’s general fund citywide account to the Department of Technology; to authorize the subsequent appropriation of $5,000,000.00 to the Department of Technology; to authorize the expenditure of $5,000,000.00; and to declare an emergency. ($5,000,000.00)\n \nBody\nWHEREAS, the Rise Together Innovation Center was established to assist in compiling the recent countywide poverty assessment and strategic plan, entitled the “Rise Together Blueprint for Reducing Poverty in Franklin County; and\n \nWHEREAS, as part of the above-stated effort, the Community Information Exchange was created; and\n \nWHEREAS, the CIE is a key player in in the continued development and implementation of the “Blueprint,” with Columbus holding one of fifteen seats on CIE’s executive committee; and\n \nWHEREAS, the City of Columbus wishes to provide funds to assist in the development and implementation of the above described “Blueprint;” and\n \nWHEREAS, funds totaling $5,000,000.00 are budgeted and available in the city’s general fund citywide account for the purpose described above; and\n \nWHEREAS, it is necessary to transfer $5,000,000.00 within the general fund, from the Finance Department’s citywide account to the Department of Technology and to then appropriate the same amount to the Department of Technology; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Technology in that it is immediately necessary to authorize the Director to enter into a Grant Agreement with Rise Together Innovation Center, Inc. and to transfer and appropriate $5,000,000.00 to accommodate this Agreement, to provide funding to assist in compiling the recent countywide poverty assessment and strategic plan to allow programs across the social services sector to coordinate and better connect residents with the services they need to reduce poverty, all for the immediate preservation of public health, peace, property, safety and welfare; and now therefore;\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of the Department of Technology be and is hereby authorized to enter into a Grant Agreement with Rise Together Innovation Center, dba Rise Together Innovation Institute, an Ohio non-profit corporation, to fund the “Rise Together Blueprint for Reducing Poverty in Franklin County” for a period of three years at a total cost of $5,000,000.00\n \nSECTION 2. That the transfer of $5,000,000.00 within the general fund, from the Finance Department’s citywide account to the Department of Technology is hereby authorized, as shown in the attachment to this ordinance (see 1606-2024)\n \nSECTION 3. That the aforementioned $5,000,000.00, having been transferred to the Department of Technology, is hereby appropriated to the Department of Technology, as shown in the attachment to this ordinance (see 1606-2024)\n \nSECTION 4. That the expenditure of up to $5,000,000.00 is hereby authorized from the General Fund appropriation in the Department of Technology, as shown in the attachment to this ordinance (see 1606-2024)\n \nSECTION 5. That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance. \n \nSECTION 6. That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 7. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 115,
    "meeting_date": "2024-06-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Community Services",
      "Contracts & Agreements"
    ]
  }
}