{
  "success": true,
  "vote": {
    "id": 9675,
    "item_number": "SR-11",
    "title": "To authorize the Director of the Department of Public Utilities to enter into a construction contract with Danbert, Inc., for the Blueprint Hilltop - Eureka/Fremont Area Integrated Solution, Permeable Pavers, Water Line Improvements, and Resurfacing projects; to authorize an amendment to the 2023 Capital Improvement Budget; to appropriate funds; to make this ordinance contingent upon the Ohio Water Development Authority approving loans for this project; to authorize a transfer of funds between projects within the Streets and Highways Bond Fund; to authorize the expenditure of $21,776,461.74 from the Sanitary Revolving Loan Fund, the Sanitary Bond Fund, the Water Supply Revolving Loan Fund, and the Streets and Highways Bond Fund to pay for the project.  ($21,776,461.74)",
    "description": "Explanation    \n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Utilities to enter into a construction contract with Danbert, Inc., via the City’s Invitation for Bid process for public sanitary sewers for the Blueprint Hilltop - Eureka/Fremont Area Integrated Solution, Permeable Pavers, Water Line Improvements, & Resurfacing project, CIP #650870-100802, 650870-153002, 690236-100143 & 530282-100147, in an amount up to $21,774,461.74; and to encumber funds with the Department of Public Service for construction administration services in an amount up to $2,000.00, for a total expenditure of $21,776,461.74.\n \nThis project consists of constructing bioretention basins/rain gardens within the City’s Right-of-Way and on City owned properties in the Hilltop/Eureka Fremont area to store and treat storm water runoff as part of the City of Columbus’ Wet Weather Integrated Plan mandated by the Ohio Environmental Protection Agency.  The goal of the project is to enhance water quality within the streams that receive the storm water and to address flooding issues in the area.\n \nThe Community Area for this ordinance will be “53”, Greater Hilltop.  \n \nTIMELINE:  Substantial completion is required to be completed in a manner acceptable to the City within 730 days from the date a Notice to Proceed (NTP) is given by the City.  Final completion shall be completed by September 1, 2026.\n \nESTIMATED COST OF PROJECT:  The bid amount and proposed award amount is $21,774,461.74, including a 15% construction contingency amount that will be utilized to fund needed and approved changes in the work.  No contract modifications are anticipated at this time; however, construction exigency might later compel modification of this contract if unforeseen difficulties are encountered.\n \nCost summary: \n \nOriginal Contract                                    $21,774,461.74\nFuture Anticipated Needs                                     $0.00 \nPrevailing Wage Services                         ___$2,000.00\nTOTAL                                                 $21,776,461.74\n \n2.  ECONOMIC IMPACT/ADVANTAGES; COMMUNITY OUTREACH; PROJECT DEVELOPMENT; ENVIRONMENTAL FACTORS/ADVANTAGES OF PROJECT\nThis project aims to capture and treat stormwater runoff by constructing storm sewers in the project area and implementing regional green infrastructure. The goal is to enhance water quality within the receiving streams and address the flooding issue in the area.\n \n3.  CONSTRUCTION CONTRACT AWARD\nAn Invitation for Bids for the Blueprint Hilltop - Eureka/Fremont Area Integrated Solution, Permeable Pavers, Water Line Improvements, & Resurfacing project was advertised on the Vendor Services and Bid Express websites from 02/14/24 through 03/20/24.  Two bids were received for the project and were opened on 03/20/24.  The following companies submitted a bid:\n  \nCompany                                            Bid Amount              Compliance Number       ODI Status\n1. Danbert, Inc.                                   $ 21,774,461.74                 CC004618                          MAJ\n2. Trucco Construction Company         $ 23,511,974.56                 CC004988                          MAJ\n \nThe Danbert, Inc. bid was deemed the lowest, best, most responsive and responsible bid in the amount of $21,774,461.74.\n \nThe certification of Danbert, Inc. was in good standing at the time the bid was awarded.\n \n4.  CONTRACT COMPLIANCE INFORMATION\nDanbert, Inc.’s contract compliance number is CC004618 and expires 1/18/26.   \n \nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against Danbert, Inc. \n \n5.  MINORITY AND WOMAN OWNED BUSINESS ENTERPRISE & SMALL LOCAL BUSINESS ENTERPRISE PROGRAM\nThis contract was bid with an anticipated City of Columbus MBE/WBE Program goal of 13% as assigned by the City’s Office of Diversity and Inclusion (ODI).  After ODI’s review of the Utilization Plan and other related information the contractor submitted with their bid response, ODI has approved an MBE/WBE Program goal of 13% for this contract.  Failure by the contractor to meet this goal subjects the contractor to the Penalties for Non-Compliance as described in the “City’s Minority and Women-Owned Business Enterprise & Small Local Business Enterprise Program Manual” and in the bid documents for this contract.\nDanbert, Inc. listed the following companies as subcontractors for this project:\n \nCompany Name                                            City/State                                     ODI Certification Status\nColumbus Asphalt Paving                            Columbus, Ohio                                         WBE\nRussell Tree Experts LTD                            Westerville, Ohio                                       MAJ\nTFR Construction LLC                                 Columbus, Ohio                                        MBE\nDanbert Electrical Corporation                     Plain City, Ohio                                         MAJ\n4K Landscape LLC                                       Dublin, Ohio                                            MAJ\nDecorative Paving Company, LLC               Loveland, Ohio                                          MAJ\nThe Paul Peterson Company                         Columbus, Ohio                                        MAJ\nGarcia Surveyors, Inc.                                   Columbus, Ohio                                       MBE\n \nThe certification of Danbert, Inc. and the above companies was in good standing at the time the bid was awarded.\n \n6.  PRE-QUALIFICATION STATUS\nDanbert, Inc. and all subcontractors have met code requirements with respect to pre-qualification, pursuant to relevant sections of Columbus City Code Chapter 329.  \n \n7.  FISCAL IMPACT\nDivision of Sewerage and Drainage Construction Funding\nThe Division of Sewerage and Drainage (DOSD) construction portion of this project (CIP #650870-100802 & 650870-153002) is anticipated to be financed with a loan from the Water Pollution Control Loan Fund (WPCLF), a program jointly administered by the Ohio EPA's Division of Environmental and Financial Assistance and the Ohio Water Development Authority (OWDA).  City Council authorized this loan application and acceptance of funding via Ordinance 2767-2023, passed by Council on 10/30/2023.  The loan is expected to be approved in June, 2024. \nThis project is contingent on the WPCLF loan being approved by the OWDA Board.  The Department of Public Utilities will inform the Auditor's Office when this loan has been approved.  It is necessary to appropriate funds in the amount of $19,555,567.46 in Fund 6111 (Sanitary Revolving Loan Fund) for the DOSD loan portion of this project.  An amendment to the 2023 Capital Improvement Budget is necessary to align budget authority with the proper project. \nDivision of Water Construction Funding\nThe Division of Water (DOW) construction portion of this project (CIP #690236-100143) is anticipated to be financed with a loan from the Water Supply Revolving Loan Account (WSRLA), a program jointly administered by the Ohio EPA's Division of Environmental and Financial Assistance and the Ohio Water Development Authority (OWDA).  City Council authorized this loan application and acceptance of funding via Ordinance 0944-2023, passed by Council on April 24, 2023.  The loan is expected to be approved in June, 2024.\n \nThis project is contingent on the WSRLA loan being approved by the OWDA Board.  The Department of Public Utilities will inform the Auditor's Office when this loan has been approved.  It is necessary to appropriate funds in the amount of $1,258,779.93 in Fund 6011 (Water Supply Revolving Loan Fund) for the DOW loan portion of this project.    \n \nDepartment of Public Service Construction Funding\n$960,114.35 is available and appropriated within the Streets and Highways Bond Fund, Fund 7704.  An amendment to the 2023 Capital Improvement Budget and a transfer of cash and appropriation is necessary to align spending with the proper project.\nConstruction Administration Funding \nFunding in the amount of $2,000.00 is appropriated and available within the Sanitary Bond Fund, Fund 6109, to pay the Department of Public Service to provide prevailing wage services for this project.\n \n  \nTitle\nTo authorize the Director of the Department of Public Utilities to enter into a construction contract with Danbert, Inc., for the Blueprint Hilltop - Eureka/Fremont Area Integrated Solution, Permeable Pavers, Water Line Improvements, and Resurfacing projects; to authorize an amendment to the 2023 Capital Improvement Budget; to appropriate funds; to make this ordinance contingent upon the Ohio Water Development Authority approving loans for this project; to authorize a transfer of funds between projects within the Streets and Highways Bond Fund; to authorize the expenditure of $21,776,461.74 from the Sanitary Revolving Loan Fund, the Sanitary Bond Fund, the Water Supply Revolving Loan Fund, and the Streets and Highways Bond Fund to pay for the project.  ($21,776,461.74)  \n \nBody\nWHEREAS, the Department of Public Utilities is engaged in the Blueprint Hilltop - Eureka/Fremont Area Integrated Solution, Permeable Pavers, Water Line Improvements, & Resurfacing project; and\n \nWHEREAS, bids for the Blueprint Hilltop - Eureka/Fremont Area Integrated Solution, Permeable Pavers, Water Line Improvements, & Resurfacing project were received and opened on 03/20/24; and\n \nWHEREAS, the lowest, best, most responsive and responsible bid was from Danbert, Inc.; and\n \nWHEREAS, Ordinance 2767-2023 authorized the sewer work on this project to be funded by a loan to be obtained through the Water Pollution Control Loan Fund (WPCLF); and\n \nWHEREAS, Ordinance 0944-2023 authorized the water work on this project to be funded by a loan to be obtained through the Water Supply Revolving Loan Account (WSRLA); and\n \nWHEREAS, this ordinance is contingent upon the loans being approved; and\n \nWHEREAS, the 2023 Capital Improvement Budget must be modified to align budget authority with the proper project; and\n \nWHEREAS, it is necessary to authorize a transfer of cash and appropriation between projects within the Streets and Highways Bond Fund, Fund 7704; and\n \nWHEREAS, it is necessary to appropriate funds from the Sanitary Revolving Loan Fund and the Water Supply Revolving Loan Fund; and\n \nWHEREAS, it is necessary to authorize the Director of the Department of Public Utilities to enter into a construction contract with Danbert, Inc. for the Blueprint Hilltop - Eureka/Fremont Area Integrated Solution, Permeable Pavers, Water Line Improvements, & Resurfacing project; and \n \nWHEREAS, it is necessary to authorize an expenditure of funds from the Sanitary Revolving Loan Fund, the Water Revolving Loan Fund, the Sanitary Bond Fund, and the Streets and Highways Bond Fund to pay for the project; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the 2023 Capital Improvement Budget authorized by Ordinance 1711-2023 be amended as follows to establish sufficient budget authority for this project:\n \nFund / Project Number / Project Name (Funding Source) / Current Authority / Revised Authority / Change \n6111 / 650870-100802 / Blueprint Hilltop - Eureka/Fremont (WPCLF/OWDA) / $10,000,000.00 / $19,555,567.00 / $9,555,567.00 (To match the loan amount)\n \n7704 / P533008 - 100000 / Arterial Street Rehabilitation - Williams Road Corridor - Scioto River to S. Hamilton Rd (Voted Carryover) / $353,539.00 / $3,541.00 / ($349,998.00) \n7704 / P530282 - 100051 / Resurfacing - Resurfacing Projects (Voted Carryover) / $802,435.00 / $192,319.00 / ($610,116.00)\n7704 / P530282 - 100147 / Resurfacing - Blueprint Hilltop Eureka Freemont (Voted Carryover) / $0.00 / $960,114.00 / $960,114.00\n \nSECTION 2.  That the appropriation of $19,555,567.46, or so much thereof as may be needed, is hereby authorized in the Sanitary Revolving Loan Fund, Fund 6111, per the accounting codes in the attachment to this ordinance.\n \nSECTION 3.  That the appropriation of $1,258,779.93, or so much thereof as may be needed, is hereby authorized in the Water Supply Revolving Loan Fund, Fund 6011, per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the transfer of $349,997.32, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5912 (Design and Construction), Project P533008-100000 (Arterial Street Rehabilitation - Williams Road Corridor - Scioto River to S. Hamilton Rd), Object Class 06 (Capital Outlay) to Dept-Div 5911 (Infrastructure Management), Project P530282-100147 (Resurfacing - Blueprint Hilltop Eureka Freemont), Object Class 06 (Capital Outlay) between projects per the account codes in the attachment to this ordinance.\nSECTION 5.  That the Director of the Department of Public Utilities is hereby authorized to enter into a construction contract for the Blueprint Hilltop - Eureka/Fremont Area Integrated Solution, Permeable Pavers, Water Line Improvements, & Resurfacing project with Danbert, Inc., 8077 Memorial Drive, Plain City, OH, 43064, in an amount up to $21,774,461.74; in accordance with the terms and conditions of the contract on file in the Department of Public Utilities; and to obtain the necessary construction administration services for this project from the Department of Public Services in an amount up to $2,000.00.\n \nSECTION 6.  That this ordinance is contingent upon the Ohio Water Development Authority approving a Water Supply Revolving Loan Account loan and a Water Pollution Control Loan Fund loan for this project.\n \nSECTION 7.  That the expenditure of $21,776,461.74, or so much thereof as may be needed, is hereby authorized to pay for this contract per the accounting codes in the attachment to this ordinance. \n \nSECTION 8.  That funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 9.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 10.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 11.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 2,
    "meeting_id": 115,
    "meeting_date": "2024-06-10",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Health & Safety"
    ]
  }
}