{
  "success": true,
  "vote": {
    "id": 9694,
    "item_number": "CA-4",
    "title": "To authorize the Director of the Department of Technology to enter into contract with vCloud Tech Inc. for Red Hat Linux licenses, Red Hat learning subscriptions, and Red Hat JBOSS including maintenance and support; to authorize the expenditure of $157,924.94 from the Department of Technology, Information Services Division, Information Services Operating Fund; and to declare an emergency.  ($157,924.94)",
    "description": "Explanation     \nBACKGROUND:\nThis ordinance authorizes the Director of the Department of Technology (DoT) to enter into a contract with vCloud Tech Inc. for Red Hat Linux licenses, Red Hat learning subscriptions, and Red Hat JBOSS including maintenance and support. DoT utilizes Red Hat Linux on its operating systems that many of the city's critical applications are housed on; therefore, maintenance and support is required.  \n \nThe Department of Technology solicited bids through RFQ027177 from March 13, 2024, to April 10, 2024.  The bid was formally advertised on Vendor Services and the city received thirteen (13) responses.  The bids were tabulated as follows: \n \n\n\n\nVendor\n\n Total amount \n\nCity, State\n\nODI Certification\n\n\n\nMicro Strategies Inc\n\n $   138,119.38 \n\nParsippany, NJ\n\nMAJ\n\n\n\nvCloud Tech Inc.\n\n $   157,924.94 \n\nRolling Hills Estates, CA\n\nMAJ\n\n\n\nComtech Global, Inc\n\n $   160,634.00 \n\nColumbus, OH\n\nMBE\n\n\n\nR3 Uniq Inc\n\n $   161,089.95 \n\nBettendorf, IA\n\nMAJ\n\n\n\nSMART IT PROS INC\n\n $   174,925.64 \n\nRockwall, TX\n\nMAJ\n\n\n\nDigital Information Services\n\n $   178,762.02 \n\nPotomac, MD\n\nMAJ\n\n\n\nAxelliant LLC\n\n $   180,370.69 \n\nChicago, IL\n\nMAJ\n\n\n\nTECH SERVICE SOLUTIONS LLC\n\n $   180,843.68 \n\nPhoenix, AZ\n\nMAJ\n\n\n\nBrown Enterprise Solutions, LLC\n\n $   183,115.70 \n\nDublin, OH\n\nMBE\n\n\n\nKambrian Corporation\n\n $   183,221.03 \n\nLa Puente, CA\n\nMBE\n\n\n\nAmerican Business Solutions Inc\n\n $   183,312.00 \n\nLewis Center, OH\n\nMBE\n\n\n\nGovConnection, Inc.\n\n $   184,819.23 \n\nPittsburgh, PA\n\nMAJ\n\n\n\nTommyTQL LLC\n\n $   186,830.00 \n\nSeattle, WA\n\nMAJ\n\n\n \n \nMicro Strategies Inc. was the lowest bidder but had to withdraw their bid due to incorrect pricing from their distributor.  Award is to be made to vCloud Tech Inc., as the lowest responsive and responsible and best bidder for their bid of $157,924.94.\n \nSearches in the Excluded Party List System (Federal) and the Findings for Recovery list (State) produced no findings against vCloud Tech Inc\nThe term of this agreement shall be from July 1, 2024 to June 30, 2025.  This agreement is not subject to automatic renewal.  However, upon mutual agreement, to include same pricing and terms and conditions as those set forth, the services may be continued for four (4) additional one-year terms.\n \nFISCAL IMPACT: \nThe funds for this expenditure have been identified and are available within the Department of Technology, Information Services Division, Information Services Operating Fund for a total cost of $157,924.94.\n \nEMERGENCY:  \nEmergency designation is being requested for these services that are necessary to support daily operation activities, to ensure no service interruption, and to establish a purchase order at the earliest possible date.\nCONTRACT COMPLIANCE:  \nVendor Name: vCloud Tech Inc.\nVendor Acct. #: 012179\nCompliance #: CC-012179\nExpiration Date: 4/19/2026\n \nTitle\n \nTo authorize the Director of the Department of Technology to enter into contract with vCloud Tech Inc. for Red Hat Linux licenses, Red Hat learning subscriptions, and Red Hat JBOSS including maintenance and support; to authorize the expenditure of $157,924.94 from the Department of Technology, Information Services Division, Information Services Operating Fund; and to declare an emergency.  ($157,924.94)\n \nBody\n \nWHEREAS, the Department of Technology has a need for Red Hat Linux licenses, Red Hat learning subscriptions, and Red Hat JBOSS licensing and support; and\n \nWHEREAS, the Department of Technology utilizes Red Hat Linux on its operating systems that many of the city's critical applications are housed on; therefore, maintenance and support is required; and \n \nWHEREAS, the Department of Technology solicited bids through RFQ027177 for the purchase of the above-described software support and award is to be made to vCloud Tech Inc. as the lowest, most responsive bidder; and\nWHEREAS, this ordinance authorizes the Director of the Department of Technology (DoT) to enter into contract with vCloud Tech Inc. for the purchase of Red Hat Linux licenses, Red Hat learning subscriptions, and Red Hat JBOSS including maintenance and support; at a cost of $157,924.94; and\n \nWHEREAS, the term of this agreement shall be from July 1, 2024 to June 30, 2025.  This agreement is not subject to automatic renewal.  However, upon mutual agreement, to include same pricing and terms and conditions as those set forth, the services may be continued for four (4) additional one-year terms; and\nWHEREAS, it has become necessary in the usual daily operation of the Department of Technology to authorize the Director enter into contract with vCloud Tech Inc. for Red Hat Linux licenses, Red Hat learning subscriptions, and Red Hat JBOSS including maintenance and support; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Technology in that it is immediately necessary to authorize the Director of the Department of Technology to enter into a contract with vCloud Tech Inc. to ensure no service interruption, for the immediate preservation of the public health, peace, property, and safety; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1: That the Director of the Department of Technology is hereby authorized to enter into contract with vCloud Tech Inc. for the purchase of Red Hat Linux licenses, Red Hat learning subscriptions, and Red Hat JBOSS including maintenance and support services at a cost of $157,924.94, for a one (1) year term, starting on July 1, 2024 to June 30, 2025.\nSECTION 2: That the expenditure of $157,924.94, or so much thereof as may be necessary, is hereby authorized to be expended as shown in the attachment to this ordinance. (Please see 1348-2024 EXP)\n \nSECTION 3: That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 4: That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 5:  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 116,
    "meeting_date": "2024-06-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}