{
  "success": true,
  "vote": {
    "id": 9753,
    "item_number": "SR-4",
    "title": "To authorize the Finance and Management Director to enter into a contract for the option to purchase Office Supplies, Accessories and Papers with Friends Service Co. Inc., HiTouch Business Services LLC and Key-4 Supply, Inc. dba Key-4 Cleaning Supplies Inc.; to authorize the expenditure of $3.00; to waive the provisions of competitive bidding; and to declare an emergency. ($3.00)",
    "description": "Explanation\n \nBACKGROUND: This legislation authorizes the Finance and Management Director to establish three (3) Universal Term Contracts (UTCs) for the option to purchase Office Supplies, Accessories and Papers with Friends Service Co., HiTouch Business Services LLC, and Key-4 Supply dba Key-4 Cleaning Supplies Inc.  Office supplies, accessories, equipment and papers are used by various City agencies to maintain daily operations.  The term of the proposed option contract would be approximately two (2) years, expiring July 31, 2026, with the option to renew for one (1) additional year.  In addition, the expenditure of $3.00 is hereby authorized from General Budget Reservation BRPO002726.  \n \nThe Purchasing Office advertised and solicited competitive bids in accordance with the relevant provisions of Columbus City Code 329 relating to competitive bidding, (Request for Quotation No. RFQ027250).  The Purchasing Office opened formal bids on April 18, 2024.   Five (5) bids were received. The Information for Bidders section (Page 3A - 3C) was not included in the bid proposal.  The three (3) awarded bidders are currently on contracts with the City and has previously agreed to these terms and conditions.  The bidders reviewed the Information for Bidders and agree to the terms and conditions.   A waiver is requested to include the Information for Bidders section in the contract, as this section was accepted and agreed to by the awarded suppliers.\n \nThe Purchasing Office is recommending award to the overall lowest, responsible and best bidders as follows:\n \nFriends Service Co. Inc., CC#006796, expires 4/19/2026, Categories 1-3, and Catalogs at discounts specified $1.00\nKey-4 Supply, Inc. dba Key-4 Cleaning Supplies Inc., CC#005308, expires 12/9/2024, Categories 1-3, and Catalogs at discounts specified, $1.00\nHiTouch Business Services LLC, CC#032413, expires 2/6/2026, Categories 1-3, and Catalogs at discounts specified, $1.00\nTotal Estimated Annual Expenditure: $800,000.00, Various City Agencies\n \nEmergency Designation:  The Finance and Management Department respectfully requests this legislation be considered an emergency ordinance to ensure that office supplies, accessories, equipment and papers are readily available to use at various City locations.  The existing contract expires July 31, 2024.\n                      \nThese companies are not debarred according to the Excluded Parties listing of the Federal Government and are not listed in the Auditor of States database for Findings for Recovery.\n \nFISCAL IMPACT: The expenditure of $3.00 is hereby authorized from General Budget Reservation BRPO002726.  City Agencies will be required to obtain approval to expend from their own appropriations for their estimated annual expenditures.\n \nTitle\n \nTo authorize the Finance and Management Director to enter into a contract for the option to purchase Office Supplies, Accessories and Papers with Friends Service Co. Inc., HiTouch Business Services LLC and Key-4 Supply, Inc. dba Key-4 Cleaning Supplies Inc.; to authorize the expenditure of $3.00; to waive the provisions of competitive bidding; and to declare an emergency. ($3.00)\n \n \nBody\n \nWHEREAS, the Office Supplies, Accessories and Papers UTC will provide for the purchase of office supplies, accessories, equipment and papers are used by all City agencies to maintain daily operations.; and,\n \nWHEREAS, the Purchasing Office advertised and solicited formal bids on April 18, 2024; and\n \nWHEREAS, The Information for Bidders section was not included in the bid proposal.  A waiver is requested to include this information in the contract, as this section was accepted and agreed to by the awarded suppliers.; and\n \nWHEREAS, an emergency exists in the usual daily operation of various City agencies in that it is immediately necessary to authorize the Finance and Management Director to enter into three (3) Universal Term Contracts with Friends Service Co. Inc., HiTouch Business Services LLC and Key-4 Supply, Inc. dba Key-4 Cleaning Supplies Inc. for the option to purchase Office Supplies, Accessories, and Papers that are needed to be readily available to use to  maintain tasks performed in various environments, since the current contract expires July 31, 2024, all for the immediate preservation of the public health, peace, property, safety and welfare; and now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Finance and Management Director is hereby authorized to enter into the following contracts for the option to purchase Office Supplies, Accessories, and Papers in accordance with Request for Quotation RFQ027250 for a term of approximately two (2) years, expiring July 31, 2026, with the option to renew for one (1) additional year, as follows:\n \nFriends Service Co. Inc., Categories 1-3, and Catalogs at discounts specified $1.00\nKey-4 Supply, Inc. dba Key-4 Cleaning Supplies Inc., Categories 1-3, and Catalogs at discounts specified, $1.00\nHiTouch Business Services LLC, Categories 1-3, and Catalogs at discounts specified, $1.00\n \nSECTION 2. This Council finds it is in the best interest of the City of Columbus to waive the relevant provisions of Columbus City Codes Section 329 to permit the aforementioned purchase.\n \nSECTION 3.  That the expenditure of $3.00 is hereby authorized from General Budget Reservation BRPO002726 of this ordinance to pay the cost thereof.\n \nSECTION 4.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5. That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 116,
    "meeting_date": "2024-06-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}