{
  "success": true,
  "vote": {
    "id": 9758,
    "item_number": "SR-9",
    "title": "To amend the 2023 Capital Improvement budget; to authorize the transfer of funds within the Streets and Highways Bond Fund; to appropriate funds within the Federal Transportation Grants Fund; to authorize the Director of the Department of Public Service to enter into contract with Complete General Construction Company for the Intersection - Georgesville Road at Hall Road & Intersection - Bethel Road at Dierker Road projects; to authorize the expenditure of $3,050,557.30 from the Streets and Highways Bond Fund and the Federal Transportation Grants Fund for projects; to repay any unused grant funds at the end of the grant period; and to declare an emergency. ($3,050,557.30)",
    "description": "Explanation\n1.  BACKGROUND\nThis ordinance authorizes the Director of Public Service to enter into contract with Complete General Construction Company for the Intersection ‐ Georgesville Road at Hall Road & Intersection - Bethel Road at Dierker Road projects and to provide payment for construction, construction administration and inspection services.  \n \nThis contract includes the construction of right‐turn lanes on Georgesville Road and Hall Road. Georgesville Road and Hall Road will be resurfaced within the project limits and drainage and storm sewers will be improved. A detention pond will be constructed along with replacing the existing traffic signal with the addition of a Shared‐Use Path (SUP) to the south side of Hall Road. Additionally, the project will consist of existing concrete median removal, shifting of existing signal heads, and the realignment of the left turn lanes on Bethel Road at the intersection of Dierker Road, and other work as may be necessary to complete the contract in accordance with the plans and specifications set forth in the Bid Submittal Documents.\n \nOrdinance 0507-2017 authorized the Director of Public Service, on behalf of the City of Columbus, to submit applications to and execute grant agreements with the Ohio Department of Transportation relative to the Highway Safety Program, accepted and expended awarded grant funds, and issued refunds, if necessary, for the Intersection Improvements - Georgesville Road at Hall Road.\n \nThe estimated Notice to Proceed date is July 15, 2024.  The projects were let together by the Office of Support Services through Vendor Services and Bid Express.  Four bids were received on May 14, 2024, (all majority) and tabulated as follows:   \n      \nCompany Name                                           Bid Amount          City/State           Majority/ODI Certification   \nComplete General Construction Company  $2,652,658.52    Columbus, OH                     Majority\nStrawser Paving Company                                    $2,829,879.14    Columbus, OH                     Majority\nBoss Excavating and Grading, Inc.              $2,932,229.99    Columbus, OH                     Majority\nShelly and Sands, Inc.                                    $2,969,389.39                        Columbus, OH                     Majority\n \nAward is to be made to Complete General Construction Company as the lowest responsive and responsible and best bidder for their bid of $2,652,658.52.  The amount of construction administration and inspection services will be $397,898.78.  The total legislated amount is $3,050,557.30. \n \nSearches in the System for Award Management (Federal) and the Findings for Recovery list (State) produced no findings against Complete General Construction Company.\n \nAs part of their bid Complete General Construction Company has proposed the following subcontractors to work on the project:\n \nCompany Name                                                  City/State                                                               Majority/ODI Certification      \nDecker Construction Company                                          Columbus, Ohio                                                               MAJ                     \nGriffin Pavement Striping, LLC                                          Columbus, Ohio                                                               MAJ                     \nFollow the River Environmental                                          McConnelsville, Ohio                                          MBE                     \nThe Paul Peterson Company                                          Columbus, Ohio                                                               MAJ                     \nJN Graham Trucking, LLC                                          Kingston, Ohio                                                               MBE                     \nKey Cable & Supply Co., Inc.                                          Perrysburg, Ohio                                          MBE                     \n \n2. CONTRACT COMPLIANCE INFORMATION\nThe contract compliance number for Complete General Construction Company is CC006056 and expires 5/10/25.\n \n3. PRE-QUALIFICATION STATUS\nComplete General Construction Company and all proposed subcontractors have met code requirements with respect to pre-qualification, pursuant to relevant sections of Columbus City Code Chapter 329.\n \n4.  FISCAL IMPACT\nA portion of this project is a reimbursable budgeted expense of $1,120,900.00 within the Federal Transportation Grants Fund, Fund 7765.   Grant # G591711 (Georgesville Rd at Hall Rd PID104704). Funds need to be appropriated.\nThe remaining balance of $1,929,657.30 is available within the Streets and Highways Bond Fund, Fund 7704.  Funds are appropriated.  An amendment to the 2023 Capital Improvement Budget and a transfer of cash and appropriation is necessary to align spending with the proper project.\n5. EMERGENCY DESIGNATION\nEmergency action is requested in order to complete needed improvements at the earliest possible time and meet the requirements of the start date for the Highway Safety Improvement Program funding award to avoid penalty and to ensure the safety of the traveling public.\n \nTitle\nTo amend the 2023 Capital Improvement budget; to authorize the transfer of funds within the Streets and Highways Bond Fund; to appropriate funds within the Federal Transportation Grants Fund; to authorize the Director of the Department of Public Service to enter into contract with Complete General Construction Company for the Intersection ‐ Georgesville Road at Hall Road & Intersection - Bethel Road at Dierker Road projects; to authorize the expenditure of $3,050,557.30 from the Streets and Highways Bond Fund and the Federal Transportation Grants Fund for projects; to repay any unused grant funds at the end of the grant period; and to declare an emergency. ($3,050,557.30)\n \nBody\nWHEREAS, the Department of Public Service is engaged in the Intersection ‐ Georgesville Road at Hall Road & Intersection - Bethel Road at Dierker Road project; and  \n \nWHEREAS, the work for this project consists of the construction of right‐turn lanes on Georgesville Road and Hall Road.  Georgesville Road and Hall Road will be resurfaced within the project limits and drainage and storm sewers will be improved. A detention pond will be constructed along with replacing the existing traffic signal with the addition of a Shared‐Use Path (SUP) to the south side of Hall Road. Additionally, the project will consist of existing concrete median removal, shifting of existing signal heads, and the realignment of the left turn lanes on Bethel Road at the intersection of Dierker Road; and other work as may be necessary to complete the contract in accordance with the plans and specifications set forth in the Bid Submittal Documents; and\n \nWHEREAS, Complete General Construction Company will be awarded the contract for the Intersection ‐ Georgesville Road at Hall Road & Intersection - Bethel Road at Dierker Road project; and \n \nWHEREAS, the Department of Public Service requires funding to be available for the Intersection ‐ Georgesville Road at Hall Road & Intersection - Bethel Road at Dierker Road project for construction expense along with construction administration and inspection services; and\n \nWHEREAS, Federal Transportation grant funds will be used to pay for a portion of this project; and\n \nWHEREAS, it is necessary to amend the 2023 Capital Improvement Budget to establish authority within the correct project; and \n \nWHEREAS, it is necessary for Council to authorize a transfer of funds and appropriation within Fund 7704, the Streets and Highways Bond Fund, to establish sufficient cash to pay for the project; and\n \nWHEREAS, funds must be appropriated within Fund 7765, the Federal Transportation Grants Fund; and\n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Public Service in that it is immediately necessary to enter into contract with Complete General Construction Company to ensure the safety of the travelling public, for the immediate preservation of the public health, peace, property, and safety; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the 2023 Capital Improvements Budget authorized by ordinance 1711-2023 be amended as follows to establish  sufficient authority for this project:\n \nFund / Project  / Project Name / Current  / Change /C.I.B. as Amended\n7704 / P530282-100051 / Resurfacing - Resurfacing Projects (Voted 2022 SIT Supported) / $34,550,637.00 / ($731,913.00) / $33,818,724.00\n7704 / P530282-100051 / Resurfacing - Resurfacing Projects (Voted 2019 SIT Supported) / $388,575.00 / ($388,575.00) / $0.00\n \n7704 / P530086-100041 / Intersection Improvements - Georgesville Road at Hall Road (Voted 2022 SIT Supported) / $0.00 / $731,913.00 / $731,913.00 \n7704 / P530086-100041 / Intersection Improvements - Georgesville Road at Hall Road (Voted 2019 SIT Supported) / $500,000.00 / $388,575.00 / $888,575.00 \n \n \nSECTION 2.  That the transfer of $1,120,487.30, or so much thereof as may be needed, is hereby authorized within Fund 7704 (Streets and Highways Bond Fund), from Dept-Div 5911 (Infrastructure Management), Project P530282-100051 (Resurfacing - Resurfacing Projects), Object Class 06 (Capital Outlay) to Dept-Div 5913 (Traffic Management), Project P530086-100041 (Intersection Improvements - Georgesville Road at Hall Road), Object Class 06 (Capital Outlay) between projects per the account codes in the attachment to this ordinance. \n \nSECTION 3. That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2024, the sum of $1,120,900.00 is appropriated in Fund 7765 (Federal Transportation Grants Fund), Dept-Div 5912 (Design and Construction), Project G591711 (Georgesville Rd at Hall Rd PID104704), in Object Class 06 (Capital Outlay) per the account codes in the attachment to this ordinance.\n \nSECTION 4.  That the Director of Public Service be and is hereby authorized to enter into a construction services contract with Complete General Construction Company, 1221 E. Fifth Avenue, Columbus, Ohio 43219 for the Intersection ‐ Georgesville Road at Hall Road & Intersection - Bethel Road at Dierker Road project in the amount of up to $2,652,658.52 in accordance with the specifications and plans on file in the Office of Support Services, which are hereby approved; and to pay for necessary construction administration and inspection costs associated with the project up to a maximum of $397,898.78.\n \nSECTION 5.  That the expenditure of $1,120,900.00, or so much thereof as may be needed, is hereby authorized in Fund 7765 (Federal Transportation Grants Fund), Dept-Div 5912 (Design and Construction), Grant G591711 (Georgesville Rd at Hall Rd PID104704), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 6.  That the expenditure of $1,929,657.30, or so much thereof as may be needed, is hereby authorized in Fund 7704 (Streets and Highways Bond Fund), Dept-Div 5913 (Traffic Management), Project P530086-100041 (Intersection Improvements - Georgesville Road at Hall Road), in Object Class 06 (Capital Outlay) per the accounting codes in the attachment to this ordinance.\n \nSECTION 7.  That funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 8.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 9.  That the City Auditor is hereby authorized to transfer the unencumbered balance in a project account to the unallocated balance account within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies are no longer required for said project.\n \nSECTION 10.  That at the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements.\n \nSECTION 11.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 116,
    "meeting_date": "2024-06-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}