{
  "success": true,
  "vote": {
    "id": 9774,
    "item_number": "SR-25",
    "title": "To amend various sections of Chapter 2331 of the Columbus City Codes to enhance the ability of the Community Relations Commission to protect individuals from discrimination that may occur within the City of Columbus.",
    "description": "Explanation\nBACKGROUND\nThe Community Relations Commission, established under the Department of Neighborhoods, helps eliminate discrimination or remove the effects of past discrimination in the City of Columbus. The Commission accomplishes this through the work and input of 15 appointed Commissioners who, per Columbus City Code, are responsive to the diversity represented by the various racial, religious, national, cultural and ethnic groups in Columbus. \nThe proposed amendments to Chapter 2331 transition the Commission to an advisory body, ensure alignment with federal law regarding bona fide occupational qualifications when necessary, and include administrative best practices as advised by the Columbus City Attorney’s office. \nAs a body that can make a final administrative decision, there currently exists limitations on who is eligible to serve as a Commissioner of the Community Relations Commission. By transitioning to an advisory body that makes recommendations to the Director of the Department of Neighborhoods, the Commission can better represent the diversity of the city of Columbus through its membership. \nIncorporating Bona Fide Occupational Qualifications (BFOQs) ensure that certain job roles, which inherently require specific characteristics, can be effectively and safely filled. This ensures Columbus City Code is consistent with federal law. All BFOQs must be approved by the Ohio Civil Rights Commission.\nThrough consultation with the City Attorney’s office, several best practices have been identified that create administrative efficiencies through the proposed amendments. These include introducing a fine schedule. \nThe proposed amendments will improve the Commission’s ability to eliminate discrimination or to remove the effects of past discrimination in the City of Columbus.\nFISCAL IMPACT: There is no fiscal impact of this legislation\nTitle\nTo amend various sections of Chapter 2331 of the Columbus City Codes to enhance the ability of the Community Relations Commission to protect individuals from discrimination that may occur within the City of Columbus.   \nBody\nWHEREAS, the Community Relations Commission, supported by the Department of Neighborhoods, is established in Columbus City Code Section 139.01 and has primary responsibility for enforcement of Columbus City Code Sections 2331.01 through 2331.05, and\nWHEREAS, recent Commissioner recruitment highlighted the need to transition the Community Relations Commission into an advisory body, and\nWHEREAS, the proposed amendments align with federal law regarding bona fide occupational qualifications, and\nWHEREAS, the proposed amendments promote administrative efficiency, and\nWHEREAS, the proposed amendments to further protect individuals from discrimination that may occur within the City of Columbus were identified through conversation with the members of the Community Relations Commission and a detailed legal review by the City Attorney’s Office, and  \nWHEREAS, the Department of Neighborhoods recommends this proposed code change to Columbus City Council for adoption; NOW, THEREFORE,\nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSection 1: That section 2331.01 of the Columbus City Codes is hereby amended to read as follows:\n2331.01 Definitions.\n(A)                     As used in Chapter 2331 of the Columbus City Codes: \n(1) \"Person\" includes one (1) or more individuals, partnerships, associations, organizations, corporations, legal representatives, trustees, trustees in bankruptcy, receivers, and other organized groups of persons. It also includes, but is not limited to, any owner, lessor, assignor, builder, manager, broker, salesman, agent, employee, lending institution; and the city of Columbus, and all political subdivisions, authorities, agencies, boards and commissions thereof. \n(2) \"Employer\" means any person who employs four (4) or more persons, within the City of Columbus, including the city of Columbus, its departments, boards, commissions, and authorities. \n(3) \"Employee\" does not include any individual employed in the domestic service of any person. \n(4) \"Labor organization\" includes any organization which exists for the purpose, in whole or in part, of collective bargaining or of dealing with employers concerning grievances, terms or conditions of employment, or for other mutual aid or protection in relation to employment. \n(5) \"Employment agency\" means any persons regularly undertaking with or without compensation, to procure opportunities for employment or to procure, recruit, refer, or place employees. \n(6) \"Discriminate and discrimination\" includes segregate or separate and any difference in treatment based on race, sex, sexual orientation, gender identity or expression, color, religion, ancestry, national origin, age, disability, familial status or military status. \n(7) \"Unlawful discriminatory practice\" means any act prohibited by Title 23, Chapter 2331 of the Columbus City Codes. \n(8) \"Place of public accommodation\" means any inn, restaurant, eating house, barbershop, public conveyance by air, land or water, theater, store, or other place for the sale of merchandise, or any other place of public accommodation or amusement where the accommodation, advantages, facilities, or privileges thereof are available to the public, or a private club which has more than two hundred (200) members, provides regular meal service and regularly receives payment for dues, fees, use of space, facilities, services, meals or beverages directly or indirectly from or on behalf of nonmembers for the furtherance of trade or business. \n(9) \"Housing accommodations\" includes any building or structure or portion thereof which is used or occupied or is intended, arranged, or designed to be used or occupied as a home residence or sleeping place of one (1) or more individuals, groups or families, whether or not living independently of each other; and any vacant land offered for sale or lease. \nIt also includes any housing accommodations held or offered for sale or rent by a real estate broker, salesperson, or agent, or by any other person pursuant to authorization of the owner, by the owner, or by such person's legal representative. \n(10) \"Restrictive covenant\" means any specification in a deed, land contract or lease limiting the use of any housing because of race, sex, sexual orientation, gender identity or expression, color, religion, ancestry, national origin, age, disability, familial status or military status or any limitation based upon affiliation with or approval by any person, directly or indirectly, employing race, sex, sexual orientation, gender identity or expression, color, religion, ancestry, national origin, age, disability, familial status or military status as a condition of affiliation or approval. \n(11) \"Burial lot\" means any lot for the burial of deceased persons within any public burial ground or cemetery, including but not limited to, cemeteries owned and operated by the City of Columbus or companies or associations incorporated for cemetery purposes. \n(12) \"Sexual orientation\" means a person's actual or perceived homosexuality; bisexuality; or heterosexuality. \n(13) \"Racial profiling\" means to stop, detain, investigate, search, seize or arrest an individual based on the racial or ethnic status of such individual except when based upon a physical description of a suspect in a criminal or traffic offense. The use of race or ethnicity as a factor for determining the existence of reasonable suspicion and/or probable cause in the absence of actual physical evidence or observations linking that individual to a crime constitutes a violation of Section 2331.07 of this chapter. \n(14) \"Age\" means at least forty (40) years old. \n(15)\"Disability\" means a physical or mental impairment that substantially limits one (1) or more major life activities, including the functions of caring for one's self, performing manual tasks, walking, seeing, hearing, speaking, breathing, learning, and working; a record of a physical or mental impairment; or being regarded as having a physical or mental impairment. \n(16) (a) \"Except as provided in division (b) of this subsection, \"physical or mental impairment\" includes any of the following: \n(i) Any physiological disorder or condition, cosmetic disfigurement, or anatomical loss affecting one (1) or more of the following body systems: neurological; musculoskeletal; special sense organs; respiratory, including speech organs; cardiovascular; reproductive; digestive; genitor-urinary; hemic and lymphatic; skin; and endocrine; \n(ii) Any mental or psychological disorder, including, but not limited to, intellectual disability, organic brain syndrome, emotional or mental illness, and specific learning disabilities; \n(iii) Diseases, blood disorders and conditions, including, but not limited to, orthopedic, visual, speech, and hearing impairments, cerebral palsy, autism, epilepsy, muscular dystrophy, multiple sclerosis, cancer, heart disease, diabetes, sickle cell, human immunodeficiency virus infection, intellectual disability, emotional illness, drug addiction, and alcoholism. \n(b)  \"Physical or mental impairment\" does not include any of the following: \n(i) Pedophilia, exhibitionism, voyeurism, or other sexual behavior disorders; \n(ii) Compulsive gambling, kleptomania, or pyromania; \n(iii)  Psychoactive substance use disorders resulting from current illegal use of a controlled substance. \n(17) \"Sex\" means male, female, neither, or both. The terms \"because of sex\" and \"on the basis of sex\" include but are not limited to pregnancy, any illness arising out of pregnancy, childbirth, or related medical conditions, breastfeeding or pumping, or other sexual or reproductive health decisions. \n(a)   For the purposes of this section the term \"sexual or reproductive health decisions\" means decisions relating to the use or intended use of products or services for contraception, sterilization, fertility treatment, pregnancy or its termination, hormone therapy including that which alters gender expression or affirms gender identity, or medical treatments that affirm gender identity. Nothing in this division shall be construed to require an employer to provide health insurance benefits for sexual or reproductive health products or services. \n(18) \"Gender identity or expression\" means having or being perceived as having gender-related identity, appearance, expression, or behavior, whether or not that identity, appearance, expression, or behavior is different from that traditionally associated with the person's actual or perceived sex. \n(19) \"Familial status\" means either of the following: \n(i)  One (1) or more individuals who are under eighteen (18) years of age and who are domiciled with a parent or guardian having legal custody of the individual or domiciled, with the written permission of the parent or guardian having legal custody, with a designee of the parent or guardian; \n(ii)  Any person who is pregnant or in the process of securing legal custody of any individual who is under eighteen (18) years of age. \n(iii) \"Family\" includes a single individual. \n(20) \"Military status\" means a person's status in \"service in the uniformed services\" as defined in Section 5923.05 of the Ohio Revised Code. \n(21) \"Service in the uniformed services\" means the performance of duty, on a voluntary or involuntary basis, in a uniformed service, under competent authority, and includes active duty, active duty for training, initial active duty for training, inactive duty for training, full-time national guard duty, and performance of duty or training by a member of the Ohio organized militia pursuant to Chapter 5923. of the Revised Code. \"Service in the uniformed services\" includes also the period of time for which a person is absent from a position of public or private employment for the purpose of an examination to determine the fitness of the person to perform any duty described in this division. \n(22)\"Uniformed services\" means the Armed Forces, the Ohio organized militia when engaged in active duty for training, inactive duty training, or full-time national guard duty, the commissioned corps of the public health service, and any other category of persons designated by the president of the United States in time of war or emergency. \n(23)  \"Race\" is inclusive of traits historically associated with race, including, but not limited to, hair textures and protective and cultural hairstyles. \n(24) \"Protective and cultural hairstyles\" includes, but is not limited to, such hairstyles as braids, locs, cornrows, bantu knots, afros, and twists, whether or not hair extensions or treatments are used to create or maintain any such style, and whether or not hair is adorned by hair ornaments, beads, or headwraps. \n(25)   “Director” means the Director of the Department of Neighborhoods or their designee.\n(26)   “Investigator” means an employee of the Department of Neighborhoods tasked by the Director with the investigation of complaints pursuant to this Chapter and all associated administrative duties.\n(B)                     Nothing in Columbus City Code Sections 2331.01-2331.04 shall be construed to bar any religious or denominational institution or organization or any organization operated for charitable or educational purposes, which is operated, supervised or controlled by or in connection with a religious organization, from limiting employment or sales or rentals of housing accommodations or admission to or giving preference to persons of the same religion or denomination or from engaging in the free exercise of religion. \n(Ord. 2535-94; Ord. 1475 § 1 (part); Ord. 1865-2008 § 2 (part); Ord. No. 0935-2011, § 1, 7-13-2011; Ord. No. 2880-2020 , § 1, 12-14-2020; Ord. No. 1212-2021 , § 3, 5-24-2021; Ord. No. 2019-2021 , § 1, 7-26-2021)\n \nSection 2: That section 2331.03 of the Columbus City Codes is hereby amended to read as follows:\n2331.03 Unlawful employment practices.\n(A)                     It shall be an unlawful discriminatory practice, except where based upon applicable national security regulations established by the United States: \n(1)                     For any employer, because of the race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status to refuse to hire that person or otherwise to discriminate against that person with respect to hire, tenure, terms, conditions, or privileges of employment, or any matter directly or indirectly related to employment; \n(2)                     For any employer, employment agency, or labor organization to establish, announce or follow a policy of denying or limiting, the employment or membership opportunities of any person or group of persons because of race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status. \n(3)                     For any employer, labor organization, or joint labor-management committee controlling apprentice training programs to discriminate against any person because of that person's race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status in admission to employment in any program established to provide apprentice training; \n(4)                     For any employer, employment agency, or labor organization to publish or circulate, or to cause to be published or circulated, any notice or advertisement relating to employment or membership which indicates any preference, limitation, specifications or discrimination based upon race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status; \n(5)                     For any person seeking employment to publish or to cause to be published any advertisement which specifies or in any manner indicates that person's race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status or expresses a limitation or preference as to the race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status of any prospective employer; \n(6)                     For any employment agency to refuse or fail to accept, register, classify properly, or refer for employment or otherwise to discriminate against any person because of race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status; \n(7)                     For any employer, employment agency, or labor organization to utilize in the recruitment or hiring of persons, any employment agency, placement service, labor organization, training school or center, or any other employee-referring source, known to discriminate against persons because of race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status; \n(8)                     For any labor organization to discriminate against any person or limit that person's employment opportunities, or otherwise adversely affect that person's status as an employee, or that person's wages, hours, or employment conditions, because of race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status; \n(9)                     For an employment agency, to comply with, accommodate, or otherwise assist with locating an employee related to, a request from an employer for referral of applicants for employment if the request indicates, directly or indirectly, that the employer fails, or may fail, to comply with Title 23, Chapter 2331, of the Columbus City Codes; \n(10)                     For any labor organization to limit or classify its membership on the basis of race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status; \n(11)                     For any employer, employment agency or labor organization to: \n(a)                     Elicit or attempt to elicit any information concerning the race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status of an applicant for employment or membership; \n(b)                     Use any form of application for employment or personnel or membership blank seeking to elicit information regarding race, sex, sexual orientation, gender identity or expression, color, religion, national origin, ancestry, age, disability, familial status or military status but an employer holding a contract containing a non-discrimination clause with the government of the United States or any department or agency thereof, may require an employee or applicant for employment to furnish documentary proof of United States citizenship and may retain such proof in the employer's personnel records and may use photographic or fingerprint identification for security purposes. \n(12)                     For any employer, employment agency or labor organization to discriminate against any person because that person has opposed any practice forbidden by Title 23, Chapter 2331, of the Columbus City Codes, or because that person has made a complaint or testified or assisted in any manner in any investigation or proceeding under Title 23, Chapter 2331, of the Columbus City Codes. \n(13)                     For any person, whether or not an employer, employment agency or labor organization, to aid, incite, compel, coerce, or participate in the doing of any act declared to be unlawful discriminatory practice by Title 23, Chapter 2331, of the Columbus City Codes, or to obstruct or prevent any person from enforcing or complying with the provisions of this chapter, or to attempt directly or indirectly to commit any act declared by this chapter, to be an unlawful discriminatory practice. \n(B)                     Consistent with federal law, 42 U.S. Code §2000e-2(e), and Ohio Revised Code §4112.02(E), it shall not be an unlawful employment practice under division (A) of this Section to make employment decisions based on religion, sex, or national origin in those instances where religion, sex, or national origin is a bona fide occupational qualification reasonably necessary to the normal operation of that particular business or enterprise. Such bona fide occupational qualification exception will only apply when certified by the Ohio Civil Rights Commission in advance of an employment related decision based on religion, sex, or national origin. \n \n(C)                     Whoever recklessly violates this section is guilty of unlawful employment practices, a misdemeanor of the first degree.  \n(Ord. 2535-94; Ord. 1865-2008 § 2 (part); Ord. No. 1212-2021 , § 5, 5-24-2021)\nSection 3: That section 2331.05 of the Columbus City Codes is hereby amended to read as follows:\n2331.05 Complaint procedure.\n(A)                     Whenever it is alleged in a complaint, in writing, by a person or aggrieved organization, hereinafter referredenced to as \"complainant,\" that any person, employer, employment agency, or labor organization, hereinafter referred to as the \"respondent,\" has engaged in or is engaging in any unlawful discriminatory practices as defined in Title 23, Chapter 2331 and Chapter 2335 of the Columbus City Codes, or upon the investigator’s own initiative, in matters relating to such discriminatory practices, the investigator community relations commission staff may initiate an preliminary investigation. Such complaint shall be filed with the investigator community relations commission within six (6) months after the alleged unlawful discriminatory practices are committed. \n                     (1)                      If the investigator receives a complaint that is incomplete or describes practices not defined in Title 23, Chapter 2331 and Chapter 2335 of the Columbus City Codes, the complaint will not be accepted. The person filing the complaint will be notified and no further action will be taken. \n(B)                     After investigation, the investigator may do any of the following:\n(1)                     If the community relations commission staff determines after such investigation, that there is no reasonable basis to believe that unlawful discriminatory practices have been or are being engaged in, staff may recommend to the community relations commission that the complaint be dismissed and closed. If the commission approves, staff shall notify the complainant that it has so determined, and the complaint will be dismissed. \n(2)                     If the community relations commission staff determines, after such investigation, that there is a reasonable basis to believe that unlawful discriminatory practices have been or are being engaged in, they shall endeavor to eliminate such practices by informal methods of conference, conciliation, and persuasion. \n(a)                     If after such investigation and conference the community relations commission staff the investigator is satisfied that any unlawful discriminatory practice of the respondent has been or will be eliminated,  the investigator staff may recommend to the community relations commission that it treat the complaint as be deemed conciliated and closed. If the commission agrees, staff shall notify the complainant that the complaint will be dismissed. \n(b)                     If the community relations commission staff the investigator fails to effect the elimination of such unlawful discriminatory practices or to obtain conciliation of the matter, or, if the circumstances warrant, in advance of or during any such preliminary investigation or endeavors to conciliate the matter, the investigator  may recommend to the community relations commission thatmay refer the complaint be referred to the City Prosecutor to evaluate for criminal prosecution. This subdivision shall not apply to complaints filed under Chapter 2335. \n(c)                     If the community relations commission staff the investigator fails to effect the elimination of such unlawful discriminatory practices or to obtain conciliation of the matter and no referral to the City Prosecutor to evaluate for criminal prosecution is then pending,the investigatormay recommend to the community relations commission that a notice of violation and imposition of a civil penalty be served upon the respondent. may direct staff to issue and cause to be served upon the respondent a notice of a finding of administrative violation and imposition of civil penalty. The notice shall notify the respondent of the right to request an administrative hearing before a hearing officer appointed by the community relations commission to contest the finding of administrative violation. Failure to request an administrative hearing within fifteen (15) days of receipt of the notice of violation shall constitute a waiver of the right to a hearing. \n(C)                     Upon receiving a recommendation from the investigator, the community relations commission may accept or reject the recommendation. The Director shall then be notified in writing of the commission’s decision. \n(D)                     Upon being notified in writing, the Director may accept or reject the recommendation of the community relations commission and issue a decision. Such decision shall be reduced to writing and the Director shall notify the investigator of their decision.\n(E)                     Upon receiving notification of the Director’s decision, the investigator may do any of the following:\n                     (1) close the complaint and notify the complainant of the decision,\n                     (2) if the Director rejects the recommendation of the community relations commission, consult with the Director and/or the commission to determine what further action, if any, needs to be taken on the complaint, and complete any additional investigation and/or processing of the complaint as directed,\n                     (3) notify the City Prosecutor’s Office of the Director’s decision to refer the complaint for evaluation for potential criminal prosecution, or\n                     (4) issue a notice of violation and imposition of civil penalty to the respondent.\n                                          (a) said notice shall inform the respondent of the right to appeal before a hearing officer appointed by the                      Department of Neighborhoods and that failure to request an appeal within fifteen (15) calendar days of                      receipt of the notice shall constitute a waiver of the right to appeal and shall be considered an admission                      of violation and a default finding of civil liability shall be imposed for the amount assessed. \n(F)                     Respondent may appeal a decision of the Director by submitting a written notice of appeal  to the investigator including  the name, address, and telephone number of the respondent, the date of the written notice of appeal, and a statement of intent to appeal. The investigator shall schedule an appeal hearing within thirty (30) calendar days of receipt of a written notice of appeal. The hearing officer may grant continuances as deemed necessary. \n                                          (1) the Director or designee  shall appoint the hearing officer and schedule the date, time and location of the appeal hearing. Notice of the appeal hearing shall be sent timely to the respondent. The investigator shall maintain a record of the hearing consistent with the Department’s records retention schedule. The record may be made by stenographic means or by the use of an audio electronic recording device. \n \n(BG)                     If a hearing officer is appointed, the hearing officer shall have the authority to: \n(1)                     Conduct a administrative hearing applying a preponderance of the evidence standard and administer an oath to anyone who will testify; \n(2)                     Provide to all the parties, witnesses, and the Community Relations Commission timely notice of the hearing date, time, and location; \n(3)                     Direct the exchange of discovery; \n(4)                     Set, change as necessary, and timely communicate to the parties such reasonable procedural rules as the hearing officer shall deem appropriate including: \n(a)                     The Department of Neighborhoods A member of the Community Relations Commission staff shall have the burden of going forward with the presentation of evidence. All parties shall have the right to appear and be heard in person, or by legal counsel, to present their case. \n(b)                     All parties shall have the right to: offer and examine witnesses and present evidence in support of their case; cross examine adverse witnesses; and proffer evidence into the record if its admission has been denied. \n(c)                     Testimony shall be given under oath. \n(cd)                     The hearing officer shall mMake rulingsrecommendations on all matters of evidence. In so doing, the hearing officer is not strictly bound by the rules of evidence. The hearing officer may ask questions of any witness at any point in the proceedings and may set time and other limitations for each side in the presentation of evidence. A record of proceedings shall be kept. Parties seeking a stenographic record shall acquire such stenographic record at their own expense. \n(5)                     Except as otherwise prescribed by law, the hearing officer shall submit, within seven (7) business days from the hearing date, to the investigator and the respondent,Community Relations Commission a written report setting forth the hearing officer's findings of fact and conclusions of law with final determination of the matter. and a recommendation of the action to be taken by the Commission. \n(a)                     If the Hearing Officer finds, by a preponderance of the evidence, that respondent did engage in, or continues to engage in, an unlawful discriminatory act or practice under this chapter as noticed in the finding of administrative violation, the Hearing Officer's report shall so indicate by recommending that the finding of violation be upheld. \n(b)                     If the Hearing Officer finds that the evidence presented failed to support the finding of violation, the Hearing Officer's report shall so indicate by recommending that the finding of administrative violation be overturned and the complaint dismissed. \n(ac)                     The writtenfinal report of the Hearing Officer may not include any orders for reinstatement of employment, refund of monies paid, other mitigation of damages, or any other orders for corrections or sanctions, except as provided in this section. \n(b)                     The written report containing a determination of the matter shall be considered a final appealable order and may be appealed pursuant to the provisions of R.C. Chapter 2506.\n(6)                     A copy of the Hearing Officer's written report and recommendation shall, within five (5) days of being submitted to the investigator, the date of filing thereof, be served upon the respondent or respondent's attorney, by certified mail. The respondent may, within ten days of receipt of the copy of the written report or recommendation, file with the Community Relations Commission written objections to the report and recommendation, which objections shall be considered by the Community Relations Commission before approving, modifying, or disapproving the recommendation. The Community Relations Commission may grant extensions of time to the respondent within which to file such objections. No recommendation of the Hearing Officer shall be approved, modified, or disapproved by the Community Relations Commission until ten days after the service of the report and recommendation as provided in this section. The Community Relations Commission may order additional testimony to be taken or permit the introduction of further documentary evidence. \nSee attached for remainder of text file",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 116,
    "meeting_date": "2024-06-24",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "ABSENT"
      }
    ],
    "topics": [
      "General"
    ]
  }
}