{
  "success": true,
  "vote": {
    "id": 9797,
    "item_number": "CA-17",
    "title": "To authorize the Director of the Department of Public Service to execute those documents necessary to release a portion of an un-named easement east of May Avenue to allow for the property to clear title so the site can be redeveloped.",
    "description": "Explanation\n \n1.                     Background\n \nIn 2022, pursuant to Ordinance 3261-2022 the City of Columbus transferred a portion of right-of-way known as an un-named alley running mostly north/south, east of May Avenue. This 15.5 foot Alley was transferred to The Gravity Project 3 Holdings, LLC by instrument number 202212200170933 and the City of Columbus reserved a utility easement for existing utilities. \n \nThe Department of Public Service recently received a request from the property owner, The Gravity Project 3 Holdings, LLC, asking that the City release the reserved easement over these areas to clear title so the site can be redeveloped. After receipt of this request the Department of Public Service Division of Infrastructure Management verified with all public and private utility companies that there are no public utilities or need for this easement, located within the requested area and that they have no objections to this portion of easement being released. \n \nThe following legislation authorizes the Director of the Department of Public Service to execute those documents necessary to release the portion of easement as described below and attached exhibit, to allow for the property to clear title so the site can be redeveloped.\n2.                     Fiscal Impact\nThe City will receive a total of $500.00, to be deposited in Fund 7748, Project P537650, for granting the request to release the easement.\nTitle\nTo authorize the Director of the Department of Public Service to execute those documents necessary to release a portion of an un-named easement east of May Avenue to allow for the property to clear title so the site can be redeveloped. \n \nBody\n \nWHEREAS, in 2022, pursuant to Ordinance 3261-2022 the City of Columbus transferred a portion of right-of-way known as an un-named alley running mostly north/south, east of May Avenue, this 15.5 foot Alley was transferred to The Gravity Project 3 Holdings, LLC by instrument number 202212200170933 and the City of Columbus reserved a utility easement for existing utilities; and \n \nWHEREAS, the Department of Public Service recently received a request from the property owner, The Gravity Project 3 Holdings, LLC, asking that the City release the reserved easement over these areas to clear title so the site can be redeveloped; and\n \nWHEREAS, the Department of Public Service Division of Infrastructure Management verified with all public and private utility companies that there are no public utilities or need for this easement, located within the requested area and that they have no objections to this portion of easement being released; and\n \nWHEREAS, a value of $500.00 was established; and\n \nWHEREAS, to authorizes the Director of the Department of Public Service to execute those documents necessary to release the portion of easement as described below and attached exhibit, to allow for the property to clear title so the site can be redeveloped; and \n \nNOW, THEREFORE; \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  To authorize the Director of the Department of Public Service to execute those documents necessary to release the portion of easement as described below and attached exhibit, to allow for the property to clear title so the site can be redeveloped: \n \nEasement Areas to be released:\n0.155 ACRE\nSituated in the State of Ohio, County of Franklin, City of Columbus, being located in Virginia Military Survey Number 1393, being part of a 15.5-foot wide unnamed alley, as dedicated in F.C. Sessions Western Addition to the City of Columbus, Ohio (herein referenced as “F.C. Sessions Western Addition”), recorded in Plat Book 2, Page 242, all records referenced herein are on file at the Office of the Recorder for Franklin County, Ohio, being all of that 0.0058 acre right-of-way parcel described in a deed to City of Columbus, Ohio, of record in Instrument Number 200302260056409, and being further bounded and described as follows: Commencing for reference at the intersection of the south right-of-way line for Broad Street (95-foot R/W width) and the east right-of-way line for May Avenue (40-foot R/W width; FKA Mead Street), being the northwest corner of Lot 5 of said F.C. Sessions Western Addition, and being the northwest corner of that tract of land described as Parcel I in a deed to FTON Property Partners OZ II LLC, of record in Instrument Number 202110070180736 (reference a MAG nail found bearing North 14 degrees 25 minutes 51 seconds East at a distance of 0.27 feet); Thence South 08 degrees 07 minutes 09 seconds East, along the east right-of-way line for said May Avenue, along the west line of said Lot 5, and along the west line of said Parcel I, a distance of 125.87 feet to the southwest corner of said Lot 5, being the southwest corner of said Parcel I, and being the northwest most corner of said 15.5-foot unnamed alley (reference a MAG nail found bearing North 31 degrees 27 minutes 57 seconds East at a distance of 0.15 feet), said point being the TRUE POINT OF BEGINNING for this description; Thence North 81 degrees 48 minutes 41 seconds East, along the north line of said 15.5-foot unnamed alley, along the south line of said Lot 5, along the south lines of Lot 4 and Lot 3 of said F.C. Sessions Western Addition, along the south line of said Parcel I, and along the south line of that tract of land described as Tract VII (Parcel II) in a deed to FTON Property Partners OZ I LLC, of record in Instrument Number 202110120184383, a distance of 105.98 feet to a MAG nail set at the northwest corner of that tract of land described as Tract VIII in said deed to FTON Property Partners OZ I LLC; Thence South 08 degrees 07 minutes 09 seconds East, along the east line of said 15.5-foot unnamed alley, along the west line of said Tract VIII, along the west lines of Lots 61 through 71, inclusive, of said F.C. Sessions Western Addition, along the west lines of those tracts of land described as Parcel I (Tract VI), Tract VII (Parcel III), Tract IX, Parcel I (Tracts I and II), Parcel I (Tracts III and IV), Parcel I (Tract V), and Tract X in said deed to FTON Property Partners OZ I LLC, (passing a 3/4-inch iron pipe found at a distance of 220.07 feet), a total distance of 320.30 feet to a MAG nail set at the southwest corner of said Parcel I (Tract V), being the southwest corner of said Tract X, and being the northwest corner of that tract of land described as Parcel III in a deed to McDowell Place Homes, LLC, of record in Instrument Number 202207290110354; Thence South 81 degrees 48 minutes 41 seconds West, across said 15.5-foot unnamed alley, along a westerly extension of the south lines of said Parcel I (Tract V) and Tract X, a distance of 15.98 feet to a MAG nail set on the west line of said 15.5-foot unnamed alley, on the east line of Lot 55 of said F.C. Sessions Western Addition, being the east line of that tract of land described in a deed to FTON Property Partners OZ III LLC, of record in Instrument Number 202203210044829; Thence North 08 degrees 07 minutes 09 seconds West, along the west line of said 15.5-foot unnamed alley, along the east line of said Lot 55, along the east lines of Lots 54 through 44, inclusive, of said F.C. Sessions Western Addition, along the east line of said FTON Property Partners OZ III LLC tract, and along the east lines of those tracts of land described as Parcel III and Parcel II in said deed to FTON Property Partners OZ II LLC, a distance of 269.76 feet to a MAG nail set at a point of curvature, said point being the south corner of said 0.0058 acre right-of-way parcel;\nThence along the arc of a curve to the left, along a southwesterly line of said 0.0058 acre right-of-way parcel, along the northeasterly line of said Parcel II, and across said Lot 44 and Lot 43 of said F.C. Sessions Western Addition, said curve having a radius of 35.00 feet, a delta angle of 90 degrees 04 minutes 11 seconds, and an arc length of 55.02 feet to a MAG nail set at a point of tangency, said MAG nail being the west corner of said 0.0058 acre right-of-way parcel, and being on the south line of said 15.5-foot unnamed alley, the north line of said Parcel II, and the north line of said Lot 43, said curve being subtended by a long chord having a bearing of North 53 degrees 09 minutes 14 seconds West and a length of 49.53 feet; Thence South 82 degrees 08 minutes 50 seconds West, along a south line of said 15.5-foot unnamed alley, along the north line of said Lot 43, and along the north line of said Parcel II, a distance of 54.96 feet to a MAG nail set at a southwest corner of said 15.5-foot unnamed alley, being the northwest corner of said Lot 43, being the northwest corner of said Parcel II, and being on the east right-of-way line for said May Avenue; Thence North 08 degrees 07 minutes 09 seconds West, along the western extent of said 15.5-foot unnamed alley, along the east right-of-way line for said May Avenue, a distance of 15.18 feet to the TRUE POINT OF BEGINNING for this description.\nThe above description contains a total area of 0.155 acres, all of which is located within the dedicated right-of-way for said 15.5-foot unnamed alley and said 0.0058 acre right-of-way parcel, and being adjacent to Franklin County Auditor’s parcel numbers 010-021196, 010-057684, 010-000899, and 010-050085. Bearings described hereon are based on North 08 degrees 07 minutes 09 seconds West for the existing centerline of right-of-way for May Avenue (40' R/W width), as measured from Grid North, referenced to the Ohio State Plane Coordinate System (South Zone) and the North American Datum of 1983 (2011 Adjustment), as established utilizing a GPS survey and an NGS OPUS solution.\nThis description was prepared under the direct supervision of Brian P. Bingham, Registered Professional Surveyor No. 8438, is based on an actual field survey performed by American Structurepoint. Inc., and is true and correct to the best of my knowledge and belief.\nSECTION 2.                     That the City Attorney is required to approve all instrument(s) associated with this ordinance prior to the director of the Department of Public Service executing and acknowledging any of those instrument(s) and that this ordinance shall take effect and be in force from and after the earliest period allowed by law.\nSECTION 3.    That the City will receive a total of $500.00 as cost to clear title to the site, to be deposited in Fund 7748, Project P537650.\n \nSECTION 4.    That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 117,
    "meeting_date": "2024-07-01",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Property & Real Estate",
      "Public Works"
    ]
  }
}