{
  "success": true,
  "vote": {
    "id": 9799,
    "item_number": "CA-19",
    "title": "To amend Ordinance 0464-2023, passed February 3, 2023, to revise encroachment easement measurements to legally allow a canopy to remain within the public right-of-way along Lane Avenue. ($0.00)",
    "description": "Explanation\n \nBACKGROUND:  This Ordinance will amend ordinance 0464-2023, passed February 3, 2023, to correct encroachment easement measurements to legally allow items to remain within the public right-of-way.  The encroachment items are one canopy into Lane Avenue and a portion of the building area extending into an alley approximately 20 feet above street level.  The corrected encroachment measurements are located within an updated description of the easement as described below and within the attached exhibits. Allowing these elements to extend into the public right-of-way will allow the building to fit into the architectural desire.\n \nOrdinance 1364-2023 authorizes an amendment to Ordinance No. 0464-2023 to correct the property owner name listed in the original ordinance.  The owner name listed in Ordinance 0464-2023 is “LV Collective” when it should have been “Lane and Norwich Columbus Owner, LLC”.  The legislation was amended to allow execution of valid agreements with the correct property owner.\n \nFISCAL IMPACT: No funding is required by this legislation.\n \nTitle\n \nTo amend Ordinance 0464-2023, passed February 3, 2023, to revise encroachment easement measurements to legally allow a canopy to remain within the public right-of-way along Lane Avenue. ($0.00) \n \n \nBody\n \nWHEREAS, the City of Columbus, Department of Public Service, received a request from Lane and Norwich Columbus Owner, LLC, asking that the City allow awning and building encroachments to remain within the public right-of-way.  These encroachments consist of one canopy into Lane Avenue and building area extending into an alley approximately 20 feet above street level.; and\n \nWHEREAS, on February 3, 2023 Columbus City Council passed Ordinance 0464-2023 authorizing the Director of Public Service to grant encroachments to legally allow an awning and building encroachments to remain within the public right-of-way; and\n \nWHEREAS, it is necessary to amend Ordinance 0464-2023 to reflect the changes in the measurements of the defined encroachment; and\n \nWHEREAS, on June 28, 2023 Columbus City Council passed Ordinance 1364-2023 to amend the property owner’s name from “LV Collective” when it should have been “Lane and Norwich Columbus Owner, LLC”; and\n \nWHEREAS, the following legislation authorizes the Director of the Department of Public Service to execute those documents necessary for the City to grant these encroachments to legally allow this item to remain within the public rights-of-way. Allowing this element to remain will retain the historical canopy/awning and meet the architectural desire; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That Section 1 of Ordinance 0464-2023, passed February 3, 2023, is hereby amended to revise the encroachment easement measurements to allow a canopy to remain with the public right of way as follows, with additions in underline and deletions in strikethrough:\n \nSECTION 1.  Authorizes the Director of the Department of Public Service to execute those documents necessary for the City to grant these encroachments to legally allow them to extend into the public rights-of-way. Allowing these elements to extend into the public right-of-way will allow the building to fit into the architectural desire; to-wit:\n \n3 Dimensional Encroachment Easement\nFROM 768.19’ (NAVD 88) TO 836.75’ (NAVD 88)\n0.0005 ACRE\n \nSituated in the State of Ohio, County of Franklin, in the City of Columbus, and being in Quarter Township 3, Township 1, Range 18, United States Military Lands, being part of Lot 15 of C.E. Justice’s Northern Heights Addition, of record in Plat Book 7, Page 372, also being part of a 0.085 acre tract as conveyed to the City of Columbus, Ohio for right-of-way purposes in Instrument Number 202208240122148, all records being of the Recorder’s Office, Franklin County, Ohio, and being more particularly described as follows:\nThis description has a vertical component. The intent of this description is to include an area from an elevation 1 foot below the bottom of a building overhang up to an elevation 5 feet above the building parapet. The bottom of the area is 768.19 feet (NAVD88) and the top is 836.75 feet (NAVD 88). The elevations given go along with the horizontal metes and bounds described below, creating an extruded block of air-space.\nCOMMENCING at the northeasterly corner of said 0.085 acre tract, being on the southerly right-of-way line of Norwich Avenue (50’);\nThence along the easterly line of said 0.085 acre tract, South 03°19’58” West, 4.89 feet to a point, said point being the TRUE POINT OF BEGINNING:\nThence along the easterly line of said 0.085 acre tract, South 03°19’58” West, 40.97 feet to a point, being from elevation 768.19 (NAVD 88) to 836.75 (NAVD88);\nThence across said 0.085 acre tract, the following three (3) courses:\nNorth 86°40’02” West, 0.50 feet to a point, being from elevation 768.19 (NAVD 88) to 836.75 (NAVD88);\nNorth 03°19’58” East, 40.97 feet to a point, being from elevation 768.19 (NAVD 88) to 836.75 (NAVD88);\nSouth 86°40’02” East, 0.50 feet to a point, being from elevation 768.19 (NAVD 88) to 836.75 (NAVD88), said point being the POINT OF TRUE BEGINNING, containing 0.0005 acres (20 S.F.), more or less.\nSubject however to all legal easements and restrictions of record in the respective utility offices.\n \nThe bearings referenced herein are based on the Ohio State Plan Coordinate System, South Zone, NAD83 (2011) being the southerly line of Norwich Avenue, bearing South 86°11’07” East. The bearing originated from a field traverse which was referenced to said coordinate system by GPS observations and observations of selected station in the Ohio Department of Transportation Virtual Reference Station Network. \nThe elevations are based on the North American Vertical Datum of 1988 (NAVD 88, Geoid 12A). Elevations were established using GPS observations of select control points utilizing the Ohio Department of Transportation’s Virtual Reference Station and transferred to the site via bench circuit. All other elevations were calculated from proposed dimension and the established elevations from local benchmarks.\n \nThis description was prepared on January 20, 2023 by Matthew Lee Sloat, Ohio Registered Professional Surveyor 8342, of E.P. Ferris and Associates, Inc. based on field work from February 2020 through June 2020.\n3 Dimensional Encroachment Easement\nFROM 756.27’ (NAVD 88) TO 836.75’ (NAVD 88)\n0.003 ACRE\n \nSituated in the State of Ohio, County of Franklin, in the City of Columbus, and being in Quarter Township 3, Township 1, Range 18, United States Military Lands, being part of Lots 5 through 7 of R.P. Woodruff’s Subdivision of the East End of Lot No. 26 of Sidney L Chaffee’s Northwood Place, of record in Plat Book 2, Page 284, being part of a 0.086 acre tract as conveyed to the City of Columbus, Ohio in Instrument Number 202210070141858, being within the right-of-way of Lane Avenue (varies), being in the right-of-way of Norwich Avenue (50’ Wide) as delineated in C.E. Justice’s Northern Heights Addition, of record in Plat Book 7, Page 372, all records being of the Recorder’s Office, Franklin County, Ohio, and being more particularly described as follows:\n \nThis description has a vertical component. The intent of this description is to include an area from an elevation 1 5 foot below the bottom of a building overhang up to an elevation 5 feet above the building parapet. The bottom of the area is 756.27 feet (NAVD88) and the top is 836.75 feet (NAVD 88). finished grade at the bottom of a retaining wall up to an elevation 1 foot above top of the wall. The bottom of the area is 742.25 feet (NAVD88) and the top is 751.00 feet (NAVD 88). The elevations given go along with the horizontal metes and bounds described below, creating an extruded block of air-space.\n \nCOMMENCING at the northeasterly corner of said 0.086 acre tract, being on the northerly right-of-way line of said Lane Avenue;\nBEGINNING at the northwesterly corner of a 0.085 acre tract as conveyed for right-of-way purposes to the City of Columbus, Ohio in Instrument Number 202208240122148, also being on the northeasterly corner of a tract conveyed to Ithica I, L.L.C., also being on the southerly right-of-way line of said Norwich Avenue;\n \nThence along the northerly line of said 0.086 acre tract and said Lane Avenue, North 86°18’55” West, 30.97 feet to a point, said point being the TRUE POINT OF BEGINNING:\nThence across said Norwich Avenue right-of-way, the following four (4) courses:\n \n \nThence across said 0.086 acre tract and said Lane Avenue, the following three (3) courses:\nSouth 03°31’29” West, 2.43 feet to a point, being from elevation 756.27 (NAVD 88) to 836.75 (NAVD88);\nNorth 86°28’31” West, 60.50 feet to a point, being from elevation 756.27 (NAVD 88) to 836.75 (NAVD88);\nNorth 03°31’29” East, 2.30 feet to a point, being on the northerly line of said 0.086 acre tract and said Lane Avenue, being from elevation 756.27 (NAVD 88) to 836.75 (NAVD88);\nThence along the northerly line of said 0.086 acre tract and said Lane Avenue, the following two (2) courses:\nAlong a curve to the right having a radius of 5779.58 feet, a delta angle of 00°34’47”, an arc length of 58.47 feet, and a chord bearing and distance of South 86°36’18” East, 58.47 feet to a point of tangency, being from elevation 756.27 (NAVD 88) to 836.75 (NAVD88);\nSouth 86°18’55” East, 2.03 feet to a point, being from elevation 756.27 (NAVD 88) to 836.75 (NAVD88), said point being the POINT OF TRUE BEGINNING, containing 0.003 acres (146 S.F.), more or less.\nNorth 03°19’58” East, 6.00 feet to a point, being from elevation 742.25 (NAVD 88) to 751.00 (NAVD88);\nSouth 86°11’07” East, 2.50 feet to a point, being from elevation 742.25 (NAVD 88) to 751.00 (NAVD88);\nSouth 03°19’58” West, 6.00 feet to a point on the northerly line of said 0.085 acre tract, being from elevation 742.25 (NAVD 88) to 751.00 (NAVD88);\nNorth 86°11’07” West, 2.50 feet to a point, being from elevation 742.25 (NAVD 88) to 751.00 (NAVD88), said point being the POINT OF TRUE BEGINNING, containing 0.0003 acres (15 S.F.), more or less.\nSubject however to all legal easements and restrictions of record in the respective utility offices.\n \nThe bearings referenced herein are based on the Ohio State Plan Coordinate System, South Zone, NAD83 (2011) being the southerly line of Norwich Avenue, bearing South 86°11’07” East. The bearing originated from a field traverse which was referenced to said coordinate system by GPS observations and observations of selected station in the Ohio Department of Transportation Virtual Reference Station Network. as determined by ODOT RTN observations, with the southerly right-of-way line of Norwich Avenue bearing South 86°11’07” East. \nThe elevations are based on the North American Vertical Datum of 1988 (NAVD 88, Geoid 12A). Elevations were established using GPS observations of select control points utilizing the Ohio Department of Transportation’s Virtual Reference Station and transferred to the site via bench circuit. All other elevations were calculated from proposed dimension and the established elevations from local benchmarks.\n \nThis description was prepared on January 20, 2023 April 19, 2024 by Matthew Lee Sloat, Ohio Registered Professional Surveyor 8342, of E.P. Ferris and Associates, Inc. based on field work from February 2020 through June 2020.\n \nSECTION 2.  That existing Section 1 of Ordinance No. 0464-2023 is hereby repealed.\n \nSECTION 3.  That the City Attorney is required to approve all instrument(s) associated with this ordinance prior to the director of the Department of Public Service executing and acknowledging any of those instrument(s).  \n \nSECTION 4.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 117,
    "meeting_date": "2024-07-01",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Property & Real Estate"
    ]
  }
}