{
  "success": true,
  "vote": {
    "id": 9808,
    "item_number": "CA-28",
    "title": "To authorize appropriation and expenditure of up to $270,201.00 of HOME Investment Partnerships Program (HOME) entitlement 2023 grant from the U.S. Department of Housing and Urban Development; to authorize the Director of the Department of Development to enter into a commitment letter, loan agreement, promissory note, mortgage, restrictive covenant;  and to authorize the city to act as a lender for this project with the Homes on the Hill Community Development Organization to construct a single family home. ($270,201.00).",
    "description": "Explanation\n \nBACKGROUND:  This legislation authorizes the appropriation and expenditure of up to $270,201.00 of  the 2023 HOME Investment Partnerships Program (HOME) entitlement grant (CHDO Set-a-side) from the U.S. Department of Housing and Urban Development (HUD) and authorizes the Director of the Department of Development enter into a commitment letter, loan agreement, promissory note, mortgage, and restrictive covenant, as well as authorizes the city to act as a lender for this project with Homes on the Hill Community Development Corporation. The project is to develop and construct a single family housing unit at 120 N. Eureka Ave., which was recently purchased from the City of Columbus Land Bank.\n \nThe funding of this project will address the need for affordable housing in the City of Columbus for low-income families that are at or below 80% of the Area Median Income limits set by HUD.  This project will add decent, safe and sanitary housing to the Hilltop Neighborhood, located in the Greater Hilltop Area of Columbus.  The increased availability of safe and stable housing in Columbus promotes the health and well-being of the neighborhood and the citizens living in the neighborhood. \nWe are funding this project with the Homes on the Hill Community Development Corporation, who is a Community Housing Development Organization (CHDO) in partnership with the City of Columbus.  Homes on the Hill will use HOME CHDO set-aside funds to develop the 120 N. Eureka Avenue project on land purchased from the Land Bank. \nHomes on the Hill Community Development Organization was founded in 1993 with the mission to be the exemplary housing counseling and development organization in Central Ohio.\n \nWith the construction of a new, single-family home at 120 N. Eureka Avenue, the Homes on the Hill Community Development Organization is investing in and providing affordable housing to the Hilltop neighborhood.  The two-story, single family home will consist of three bedrooms, two and a half bathrooms, a basement, a garage, and will be built to City AWARE standards.  The home will be sold to a first-time homebuyer earning at or below 80% of the Area Median Income as defined by HUD.  \n \nThis legislation represents appropriation for a part of the HOME portion of the 2023 Action Plan per ordinance 3353-2022. \n \nContract Compliance:  the vendor number is 005144 and expires 08/04/2024.\n \nFiscal Impact: $270,201.00 is available from the 2023 HOME grant (G442202) using HOME CHDO Set-aside funds.  \n \n \nTitle\n \nTo authorize appropriation and expenditure of up to $270,201.00 of HOME Investment Partnerships Program (HOME) entitlement 2023 grant from the U.S. Department of Housing and Urban Development; to authorize the Director of the Department of Development to enter into a commitment letter, loan agreement, promissory note, mortgage, restrictive covenant;  and to authorize the city to act as a lender for this project with the Homes on the Hill Community Development Organization to construct a single family home. ($270,201.00).\n \n \nBody\n \nWHEREAS, the City of Columbus is a participating jurisdiction of the U.S. Department of Housing and Urban Development; and\n \nWHEREAS, the City of Columbus is the recipient of HOME Investment Partnerships funds from the U.S. Department of Housing and Urban Development; and\n \nWHEREAS, the Columbus City Council has approved the 2023 Action Plan per ordinance 3353-2022; and\n \nWHEREAS, the Department of Development desires to support the Homes on the Hill Community Development Organization with financial support for a single family home at 120 N. Eureka Avenue; and\nNOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That from the unappropriated monies and from all monies estimated to come into said fund from any and all sources and unappropriated for any other purpose during the fiscal year ended December 31, 2024, the sum of $270,201.00 is appropriated in Fund 2201 (HOME), from Dept-Div 44-10 (Housing), G442202 (2023 HOME grant), object class 05 (Other Expenses) per the account codes in the attachment to this ordinance.\n \nSECTION 2.  That the expenditure of $270,201.00 or so much thereof as may be needed, is hereby authorized in Fund 2201 (HOME), from Dept-Div 44-10 (Housing), G442202 (2023 HOME grant), object class 05 (Other Expenses) per the account codes in the attachment to this ordinance.\n \nSECTION 3.  That the Director of Development is hereby authorized to execute a commitment letter and loan agreement and authorizes the city to act as a lender and have a promissory note, mortgage, and restrictive convent executed for this project with Homes on the Hill Community Development Organization to construct a single family home at 120 N. Eureka Avenue.                     \n \nSECTION 4.  That funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary.\n                                          \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance.\n \nSECTION 6.  That at the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements.\n \nSECTION 7.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 117,
    "meeting_date": "2024-07-01",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Grants"
    ]
  }
}