{
  "success": true,
  "vote": {
    "id": 9849,
    "item_number": "SR-17",
    "title": "This ordinance amends Title 11, Chapters 1145 Sewer Use Regulations and 1147 Sewer Charges, of the Columbus City Codes to allow for the use of mass-based local limits and to provide additional methods to determine the organic strength of wastewater.",
    "description": "Explanation\n \nThis ordinance amends Title 11, Chapters 1145 Sewer Use Regulations and 1147 Sewer Charges, of the Columbus City Codes to allow for the use of mass-based local limits and to provide additional methods to determine the organic strength of wastewater. These proposed amendments work in coordination with a new Director’s Rule, which establishes new local limits for the Department of Public Utilities, Division of Sewerage and Drainage in accordance with Columbus City Codes Chapters 1145.23 and 1145.11. The new Director’s Rule will replace obsolete Director’s Rule 2018-03.\n \nLast year, the Division of Sewerage and Drainage completed the local limits technical justification as required by both of its wastewater treatment plants’ National Pollutant Discharges Elimination System permits. The process included collection of data for pollutants of concern, identification of limiting criteria, development of maximum allowable headworks loadings, and allocation of available pollutant loadings to industry. \n \nThe Division of Sewerage and Drainage submitted the technical justification, including the proposal to use of mass-based limits in addition to the existing use of concentration-based limits, to Ohio EPA for approval in December 2023. The ability to implement mass-based limits provides the Industrial Pretreatment Program with more flexibility to achieve compliance and to protect the wastewater treatment plants.\n \nIn accordance with Ohio Administrative Code 3745-3-03(F), Ohio EPA issued a public notice of the proposed local limits as a substantial program modification on March 6, 2024. The public comment period ended on April 12, 2024. On April 15, 2024 Ohio EPA issued approval letters for the local limits program modification.\n \nIn coordination with its effort to update the local limits in Chapters 1145 and 1147 of the Columbus City Codes, the Division of Sewerage and Drainage is updating those Chapters to allow the use of additional methods to determine the organic strength of wastewater. The Division of Sewerage and Drainage completed a 6-month Biochemical Oxygen Demand / Chemical Oxygen Demand / Total Organic Carbon correlation study in late 2023. The results of the study established that a Chemical Oxygen Demand of 450 mg/L and a Total Organic Carbon of 145 mg/L correlates to 250mg/L Biochemical Oxygen Demand, which is the established organic extra strength threshold. \n \nThe addition of Chemical Oxygen Demand and Total Organic Carbon as methods to determine the organic strength of wastewater along with Biochemical Oxygen Demand does not create a new charge - extra strength Industrial Users will be billed according to sampling results on only one of the three methods (Biochemical Oxygen Demand or Chemical Oxygen Demand or Total Organic Carbon). This flexibility will allow Division of Sewerage and Drainage labs to operate more efficiently as Chemical Oxygen Demand and Total Organic Carbon tests are less labor intensive than the Biochemical Oxygen Demand test, and results are obtained more quickly.\n \nAdditionally, the proposed changes to the Columbus City Codes include general housekeeping updates to achieve consistency in the definitions used in Columbus City Codes Chapters 1145 and 1147. \n \nThe Division of Sewerage and Drainage submitted proposed modifications of its sewer use ordinance, Chapter 1145 of the Columbus City Codes, to Ohio EPA on April 2, 2024 for review and approval. Ohio EPA determined that the proposed changes to Chapter 1145 were non-substantial based on Ohio Administrative Code 3745-3-03(E). On April 9, 2024, Ohio EPA issued approval letters for proposed changes to Chapter 1145.  \n \nTitle\n \nThis ordinance amends Title 11, Chapters 1145 Sewer Use Regulations and 1147 Sewer Charges, of the Columbus City Codes to allow for the use of mass-based local limits and to provide additional methods to determine the organic strength of wastewater. \n \nBody\n \nWHEREAS, pursuant to 40 CFR 403, U.S. EPA requires that each publicly owned treatment works develop a state approved pretreatment program and develop and enforce local limits for industrial users to protect against pass through and interference which may be caused by industrial discharges to the treatment facilities; and \n \nWHEREAS, the City of Columbus, Department of Public Utilities, Division of Sewerage and Drainage has an Ohio EPA approved pretreatment program and developed local limits that now need to be modified to allow for the use of mass-based limits in addition to the existing use of concentration-based limits; and\n \nWHEREAS, Ohio EPA issued public notice of the proposed modifications to the local limits from March 6, 2024 through April 12, 2024; and \n \nWHEREAS, Ohio EPA approved the local limits program modification on April 15, 2024; and\n \nWHEREAS, these modified local limits must be made effective by August 15, 2024 pursuant to the National Pollutant Discharges Elimination System permit terms of the City of Columbus, Department of Public Utilities, Division of Sewerage and Drainage; and \n \nWHEREAS, it is necessary to amend sections of Chapters 1145 and 1147 of the Columbus City Codes; and \n \nWHEREAS, Ohio EPA approved the revisions to the City’s sewer use ordinance, which is Chapter 1145 of the Columbus City Codes, on April 9, 2024; and\n \nWHEREAS, it is necessary to amend City Code Section 1145.02.006 to modify the definition of “Biochemical Oxygen Demand” to allow use of carbonaceous Biochemical Oxygen Demand, which is consistent with NPDES permit requirements; and\n \nWHEREAS, it is necessary to amend City Code Section 1145.02(E) to modify the definitions of “extra strength” and “standard strength” to allow options to utilize Biochemical Oxygen Demand, Chemical Oxygen Demand, or Total Organic Carbon, to determine the organic strength of wastewater, based on DOSD’s correlation study results; and \n \nWHEREAS, it is necessary to amend City Code Section 1145.20 by adding the hydrocarbon FOG limit from the local limits list, which is consistent with pH and temperature restrictions in the Chapter; and\n \nWHEREAS, it is necessary to amend City Code Section 1145.23 by deleting 1145.23(E), which restricted the use of mass limits for industrial users, to allow the use of mass limits for industrial users; and \n \nWHEREAS, it is necessary to amend City Code Section 1145.50 to provide for electronic submittals for IPP required reports by industrial users, to lessen the burden of compliance reporting; and\n \nWHEREAS, it is necessary to amend City Code Section 1145.55 to enhance notification requirements for Significant Industrial Users for changed conditions related to the nature and volume of wastewater, to protect the POTW related to the considerable industrial growth in the region; and  \n \nWHEREAS, it is necessary to amend City Code Section 1147.01 to reference City Code Chapter 1145 definitions for the following terms: “Biochemical Oxygen Demand,” “Chemical Oxygen Demand,” “Standard Strength,” “Total Suspended Solids,” “Total Organic Carbon,” “Industrial Wastewater,” and “Total Kjeldahl Nitrogen,” for consistency; and  \n \nWHEREAS, it is necessary to amend City Code Section 1147.01 to modify the definition of “Domestic Waste” to include Chemical Oxygen Demand and Total Organic Carbon; and\n \nWHEREAS, it is necessary to amend City Code Section 1147.01 to add a definition of “Significant Industrial User;” and\n \nWHEREAS, it is necessary to amend City Code Chapter 1147 to replace the term “industrial waste” with “industrial wastewater” across the Chapter, for accuracy and consistency; and\n \nWHEREAS, it is necessary to amend City Code Section 1147.07(b)(1) to allow options to utilize Biochemical Oxygen Demand, Chemical Oxygen Demand, or Total Organic Carbon to determine the organic strength of wastewater, to reflect the amendments made to City Code Chapter 1145; and\n \nWHEREAS, it is necessary to amend City Code Section 1147.07(b)(2) by adding a reference to City Code Section 1145.55 regarding notification requirements for changes to wastewater nature volume or quantity; and\n \nWHEREAS, it is necessary to amend City Code Sections 1147.08(a) and (b) to include options to use Chemical Oxygen Demand and Total Organic Carbon to determine extra strength in addition to already existing option to use Biochemical Oxygen Demand; and\n \nWHEREAS, it is necessary to amend City Code Section 1147.11 to include options to calculate extra strength surcharges for Chemical Oxygen Demand and Total Organic Carbon in the rate schedule charts; and\n \nWHEREAS, it is necessary to update the Director’s Rules and Regulations to reflect updated local limits and the revisions to Chapters 1145 and 1147 of the Columbus City Codes, the Division of Sewerage and Drainage will publish a new Director’s Rule which will replace the obsolete Director’s Rule 2018-03 regarding local limits; and\n \nWHEREAS, it has become necessary in the usual daily operation of the Department of Public Utilities to amend the various sections listed above for the public health, safety and welfare; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That Sections 1145.02, 1145.02.006, 1145.20, 1145.23, 1145.50, and 1145.55 are hereby amended as follows: \nSEE ATTACHMENT - CHAPTER 1145.\n \nSECTION 2. That Sections 1147.01, 1147.47.07, 1147.08, and 1147.11 are hereby amended as follows:\nSEE ATTACHMENT - CHAPTER 1147.\n \nSECTION 3.  That this ordinance shall take effect and be in force from and after the earliest period allowed by law.",
    "outcome": "PASS",
    "ayes": 8,
    "noes": 0,
    "abstain": 0,
    "absent": 1,
    "meeting_id": 117,
    "meeting_date": "2024-07-01",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Health & Safety",
      "Infrastructure",
      "Public Works"
    ]
  }
}