{
  "success": true,
  "vote": {
    "id": 9852,
    "item_number": "0",
    "title": "To enact Chapter 4517 of the Columbus City Codes to create a Vacant Building Registry.",
    "description": "Explanation\n \nBACKGROUND: This legislation enacts Chapter 4517 of the Columbus City Codes to create a Vacant Building Registry.  \nVacant properties pose a danger to the public health, safety and welfare. Several studies have demonstrated that vacant residential properties can quickly become blighted and abandoned properties. Locating the person in control of the property or responsible for the care and maintenance of the property is often an impossible task. Accordingly, citations for property maintenance are routinely ignored at these properties, placing properties at increased risk for becoming unsecured, vandalized, and hazardous.\nThe proliferation of these vacant properties has caused blight to flourish, providing havens for criminal activity; destroying the safety of neighborhoods; posing dangerous risks to the city’s firefighters, police officers, and code enforcement officials; depleting already scarce city resources; diminishing property values throughout the city; undermining the city’s ability to enforce its criminal laws; and interfering with the city’s duty to protect its citizens from unsafe and harmful conditions.\nThe purpose of this chapter is to ensure that vacant properties are protected and maintained and that city officials are alerted to the location of these vulnerable properties. This chapter is enacted in order to address the problem of blighted properties that are a direct result of vacant properties and that pose a threat to the public health, safety, and welfare.\nFISCAL IMPACT: No Impact\n \nTitle\n \nTo enact Chapter 4517 of the Columbus City Codes to create a Vacant Building Registry.  \n \nBody\n \nWHEREAS, vacant properties pose a danger to the public health, safety and welfare; and\n \nWHEREAS, locating the person in control of the property or responsible for the care and maintenance of the property is often an impossible task; and \n \nWHEREAS,  the proliferation of these vacant properties has caused blight to flourish, providing havens for criminal activity; destroying the safety of neighborhoods; posing dangerous risks to the city’s firefighters, police officers, and code enforcement officials; depleting already scarce city resources; diminishing property values throughout the city; undermining the city’s ability to enforce its criminal laws; and interfering with the city’s duty to protect its citizens from unsafe and harmful conditions; and\n \nWHEREAS, it is important to ensure that vacant properties are protected and maintained and that city officials are alerted to the location of these vulnerable properties; NOW, THEREFORE,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.                     That Chapter 4517 of the Columbus City Codes be enacted to read as follows:\n \nChapter 4517 REGISTRY OF VACANT BUILDINGS \n \n4517.01 Registry of Vacant Buildings.\nThere is hereby created in the Department a Registry of Vacant Buildings. This registry shall be available for public inspection during regular business hours of the Department. The Director is authorized to promulgate rules and regulations related to the operation and enforcement of the Registry of Vacant Buildings.\n \n4517.02 Definitions.\nA. “Property Owner” as used in this Chapter means the owner of record of real property situated in the City of Columbus as shown on the current tax list of the auditor of Franklin, Delaware, Pickaway, Licking, or Fairfield County, Ohio, excluding properties owned by a municipal corporation or other governmental entity.\nB. “Vacant Building” as used in this Chapter means a dwelling or dwelling unit as defined in section 3303.04 which is not being occupied as a home, residence, or sleeping place for one or more persons under a lease, rental agreement or permission of the owner.\n \n4517.03 Vacant buildings to be registered.\nA. A Property Owner of a Vacant Building shall register the Vacant Building on a form or in the manner approved by the Department for inclusion in the Registry of Vacant Buildings. The Property Owner shall pay the designated registration fee within sixty (60) days of the following:  receipt of a notice of vacancy from a code enforcement officer, becoming vacant, or the effective date of this ordinance, whichever comes first. This provision shall not apply to the following:\n1. Vacant Buildings that are the subject of an active Probate case;\n2. Vacant Buildings that are the subject of an insurance claim that renders the building uninhabitable. \n3. Vacant Buildings that the Property Owner is actively seeking to have occupied as demonstrated by acts such as listing the property for sale or lease;\n4. Vacant Buildings that are the subject of a valid permit issued pursuant to City Code Chapter 598 - Hotel/Motel and Short-term rental operations;\n5. Vacant Buildings that have active building permits on file with the Department issued pursuant to City Code Chapter 4113. \n6. Vacant Buildings that are owned by a local, regional, or State Land Bank.\n7. An accessory structure as defined in Chapter 4501.\nB.  If any Property Owner has an appeal pending before the Property Maintenance Appeals Board pertaining to an alleged code violation associated with a Vacant Building, the Property Owner is not required to register that Vacant Building until a dispositive ruling has been issued by the Board. \nC.  A Property Owner may petition to have a Vacant Building removed from the Registry of Vacant Buildings by providing documentation to the Department that clearly demonstrates the presence of a building occupant or establishes some regular commercial use of the building. Such documentation may include copies of current utility bills and an executed lease or sales contract. \n \n4517.05 Vacant Building Property Owner's affidavit.\nA. A Property Owner who is required to register a Vacant Building in the Registry of Vacant Buildings shall submit for filing, on a form or in the manner approved by the Department, an affidavit in which the Property Owner affirms as true the following information: \n1. The legal name of the Property Owner(s) of the Parcel and/or Building;\n2. Parcel number(s) and Vacant Building address;\n3. Contact information for the Property Owner(s), including:\na. A current mailing address where mail may be sent that will be acknowledged as received by the Property Owner. If certified mail/return receipt requested is sent to the address and the mail is returned marked \"refused\" or \"unclaimed,\" or if ordinary mail sent to the address is returned for whatever reason, then such occurrence shall be prima facie evidence that the Property Owner has failed to comply with this requirement;\nb. A telephone or cellular phone number; and\nc. An electronic mail address.\n4. The name of an individual responsible for the care and control of the Vacant Building. Such individual may be the Property Owner, if the Property Owner is an individual. \n5. The contact information for the individual responsible for the care and control of the Vacant Building, including:\na. A current mailing address where mail may be sent that will be acknowledged as received by the individual responsible for the care and control of the Vacant Building. If certified mail/return receipt requested is sent to the address and the mail is returned marked \"refused\" or \"unclaimed,\" or if ordinary mail sent to the address is returned for whatever reason, then such occurrence shall be prima facie evidence that the Property Owner has failed to comply with this requirement. \nb. A telephone or cellular phone number; and\nc. An electronic mail address.\n6. Proof of liability insurance in the amount of the Appraised Value of the Vacant Building as determined by the most recent appraisal by the County Auditor as shown on the current tax list of the auditor of Franklin, Delaware, Pickaway, Licking, or Fairfield County, Ohio.\n7. Signed Agent Authorization Form to allow the Columbus Division of Police to trespass all persons impermissibly on the premises. \n8. Signed waiver to allow for an annual exterior inspection of the property, including entering onto the property to examine all exterior structures.\n9. A current picture of the Vacant Building.\nB. Each year on the anniversary of the initial filing, the Property Owner(s) shall re-register the Vacant Building and pay fees if the building remains vacant. \n \n4517.07 Vacant Building registration fee.\nA. At the time of registration and annually thereafter, the Property Owner shall pay a non-refundable registration fee, as set forth in the fee schedule pursuant to City Code Section 4103.14, for each Vacant Building. The fees shall be reasonably related to:\n1. The administrative costs for registering and processing the registry form;\n2. Costs incurred by the City in monitoring the Vacant Building;\n3. Costs incurred by the City for hazard abatement, pursuant to Chapter 4709, for the Vacant Building;\n4. Any other related purposes as set forth in this Chapter. \nB. At the time of initial registration or upon registration renewal, a Property Owner can submit a request for relief from registration fees to the Property Maintenance Appeals Board. If the Property Owner is able to demonstrate significant financial hardships, the Property Maintenance Appeals Board may waive the Property Owner’s registration fee requirement. \n \n4517.09 Requirement to keep Vacant Building in compliance and information current.\nA. Vacant Buildings must be kept in compliance with all city code requirements.\nB. If at any time the information contained in the affidavit on file is no longer current, the Property Owner must file, within twenty (20) calendar days after the information becomes outdated, a new affidavit listing current information. \nC. If the Vacant Building is sold or transferred, the new Property Owner shall be subject to all the terms of this Chapter including, but not limited to, the annual registration fee. The previous Property Owner will not be released from the responsibility of paying any unpaid fees, fines, or penalties accrued during that Property Owner’s involvement with the Vacant Building.\n \n4517.10 - Severability.\nThe provisions of this Chapter shall be deemed severable; and, if any such provision shall be held unconstitutional by a court of competent jurisdiction the decision of such court shall not impair any of the remaining provisions.\n \n4517.99 - Violations.\nA. It shall be unlawful for any Property Owner to fail to comply with the requirements of this Chapter. \nB. If the Director determines that a Property Owner has failed to comply with the requirements of this Chapter, a Notice of Violation shall be issued in accordance with Chapter 4509.  Failure to comply with the Notice of Violation by the date specified therein shall subject the Property Owner to penalties as set forth in Section 4517.995. The Notice of Violation shall state the date on which the assessment of civil penalties may commence. \nC. Appeals. If the Director issues a Notice of Violation, the Property Owner may appeal to the Property Maintenance Appeals Board, pursuant to Chapter 4509. \n \n4517.995 - Civil penalty; effect of appeal.\nA. In addition to any other remedy or penalty provided in this Housing Code or the Ohio Revised Code, a Property Owner who fails to comply with a Notice of Violation issued pursuant to this Chapter by the date specified in the notice may incur a civil penalty of one hundred-fifty dollars ($150.00) for each calendar day thereafter that the Property Owner fails to comply with the orders in the Notice of Violation. \nB. In addition to any other remedy available by law, the Director may file a civil action in the Environmental Division of the Franklin County Municipal Court seeking a court order to recover any accumulated civil penalties.\nC. Upon the Property Owner appealing a Notice of Violation to the Property Maintenance Appeals Board pursuant to Chapter 4509, any enforcement action seeking compliance with the ordered abatement, including the collection of civil penalties pursuant to this section, shall be stayed until the Property Maintenance Appeals Board issues its decision on the appeal. Civil penalties incurred pursuant to this section shall continue to be assessed during the pendency of any appeal to the Property Maintenance Appeals Board and any subsequent court on appeal, and shall be subject to collection upon a final judgment on the appeal.\n \nSECTION 2.                     That this ordinance shall take effect and be in full force 30 days from and after its passage and approval by the Mayor of the City of Columbus on January 1, 2025.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 118,
    "meeting_date": "2024-07-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "General"
    ]
  }
}