{
  "success": true,
  "vote": {
    "id": 9879,
    "item_number": "CA-18",
    "title": "To authorize the issuance and sale of general obligation bonds in an amount not to exceed $161,000.00 for the Morningstar/North-Forty Street Lighting Assessment Project; to authorize an expenditure of $15,000.00 from the Electricity Operating Fund for costs of issuance; and to declare an emergency. ($176,000.00)\r\n\r\nSection 44-1(b)",
    "description": "Explanation\n1.                     Background\nThis ordinance authorizes the issuance and sale of general obligation bonds (the “Bonds”) in an amount not to exceed $161,000.00 for the purpose of financing the costs of the Morningstar/North-Forty Street Lighting Assessment Project. $161,000.00 bond anticipation notes were issued on February 21, 2024 (the “Outstanding Notes”), and the proceeds of the Bonds will retire the Outstanding Notes. The Bonds will be sold to the City's Treasury and Investment Board.\n \n2.                     Fiscal Impact\nBonds in an amount not to exceed $161,000.00 will be issued. It is the intent that the debt service associated with the issuance of such Bonds will be paid from special assessments levied and collected from the property owners benefiting from the Morningstar/North-Forty Street Lighting Assessment Project.\n \n3.                     Emergency Designation\nEmergency action is requested to allow for immediate issuance of bonds in order to retire the Outstanding Notes prior to maturity.\n \nTitle\nTo authorize the issuance and sale of general obligation bonds in an amount not to exceed $161,000.00 for the Morningstar/North-Forty Street Lighting Assessment Project; to authorize an expenditure of $15,000.00 from the Electricity Operating Fund for costs of issuance; and to declare an emergency. ($176,000.00)\n \nSection 44-1(b)\n \nBody\nWHEREAS, pursuant to Ordinance No. 2997-2022 adopted November 21, 2022, City Council (the “Council”) of the City of Columbus, Ohio (the “City”), has previously determined to proceed with the street lighting project described below in accordance with Resolution No. 0014X-2019 adopted by this Council on February 4, 2019; and \nWHEREAS, Council has issued notes dated February 21, 2024, in the aggregate principal amount of $161,000.00 (the “Outstanding Notes”); and\nWHEREAS, the City Auditor has certified to this Council that the estimated life of the improvements to be constructed from the proceeds of the bonds and the notes hereinafter referred to exceeds five (5) years, the maximum maturity of bonds being ten (10) years; and\nWHEREAS, an emergency exists in the usual daily operations of the City Auditor’s Office in that it is immediately necessary to authorize the issuance of bonds in an amount not to exceed $161,000.00 in order to provide for the payment of a portion of the principal and interest on the Outstanding Notes prior to maturity for the immediate preservation of the public peace, property, health or safety; NOW, THEREFORE, \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\nSection 1.                                          That it is hereby declared necessary to issue bonds of the City of Columbus, Ohio (the “City”) in a principal sum not to exceed $161,000.00 (the “Bonds”) in anticipation of the levy and collection of special assessments for the purpose of providing funds to pay the costs of installing a light-emitting diode (LED) street lighting system with decorative poles and underground wiring for the Morningstar/North-Forty area, including Sullivant Avenue, Round Up Drive, Corral Gate Court, Morningstar Drive, Branding Iron Court, Branding Iron Drive, North Forty Drive, Tricia Drive, Wild Stallion Drive, Old Ranch Court, Magna Carta Circle, Greensdale Drive, Countrie Side Drive, Countrie Glen Drive, and Countrie View Court, by installing poles, fixtures, power cable and conduit, constructing control facilities and doing such other things as may be necessary in the City.\n \nSection 2.                                          That there shall be and is hereby levied annually on all the taxable property in the City, in addition to all other taxes and inside the ten mill limitation, a direct tax (the “Debt Service Levy”) for each year during which any of the Bonds are outstanding, for the purpose of providing, and in an amount which is sufficient to provide, funds to pay interest upon the Bonds as and when the same falls due and to provide a fund for the repayment of the principal of the Bonds at maturity or upon redemption.  The Debt Service Levy shall not be less than the interest and sinking fund tax required by Article XII, Section 11 of the Ohio Constitution.\n \nSection 3.                                          That the Debt Service Levy shall be and is hereby ordered computed, certified, levied and extended upon the tax duplicate and collected by the same officers, in the same manner, and at the same time that taxes for general purposes for each of such years are certified, extended and collected.  The Debt Service Levy shall be placed before and in preference to all other items and for the full amount thereof.  The funds derived from the Debt Service Levy shall be placed in a separate and distinct fund, which shall be irrevocably pledged for the payment of the premium, if any, and interest on and principal of the Bonds when and as the same falls due.  Notwithstanding the foregoing, in each year to the extent that funds from the collection of the special assessments referred to in Section 1 hereof or other sources are lawfully available for the payment of the Bonds, and are appropriated for such purpose, the amount of the Debt Service Levy for such year shall be reduced by the amount of funds which will be so available, and the City shall appropriate such funds to the payment of the Bonds in accordance with law.\n \nSection 4.                                          That the Bonds shall be designated “City of Columbus, Ohio Morningstar/North-Forty Street Lighting Assessment Bonds, Series 2024.”\nSection 5.                                          That the Bonds shall be issued only as fully registered bonds, in the denominations specified in the Certificate of Award or any integral multiple thereof but not exceeding the principal amount of Bonds maturing on any one date; shall be numbered from R-1 upward; shall be dated as set forth in the Certificate of Award; shall bear interest payable semi-annually on the dates specified in the Certificate of Award (the “Interest Payment Dates”), until the principal sum is paid; and shall bear interest at the rates, shall mature, shall be subject to mandatory and optional redemption in the amounts and on the dates, and shall be subject to optional redemption in the years and at the redemption prices, as shall be set forth in the Certificate of Award. \n \nSection 6.                                          That the Bonds shall set forth the purposes for which they are issued and state that they are issued pursuant to this Ordinance and shall be executed by the Mayor and the City Auditor of the City, in their official capacities, provided that any of those signatures may be a facsimile.  No Bond shall be valid or become obligatory for any purpose or shall be entitled to any security or benefit under this Ordinance unless and until a certificate of authentication, as printed on the Bond, is signed by the Bond Registrar (as defined in Section 8 hereof) as authenticating agent.  Authentication by the Bond Registrar shall be conclusive evidence that the Bond so authenticated has been duly issued and delivered under this Ordinance and is entitled to the security and benefit of this Ordinance.  \n \nSection 7.                                          That the principal of and premium, if any, and interest on the Bonds shall be payable in lawful money of the United States of America without deduction for the services of the Bond Registrar as paying agent.  The principal of the Bonds shall be payable upon presentation and surrender of the Bonds at the principal office of the Bond Registrar.  Each Bond shall bear interest from the later of the date thereof, or the most recent Interest Payment Date to which interest has been paid or duly provided for, unless the date of authentication of any Bond is less than 15 days prior to an Interest Payment Date, in which case interest shall accrue from such Interest Payment Date.  Interest on any Bond shall be paid on each Interest Payment Date to the person in whose name the Bond is registered, at the close of business on the 15th day next preceding that Interest Payment Date (the “Record Date”) (unless such date falls on a non-business day, in which case the Record Date shall be the preceding business day), on the Bond Register (as defined in Section 8 hereof).\nAny interest on the Bonds which is payable, but is not punctually paid or provided for, on any Interest Payment Date (herein called “Defaulted Interest”) shall forthwith cease to be payable to the registered owner on the relevant Record Date by virtue of having been such owner and such Defaulted Interest shall be paid to the registered owner in whose name the Bonds are registered at the close of business on a date (the “Special Record Date”) to be fixed by the Bond Registrar, such Special Record Date to be not more than 15 nor less than 10 days prior to the date of proposed payment.  The Bond Registrar shall cause notice of the proposed payment of such Defaulted Interest and the Special Record Date therefor to be mailed, first class postage prepaid, to each registered owner, at his address as it appears in the Bond Register, not less than 10 days prior to such Special Record Date, and may, in its discretion, cause a similar notice to be published once in a newspaper in each place where Bonds are payable, but such publication shall not be a condition precedent to the establishment of such Special Record Date.\nSection 8.                                          That the City Auditor is hereby appointed to act as the authenticating agent, bond registrar, transfer agent and paying agent (collectively, the “Bond Registrar”) for the Bonds.  So long as any of the Bonds remain outstanding, the City will cause to be maintained and kept by the Bond Registrar, at the office of the Bond Registrar, all books and records necessary for the registration, exchange and transfer of Bonds as provided in this Section (the “Bond Register”).  Subject to the provisions of Section 7 hereof, the person in whose name the Bonds shall be registered on the Bond Register shall be regarded as the absolute owner thereof for all purposes.  Payment of or on account of the principal of and premium, if any, and interest on the Bonds shall be made only to or upon the order of that person.  Neither the City nor the Bond Registrar shall be affected by any notice to the contrary, but the registration may be changed as herein provided.  All payments shall be valid and effectual to satisfy and discharge the liability upon the Bonds, including the interest thereon, to the extent of the amount or amounts so paid.\n \nAny Bond, upon presentation and surrender at the principal office of the Bond Registrar, together with a request for exchange signed by the registered owner or by a person authorized by the owner to do so by a power of attorney in a form satisfactory to the Bond Registrar, may be exchanged for Bonds of any authorized denomination or denominations equal in the aggregate to the unmatured principal amount of the Bonds surrendered, and bearing interest at the same rate and maturing on the same date.  \n \nA Bond may be transferred only on the Bond Register upon presentation and surrender thereof at the principal office of the Bond Registrar, together with an assignment executed by the registered owner or by a person authorized by the owner to do so by a power of attorney in a form satisfactory to the Bond Registrar.  Upon that transfer, the Bond Registrar shall complete, authenticate and deliver a new Bond or Bonds of any authorized denomination or denominations equal in the aggregate to the unmatured principal amount of the Bonds surrendered, and bearing interest at the same rate and maturing on the same date.\n \nThe City and the Bond Registrar shall not be required to transfer or exchange any Bond for a period of 15 days next preceding an Interest Payment Date or the date of maturity.\n \nIn all cases in which Bonds are exchanged or transferred hereunder, the City shall cause to be executed and the Bond Registrar shall authenticate and deliver Bonds in accordance with the provisions of this Ordinance.  The exchange or transfer shall be without charge to the owner; except that the City and Bond Registrar may make a charge sufficient to reimburse them for any tax or other governmental charge required to be paid with respect to the exchange or transfer.  The City or the Bond Registrar may require that those charges, if any, be paid before it begins the procedure for the exchange or transfer of the Bonds.  All Bonds issued upon any transfer or exchange shall be the valid obligations of the City, evidencing the same debt, and entitled to the same benefits under this Ordinance, as the Bonds surrendered upon that transfer or exchange.\nSection 9.                                          That the Bonds shall be sold at private sale to the City’s Treasury Investment Board (the “Original Purchaser”).  \n \nThe sale and award of the Bonds shall be evidenced by the execution of a Certificate of Award (the “Certificate of Award”) by the City Auditor and the Director of Finance and Management, or either of them individually, on behalf of the City.  The Certificate of Award shall set forth the aggregate principal amount of the Bonds to be issued, the dated date of the Bonds, the Purchase Price, the Specified Interest Rate, Mandatory Redemption Dates and Mandatory Sinking Fund Requirements (all as hereinafter defined), and shall set forth and determine such additional terms and other matters pertaining to the Bonds, their issuance, sale or delivery, as are authorized and directed to be determined therein by this Ordinance.\n \nAs used in this Section 9 and Section 5 hereof:\n \n“Certificate of Award” means the Certificate of Award authorized by this Section 9 to be executed by the City Auditor or the Director of Finance and Management setting forth and determining such terms and other matters pertaining to the Bonds, their issuance, sale or delivery, as are authorized and directed to be determined therein by this Ordinance.\n \n“Mandatory Redemption Dates” means the dates specified in the Certificate of Award in which the Bonds are to be redeemed pursuant to Mandatory Sinking Fund Requirements.\n \n“Mandatory Sinking Fund Requirements” means, as to the Bonds, amounts sufficient to redeem such Bonds (less the amount of credit, if any, as provided in the Certificate of Award) on each Mandatory Redemption Date, as are to be set forth in the Certificate of Award.\n \n“Purchase Price” means that amount which is to be determined in the Certificate of Award, but such amount is to be no less than 100% of the aggregate principal amount of the Bonds, together with accrued interest on the Bonds from their date to the date of their delivery and payment therefor.\n \n“Specified Interest Rate” means the interest rate at which the Bonds will bear interest, which rate shall be the fair market rate at the time of execution of the Certificate of Award, which Certificate of Award shall state that such rate is the fair market rate for the Bonds.\n                     \nThe Mayor, the Director of Finance and Management, the City Auditor and the Clerk are authorized and directed to make the necessary arrangements on behalf of the City to establish the date, location, procedure and conditions for the delivery of the Bonds to the Original Purchaser.  Those officers are further directed to take all steps necessary to effect due execution, authentication and delivery of the Bonds under the terms of this Ordinance and the Certificate of Award.  Further, such officers are hereby authorized and directed to take such action and to execute and deliver, on behalf of the City, such additional instruments, agreements, certificates, and other documents as may be in their discretion necessary or appropriate in order to carry out the intent of this Ordinance.  Such documents shall be in the form not substantially inconsistent with the terms of this Ordinance, as they in their discretion shall deem necessary or appropriate.\n \nThe proceeds from the sale of the Bonds shall be deposited in the City Treasury and shall be credited to the proper Bond Retirement Fund to be applied to the payment of the principal of and interest on the Outstanding Notes, which shall be redeemed on the date of delivery of the Bonds. \n \nAny accrued interest or premium received from such sale shall be deposited in the City Treasury and shall be credited to the proper Bond Retirement Fund to be applied to the payment of the principal and interest of the Bonds in the manner provided by law.  Said proceeds are hereby appropriated for such purposes.\n \nAll moneys necessary to carry out the purposes of this Ordinance are hereby deemed appropriated for expenditure by the City Auditor.\n \nTo provide for the payment of the costs of issuance of the Bonds, which shall include, but shall not be limited to, the fees and expenses of the City’s bond counsel and the fees and expenses of the City’s municipal advisor, the City Auditor is hereby authorized to expend from the Electricity Operating Fund (Fund - 6300) a sum not to exceed $15,000.00.\nSection 10.                                          That it is hereby found and determined that all formal actions of this Council concerning and relating to the adoption of this Ordinance were adopted in an open meeting of this Council, and that all deliberations of this Council and of any of its committees that resulted in such formal action, were in meetings open to the public, in compliance with all legal requirements including Section 121.22 of the Ohio Revised Code.\n \nSection 11.                                          That it is hereby found and determined that all acts, conditions and things necessary to be done precedent to and in the issuing of the Bonds in order to make the Bonds the legal, valid and binding obligation of the City have happened, been done and been performed in regular and due form as required by law; that the full faith, credit and revenue of the City are hereby irrevocably pledged for the prompt payment of the principal and interest thereof at maturity; and that no limitation of indebtedness or taxation, either statutory or constitutional, has been exceeded in issuing the Bonds.\n \nSection 12.                                          That the Clerk of Council is hereby directed to forward a certified copy of this Ordinance to the County Auditors of Franklin, Fairfield, and Delaware Counties, Ohio.\n \nSection 13.                                          That for the reasons stated in the preamble hereto, which is hereby made a part hereof, and in accordance with Sections 22 and 44-1(b) of the Charter of the City of Columbus, Ohio, this Ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and immediately after its passage and approval by the Mayor, or ten (10) days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 118,
    "meeting_date": "2024-07-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Emergency Services"
    ]
  }
}