{
  "success": true,
  "vote": {
    "id": 9896,
    "item_number": "CA-35",
    "title": "To authorize the Director of the Department of Public Service to apply for grant funding from the Ohio Department of Transportation related to the Federal Highway Administration FHWA State Transportation Innovation Council STIC Incentive grant to fund the purchase of multiple Mobile Road Weather Information Sensors for snow and ice equipment; to execute those documents necessary to accept the grant funds if awarded; to repay any unused grant funds at the end of the grant period; and to declare an emergency.  ($0.00)",
    "description": "Explanation\n1.  BACKGROUND\nThe Department of Public Service is seeking Council approval to accept grant funding from the Ohio Department of Transportation (ODOT) related to the Federal Highway Administration's (FHWA) State Transportation Innovation Council (STIC) Incentive grant program.  The Department of Public Service applied for up to $100,000 of said grant monies to fund the purchase of multiple Mobile Road Weather Information Sensors for snow and ice equipment.  These sensors take different types of readings, including the level of friction and grip in real time during snow and ice events. This provides critical data to allow better decisions on salt and material usage, plowing effectiveness, roadway safety and speed recovery.  This information can be used to save time and material costs, redirecting resources to where they are needed most.\n \nThrough this program, funding up to $100,000 per State per Federal fiscal year is made available to support or offset the costs of standardizing innovative practices in a State transportation agency (STA) or other public sector STIC stakeholder. The program is administered by FHWA’s Center for Accelerating Innovation (CAI).\n \nThis legislation will authorize the Director of Public Service to formally apply for funding from ODOT for the FHWA STIC Incentive program grant funds and, if awarded, to accept the award on behalf of the Department of Public Service, to execute those documents necessary to accept the grant, to administer the grant funds, and to refund any unused funds to ODOT after the grant period ends if final accounting determines a refund is owed.  Separate legislation will be submitted to Council to expend awarded grant funds. \n \n2.  FISCAL IMPACT\nNo financial participation is required at this time. Approval of this legislation will allow the Department of Public Service to apply for a grant award from ODOT relative to the Federal Highway Administration (FHWA) State Transportation Innovation Council (STIC) Incentive program. If the grant is awarded and accepted, a 25% local match would be required.\n \n3.  EMERGENCY DESIGNATION\nEmergency action is requested to allow the Department of Public Service to apply for and accept funds from ODOT in relation to the FHWA STIC Grant Program so purchase of the Mobile Road Weather Information Sensors can be completed before the beginning of the snow and ice season.\n \nTitle\nTo authorize the Director of the Department of Public Service to apply for grant funding from the Ohio Department of Transportation related to the Federal Highway Administration FHWA State Transportation Innovation Council STIC Incentive grant to fund the purchase of multiple Mobile Road Weather Information Sensors for snow and ice equipment; to execute those documents necessary to accept the grant funds if awarded; to repay any unused grant funds at the end of the grant period; and to declare an emergency.  ($0.00)\n \nBody\nWHEREAS, the Ohio Department of Transportation (ODOT) is offering grant funds associated with the Federal Highway Administration (FHWA) State Transportation Innovation Council (STIC) Incentive program; and \n \nWHEREAS, the Department of Public Service intends to apply for grant monies from ODOT related to the FHWA STIC Incentive program to fund the purchase of multiple Mobile Road Weather Information Sensors for snow and ice equipment; and \n \nWHEREAS, it will be necessary to execute documents accepting awarded grant funds; and\n \nWHEREAS, an emergency exists within the Department of Public Service in that it is immediately necessary to authorize the Director of the Department of Public Service to apply for and accept grant monies to meet the timeline for purchase of Mobile Road Weather Information Sensors before the next snow and ice season, for the immediate preservation of the public health, peace, property, and safety; NOW, THEREFORE, \n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of the Department of Public Service be and is hereby authorized to apply for Federal Highway Administration (FHWA) State Transportation Innovation Council (STIC) Incentive funding being offered by the Ohio Department of Transportation (ODOT), to accept said grant if awarded, to execute any documents necessary to effectuate said application, acceptance and agreement on behalf of the Department of Public Service, to administer awarded grant funds and to seek reimbursement from FHWA for grant expenses.\n \nSECTION 2.  That at the end of the grant period, any repayment of unencumbered balances required by the grantor is hereby authorized and any unused City match monies may be transferred back to the City fund from which they originated in accordance with all applicable grant agreements.\n \nSECTION 3.  That funds are hereby deemed appropriated and expenditures and transfers authorized to carry out the purposes of this ordinance and the City Auditor shall establish such accounting codes as necessary. \n \nSECTION 4.  That for the reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 118,
    "meeting_date": "2024-07-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Economic Development",
      "Emergency Services"
    ]
  }
}