{
  "success": true,
  "vote": {
    "id": 9941,
    "item_number": "SR-3",
    "title": "To authorize the Director of Finance and Management, on behalf of the Office of Construction Management, to enter into a construction contract with Harold J. Becker Company, Inc. for the Roof Renovations & Replacement 2023 project; to authorize a transfer and expenditure up to $5,946,950.00 within the Construction Management Capital Improvement Fund; and to declare an emergency.  ($5,946,950.00)",
    "description": "Explanation\n \n1. BACKGROUND:  This legislation authorizes the Director of Finance and Management to enter into a construction contract, on behalf of the Office of Construction Management, with Harold J. Becker Company, Inc., for the Roof Renovations & Replacement 2023 project, in the amount of $5,946,950.00.  \n \nWork under this project includes demolition and installation of roof systems on the following ten (10) City buildings:\n \nSWAT Building, 2609 McKinley Ave., Columbus, OH 43204  (alternate)\nFire Station #1, 300 N. Fourth St., Columbus, OH 43215\nFire Station #7, 1425 Indianola Ave., Columbus, OH 43201\nFire Station #8, 1240 E. Long St., Columbus, OH 43203\nFire Station #13, 303 Arcadia Ave., Columbus, OH 43202\nFire Station #26, 5433 Fisher Rd., Columbus, OH 43228\nFire Station #28, 3240 McCutcheon Rd., Columbus, OH 43230  (alternate)\nFire Training Academy, 3639 Parsons Ave., Columbus, OH 43207\nPolice Substation #13, 544 E. Woodrow Ave., Columbus, OH 43207\nEast Central Health, 1180 E. Main St., Columbus, OH 43205  (alternate)\n \n2. CONSTRUCTION CONTRACT AWARD:  The project was let by the Office of Construction Management through Vendor Services and Bid Express.  Of the 545 vendors solicited, 205 were Minority-owned, 2 were Veteran-owned, 335 were Small Business-owned, and 122 were Women-owned.\n \nThe Director of Finance and Management publicly opened three (3) bids on June 12, 2024. None of the bids received held Minority-designated status.\n \n1. Harold J. Becker Company, Inc.                     $5,946,950.00\n2. N.F. Mansuetto & Sons, Inc.                     $6,297,467.00*\n3. JB Roofing                     $8,850,259.00\n \n*N. F. Mansuetto & Sons, Inc. was disqualified because they were not pre-qualified at the time of bid.\n \nHarold J. Becker Company’s bid was deemed the lowest, best, most responsive and responsible bid in the amount of $5,946,950.00.  Their DAX Vendor Account No. is 4161 (expires 10/11/24, Majority-designated).\n \n3. SUBCONTRACTOR PARTICIPATION:  The ODI-assigned goal for this project is 13%.  Harold J. Becker Company proposed using the following subcontractor to meet this goal: \n \nCompany Name                     City/State                     ODI Designation      \nRoberts Service Group                     Columbus/OH                     WBE\n \n4.  EMERGENCY DESIGNATION:  Emergency legislation is being requested due to scheduling constraints to complete the Fire Training Academy and the SWAT building before the end of the year.\n \n5. FISCAL IMPACT:  A transfer of funds within the Construction Management Capital Improvement Fund will be necessary for this expenditure.  \n \n \nTitle\n \nTo authorize the Director of Finance and Management, on behalf of the Office of Construction Management, to enter into a construction contract with Harold J. Becker Company, Inc. for the Roof Renovations & Replacement 2023 project; to authorize a transfer and expenditure up to $5,946,950.00 within the Construction Management Capital Improvement Fund; and to declare an emergency.  ($5,946,950.00)\n \n \nBody\n \nWHEREAS, three (3) bids for Roof Renovations & Replacement 2023 project were received and publicly opened in the office of the Director of Finance and Management on June 12, 2024; and\n \nWHEREAS, the lowest, best, most responsive and responsible bid was from Harold J. Becker Company, Inc. in the amount of $5,946,950.00; and\n \nWHEREAS, it is necessary to authorize the Director of Finance and Management to award and execute a construction contract for the Roof Renovations & Replacement 2023 project; and \n \nWHEREAS, it is necessary to authorize a transfer and expenditure of funds within the Construction Management Capital Improvement Fund - Fund No. 7733; and  \n \nWHEREAS, an emergency exists in the usual daily operation of the Department of Finance and Management, Office of Construction Management, in that it is immediately necessary to authorize the Director of Finance and Management to enter into a construction contract for the Roof Renovations & Replacement 2023 project, in an emergency manner due to scheduling constraints to complete the Fire Training Academy and the SWAT building before the end of the year; for the immediate preservation of the public Safety, peace, property and safety; now therefore,\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1.  That the Director of Finance and Management is hereby authorized to enter into a construction contract, on behalf of the Office of Construction Management, with Harold J. Becker Company, Inc., for the Roof Renovations & Replacement 2023 project, in an amount up to $5,946,950.00.\n \nSECTION 2. That the transfer of up to $182,364.00, or so much thereof as may be needed, is hereby authorized in the Construction Management Capital Improvement Fund - Fund No. 7733, per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That the expenditure of up to $5,946,950.00, or so much thereof as may be needed, is hereby authorized in the Construction Management Capital Improvement Fund - Fund No. 7733, in Object Class 06 - Capital Outlay, per the accounting codes in the attachment to this ordinance.\n \nSECTION 4.  That the funds necessary to carry out the purpose of this Ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 5.  That the City Auditor is hereby authorized and directed to transfer any unencumbered balance in the project account to the unallocated balance within the same fund upon receipt of certification by the Director of the Department administering said project that the project has been completed and the monies no longer required for said project; except that no transfer shall be made from a project account by monies from more than one source.\n \nSECTION 6.  That the City Auditor is authorized to establish proper project accounting numbers as appropriate.\n \nSECTION 7.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this Ordinance.\n \nSECTION 8.  That for reasons stated in the preamble hereto, which is hereby made a part hereof, this Ordinance is declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the Mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 118,
    "meeting_date": "2024-07-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}