{
  "success": true,
  "vote": {
    "id": 9970,
    "item_number": "SR-32",
    "title": "To authorize the Director of Finance and Management to enter into contract with Agilent Technologies for the purchase of three gas chromatograph mass spectrometers (GC/MS) to be used by the Division of Police Crime Lab for the analysis of controlled substances in accordance with the bid waiver provisions of Columbus City Code; to authorize a transfer of funds within the General Government Grant Fund; to authorize the expenditure of $313,373.61 from the General Government Grant Fund; and to declare an emergency. ($313,373.61)",
    "description": "Explanation\n \nBACKGROUND: This ordinance authorizes the Director of Finance and Management to enter into contract for the purchase three gas chromatograph mass spectrometers (GC/MS) for the Division of Police Crime Lab.  Mass spectrometers are used in the analysis of controlled substances.  These mass spectrometers will replace three existing units.  In addition, the software used with the mass spectrometers is proprietary and only available through Agilent Technologies Inc.  Therefore, alternate mass spectrometer systems from other manufacturers would not meet the Drug Identification Section’s workload. Due to the proprietary nature of this equipment, the Division of Police is requesting a bid waiver so that current and new GC/MS Systems can operate on the same software for its caseload. \n \nBID INFORMATION:  It is manifestly impractical to bid out the GC/MS systems because the software used for analysis is proprietary and only manufactured, distributed, and supported by Agilent Technologies Inc. Therefore this contract is being awarded pursuant to the bid waiver provisions of Chapter 329 of City Code. \n \nThis company is not debarred according to the Federal excluded parties listing or prohibited from being awarded a contract according to the Auditor of State unresolved findings for recovery certified search.\n \nCONTRACT COMPLIANCE NO:  CC010267 Expires 8/17/2025\n \nEMERGENCY DESIGNATION: Emergency legislation is requested to procure the equipment prior to the grant end date and provide new technology to process evidence needed to solve cases.\n \nFISCAL IMPACT:   The purchase of the three GC/MS systems from Agilent Technologies in the amount of $313,373.61 will be made using grant funds from the 2022 ARPA Crime Lab Backlog Grant and the 2022 ARPA Crime Lab Backlog Grant A. \n \nTitle\n \nTo authorize the Director of Finance and Management to enter into contract with Agilent Technologies for the purchase of three gas chromatograph mass spectrometers (GC/MS) to be used by the Division of Police Crime Lab for the analysis of controlled substances in accordance with the bid waiver provisions of Columbus City Code; to authorize a transfer of funds within the General Government Grant Fund; to authorize the expenditure of $313,373.61 from the General Government Grant Fund; and to declare an emergency. ($313,373.61)\n \nBody\n \nWHEREAS, the Division of Police Crime Lab needs to purchase three gas chromatograph mass spectrometers (GC/MS) to be used for the analysis of controlled substances; and\n \nWHEREAS, The OpenLab software is proprietary and only available through Agilent Technologies Inc., and\n \nWHEREAS, funds are budgeted through the 2022 ARPA Crime Lab Backlog Grants and will be used for the purchase three gas chromatograph mass spectrometers (GC/MS).; and \n \nWHEREAS, it is in the best interest of the City to enter into said agreement in accordance with the relevant bid waiver provisions of Section 329 of the Columbus City Code; and\n \nWHEREAS, it is necessary to transfer funds between object classes within the General Government Grant Fund to cover the cost of the equipment and services; and \n \nWHEREAS, an emergency exists in the usual daily operation in the Division of Police, Department of Public Safety, in that it is immediately necessary to authorize the Finance Director to enter into contract for the purchase of three gas chromatograph mass spectrometers (GC/MS) for the Division of Police Crime Lab prior to the grant end date and provide new technology to process evidence needed to solve cases, all for the immediate preservation of the public health, peace, property, safety, and welfare; now, therefore\n \nBE IT ORDAINED BY THE COUNCIL OF THE CITY OF COLUMBUS:\n \nSECTION 1. That the Director of Finance and Management be and is hereby authorized and directed to enter into a contract with Agilent Technologies Inc. for the purchase of three gas chromatograph mass spectrometers (GC/MS) to be used by the Division of Police Crime Lab for the analysis of controlled substances.\n \nSECTION 2. That the transfer of $144,349.62, or so much thereof as may be needed, is hereby authorized within Fund 2220, General Government Grant Fund per the accounting codes in the attachment to this ordinance.\n \nSECTION 3. That the expenditure of $313,373.61, or so much thereof as may be needed, is hereby authorized in object class 06 Capital Outlay per the accounting codes in the attachment to this ordinance.\n \nSECTION 4. That said contract shall be awarded in accordance with the bid waiver provisions of Chapter 329 of the Columbus City Code.\n \nSECTION 5.  That the City Auditor is authorized to make any accounting changes to revise the funding source for all contracts or contract modifications associated with this ordinance and to make any accounting changes necessary to ensure that this contract is properly accounted for and recorded accurately on the City's financial records.\n \nSECTION 6.  That the funds necessary to carry out the purpose of this ordinance are hereby deemed appropriated, and the City Auditor shall establish such accounting codes as necessary.\n \nSECTION 7. That for reasons stated in the preamble hereto, which is hereby made a part hereof, this ordinance is hereby declared to be an emergency measure and shall take effect and be in force from and after its passage and approval by the Mayor, or ten days after passage if the mayor neither approves nor vetoes the same.",
    "outcome": "PASS",
    "ayes": 9,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 118,
    "meeting_date": "2024-07-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 1,
        "full_name": "Christopher Wyche",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Emmanuel V. Remy",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "Lourdes Barroso De Padilla",
        "vote_choice": "AYE"
      },
      {
        "member_id": 5,
        "full_name": "Melissa Green",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Nancy Day-Achauer",
        "vote_choice": "AYE"
      },
      {
        "member_id": 8,
        "full_name": "Nicholas Bankston",
        "vote_choice": "AYE"
      },
      {
        "member_id": 11,
        "full_name": "Rob Dorans",
        "vote_choice": "AYE"
      },
      {
        "member_id": 12,
        "full_name": "Shannon G. Hardin",
        "vote_choice": "AYE"
      },
      {
        "member_id": 13,
        "full_name": "Shayla Favor",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Contracts & Agreements",
      "Emergency Services"
    ]
  }
}